{
  "chapter": "1 Peter 1",
  "sermons": [
    {
      "sermon_id": "EetmC5JSFHc",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "1 Peter 1",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 1005.9600219726562,
          "context": "...e of Scripture, and we think about the blessedness of being kept by the power of God, as He says in 1 Peter 1 and verse number 5, and I'm so thankful that He keeps us. Here in John 10 and verse number 27, noti..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 1078.0400390625,
          "context": "...e. And here's what I give them. I give them eternal life. They shall never perish. I'm so thankful, 1 Peter 1 and verse number 5, jot it down in your notes. It tells us that we are kept by the power of God. Li..."
        }
      ]
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 714.3600234985352,
          "context": "...l I face a trial? The question is, how will I behave through the trial? Notice in verse number 3 of 1 Peter 1, the Bible says, blessed be the God and Father of our Lord Jesus Christ, which according to His abu..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 972.6000366210938,
          "context": "...r shall any man pluck them from my hand, and we see the security of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 1038.760009765625,
          "context": "of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 1627.9200134277344,
          "context": "...g that happens in my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Lis..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 1703.3999938964844,
          "context": "my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Lis..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 1848.8399772644043,
          "context": "...e you. To him be glory and dominion forever and ever. Amen. From these two portions of Scripture in 1 Peter 1, verses 6 through 9, and in 1 Peter 5, verses 10 and 11, we really have the opportunity through the..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 2496.719955444336,
          "context": "... himself. Secondly, it's to develop us spiritually. Notice, it says that the trial of your faith in 1 Peter 1 and verse number seven, being much more precious than of gold that perisheth. That'll put some thin..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 2777.7799682617188,
          "context": "... So absolutely we can rejoice through trials. This is not an exhaustive list this morning, but from 1 Peter 1, just three simple thoughts, truths that will enable you, that will enable me to rejoice in the mid..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 2855.3199462890625,
          "context": "...s. And God, I pray that you would enable us to rejoice through trials, that these three truths from 1 Peter 1 would just permeate our minds, that we'd be reminded in the midst of trial of our position in Chris..."
        }
      ]
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "1 Peter 1",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 1586.02001953125,
          "context": "...lp us to walk wholly. That we'd be holy in all matter of conversation, according to what He says in 1 Peter 1. Let's pray together. Father, we love You. Thank You for loving us. We know that we have an enemy, ..."
        }
      ]
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "1 Peter 1",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 688.2399826049805,
          "context": "...n is a protective love, such is the case with God's love. I want you to remember what Peter said in 1 Peter 1, just a few pages over, and then we'll get right into the text of Scripture this morning. See, God ..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 688.2399826049805,
          "context": "...n is a protective love, such is the case with God's love. I want you to remember what Peter said in 1 Peter 1, just a few pages over, and then we'll get right into the text of Scripture this morning. See, God ..."
        },
        {
          "reference": "1 Peter 1",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 1658.7599792480469,
          "context": "... 1, just a few pages over, I want you to remember what Peter said with regard to our redemption. In 1 Peter 1, beginning in verse number 18, Peter says this, for as much as you know that you were not redeemed ..."
        }
      ]
    }
  ]
}