{
  "chapter": "1 Timothy 6",
  "sermons": [
    {
      "sermon_id": "7YFnql3gWjE",
      "sermon_title": "\"King Of Kings And Lord Of Lords\" I Timothy 6:13-21",
      "url": "https://www.youtube.com/watch?v=7YFnql3gWjE",
      "publish_date": 20240714,
      "occurrences": [
        {
          "reference": "1 Timothy 6",
          "sermon_id": "7YFnql3gWjE",
          "timestamp": 2690.259979248047,
          "context": "...rish, but that all should come to repentance. Back in the text of scripture, it says in verse 16 in 1 Timothy 6, who only hath immortality dwelling in the light, which no man can approach unto whom no man hath s..."
        }
      ]
    },
    {
      "sermon_id": "VUxY_FF000Q",
      "sermon_title": "\"Flee, Follow, Fight\" I Timothy 6:11-12",
      "url": "https://www.youtube.com/watch?v=VUxY_FF000Q",
      "publish_date": 20240708,
      "occurrences": [
        {
          "reference": "1 Timothy 6",
          "sermon_id": "VUxY_FF000Q",
          "timestamp": 1264.859992980957,
          "context": "... we believe God. What are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also..."
        },
        {
          "reference": "1 Timothy 6",
          "sermon_id": "VUxY_FF000Q",
          "timestamp": 1334.6199951171875,
          "context": "are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also..."
        },
        {
          "reference": "1 Timothy 6",
          "sermon_id": "VUxY_FF000Q",
          "timestamp": 2267.260009765625,
          "context": "...hath chosen him to be a soldier. Those verses of Scripture go perfect with what we're looking at in 1 Timothy 6 verses 11 and 12. The one that's warring, the good soldier that's going to endure hardness, he's no..."
        },
        {
          "reference": "1 Timothy 6",
          "sermon_id": "VUxY_FF000Q",
          "timestamp": 2349.9000244140625,
          "context": "...Be strong in the Lord and the power of His might. It's a battleground. Notice in verse number 12 of 1 Timothy 6, he says, fight the good fight of faith. But then he gives this following truth that's so important..."
        }
      ]
    },
    {
      "sermon_id": "53lojYZz2_0",
      "sermon_title": "\"Developing Biblical Perspective\" I Timothy 6:1-10",
      "url": "https://www.youtube.com/watch?v=53lojYZz2_0",
      "publish_date": 20240702,
      "occurrences": [
        {
          "reference": "1 Timothy 6",
          "sermon_id": "53lojYZz2_0",
          "timestamp": 2834.0799865722656,
          "context": "...know, the, the truth of verse number 4, labor not to be rich, is really coupled with what we see in 1 Timothy 6 and verse number 9, they that will be rich. He says, listen,"
        },
        {
          "reference": "1 Timothy 6",
          "sermon_id": "53lojYZz2_0",
          "timestamp": 2914.3999633789062,
          "context": "...know, the, the truth of verse number 4, labor not to be rich, is really coupled with what we see in 1 Timothy 6 and verse number 9, they that will be rich. He says, listen, labor not to be rich. Cease from thine..."
        }
      ]
    }
  ]
}