{
  "chapter": "John 2",
  "sermons": [
    {
      "sermon_id": "2mDKhmk687Y",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 2",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 363.8399963378906,
          "context": "...e would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up"
        },
        {
          "reference": "John 2",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 425.67999267578125,
          "context": "...e would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up Then said the Jews forty and six y..."
        }
      ]
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 2",
          "sermon_id": "QRS13lJ0CSY",
          "timestamp": 1985.8199920654297,
          "context": "... important and gives us clarity. In previous messages in chapter 2 and 3, we dealt with this in 1st John 2 and 3, but the verb here, when it talks about sinneth not, is conjugated in the present tense. I'm ..."
        }
      ]
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 2",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 0.0,
          "context": "Online and happy birthday to brother John and he is not 40. Amen. I don't know exactly his age, but he is not 40 I can guarantee you that happy birthday, brother John 2nd Chronicles chapter number 20 2nd Chronicles chapter number 20 in your Bible this morning as you know throughout the year Here in 2020 our theme has been looking unto Jesus We systematically studied through the book of Hebrews and as we studied through the book of Hebrews Of course, as you know as you've been with us, we finished up last Sunday and what a joy To that it was for me I hope it was a joy for you to study through the book of Hebrews and to be encouraged to be challenged to be strengthened And as we study the Word of God We know that the Bible tells us that faith come of my hearing and hearing by the Word of the Lord of the Word of God and I'm so thankful that through studying the Word of God that our faith is increased and we serve a wonderful Savior Amen, and I know I've shared this before with you that several in the places in which we go we have to wear masks and all that sort of thing and so I purchased a couple of masks that have Some some some sayings on them. One of them says Jesus loves you"
        }
      ]
    }
  ]
}