{
  "chapter": "Psalms 113",
  "sermons": [
    {
      "sermon_id": "FZYKQS7fq1w",
      "sermon_title": "Sermon FZYKQS7fq1w",
      "url": "https://www.youtube.com/watch?v=FZYKQS7fq1w",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 113",
          "sermon_id": "FZYKQS7fq1w",
          "timestamp": 1752.260009765625,
          "context": "children are a blessing. Children are work, amen? Children are a blessing, not a burden. We have this society that's grown up, this very, you know, the selfie generation, it's all about them and it's all about their, what they want in life and they don't want to be inconvenienced. They don't want their life to be restricted in any way, shape or form because of children. The birth rate in America has declined greatly. If you look at it globally, you see that there's some other nations around the world that their birth rate is way higher than what the birth rate of American citizens is and we see that change that's going on in our society. But this lady, she was blessed, she conceived and she bear a son and the Bible says in verse 18, when the child was grown, and I think about those formative years, we don't know how old he is because we know that he's old enough that he goes out into the field and he's there as his father is working in the field with the reapers and again, we don't know the age of the son, we can make speculation. And the Bible says that it has grown and I think about those formative years and I think about that opportunity and about this Shunammite woman and the blessing of having a child. Notice if you will, Psalm 113, we'll look at two Psalms, verses in the book of Psalms."
        },
        {
          "reference": "Psalms 113",
          "sermon_id": "FZYKQS7fq1w",
          "timestamp": 1816.1200141906738,
          "context": "And the Bible says that it has grown and I think about those formative years and I think about that opportunity and about this Shunammite woman and the blessing of having a child. Notice if you will, Psalm 113, we'll look at two Psalms, verses in the book of Psalms. Look at first with me at Psalm 113. God is the giver of life. God is the sustainer of life. I'm thankful that God is the author of eternal life. Life is precious, but more important than being alive and breathing here this morning, the most important thing is the spiritual life that is offered through the Lord Jesus Christ. The Bible tells us that there's a time to be born and a time to die. The Bible tells us as an appointed unto man wants to die, but after this, the judgment. And we understand the life and some people have the idea that life here on earth, this physical life, is really all there is to it. I mean, just live the best you can and get the most toys and I mean, just live it up because this is all there is. I'm sorry, but God tells us that there is eternity. And the most precious thing is that God is the author of eternal salvation. We find that He offers that eternal life. You're here living this morning."
        },
        {
          "reference": "Psalms 113",
          "sermon_id": "FZYKQS7fq1w",
          "timestamp": 1816.1200141906738,
          "context": "And the Bible says that it has grown and I think about those formative years and I think about that opportunity and about this Shunammite woman and the blessing of having a child. Notice if you will, Psalm 113, we'll look at two Psalms, verses in the book of Psalms. Look at first with me at Psalm 113. God is the giver of life. God is the sustainer of life. I'm thankful that God is the author of eternal life. Life is precious, but more important than being alive and breathing here this morning, the most important thing is the spiritual life that is offered through the Lord Jesus Christ. The Bible tells us that there's a time to be born and a time to die. The Bible tells us as an appointed unto man wants to die, but after this, the judgment. And we understand the life and some people have the idea that life here on earth, this physical life, is really all there is to it. I mean, just live the best you can and get the most toys and I mean, just live it up because this is all there is. I'm sorry, but God tells us that there is eternity. And the most precious thing is that God is the author of eternal salvation. We find that He offers that eternal life. You're here living this morning."
        },
        {
          "reference": "Psalms 113",
          "sermon_id": "FZYKQS7fq1w",
          "timestamp": 1883.8000183105469,
          "context": "and I mean, just live it up because this is all there is. I'm sorry, but God tells us that there is eternity. And the most precious thing is that God is the author of eternal salvation. We find that He offers that eternal life. You're here living this morning. You have breath and life and none of us know how long we will have to live, but I hope this morning you're sure of heaven. You've trusted the Lord Jesus Christ, your personal savior and received the gift of life, which is eternal life, or the gift of God, which is eternal life. Notice here, as we think about the blessing of this Shunammite woman in Psalm 113 and verse number nine, the Bible says, He, speaking of God, He maketh the barren woman to keep her house, and to be a joyful mother of children, praise ye the Lord. What a blessing. In Psalm 127, in verse number three, a verse of Scripture that's familiar to many of us, the Bible says, Lo, children are an heritage of the Lord, and the fruit of the womb is His reward. The Bible continues in verses four and five and says, As arrows are in the hand of a mighty man, so are children of the youth. Happy is the man that hath his quiver full of them. They shall not be ashamed, but they shall speak with the enemies in the gate."
        }
      ]
    }
  ]
}