{
  "chapter": "Psalms 2",
  "sermons": [
    {
      "sermon_id": "1_NCe9SHoA0",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 2",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 1995.4400024414062,
          "context": "avoid these pitfalls because God's warned me about them? And the reality is that there's record of people in the Word of God that forsook because they love this world. I don't want to be there. So how do I avoid it? Number three this morning, finally, I'd say this. As you continue through the passage, you come to verse number 17, I would say that there's a promise to embrace. It's really a twofold promise that is given to us here, and I hope that this twofold promise that is given to us would cause us to be encouraged. Notice what the Bible says. It begins by telling us this, and the world passeth away and the lust thereof. This world is going to pass away. The world system, listen, there are times in which we look at and we understand when the Bible tells us, why do the heathen rage, right? And you look at Psalm 2 and you understand how the kings of the earth, they set themselves against the Lord. And you look at all that's taking place and you understand this world system in which we're living and we're operating, and you find that in this world system there are some that would try to get us to think that this world system has some level of permanence. But no, the world system, we have the promise of God Almighty that this world passeth away and the lust thereof."
        }
      ]
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 2",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 1169.780029296875,
          "context": "stronger or better than your dad. They have those kind of conversations. You know what the Bible tells us? Our rock is not like their rock. Who's it referring to? Our God. And I'm so thankful this morning that our God is greater and we find that they respond properly. And for us this morning, how we respond to great adversity really reveals what we know and believe about God. When we face great opposition, we face great difficulty in opposition, how we respond reveals in great measure what we know and believe to be true of God. We find how they respond, but then I want you to note in our text. of Scripture, what they requested. I want you to notice, they pray, and in verses 25 through 27, they speak about the truth that had been revealed in the Old Testament, reference to Psalm 2, with regard to the heathen raging and the kings of the earth standing against the Lord, and so on and so forth. And you find in verse 27 and 28, speaking about the Lord Jesus Christ and how He would He was, of course, determined to go to the cross of Calvary. And then we come to verse 29, and that's where we really see what it is that they requested. In verse 29 and verse number 30, and when I begin to note their request, when I notice"
        }
      ]
    }
  ]
}