{
  "chapter": "Psalms 150",
  "sermons": [
    {
      "sermon_id": "EOBB4xsyduY",
      "sermon_title": "Sermon EOBB4xsyduY",
      "url": "https://www.youtube.com/watch?v=EOBB4xsyduY",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 150",
          "sermon_id": "EOBB4xsyduY",
          "timestamp": 0.0,
          "context": "And as you're turning to Psalm 150, I will read for you the verse from the book of Titus that we have gotten to in our study through the book of Titus, Titus 2 and verse number 1. When Paul tells Titus, but speak thou the things which become sound doctrine, and we've taken this purposed detour to deal with the subject matter of doctrine. And some have asked, how long is it going to be? The message I'm seeking to give you this evening, I could take seven weeks to deliver this message. And so I'm trying to make it through the doctrinal part, but I don't want to rush too much because doctrine is important. And we're living in a time in which, as Paul told Timothy in 2 Timothy chapter number 4, that there will be a time when they will not endure sound doctrine. And so doctrine is important. And so this evening, we will continue with our study on the doctrine of theology. And we started this section of our study on theology in the book of Jeremiah, Jeremiah chapter number 10, we used as our first lesson. And verse number 6 says this, for as much as there is none like unto thee, O Lord, thou art great and thy name is great in might. We looked at that verse as being sort of our template outline, if you will, for the study of theology."
        },
        {
          "reference": "Psalms 150",
          "sermon_id": "EOBB4xsyduY",
          "timestamp": 81.72000122070312,
          "context": "first lesson. And verse number 6 says this, for as much as there is none like unto thee, O Lord, thou art great and thy name is great in might. We looked at that verse as being sort of our template outline, if you will, for the study of theology. And we're dealing still with that section of the verse when it says, thou art great. And last week, we looked at the greatness of God, part one, and we studied the natural attributes of God, the fact that our God is omniscient, He's omnipotent, He's omnipresent, He's immutable, and He's eternal. And how that ought to cause us to rejoice when we understand the way in which God has revealed Himself to us in His Word. This evening, we're going to continue looking at the attributes of God, we'll look at the moral attributes of God, and with God's help, we'll try to look at seven of them this evening. It is not an exhaustive list, but it is a sampling that we'll have this evening. I want to draw your attention to verse number 2 of Psalm 150. We can read the entirety of the psalm and see the call to praise and how important it is that we praise the Lord. But I want you to notice what the psalmist says in verse number 2, praise Him for His mighty acts. Now, we understand this evening that our God has done some incredible things, some marvelous,"
        },
        {
          "reference": "Psalms 150",
          "sermon_id": "EOBB4xsyduY",
          "timestamp": 147.0800018310547,
          "context": "see the call to praise and how important it is that we praise the Lord. But I want you to notice what the psalmist says in verse number 2, praise Him for His mighty acts. Now, we understand this evening that our God has done some incredible things, some marvelous, miraculous things that He's done, and we ought to praise Him for those things. And we praise Him for the things that God does, then we ought to, but then you look at the latter part of the verse and it says, praise Him according to His excellent greatness. Not only do we praise God for what He does, but we find that we praise God for who He is. And I am thankful even as we look at the natural attributes of God last week and we dealt with the fact that He's immutable, that He never changes, He is the same yesterday and today and forever, that this evening when we think about the latter part of Psalm 150 in verse number 2, when the psalmist says, praise Him according to His excellent greatness, that our God is great, He never changes, and it ought to cause us to rejoice. There are times in our lives in which we deal with difficulties. There are times in our lives in which we go through what some have termed the valleys. We're in those valleys, our circumstances may not be great, but we understand that our"
        },
        {
          "reference": "Psalms 150",
          "sermon_id": "EOBB4xsyduY",
          "timestamp": 1862.3199844360352,
          "context": "and He's merciful. We say, man, that's a lot. There's so many more attributes that we could deal with this evening, but just to look at those seven tonight, and how does it impact us? How does it affect us? Well, number one, it ought to cause us to rejoice. It ought to cause us to rejoice tonight that we serve a God that is so great and He has revealed to us His character. He's given to us His attributes and His word so that we'd understand who He is. As we examine His character, as we examine the attributes of God that are revealed to us here, it causes us to rejoice greatly. Remember, we started this evening in Psalm 150 when the psalmist said, praise Him for His mighty acts, praise Him according to His excellent greatness. You wake up tomorrow morning and God is still going to be holy. He's still going to be righteous. He's still going to be, go right through all of them that we've dealt with this evening. He's going to be omnipotent and omniscient as we dealt with last week. Our God is always going to be those things because we find that He's faithful. He is immutable. And this evening as we are mindful of those truths that it helps us to understand and to rejoice greatly in who He is, it helps us to declare His greatness to another generation, to another group of people."
        }
      ]
    },
    {
      "sermon_id": "SfucrRfy8nw",
      "sermon_title": "Sermon SfucrRfy8nw",
      "url": "https://www.youtube.com/watch?v=SfucrRfy8nw",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 150",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 76.80000305175781,
          "context": "as you as I I believe this morning I could say this I believe that I would be Accurate in saying this I think it's a safe assumption to say that each of us would agree this morning That God is worthy of our praise He's worthy of our worship You read the book of Revelation in chapter number four and five and begin to see the scene in heaven You begin to see how that the Lamb is being worshiped how he's being praised our Savior what a blessing and the reality is that as we look at the the Experiences that we have on life as we deal with the troubles the trials of the victories the times of triumph The reality is that we ought to be a people that praise him. I know that you're there in Psalm 34 You don't need to turn there But I want to read to you the final psalm of the book of Psalms in Psalm 150 how accurately it really summarizes Much of not the only theme but certainly a very profound thought throughout the book of Psalms that of praise The song psalmist said praise ye the Lord praise God in his sanctuary Praise him in the firmament of his power Praise him for his mighty acts praise him according to his excellent greatness Praise him with the sound of the trumpet praise him with the saw tree and harp"
        }
      ]
    }
  ]
}