{
  "chapter": "Psalms 21",
  "sermons": [
    {
      "sermon_id": "YCUS9wAR_oA",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 21",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 708.0999755859375,
          "context": "in verse number 5, trust also in Him. You know, it's important that we trust Him. The Bible says, trust in the Lord with all thine heart. Not part of it, not most of it, but with all of it. We find that we sing the song, trust and obey, and there's no other way to be happy in Jesus but to trust and obey. Trusting Jesus, simply trusting. I'm so glad I learned to trust Him, the songwriter said. And indeed, our God is trustworthy. And He says to His people that we're to trust in the Lord. Notice verse number 4, the instruction, the nugget of truth given to us, delight thyself also in the Lord. On the front of our bulletins for today, if you looked at it, is Psalm 1611. And thy presence is fullness of joy. And what a blessing to enter into the presence of God, to understand the joy that God gives as we enter into His presence. But we delight thyself also in the Lord. And as we delight ourselves in the Lord, notice it says, and He shall give thee the desires of thine heart. I believe this morning as we look at this truth, and we actually see it in Psalm 21 and verse number 2, thou hast given him his heart's desire, and hast not withholding the request of his lips. I believe that as we delight ourselves in the Lord, that our desires are really God's desires."
        },
        {
          "reference": "Psalms 21",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 781.0999755859375,
          "context": "we look at this truth, and we actually see it in Psalm 21 and verse number 2, thou hast given him his heart's desire, and hast not withholding the request of his lips. I believe that as we delight ourselves in the Lord, that our desires are really God's desires. So what happens is God's desires become our desires. I wonder this morning, before you got saved, were there certain desires or ambitions that you had, somebody said to you when you were a teenager, if you were not saved at that point in your life, they said, hey, what do you want to do with your life? I mean, what are you going to do? And we have our desires, our ambitions, our ideas of what we're going to do. And then we understand that as we look at the truth of God's word, that we are His children. And if we delight ourselves in the Lord, His desires really become our desires. The more time you spend with the Lord, the more that you're in His presence, the more that you're trusting Him, the more that His will and His desire becomes your will and your desire. It's found in His word, how much time we must spend in God's word every day of our lives. Notice with me in verse number 5, commit thy way unto the Lord. And then we see again, trust also in Him. So we are told to trust in the Lord."
        }
      ]
    }
  ]
}