{
  "chapter": "Psalms 19",
  "sermons": [
    {
      "sermon_id": "ZWhiVzLFfxc",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 19",
          "sermon_id": "ZWhiVzLFfxc",
          "timestamp": 1339.5399932861328,
          "context": "seeds, and as you put those two or three seeds, then you will have a corn stalk that should grow with all of the right care and so on and so forth, and that stalk of corn will have two to four ears of corn on average on that single stalk. And they say that each ear of corn has approximately 600 kernels. So you just do some quick math from a couple of seeds, a couple of kernels, even on the low end of only two ears of corn being on that single stalk, you use on the high end three kernels and you get 1,200. Or you get three and you get 2,400. Typically you sow, excuse me, you reap more than you sow. You reap more than you sow. We see that in nature, but oftentimes we don't really allow the truth of nature to impact us when we think about the spiritual aspect of it. I mentioned Psalm 19 a few moments ago, and you think about the law of the Lord is perfect enduring forever and all of that context there in verses 10 through, excuse me, I think it's 7 through 11, but really before you get to that, you know what the Bible says in Psalm 19? The heavens declare the glory of God. The firmament showeth forth his handiwork. You know, many times when the Lord Jesus Christ walked upon the earth, he used parables, and he would reference various things"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "ZWhiVzLFfxc",
          "timestamp": 1339.5399932861328,
          "context": "seeds, and as you put those two or three seeds, then you will have a corn stalk that should grow with all of the right care and so on and so forth, and that stalk of corn will have two to four ears of corn on average on that single stalk. And they say that each ear of corn has approximately 600 kernels. So you just do some quick math from a couple of seeds, a couple of kernels, even on the low end of only two ears of corn being on that single stalk, you use on the high end three kernels and you get 1,200. Or you get three and you get 2,400. Typically you sow, excuse me, you reap more than you sow. You reap more than you sow. We see that in nature, but oftentimes we don't really allow the truth of nature to impact us when we think about the spiritual aspect of it. I mentioned Psalm 19 a few moments ago, and you think about the law of the Lord is perfect enduring forever and all of that context there in verses 10 through, excuse me, I think it's 7 through 11, but really before you get to that, you know what the Bible says in Psalm 19? The heavens declare the glory of God. The firmament showeth forth his handiwork. You know, many times when the Lord Jesus Christ walked upon the earth, he used parables, and he would reference various things"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "ZWhiVzLFfxc",
          "timestamp": 1416.499984741211,
          "context": "really before you get to that, you know what the Bible says in Psalm 19? The heavens declare the glory of God. The firmament showeth forth his handiwork. You know, many times when the Lord Jesus Christ walked upon the earth, he used parables, and he would reference various things that people could see in nature that they could understand, and he would then give them from that natural occurrence, he would provide them with a spiritual truth. And so when we think about this principle, this law of sowing and reaping, we understand even by nature that you reap more than you sow, and yet for some reason when we think about the life that we're living and we think about our walk with God and we consider the thought of this passage of Scripture, and there are many that have been deceived thinking that they can get away with it, that God's okay with sin, that whatever the thoughts are, whoever, everybody is doing it, this is the acceptable thing that we can do now, so on and so forth, we fail to recognize that often you reap more than you sow. Say, man, why am I dealing with all of these things? Why is all of this stuff going on? You reap more than you sow. I know that I've used the quote before that many times, I don't remember who it was, a preacher of yesteryear, he"
        }
      ]
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 19",
          "sermon_id": "w16vXRlvXV0",
          "timestamp": 2662.3600463867188,
          "context": "the most important, most profitable book in all of the world, it's doing you nothing. Because you're not reading it. You're not following it. You're not obeying it. I think, I don't remember who it was, I think it might have been Charles Ryrie. It might have been somebody else, so don't fact check me on it because I'm telling you up front, I can't remember exactly who it was that said it. But he said this, on one page of Scripture, I have more life transforming truth than in all of the volumes of the Encyclopedia Britannica. I thought, man, I like his perspective. I do. Now, you young people, I know you don't have volumes of Encyclopedia Britannica because we have Wikipedia and they stopped actually printing it a number of years ago, but the reality is that God's Word is full of good instruction, good doctrine, and oh, that we just hear it and receive it. Let me close with two passages of Scripture, Psalm 19. We're familiar with Psalm 19. The Bible begins with, the heavens declare the glory of God, the firmament showeth forth His handiwork. What a blessing. Think about the beauty of creation, how it reveals there's a Creator. As we look at the passage of Scripture, it quickly moves from the truth of creation to the truth of God's written Word. Of course, as we think about this passage being the Old Testament, the law of the Lord, the books of Moses,"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "w16vXRlvXV0",
          "timestamp": 2662.3600463867188,
          "context": "the most important, most profitable book in all of the world, it's doing you nothing. Because you're not reading it. You're not following it. You're not obeying it. I think, I don't remember who it was, I think it might have been Charles Ryrie. It might have been somebody else, so don't fact check me on it because I'm telling you up front, I can't remember exactly who it was that said it. But he said this, on one page of Scripture, I have more life transforming truth than in all of the volumes of the Encyclopedia Britannica. I thought, man, I like his perspective. I do. Now, you young people, I know you don't have volumes of Encyclopedia Britannica because we have Wikipedia and they stopped actually printing it a number of years ago, but the reality is that God's Word is full of good instruction, good doctrine, and oh, that we just hear it and receive it. Let me close with two passages of Scripture, Psalm 19. We're familiar with Psalm 19. The Bible begins with, the heavens declare the glory of God, the firmament showeth forth His handiwork. What a blessing. Think about the beauty of creation, how it reveals there's a Creator. As we look at the passage of Scripture, it quickly moves from the truth of creation to the truth of God's written Word. Of course, as we think about this passage being the Old Testament, the law of the Lord, the books of Moses,"
        }
      ]
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 19",
          "sermon_id": "UpbuU9BS4yg",
          "timestamp": 2181.519989013672,
          "context": "saying something that they've not said, that they don't read this book. They don't read the Bible. And yet, they're going to come to me with some contradictions of some, this verse says this, but way over here in this chapter, it says this. Say, where did you find that? And all of a sudden, if you just go on Google and type in biblical contradictions, it's like the first two that pop up. That's where they found it. And be careful, because God's word is incapable of error. Why? Because our God is perfect, and our God is incapable of error. Titus, in chapter 1 and verse number 2, says this, the book of Titus 1-2, and hope of eternal life, which God that cannot lie promised before the world began. I'm thankful that God is truth. He cannot lie. This book, the Bible, is incapable of error. Why? Because it's God's word. See, if you write something, if you say something, if you speak as much as I speak, you're going to say something wrong. We're humans. But God is perfect. He has given us a book that's perfect, because all Scripture is given by inspiration of God. This book, because of the truth of inspiration, we talked about the process and the product, because of the truth of inspiration, this book is authoritative. It's authoritative. See, notice what the psalmist says, and we'll finish here in Psalm 19. Notice what the psalmist says."
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "UpbuU9BS4yg",
          "timestamp": 2259.760009765625,
          "context": "by inspiration of God. This book, because of the truth of inspiration, we talked about the process and the product, because of the truth of inspiration, this book is authoritative. It's authoritative. See, notice what the psalmist says, and we'll finish here in Psalm 19. Notice what the psalmist says. We talk about this book being authoritative. In Psalm 19 and verse number 7, the Bible says, The law of the Lord is perfect, converting the soul. The testimony of the Lord is sure, making wise the simple. The statutes of the Lord are right, rejoicing the heart. The commandment of the Lord is pure, enlightening the eyes. The fear of the Lord is clean, enduring forever. The judgments of the Lord are true and righteous altogether. Notice verse 10 of Psalm 19. More to be desired are they than gold, yea, than much fine gold. Sweeter also than honey and the honeycomb. Moreover, verse 11, by them is thy servant warned, and in keeping of them there is great reward. God's Word is authoritative because of what it is, because it's God's Word. Begin to think about people, humans, interactions that we have, one with another. Someone's word that might be authoritative. Someone that has some position of authority. The word that they give is authoritative because of the position that they hold. We understand that in life. We deal with that. I mentioned a reference a moment ago about on the basketball court."
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "UpbuU9BS4yg",
          "timestamp": 2259.760009765625,
          "context": "by inspiration of God. This book, because of the truth of inspiration, we talked about the process and the product, because of the truth of inspiration, this book is authoritative. It's authoritative. See, notice what the psalmist says, and we'll finish here in Psalm 19. Notice what the psalmist says. We talk about this book being authoritative. In Psalm 19 and verse number 7, the Bible says, The law of the Lord is perfect, converting the soul. The testimony of the Lord is sure, making wise the simple. The statutes of the Lord are right, rejoicing the heart. The commandment of the Lord is pure, enlightening the eyes. The fear of the Lord is clean, enduring forever. The judgments of the Lord are true and righteous altogether. Notice verse 10 of Psalm 19. More to be desired are they than gold, yea, than much fine gold. Sweeter also than honey and the honeycomb. Moreover, verse 11, by them is thy servant warned, and in keeping of them there is great reward. God's Word is authoritative because of what it is, because it's God's Word. Begin to think about people, humans, interactions that we have, one with another. Someone's word that might be authoritative. Someone that has some position of authority. The word that they give is authoritative because of the position that they hold. We understand that in life. We deal with that. I mentioned a reference a moment ago about on the basketball court."
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "UpbuU9BS4yg",
          "timestamp": 2259.760009765625,
          "context": "by inspiration of God. This book, because of the truth of inspiration, we talked about the process and the product, because of the truth of inspiration, this book is authoritative. It's authoritative. See, notice what the psalmist says, and we'll finish here in Psalm 19. Notice what the psalmist says. We talk about this book being authoritative. In Psalm 19 and verse number 7, the Bible says, The law of the Lord is perfect, converting the soul. The testimony of the Lord is sure, making wise the simple. The statutes of the Lord are right, rejoicing the heart. The commandment of the Lord is pure, enlightening the eyes. The fear of the Lord is clean, enduring forever. The judgments of the Lord are true and righteous altogether. Notice verse 10 of Psalm 19. More to be desired are they than gold, yea, than much fine gold. Sweeter also than honey and the honeycomb. Moreover, verse 11, by them is thy servant warned, and in keeping of them there is great reward. God's Word is authoritative because of what it is, because it's God's Word. Begin to think about people, humans, interactions that we have, one with another. Someone's word that might be authoritative. Someone that has some position of authority. The word that they give is authoritative because of the position that they hold. We understand that in life. We deal with that. I mentioned a reference a moment ago about on the basketball court."
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "UpbuU9BS4yg",
          "timestamp": 2348.47998046875,
          "context": "with another. Someone's word that might be authoritative. Someone that has some position of authority. The word that they give is authoritative because of the position that they hold. We understand that in life. We deal with that. I mentioned a reference a moment ago about on the basketball court. The coaches can disagree, the players can disagree, but that guy with that black and white striped shirt and that whistle, he is the authority on that court. Like it or not, it's just the way it works. We can think about a number of positions that people hold and the word that they speak having authority, but I want you to understand that God is the eternal God. He's the omnipotent God. He rules. He reigns. He is the Lord God Almighty, and He's given us the Bible. And because He's given it to us by inspiration, because every word of God is pure, because of the truth of inspiration, then we understand that this book is authoritative. You can say, I disagree with it. That's up to you. You've got a problem with God because God's Word is authoritative. God's Word is authoritative. I think this morning that it's in our best interest as we find in Psalm 19 and also in 2 Peter 1, it's in our best interest to take heed. It says, moreover by them is my servant warned. You know, warnings are good for us. People get warnings."
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "UpbuU9BS4yg",
          "timestamp": 2431.2800006866455,
          "context": "authoritative. I think this morning that it's in our best interest as we find in Psalm 19 and also in 2 Peter 1, it's in our best interest to take heed. It says, moreover by them is my servant warned. You know, warnings are good for us. People get warnings. We're familiar with warnings, by the way. Go home this afternoon and you look at some products that you have at home and you look at the labels, especially cleaning supplies, warning labels, right? We're familiar with warnings. I was sharing with someone this past week about warnings. We see warnings on the road. Bridge out ahead. Aren't you thankful for that warning? Can you imagine if no one took the time to put the sign up, you just kept on driving? It'd be a problem. God's given us warnings in His Word. Moreover by them is my servant warned. This is this, and in keeping of them, there is great reward. Wow. Who's the reward come from? The one who gave us the book. He said this to Joshua, this book of the law shall not depart out of thy mouth, but thou shalt meditate therein day and night. Why? Why is it so important that this book not depart out of my mouth? Why is it so necessary that I meditate in it day and night? Because it's God's Word. Because it's God's Word. Then shalt thou find good success, have thy way prosperous and find good success."
        }
      ]
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 19",
          "sermon_id": "cRs01nZR7xE",
          "timestamp": 2275.439971923828,
          "context": "and so on and so forth. But our Bible reveals God to us, and we understand the Trinity teaches that God exists in three persons and is co-equal in power and in glory. Begin to think about creation. And we don't have time to go through all of these examples. I'll just use the example of creation. You look at the truth of creation. The Lord declares in the Old Testament that He created all things. And then Jesus declares in the New Testament that He created all things. We read John 1 already. There's no discrepancy for us. Why? Because He's God. He's God. It's very interesting, and again, I'm not seeking to try to provide some level of analogy or illustration that would help us to understand the truth or the concept of the Trinity, because I think every illustration that we could give, and I've heard a number of them. In fact, I've used some of them in the past. I will not use any of them this evening. But I do want you to think about the universe. I want you to finish up by looking at Psalm 19. It's very interesting, this thought that we have here in Psalm 19. Again, it's a familiar passage of Scripture for us. We find that God, of course, created all things. He's the creator of all things. We find that His creation"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "cRs01nZR7xE",
          "timestamp": 2275.439971923828,
          "context": "and so on and so forth. But our Bible reveals God to us, and we understand the Trinity teaches that God exists in three persons and is co-equal in power and in glory. Begin to think about creation. And we don't have time to go through all of these examples. I'll just use the example of creation. You look at the truth of creation. The Lord declares in the Old Testament that He created all things. And then Jesus declares in the New Testament that He created all things. We read John 1 already. There's no discrepancy for us. Why? Because He's God. He's God. It's very interesting, and again, I'm not seeking to try to provide some level of analogy or illustration that would help us to understand the truth or the concept of the Trinity, because I think every illustration that we could give, and I've heard a number of them. In fact, I've used some of them in the past. I will not use any of them this evening. But I do want you to think about the universe. I want you to finish up by looking at Psalm 19. It's very interesting, this thought that we have here in Psalm 19. Again, it's a familiar passage of Scripture for us. We find that God, of course, created all things. He's the creator of all things. We find that His creation"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "cRs01nZR7xE",
          "timestamp": 2333.6799926757812,
          "context": "you to finish up by looking at Psalm 19. It's very interesting, this thought that we have here in Psalm 19. Again, it's a familiar passage of Scripture for us. We find that God, of course, created all things. He's the creator of all things. We find that His creation reveals His person, right? And we look at the universe, and we find that the Bible tells us in Psalm 19, the heavens declare the glory of God, and the firmament showeth His handiwork. And we begin to think about the beginning of this portion of Scripture and speaking about how the heavens declare the glory of God. When we think about the universe, it's space, time, and matter. If you remove any of them, it's no longer a universe. We begin to think about the way in which the heavens declare the glory of God, and there's a great connection there with regard to this teaching, this understanding, this biblical truth with regard to the Trinity. And so, again, we begin to understand the teaching of the Trinity. It's obvious throughout the Word of God. We see it in the Old Testament, we see it in the New Testament, and the Bible says plainly in 1 John 5, in verse number 7, the verse that we started out with this evening, the Bible says very plainly, and we accept it by faith, that there are three that bear record in heaven, the Father, the"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "cRs01nZR7xE",
          "timestamp": 2333.6799926757812,
          "context": "you to finish up by looking at Psalm 19. It's very interesting, this thought that we have here in Psalm 19. Again, it's a familiar passage of Scripture for us. We find that God, of course, created all things. He's the creator of all things. We find that His creation reveals His person, right? And we look at the universe, and we find that the Bible tells us in Psalm 19, the heavens declare the glory of God, and the firmament showeth His handiwork. And we begin to think about the beginning of this portion of Scripture and speaking about how the heavens declare the glory of God. When we think about the universe, it's space, time, and matter. If you remove any of them, it's no longer a universe. We begin to think about the way in which the heavens declare the glory of God, and there's a great connection there with regard to this teaching, this understanding, this biblical truth with regard to the Trinity. And so, again, we begin to understand the teaching of the Trinity. It's obvious throughout the Word of God. We see it in the Old Testament, we see it in the New Testament, and the Bible says plainly in 1 John 5, in verse number 7, the verse that we started out with this evening, the Bible says very plainly, and we accept it by faith, that there are three that bear record in heaven, the Father, the"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "cRs01nZR7xE",
          "timestamp": 2333.6799926757812,
          "context": "you to finish up by looking at Psalm 19. It's very interesting, this thought that we have here in Psalm 19. Again, it's a familiar passage of Scripture for us. We find that God, of course, created all things. He's the creator of all things. We find that His creation reveals His person, right? And we look at the universe, and we find that the Bible tells us in Psalm 19, the heavens declare the glory of God, and the firmament showeth His handiwork. And we begin to think about the beginning of this portion of Scripture and speaking about how the heavens declare the glory of God. When we think about the universe, it's space, time, and matter. If you remove any of them, it's no longer a universe. We begin to think about the way in which the heavens declare the glory of God, and there's a great connection there with regard to this teaching, this understanding, this biblical truth with regard to the Trinity. And so, again, we begin to understand the teaching of the Trinity. It's obvious throughout the Word of God. We see it in the Old Testament, we see it in the New Testament, and the Bible says plainly in 1 John 5, in verse number 7, the verse that we started out with this evening, the Bible says very plainly, and we accept it by faith, that there are three that bear record in heaven, the Father, the"
        }
      ]
    },
    {
      "sermon_id": "We8921d40Z4",
      "sermon_title": "Sermon We8921d40Z4",
      "url": "https://www.youtube.com/watch?v=We8921d40Z4",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 19",
          "sermon_id": "We8921d40Z4",
          "timestamp": 946.8399963378906,
          "context": "individual. And we find this evening that as we look at this passage of Scripture, that God provides us with this valuable counsel, but he does not force us to heed it. I want you to consider, hold your place here, we'll be right back into the book of Romans, but look over at 2 Peter chapter one, just for a moment, and as you're turning to 2 Peter chapter number one, I wanna read a verse of Scripture to you there, but I also, I don't want you to turn to Psalm 19, if you want, you can if you're quick, but Psalm 19, I wanna read a couple of verses to you there as we get back over to 2 Peter chapter one here in just a moment, but I want you to see that in Psalm 19, I don't have time to read all of it, but it begins in verse seven, speaking about the law of the Lord being perfect and gives all of these attributes and various workings of God's word and how it's effective. In verse number 11, it says, \"'Moreover, by them is thy servant warned, and in keeping of them, there is great reward.'\" You can warn people, but you can't force people. Do we agree with that tonight? You can warn them, but you can't force them. And notice in 2 Peter chapter one, Peter's writing, and in this particular text of scripture, beginning in verse 16, he's writing about"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "We8921d40Z4",
          "timestamp": 946.8399963378906,
          "context": "individual. And we find this evening that as we look at this passage of Scripture, that God provides us with this valuable counsel, but he does not force us to heed it. I want you to consider, hold your place here, we'll be right back into the book of Romans, but look over at 2 Peter chapter one, just for a moment, and as you're turning to 2 Peter chapter number one, I wanna read a verse of Scripture to you there, but I also, I don't want you to turn to Psalm 19, if you want, you can if you're quick, but Psalm 19, I wanna read a couple of verses to you there as we get back over to 2 Peter chapter one here in just a moment, but I want you to see that in Psalm 19, I don't have time to read all of it, but it begins in verse seven, speaking about the law of the Lord being perfect and gives all of these attributes and various workings of God's word and how it's effective. In verse number 11, it says, \"'Moreover, by them is thy servant warned, and in keeping of them, there is great reward.'\" You can warn people, but you can't force people. Do we agree with that tonight? You can warn them, but you can't force them. And notice in 2 Peter chapter one, Peter's writing, and in this particular text of scripture, beginning in verse 16, he's writing about"
        },
        {
          "reference": "Psalms 19",
          "sermon_id": "We8921d40Z4",
          "timestamp": 946.8399963378906,
          "context": "individual. And we find this evening that as we look at this passage of Scripture, that God provides us with this valuable counsel, but he does not force us to heed it. I want you to consider, hold your place here, we'll be right back into the book of Romans, but look over at 2 Peter chapter one, just for a moment, and as you're turning to 2 Peter chapter number one, I wanna read a verse of Scripture to you there, but I also, I don't want you to turn to Psalm 19, if you want, you can if you're quick, but Psalm 19, I wanna read a couple of verses to you there as we get back over to 2 Peter chapter one here in just a moment, but I want you to see that in Psalm 19, I don't have time to read all of it, but it begins in verse seven, speaking about the law of the Lord being perfect and gives all of these attributes and various workings of God's word and how it's effective. In verse number 11, it says, \"'Moreover, by them is thy servant warned, and in keeping of them, there is great reward.'\" You can warn people, but you can't force people. Do we agree with that tonight? You can warn them, but you can't force them. And notice in 2 Peter chapter one, Peter's writing, and in this particular text of scripture, beginning in verse 16, he's writing about"
        }
      ]
    }
  ]
}