{
  "chapter": "Psalms 111",
  "sermons": [
    {
      "sermon_id": "EOBB4xsyduY",
      "sermon_title": "Sermon EOBB4xsyduY",
      "url": "https://www.youtube.com/watch?v=EOBB4xsyduY",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 111",
          "sermon_id": "EOBB4xsyduY",
          "timestamp": 1387.760009765625,
          "context": "could preach a whole message on each of these, and I just want to kind of scratch the surface this evening and maybe whet your appetite for some further study of these attributes. Number six, God is gracious. He is gracious. So often we speak about the grace of God, and we sing about the grace of God. One of the probably most often requested songs, Amazing Grace, and we understand Brother Don, he just makes me laugh every time we get anywhere near the 180s in the hymnal, he wants to know why we're not on 187, because that's Amazing Grace, and it's as if the other eight songs there just, you know, not just, you know, we got to be 187, and What a Blessing, Amazing Grace is a great song. We speak about God's abundant grace, and we begin to think about God's grace, and notice what the psalmist says in Psalm 111 with regard to this attribute of God's grace. In Psalm 111, we find that in verse number four, the Bible says, he hath made his wonderful works to be remembered. The Lord is gracious and full of compassion. Once again, we see that compassion referenced here in this verse of Scripture. We're focusing here on that attribute that the Lord is gracious. This evening, we find that really the grace of God can be defined as God giving us what we do not deserve. Some have said that grace is"
        },
        {
          "reference": "Psalms 111",
          "sermon_id": "EOBB4xsyduY",
          "timestamp": 1387.760009765625,
          "context": "could preach a whole message on each of these, and I just want to kind of scratch the surface this evening and maybe whet your appetite for some further study of these attributes. Number six, God is gracious. He is gracious. So often we speak about the grace of God, and we sing about the grace of God. One of the probably most often requested songs, Amazing Grace, and we understand Brother Don, he just makes me laugh every time we get anywhere near the 180s in the hymnal, he wants to know why we're not on 187, because that's Amazing Grace, and it's as if the other eight songs there just, you know, not just, you know, we got to be 187, and What a Blessing, Amazing Grace is a great song. We speak about God's abundant grace, and we begin to think about God's grace, and notice what the psalmist says in Psalm 111 with regard to this attribute of God's grace. In Psalm 111, we find that in verse number four, the Bible says, he hath made his wonderful works to be remembered. The Lord is gracious and full of compassion. Once again, we see that compassion referenced here in this verse of Scripture. We're focusing here on that attribute that the Lord is gracious. This evening, we find that really the grace of God can be defined as God giving us what we do not deserve. Some have said that grace is"
        }
      ]
    },
    {
      "sermon_id": "SfucrRfy8nw",
      "sermon_title": "Sermon SfucrRfy8nw",
      "url": "https://www.youtube.com/watch?v=SfucrRfy8nw",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 111",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 216.55999755859375,
          "context": "based upon that definition We would easily conclude that our God is worthy of our praise. He is perfect in every way. Amen We have plenty of imperfections Yes We are imperfect people, but we serve a perfect God and I'm so thankful for the the truth of his character we think about the definition that we would to glorify an account of perfections or Excellent works in the sense of or in the case of praising our God. We praise him in both references not an or Situation, but we praise him on the account of his perfections and on his excellent works Our God is awesome. In fact, it's interesting You don't need to turn there but I will reference for you in Psalm 111 in verse number three and four the Bible says his work is honorable and glorious and His righteousness endureth forever. He hath made his wonderful works to be remembered the Lord is gracious and full of Compassion as I think about that phrase in verse number four that he hath made his wonderful works to be remembered I'm mindful of the book that we hold in our hands and the many accounts that God has given us of his wonderful works and how we can rehearse them and we can recall them and and how it causes us to understand the excellent works of our God"
        }
      ]
    }
  ]
}