{
  "chapter": "Psalms 11",
  "sermons": [
    {
      "sermon_id": "O-P_67xx1P0",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 11",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 0.0,
          "context": "I'll make, by way of introduction, a few statements from several of the verses here in Psalm 11. The text for our message, however, will come from verse number 7. And what a powerful psalm that is before us. I am so thankful for all of the Bible, and what a blessing it is to have the Word of God. And as we think about the psalms in particular, what a joy to be able to read the psalms and to be encouraged and strengthened. And the transparency of the psalmist often is in view, and that is a tremendous blessing. As we look at this particular psalm, I'm going to use as my title from verse number 7, for the righteous Lord loveth righteousness. And that'll be the title for the message this evening, The Righteous Lord Loveth Righteousness. Before we get into the meat of our message from that thought in verse number 7, let me share just a few, highlight just a few things from this passage of Scripture. Notice in verse number 1, the psalmist begins by saying, in the Lord put I my trust. Isn't that a good statement? I mean, we understand that He is Jehovah God, that He is the Lord God Almighty, that He rules and He reigns, and it would only make sense, it would only be logical for us, understanding who He is to place our trust in Him."
        },
        {
          "reference": "Psalms 11",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 381.739990234375,
          "context": "would understand that His righteousness really is the expression of His holiness as He deals with mankind. We find that the idea of God's righteousness means that He is just and lawful, that He always does that which is right. And we ought to rejoice in that truth this evening. We ought to be thankful this evening that the Bible tells us that the righteous Lord loveth righteousness, that we understand that He is righteous. The Bible says in Psalm 119 and verse 142, thy righteousness is an everlasting righteousness, and thy law is the truth. Our God is righteous, and it's important for us to understand the truth this evening that our God is righteous and that He loves righteousness. Look in Proverbs chapter 14, if you will, I mentioned to you that we mentioned some things and go through quickly and highlight a few things in Psalm 11 and then jump from there as we use verse 7 as really our main thought for the message this evening. And as we understand that our God is righteous, we also understand that sin brings reproach. In Proverbs chapter 14, the Bible says this, righteousness exalteth a nation. Why is that? Because the truth that we just looked at in Psalm 11 and verse 7, the righteous Lord loveth righteousness. And so therefore, righteousness exalteth a nation. Why? Because God loves righteousness, because He is righteous. And the righteous Lord loveth righteousness."
        },
        {
          "reference": "Psalms 11",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 381.739990234375,
          "context": "would understand that His righteousness really is the expression of His holiness as He deals with mankind. We find that the idea of God's righteousness means that He is just and lawful, that He always does that which is right. And we ought to rejoice in that truth this evening. We ought to be thankful this evening that the Bible tells us that the righteous Lord loveth righteousness, that we understand that He is righteous. The Bible says in Psalm 119 and verse 142, thy righteousness is an everlasting righteousness, and thy law is the truth. Our God is righteous, and it's important for us to understand the truth this evening that our God is righteous and that He loves righteousness. Look in Proverbs chapter 14, if you will, I mentioned to you that we mentioned some things and go through quickly and highlight a few things in Psalm 11 and then jump from there as we use verse 7 as really our main thought for the message this evening. And as we understand that our God is righteous, we also understand that sin brings reproach. In Proverbs chapter 14, the Bible says this, righteousness exalteth a nation. Why is that? Because the truth that we just looked at in Psalm 11 and verse 7, the righteous Lord loveth righteousness. And so therefore, righteousness exalteth a nation. Why? Because God loves righteousness, because He is righteous. And the righteous Lord loveth righteousness."
        },
        {
          "reference": "Psalms 11",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 468.29998779296875,
          "context": "says this, righteousness exalteth a nation. Why is that? Because the truth that we just looked at in Psalm 11 and verse 7, the righteous Lord loveth righteousness. And so therefore, righteousness exalteth a nation. Why? Because God loves righteousness, because He is righteous. And the righteous Lord loveth righteousness. And when we understand this evening this truth of Proverbs 14 and verse 34, that righteousness exalteth a nation, sometimes we're led to think and have the idea that this means that it will have some monetary type of blessing. And that's really not the fullness of what's being dealt with here. Though it may be that there are some temporal blessings that are enjoyed and experienced by a righteous people, the reality is that we have the favor of God upon us. The Bible says that righteousness exalteth a nation. But notice the last part of Proverbs 14 and verse 34, but sin is a reproach to any people. God is righteous, sin brings reproach. The Bible says in Psalm 9 and verse number 17, this with regard to the subject of sin bringing reproach, it says, the wicked shall be turned into hell and all the nations that forget God. You say, well, that's strong language. That's the Bible. The Bible is strong. The Bible does confront. The Bible, you know, people talk about wanting to be politically correct. The reality is that I'd rather be biblically correct. Amen?"
        }
      ]
    }
  ]
}