{
  "chapter": "Psalms 84",
  "sermons": [
    {
      "sermon_id": "cCksVIX-UWU",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 84",
          "sermon_id": "cCksVIX-UWU",
          "timestamp": 398.1000061035156,
          "context": "find that we have an inheritance that's reserved in heaven for us. I cannot work to be saved, nor can I work to stay saved, but when we understand and we examine, we review our attitude towards serving the Lord, we understand this morning that we get to serve God because we are saved. It's the result of being saved that gives us the privilege and the opportunity to serve the master, to serve the king of kings and Lord of lords, and what a great privilege it is. But at times, if we're not careful, our attitude can kind of get sideways with regard to service. We can kind of get into the drudgery and the monotony, if you will, and we can get overwhelmed with it, and we lose our focus that we're serving the Lord, we're serving the master, and what a blessing. Think about the perspective, if you will, of the psalmist, or Psalm 84, and I want you to look at a couple of verses within the Psalms, because really, I hope this morning that your service for Christ is a delight, that it's a delight. We understand that God has designed it that his children would serve him, and what a blessing it is, and you say, as we look at this truth of serving the Lord, we understand that it comes, and we'll look at our next point, it comes in a variety of shapes and sizes,"
        },
        {
          "reference": "Psalms 84",
          "sermon_id": "cCksVIX-UWU",
          "timestamp": 459.1600036621094,
          "context": "God has designed it that his children would serve him, and what a blessing it is, and you say, as we look at this truth of serving the Lord, we understand that it comes, and we'll look at our next point, it comes in a variety of shapes and sizes, and everyone's service is not the same, but what a privilege it is to serve the Lord, and it should be a delight. In Psalm 84, notice in verse number 10, the Bible says, for a day in thy court is better than a thousand. I had rather be a doorkeeper in the house of my God than to dwell in the tents of wickedness. I want you to think about that just for a moment. The psalmist says that they'd rather be a doorkeeper in the house of my God, a doorkeeper. You say, well, that's kind of a, no, no, no, that's a service to the king. It's a privilege, it's a delight to be able to serve the Lord, and you think about the perspective here. It says I'd rather do that than to dwell in the tents of wickedness. I want you to think about your service to the Lord, and the reality is that, listen, I'd rather clean bathrooms for the Lord than do something else for the world, amen, and what a delight. Somebody came to me not long ago and said, pastor, what can I do?"
        },
        {
          "reference": "Psalms 84",
          "sermon_id": "cCksVIX-UWU",
          "timestamp": 520.6799926757812,
          "context": "I want you to think about your service to the Lord, and the reality is that, listen, I'd rather clean bathrooms for the Lord than do something else for the world, amen, and what a delight. Somebody came to me not long ago and said, pastor, what can I do? I'll clean toilets, I'll clean this, I'll do that, whatever, I just wanna serve the Lord, and praise the Lord for that kind of perspective because why, it's a privilege to serve God. It is an absolute privilege. The psalmist says here in Psalm 84, what he would rather do, be a doorkeeper in the house of my God. I want you to think about Psalm 100, and of course, we're familiar with that psalm. It's a very familiar psalm to us, but I want you to see what the psalmist says in Psalm 100 in verse number two. The Bible says this, serve the Lord how? With gladness, with gladness. Come before his presence with singing, and we think about this truth as we review our attitude towards serving the Lord. I get to do this, I get to serve God. I can do it with gladness, and why? Because my perspective is that it's for the audience of one, for the audience of one. I'm serving the Lord. I have the privilege of being able to serve Christ. You say, well, as the pastor, you get to, no, no, listen, we get to serve Christ."
        }
      ]
    }
  ]
}