{
  "chapter": "Psalms 107",
  "sermons": [
    {
      "sermon_id": "SfucrRfy8nw",
      "sermon_title": "Sermon SfucrRfy8nw",
      "url": "https://www.youtube.com/watch?v=SfucrRfy8nw",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 107",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 648.9599761962891,
          "context": "thee. In fact, the phrase I will praise thee is referenced in those particular words over 11 times just in the Psalms. And you think about the resolve, the purpose, the commitment that the psalmist is making that he is resolved to praise the Lord. We find that he says here in verse number one, I will bless the Lord at all times. Notice the next phrase, his praise shall continually be in my mouth. My soul shall make her boast in the Lord. The humble shall hear thereof and be glad. O magnify the Lord with me and let us exalt his name together. It's interesting if you were to read Psalm 107, oftentimes we'll use a portion of the first opening of that particular passage in verse number two where the Bible says, let the redeemed of the Lord say so. And maybe we'll use that phraseology when talking about praising the Lord and giving testimony. In fact, the psalmist says, O give thanks unto the Lord for he is good, for his mercy endureth forever. Begin to think about the psalm and the truth that is captured in Psalm 107. On four occasions the psalmist says, O that men would praise the Lord for his goodness and for his wonderful works to the children of men. And this morning when we think about the truth of praise him, praise him, it should not be something that is difficult for"
        },
        {
          "reference": "Psalms 107",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 648.9599761962891,
          "context": "thee. In fact, the phrase I will praise thee is referenced in those particular words over 11 times just in the Psalms. And you think about the resolve, the purpose, the commitment that the psalmist is making that he is resolved to praise the Lord. We find that he says here in verse number one, I will bless the Lord at all times. Notice the next phrase, his praise shall continually be in my mouth. My soul shall make her boast in the Lord. The humble shall hear thereof and be glad. O magnify the Lord with me and let us exalt his name together. It's interesting if you were to read Psalm 107, oftentimes we'll use a portion of the first opening of that particular passage in verse number two where the Bible says, let the redeemed of the Lord say so. And maybe we'll use that phraseology when talking about praising the Lord and giving testimony. In fact, the psalmist says, O give thanks unto the Lord for he is good, for his mercy endureth forever. Begin to think about the psalm and the truth that is captured in Psalm 107. On four occasions the psalmist says, O that men would praise the Lord for his goodness and for his wonderful works to the children of men. And this morning when we think about the truth of praise him, praise him, it should not be something that is difficult for"
        },
        {
          "reference": "Psalms 107",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 974.3599853515625,
          "context": "remind us of the truth of Psalm 68, that he, God, hath daily loatheth us with benefits. There's so much to praise him for, and we need to resolve to praise the Lord. Psalm 69, notice what is said here by the psalmist in Psalm 69, in verse number 30. In Psalm 69, in verse number 30, the psalmist says, I will praise the name of God with a psalm and will magnify him with thanksgiving. Does our song praise God? I hope it does. I hope the songs that we sing are offering, rendering praise unto our God, reminding us of who he is, reminding us of what he's done. It's a psalm of praise. In Psalm 86, turn over several pages here and look at Psalm 86 and, again, a psalm that's ascribed to David, and we find that here in this particular psalm, he's rejoicing. Really, it's a prayer of David. He's rejoicing for how the Lord would answer his prayer and teaching him his way. He says this in verse number 12, I will praise thee, O Lord my God, with all my heart, and I will glorify thy name forevermore. In Psalm 118, again, this psalm begins with that same phraseology that we mentioned from Psalm 107, O give thanks unto the Lord for he is good, because his mercy endureth forever. But here in Psalm 118, in verse number 21, the Bible says this, I will praise thee, notice this, for thou"
        },
        {
          "reference": "Psalms 107",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 1057.1199645996094,
          "context": "again, this psalm begins with that same phraseology that we mentioned from Psalm 107, O give thanks unto the Lord for he is good, because his mercy endureth forever. But here in Psalm 118, in verse number 21, the Bible says this, I will praise thee, notice this, for thou hast heard me and art become my salvation. I want you to just pause there just for a moment. We often speak about the importance of prayer, the privilege of prayer, the fact that we can enter boldly into the throne room of God and we can bring our petitions before the Lord knowing that he hears and answers prayer. The psalmist says here, I will praise thee. Why? For thou hast heard me. The reality is that we find that Paul would say this to the believers in Philippi as he would give them the instruction of praying and giving thanks, and he would say this to these believers, and it's a great model for us to follow in Philippians 4, in verse number 6, be careful for nothing but in everything by prayer and supplication, with thanksgiving let your requests be made known unto God. See, we ought to praise God that he hears us. Yes, that he answers us, but sometimes the answer doesn't come immediately. Have you ever prayed for something that you didn't get a response immediately? But you know what? We can"
        }
      ]
    }
  ]
}