{
  "chapter": "Psalms 78",
  "sermons": [
    {
      "sermon_id": "bsk8iNEnRVo",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 78",
          "sermon_id": "bsk8iNEnRVo",
          "timestamp": 1618.2999877929688,
          "context": "land for forty days. They saw that there were giants in the land. They saw that they had fortified cities. They observed those things and therefore they concluded we be not able. But can you just for a moment rehearse in your mind all of the things that they had seen God do? When they were in Egypt and when they were there and they were under great turmoil. And God sends Moses and there's a series of plagues. You think about those ten plagues and you think about the power of God that was displayed. They saw that. Then you go forward and you begin to think about the crossing of the Red Sea. What power was displayed by our God? You think about after they crossed the Red Sea and you think about the water that God provided. You think about the manna that God provided. You think about more water that God provided. And you just begin to think about all that they saw God do. Then they go in and they spot a land and they see some giants and they see some fortified cities and all of a sudden they don't believe that God is able. Doubt and unbelief. In Psalm 78 the Bible says that they limited the Holy One of Israel. You know how we limit the unlimited God? Doubt. Unbelief. You say He's the unlimited God. How could He be limited? By our unbelief. He did not many miracles there. Why?"
        },
        {
          "reference": "Psalms 78",
          "sermon_id": "bsk8iNEnRVo",
          "timestamp": 1692.4999694824219,
          "context": "is able. Doubt and unbelief. In Psalm 78 the Bible says that they limited the Holy One of Israel. You know how we limit the unlimited God? Doubt. Unbelief. You say He's the unlimited God. How could He be limited? By our unbelief. He did not many miracles there. Why? Because of their unbelief. It's time that we believe God and that other people can see in us that God is real. That God does answer prayer. That God does work and God is still on His throne. We see the perception. We see the proposal. I want you to notice as we finish up the chapter this evening here in Genesis 21. I want you to notice the priority of Abraham. The priority of Abraham. The Bible says in verse 33, And Abraham planted a grove in Beersheba. Now understand that this is pre-law. Understand that this was a valid process, a place where he would worship, no doubt, as the Bible says, and called there on the name of the Lord God, the everlasting God. In the law it would be forbidden to have groves, but we find this again predates. And Abraham planted a grove there. He planted it with the purpose. Obviously there's work involved. Abraham is an old man at this point. We understand that. But there's work that's involved. He plants this grove in Beersheba and he worships. The Bible says that he called there on the name of the Lord."
        }
      ]
    }
  ]
}