{
  "chapter": "Psalms 9",
  "sermons": [
    {
      "sermon_id": "O-P_67xx1P0",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 9",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 468.29998779296875,
          "context": "says this, righteousness exalteth a nation. Why is that? Because the truth that we just looked at in Psalm 11 and verse 7, the righteous Lord loveth righteousness. And so therefore, righteousness exalteth a nation. Why? Because God loves righteousness, because He is righteous. And the righteous Lord loveth righteousness. And when we understand this evening this truth of Proverbs 14 and verse 34, that righteousness exalteth a nation, sometimes we're led to think and have the idea that this means that it will have some monetary type of blessing. And that's really not the fullness of what's being dealt with here. Though it may be that there are some temporal blessings that are enjoyed and experienced by a righteous people, the reality is that we have the favor of God upon us. The Bible says that righteousness exalteth a nation. But notice the last part of Proverbs 14 and verse 34, but sin is a reproach to any people. God is righteous, sin brings reproach. The Bible says in Psalm 9 and verse number 17, this with regard to the subject of sin bringing reproach, it says, the wicked shall be turned into hell and all the nations that forget God. You say, well, that's strong language. That's the Bible. The Bible is strong. The Bible does confront. The Bible, you know, people talk about wanting to be politically correct. The reality is that I'd rather be biblically correct. Amen?"
        },
        {
          "reference": "Psalms 9",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 1288.5399475097656,
          "context": "we live, and I love the nation in which we live, we would say, if we'd be honest this evening, that America is ripe for judgment. Is it not true that we have despised the law of the Lord? Is it not true that we have not kept His commandments? You understand that like no other nation, this nation had a standing and a starting with the principles of this book. Remember the truth that I shared with you in Psalm 9, in verse 17, the wicked shall be turned into hell and all the nations that forget God. Remember the Bible says about Judah in the book of Jeremiah that they forgot God days without number. Could it not be said of America? Honestly, I'm broken for our nation this evening, but I believe the Bible has the answer for our nation this evening, but we must understand and we must acknowledge that our God is righteous and that sin brings reproach. We understand this evening the pride in America. We understand this evening the murder, the drug abuse. There were states in our nation that voted to legalize hardcore drugs. It's unbelievable. It's wicked. It's ungodly. The Bible says that God will judge. He is the righteous judge. I don't want judgment for our nation. I don't. That's not what I would hope for our nation, but can I tell you that we're right for judgment. But think about abortion. Think about fornication."
        },
        {
          "reference": "Psalms 9",
          "sermon_id": "O-P_67xx1P0",
          "timestamp": 2583.7599334716797,
          "context": "Notice what he says, I am ashamed and blush to lift up my face to thee, my God, for our iniquities are increased over our head, and our trespass is grown up unto the heavens. I wonder this evening which one among us would respond the way that Ezra did. I mean honestly, that when we hear this, that our heart is heavy, I don't long for America to be judged. I don't hope for America to be judged. I really don't. I'm simply giving you this evening truth from the Word of God, that the righteous God, the righteous Lord, loveth righteousness, that righteousness exalteth the nation, but sin is a reproach to any people. The Bible told us as we looked, and we made mention there, and I wish I could quote it for you, I did not commit it to memory, but in Psalm 9, as I've turned back there a couple of times in verse number 17, the wicked shall be turned into hell in all the nations that forget God. I don't want that for our nation. I'm not preaching this message because I hope that judgment comes. I understand that Jonah went to Nineveh, and then after they repented and they were spared, that he was upset. I understand. I've read, I've preached the book of Jonah before. I understand the fourth chapter. And I tell you this evening, as much as I could say this with knowing what I know, if"
        }
      ]
    },
    {
      "sermon_id": "SfucrRfy8nw",
      "sermon_title": "Sermon SfucrRfy8nw",
      "url": "https://www.youtube.com/watch?v=SfucrRfy8nw",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 9",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 839.8799743652344,
          "context": "life of David and we see the closeness that he has. And you find that David says, the Lord is my shepherd in Psalm 23. And we begin to fill your mind with those truths of the Word of God and begin to spend that time. Remember, the Psalms tell us that in his presence is fullness of joy. The reality is that there's a sense of resolve that I see here on the part of the psalmist, a sense of resolve that I need, a sense of resolve that I believe that each of us could use in our lives. In Psalm 9, I'm gonna share a number of references with you. You can turn there if you want. I'll read them to you. You don't have to take the time to try to fumble back and forth. They're all here in the book of Psalms, so we're not gonna go to all sorts of other places, at least not yet. In Psalm 9, in verse number 1, again, a psalm that is ascribed to David, the Bible says this, I will praise thee, O Lord, and then I like this phrase, with my whole heart I will show forth all thy marvelous works. Think about the wholehearted aspect that the psalmist shares with us here. It's not just a, I have to say this because duty demands it, so to speak. I have to say this because somebody's looking for a testimony. We"
        },
        {
          "reference": "Psalms 9",
          "sermon_id": "SfucrRfy8nw",
          "timestamp": 839.8799743652344,
          "context": "life of David and we see the closeness that he has. And you find that David says, the Lord is my shepherd in Psalm 23. And we begin to fill your mind with those truths of the Word of God and begin to spend that time. Remember, the Psalms tell us that in his presence is fullness of joy. The reality is that there's a sense of resolve that I see here on the part of the psalmist, a sense of resolve that I need, a sense of resolve that I believe that each of us could use in our lives. In Psalm 9, I'm gonna share a number of references with you. You can turn there if you want. I'll read them to you. You don't have to take the time to try to fumble back and forth. They're all here in the book of Psalms, so we're not gonna go to all sorts of other places, at least not yet. In Psalm 9, in verse number 1, again, a psalm that is ascribed to David, the Bible says this, I will praise thee, O Lord, and then I like this phrase, with my whole heart I will show forth all thy marvelous works. Think about the wholehearted aspect that the psalmist shares with us here. It's not just a, I have to say this because duty demands it, so to speak. I have to say this because somebody's looking for a testimony. We"
        }
      ]
    }
  ]
}