{
  "chapter": "Psalms 51",
  "sermons": [
    {
      "sermon_id": "VXXPWmtdQok",
      "sermon_title": "Sermon VXXPWmtdQok",
      "url": "https://www.youtube.com/watch?v=VXXPWmtdQok",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 51",
          "sermon_id": "VXXPWmtdQok",
          "timestamp": 2398.9800415039062,
          "context": "to respond before he has to step things up because he's merciful. He's merciful, amen? And I think about that and I think, well, praise the Lord how good God really is to us because he is indeed a wonderful God of mercy. So you knew you could go home. So verse 18, I've got to keep moving. I'm almost... done, I will rise and go to my Father, and I will say unto him, Father, I have sinned against heaven and before thee, before thee. Now that's repentance. That's the beginning of repentance right there. That's an admission of sin. That's the acknowledgement of sin. The first step in revival and the first step in getting right with God is to acknowledge my sin. David said, I acknowledge my sin, it's ever before me in Psalm 51. So that's the acknowledgement of sin. That's where repentance starts. Verse 19, I'm no more worthy to be called thy son. Make me as one of the hired servants. That's humility. That's humility. Verse 20, and he rose and came to his father, but when he was a great way off, his father saw him and in compassion ran and fell on his neck and kissed him. Now that's interesting because here this boy, and by the way, he may have been a little hesitant on his way home, but here this boy is coming down the path and his father is waiting for him at"
        }
      ]
    },
    {
      "sermon_id": "QuP5gIgrnmo",
      "sermon_title": "Sermon QuP5gIgrnmo",
      "url": "https://www.youtube.com/watch?v=QuP5gIgrnmo",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 51",
          "sermon_id": "QuP5gIgrnmo",
          "timestamp": 1910.839958190918,
          "context": "His mercy endureth forever, but you understand that our God is just, and we must never, never mistake God's long-suffering for God's approval, amen? God never approved sin. He died for sin. What is it that Joseph said after Potiphar's wife multiple times sought to cast her eyes upon her and lie with me, lie with me, lie with me? How then can I do this great wickedness and sin against God? See, that's how we gotta view it. We gotta understand it in that fashion. When David penned the repentant Psalm of Psalm 51 against thee, and thee only have I done this wickedness. Restore unto me the joy of thy salvation after he says, create me a clean heart. And so we find that disobedience will lead to discipline. Notice what he says here, the wrath of God. I don't want God's anger or wrath. Do you? If you say, yeah, I'm signing up for that, you're crazy. I mean, honestly, you are absolutely insane. Read the Old Testament. Read about how God judged. Read 1 Corinthians 10. These things are written for our example and sample is what the word is there. But read it and see how God judged. And Paul says, for which things, in the which, for which things sake, the wrath of God cometh on the children of disobedience. See, I'm no, as we understand this truth and we understand God's righteousness and we understand God's justice,"
        }
      ]
    },
    {
      "sermon_id": "pKSibA3D-2M",
      "sermon_title": "Sermon pKSibA3D-2M",
      "url": "https://www.youtube.com/watch?v=pKSibA3D-2M",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 51",
          "sermon_id": "pKSibA3D-2M",
          "timestamp": 1896.8400039672852,
          "context": "of them are pretty terrible. But they had to engage in abominable acts because this was an abominable, abominable god, this false god. Now verse 6 look at this, this is sad. This man whom God gave all this wisdom to and all this wealth to, look at this in verse 6, And Solomon did evil in the sight of the LORD, and went not fully after the LORD as did David his father. See that backs up the statement I made to you a minute ago that Solomon did not love God as deeply as did David. David loved the Lord with all of his heart. Now did David sin? Did he get off track? Did he get off course? Yes. But praise the Lord David was known to make course corrections. I can see it in Psalm 51 after that thing that he did with Bathsheba and God broke him and he got right with the Lord, amen. When he confessed that sin, when he repented of that sin, when he turned away from that sin, when he forsook that sin God restored him again to fellowship. He made a course correction that he knew he needed to make in order to get back to where he needed to be. Had he not done that, that lack of being on course would have run him smack into a wall somewhere and he'd end up crashed and burned. So praise the Lord for that testimony. And by the"
        }
      ]
    },
    {
      "sermon_id": "TljookEyMZU",
      "sermon_title": "Sermon TljookEyMZU",
      "url": "https://www.youtube.com/watch?v=TljookEyMZU",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 51",
          "sermon_id": "TljookEyMZU",
          "timestamp": 2600.8199615478516,
          "context": "the Holy Spirit of God will do in your life? He'll convict you. Amen? How many of you experience it? Don't show me your hands, but you know, amen? The conviction of the Holy Spirit of God. By the way, that's a good thing. It's good to be convicted of your sin, and it's good to be aware of the fact that we need to confess our sin and we need to understand that our fellowship can be restored. Remember David as he prayed, as he made confession in Psalm 51, he says, return unto me the joy of my salvation. He had sinned greatly. He's confessing his sin, and he's saying to the Lord, return unto me the joy of my salvation. D. L. Moody said, this book will keep you from sin, or sin will keep you from this book. And unfortunately, sometimes what happens is we have, as the book of Hebrews has already warned us, hardened hearts. And we're not as in tune with the Holy Spirit of God and the conviction of the Holy Spirit of God. The Bible talks about the fact that we can grieve the Holy Spirit of God. The Bible talks about the fact that we can quench the Holy Spirit of God. That's dangerous, dangerous territory to be in. Oh, that we'd be sensitive, that we would have the theme of that song, that there would be nothing between my soul and my Savior,"
        }
      ]
    },
    {
      "sermon_id": "8bqqorGPae8",
      "sermon_title": "Sermon 8bqqorGPae8",
      "url": "https://www.youtube.com/watch?v=8bqqorGPae8",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 51",
          "sermon_id": "8bqqorGPae8",
          "timestamp": 2313.959991455078,
          "context": "well within us. It's something that God gives us. No man taketh your joy, right? It's what the Word of God tells us. And we can be dealing with some of the most adverse circumstances on this earth, some of the hardest trials that we've ever faced, and have joy. We can face the most intense and the most severe storm, we can have peace and we can have joy. It's completely different than happiness. Joy is the result of salvation. David said this in Psalm 51, his great psalm of repentance. He says, restore unto me the joy of thy salvation. He did not say, restore unto me salvation, he didn't lose it, but he certainly lost the joy of his salvation. You know why he lost the joy of his salvation? Because sin robs you of your joy. And so we find here that he says that your joy may be full. Number one, joy is the result of salvation, but then I would say this, number two, that joy is the result of fellowship. It's the result of fellowship, of that godly living. We mentioned that in verse number seven, the theme that we have, walking in the light, that if we walk in the light as He is in the light, we have fellowship one with another in the blood of Jesus Christ, His Son cleanseth us from all sin."
        }
      ]
    }
  ]
}