{
  "chapter": "Psalms 37",
  "sermons": [
    {
      "sermon_id": "YCUS9wAR_oA",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 566.7000122070312,
          "context": "We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us and reveals to us what His will is for mankind. How is it that I can align my will with God's will? Because that's really what it boils down to, is how is it that we can align our will with God's will? Take your Bible quickly, if you will. Turn to the book of Psalm, Psalm 37. I believe in Psalm 37, God gives us some really nuggets of truth, some indicators, if you will, for how we, as God's people, can align our will. with His will, because Jesus, in responding to the request of the disciple, Lord, teach us to pray, gave this framework, this pattern for prayer, and within the framework, He says, Thy will be done. In Psalm chapter 37, the Bible says this in verse number 3. I'm going to look at verses 3 through 7. Notice what the Bible says. Trust in the Lord and do good. So shalt thou dwell in the land, and verily thou shalt be fed. Delight thyself also in the Lord, and He shall give thee the desires of thine heart. How many times have you heard verse 4 taken completely out of context?"
        },
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 566.7000122070312,
          "context": "We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us and reveals to us what His will is for mankind. How is it that I can align my will with God's will? Because that's really what it boils down to, is how is it that we can align our will with God's will? Take your Bible quickly, if you will. Turn to the book of Psalm, Psalm 37. I believe in Psalm 37, God gives us some really nuggets of truth, some indicators, if you will, for how we, as God's people, can align our will. with His will, because Jesus, in responding to the request of the disciple, Lord, teach us to pray, gave this framework, this pattern for prayer, and within the framework, He says, Thy will be done. In Psalm chapter 37, the Bible says this in verse number 3. I'm going to look at verses 3 through 7. Notice what the Bible says. Trust in the Lord and do good. So shalt thou dwell in the land, and verily thou shalt be fed. Delight thyself also in the Lord, and He shall give thee the desires of thine heart. How many times have you heard verse 4 taken completely out of context?"
        },
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 849.0999755859375,
          "context": "It's found in His word, how much time we must spend in God's word every day of our lives. Notice with me in verse number 5, commit thy way unto the Lord. And then we see again, trust also in Him. So we are told to trust in the Lord. We're told to delight thyself also in the Lord. We're told to commit thy way unto the Lord, trusting Him. Listen, because we know who He is, then we can commit our way unto Him. And then we find in verse number 7, notice these words, rest in the Lord. Rest in the Lord. You know, when we look at the truth that God gives us here in Psalm 37 in verses 3 through 7, these four nuggets of truth as we seek to answer the question, how can I align my will with God's will? We find that it's necessary that we're in His presence, that we're trusting Him, that we're delighting in Him, that we're committing our way unto Him, that we're resting in Him. This morning as we think about the subject of prayer and looking at these four words, thy will be done, two thoughts for you this morning. When we pray thy will be done, number one, we recognize that His will or His way is superior. When we pray, thy will be done. Now understand, that's not just a cliche that we add to the end of a prayer."
        },
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 1417.5199737548828,
          "context": "he going to do that? A variety of ways. But we find this morning that as we look at David and he gives this testimony, his way is perfect. Notice the word of the Lord is tried. He is a buckler to all them that trust in him, a shield. Do you remember Psalm 37 twice in those verses of Scripture, trust in the Lord. And we find here this morning that when we understand thy will be done, we are recognizing when we pray that way, when our prayer life is influenced and impacted by this phrase, we are recognizing that his way, his will is best. It's best. You say, well, it might not be what I've chosen. You don't know what God's going to do. You don't know how God is going to work. The book of Philippians in the first chapter, Paul says to the believers in Philippi, I want you to understand something. What I want you to understand is that the things that have happened to me have happened for the furtherance of the gospel. Praise God. In chapter number four, he speaks about those of Caesar's household that send their greetings. No doubt they heard the gospel because Paul was imprisoned. You say, well, I don't want to be in prison. You can read of many countless that have gone on before us that have suffered. They faced persecution and difficulty and we find that in so doing, God was glorified."
        }
      ]
    }
  ]
}