{
  "book": "John",
  "sermons": [
    {
      "sermon_id": "2mDKhmk687Y",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 2",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 363.8399963378906,
          "context": "...e would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up"
        },
        {
          "reference": "John 2",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 425.67999267578125,
          "context": "...e would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up Then said the Jews forty and six y..."
        },
        {
          "reference": "John 14",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 2765.9800720214844,
          "context": "...reby we must be saved. What was Peter saying? Well, he was saying the same thing that Jesus said in John 14. I am the way, the truth, and the life. No man cometh unto the Father but by me. This morning, if y..."
        },
        {
          "reference": "John 14",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 2842.540069580078,
          "context": "must be saved. What was Peter saying? Well, he was saying the same thing that Jesus said in John 14. I am the way, the truth, and the life. No man cometh unto the Father but by me. This morning, if y..."
        },
        {
          "reference": "John 16",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 2907.2200622558594,
          "context": "...en, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's"
        },
        {
          "reference": "John 16",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 2992.3800659179688,
          "context": "...en, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's righteousness, and of judgment t..."
        }
      ]
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 10",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 1005.9600219726562,
          "context": "...r of God, as He says in 1 Peter 1 and verse number 5, and I'm so thankful that He keeps us. Here in John 10 and verse number 27, notice what Jesus says, My sheep hear My voice, and I know them, and they foll..."
        },
        {
          "reference": "John 14",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 2363.2999877929688,
          "context": "...s, He promised to return for us. He promised to return for us. We're familiar with this promise. In John 14, in verses one through three, Jesus says, let not your heart be troubled. You believe in God, belie..."
        }
      ]
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 13",
          "sermon_id": "BZi-sUEn51M",
          "timestamp": 599.97998046875,
          "context": "...e number 4 is described this way, it suffereth long. You know we're instructed to love one another. John 13 records it this way, if you would turn there in John 13. The Bible says this, Jesus of course as we..."
        },
        {
          "reference": "John 13",
          "sermon_id": "BZi-sUEn51M",
          "timestamp": 599.97998046875,
          "context": "...e number 4 is described this way, it suffereth long. You know we're instructed to love one another. John 13 records it this way, if you would turn there in John 13. The Bible says this, Jesus of course as we..."
        }
      ]
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 11",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 2114.47998046875,
          "context": "...sick, Jesus didn't immediately go. He tarried because he had a purpose. Notice in verse number 4 of John 11, the Bible says when Jesus heard that, heard what? That Lazarus was sick, he said, the sickness is ..."
        },
        {
          "reference": "John 11",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 2300.199981689453,
          "context": "...u're going to learn something that you would not learn under any other circumstance. Notice here in John 11, after Jesus delays, he tells the disciples that we're going to go. And he says in verse number 11,..."
        }
      ]
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 5",
          "sermon_id": "QRS13lJ0CSY",
          "timestamp": 1861.7199935913086,
          "context": "... chapter of the book of 1st John, he used that phrase born of God twice. In verse number one of 1st John 5, he said whosoever believeth that Jesus is the Christ is born of God. And then in verse number four..."
        },
        {
          "reference": "John 2",
          "sermon_id": "QRS13lJ0CSY",
          "timestamp": 1985.8199920654297,
          "context": "... important and gives us clarity. In previous messages in chapter 2 and 3, we dealt with this in 1st John 2 and 3, but the verb here, when it talks about sinneth not, is conjugated in the present tense. I'm ..."
        },
        {
          "reference": "John 16",
          "sermon_id": "QRS13lJ0CSY",
          "timestamp": 2486.739990234375,
          "context": "...g, and we understand this morning that this understanding comes through the Holy Spirit. He says in John 16 and verse number 13 that He, the Holy Spirit, He is the Spirit of truth, and He will guide us into ..."
        }
      ]
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 1",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 86.41999816894531,
          "context": "...d Jesus Christ as many as received him to them gave he power to become the sons of God according To John 1 in verse number 12, and I'm so thankful that I can say father and Go to the Lord knowing that I hav..."
        }
      ]
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 14",
          "sermon_id": "iT8pxOgIv0A",
          "timestamp": 1019.6599731445312,
          "context": "...e in. I didn't have access. But Jesus has provided the way. He is the way, the truth, and the life. John 14, remember Jesus said that to His disciples."
        },
        {
          "reference": "John 14",
          "sermon_id": "iT8pxOgIv0A",
          "timestamp": 1085.1399841308594,
          "context": "...e in. I didn't have access. But Jesus has provided the way. He is the way, the truth, and the life. John 14, remember Jesus said that to His disciples. He said, I am the way, the truth, and the life. No man ..."
        },
        {
          "reference": "John 13",
          "sermon_id": "iT8pxOgIv0A",
          "timestamp": 1809.5799369812012,
          "context": "...s speaking to them and at the end of chapter number 13 he says this beginning in verse number 31 of John 13 therefore when he was gone out Jesus said now is the Son of Man glorified and God is glorified in h..."
        }
      ]
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 3",
          "sermon_id": "LAgQEfojK6Q",
          "timestamp": 150.3000030517578,
          "context": "...y in 2014 I preached to the book of John and Dealt with that great statement of John the Baptist in John 3 in verse number 30. He must increase It's all about Jesus and we understand that the entirety of th..."
        }
      ]
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 3",
          "sermon_id": "2cDKZaPlI5s",
          "timestamp": 414.0,
          "context": "...t into the message this evening, notice that little word, so. We're familiar with that when we read John 3, 16, for God so loved the world. And you think about the impact when God is explaining to us the te..."
        }
      ]
    },
    {
      "sermon_id": "0lpK3XY3NtI",
      "sermon_title": "Sermon 0lpK3XY3NtI",
      "url": "https://www.youtube.com/watch?v=0lpK3XY3NtI",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 15",
          "sermon_id": "0lpK3XY3NtI",
          "timestamp": 934.7799987792969,
          "context": "...e Christ. We must rely on his power. Without me, we know the verse. Without me, you can do nothing, John 15. We know the verse, but I would submit to you that many of God's people, though we know the verse h..."
        }
      ]
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 2",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 0.0,
          "context": "Online and happy birthday to brother John and he is not 40. Amen. I don't know exactly his age, but he is not 40 I can guarantee you that happy birthday, brother John 2nd Chronicles chapter number 20 2nd Chronicles chapter number 20 in your Bible this morning as you know throughout the year Here in 2020 our theme has been looking unto Jesus We systematically studied through the book of Hebrews and as we studied through the book of Hebrews Of course, as you know as you've been with us, we finished up last Sunday and what a joy To that it was for me I hope it was a joy for you to study through the book of Hebrews and to be encouraged to be challenged to be strengthened And as we study the Word of God We know that the Bible tells us that faith come of my hearing and hearing by the Word of the Lord of the Word of God and I'm so thankful that through studying the Word of God that our faith is increased and we serve a wonderful Savior Amen, and I know I've shared this before with you that several in the places in which we go we have to wear masks and all that sort of thing and so I purchased a couple of masks that have Some some some sayings on them. One of them says Jesus loves you"
        },
        {
          "reference": "John 15",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 1731.9400024414062,
          "context": "...of the verse, we'd say in the latter part of the verse that it's a declaration of their dependence. John 15, we find that Jesus teaches the disciples, and of course for us to have the understanding of that t..."
        },
        {
          "reference": "John 3",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 2865.3800354003906,
          "context": "...ipture, but once again, my attention was focused upon that great declaration of John the Baptist in John 3 in verse 30, he must increase and I must decrease. Listen, it's all about God being glorified. And ..."
        }
      ]
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 3",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 834.7599792480469,
          "context": "John 3 and verse number 4 with regard to the definition or the description of sin. I would say this, as we..."
        },
        {
          "reference": "John 8",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 1059.239990234375,
          "context": "...ious leaders of the day, and He speaks to them about their father, the devil. And He speaks this in John 8 and verse number 44, the year of your father, the devil, and the lust of your father you will do. H..."
        },
        {
          "reference": "John 8",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 1059.239990234375,
          "context": "...ious leaders of the day, and He speaks to them about their father, the devil. And He speaks this in John 8 and verse number 44, the year of your father, the devil, and the lust of your father you will do. H..."
        },
        {
          "reference": "John 17",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 1359.239974975586,
          "context": "...ions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye t..."
        },
        {
          "reference": "John 17",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 1441.3999786376953,
          "context": "...ions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye t..."
        },
        {
          "reference": "John 15",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 1936.8199615478516,
          "context": "...Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subje..."
        },
        {
          "reference": "John 15",
          "sermon_id": "WhaPo-g3nqA",
          "timestamp": 2013.5399627685547,
          "context": "...Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subje..."
        }
      ]
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 17",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 0.0,
          "context": "But before we get there, I'm going to be reading a passage from John 17. And so perhaps you want to start in John chapter number 17. And I'm going to read our text from 1 ..."
        },
        {
          "reference": "John 17",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 130.0,
          "context": "... us just moments before the Lord Jesus Christ would go to the cross of Calvary. The Bible begins in John 17 and verse number 11, and it says this, And now I am no more in the world, but these are in the worl..."
        },
        {
          "reference": "John 17",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 195.0,
          "context": "...hat they also might be sanctified through the truth. As we notice in these verses of Scripture from John 17, many times the Lord Jesus Christ is referring to the world. And he says this, that he's given us h..."
        },
        {
          "reference": "John 17",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 261.0,
          "context": "...en so have I also sent them into the world. And we think about this truth that is revealed to us in John 17 and coupled with what we read in 1 John chapter number 2, and we are immediately confronted with a ..."
        }
      ]
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 0.0,
          "context": "... the gospel of John. I just read it again last week and just thoroughly was blessed and encouraged. John 16, in verse number 33, notice what the Bible says. These things I have spoken unto you, that in me yo..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 166.55999755859375,
          "context": "...y, the truth of preparation is still found within these words that Jesus spoke. We find that really John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 246.16000366210938,
          "context": "John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 454.20001220703125,
          "context": "...If you're taking notes with me this morning, notice number one, something to embrace. As we look at John 16 and verse number 33, I find that there's something for us to embrace, something for the disciples t..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 988.780029296875,
          "context": "...take place, he says, I'm commanding you that you love one another. You're going to need each other. John 16 and verse number 1, these things have I spoken unto you that you should not be offended. Notice whe..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1053.9000244140625,
          "context": "...things unto you. I'm trying to give you the instruction that you need. Look in verse number four of John 16, but these things have I told you that when the time shall come, you may remember that I told you o..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1115.9000244140625,
          "context": "... that he's given us the truth that we need. There's something to embrace. We find in verse seven of John 16, Jesus says, nevertheless, I tell you the truth. I tell you, he's speaking to them. It is expedient..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1188.9000244140625,
          "context": "...That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bi..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1188.9000244140625,
          "context": "...That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bi..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1343.5600280761719,
          "context": "...stand that in me, you might have peace. In me, in the Lord Jesus Christ. But notice what he says in John 16. He says, in me, you might have peace, but he follows it up and says this, in the world, you shall ..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1425.0000305175781,
          "context": "...na have tribulation, that in him, they can have peace. This is a great truth that is given to us in John 16 in verse number 33, that yes, we understand that in that world, there's going to be tribulation and..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1938.300048828125,
          "context": "...ribulation, but He said in Him there's peace. And what joy that is to every child of God. I find in John 16 and verse 33, there's something to embrace, there's something to expect, but I find there's someone..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1938.300048828125,
          "context": "...ribulation, but He said in Him there's peace. And what joy that is to every child of God. I find in John 16 and verse 33, there's something to embrace, there's something to expect, but I find there's someone..."
        },
        {
          "reference": "John 13",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 166.55999755859375,
          "context": "...of Peter and his objection and the instruction that's given. But after that portion of scripture in John 13, we find that Jesus to conclude the 13th chapter, chapter 14, 15 and 16, we find that in these page..."
        },
        {
          "reference": "John 17",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 246.16000366210938,
          "context": "...but we find that as immediately following our text of scripture this morning, that when you come to John 17 and verse number one, that Jesus says, father, the hour is come. What is he referring to? Well, he'..."
        },
        {
          "reference": "John 17",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 2174.780029296875,
          "context": "... to be praised. We need to see Him high, holy and lifted up. We need to see Him exalted. We find in John 17 that as Jesus says the hour has come glorify thy son that thy son also may glorify thee. We find th..."
        },
        {
          "reference": "John 15",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 862.2200317382812,
          "context": "...our joy, that my joy might remain in you, and that your joy might be full. Look at verse 17 here in John 15. He says, these things I command you that you love one another. You know, I want you to think about..."
        },
        {
          "reference": "John 14",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1188.9000244140625,
          "context": "...we have divided into chapters. He's providing this instruction to his disciples. And notice back in John 14 and verse 27, notice what Jesus says with regard to peace. He says, listen, there's something to em..."
        },
        {
          "reference": "John 14",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1188.9000244140625,
          "context": "...we have divided into chapters. He's providing this instruction to his disciples. And notice back in John 14 and verse 27, notice what Jesus says with regard to peace. He says, listen, there's something to em..."
        },
        {
          "reference": "John 14",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1264.9800262451172,
          "context": "... unto you, but there's something to expect. He says, listen, in me, you might have peace. Notice in John 14 and verse number 27, Jesus says this, peace I leave with you. Do you notice the next word? My peace..."
        }
      ]
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 17",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 1104.4999694824219,
          "context": ".... We've got to lay aside the sin which doth so easily beset us. We're mindful of what Jesus said in John 17 as He's nearing the time in which He would go to the cross of Calvary. And we find that He's prayin..."
        },
        {
          "reference": "John 17",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 1104.4999694824219,
          "context": ".... We've got to lay aside the sin which doth so easily beset us. We're mindful of what Jesus said in John 17 as He's nearing the time in which He would go to the cross of Calvary. And we find that He's prayin..."
        },
        {
          "reference": "John 17",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 1937.260009765625,
          "context": "... verse number 29, He says this, I do always those things that please Him. We mentioned already from John 17 and verses 15 through 17 about the fact that we're in the world but not of the world, but we find t..."
        },
        {
          "reference": "John 17",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 1995.4199981689453,
          "context": "...ore verses as we really think about the transition to our final point this morning, He says this in John 17 and verse number 4, I have glorified Thee on the earth, I have finished the work which Thou gavest ..."
        },
        {
          "reference": "John 17",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 2063.4400024414062,
          "context": "... to be focused for the race, we need to finish the race. Jesus finished, as we mentioned already in John 17 and verse number four. He said, I've glorified thee, I finished. We find that in John 19 and verse ..."
        },
        {
          "reference": "John 8",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 1937.260009765625,
          "context": "...he earthly ministry of the Lord Jesus Christ, that He was focused on His purpose. You understand in John 8 and verse number 29, He says this, I do always those things that please Him. We mentioned already f..."
        },
        {
          "reference": "John 19",
          "sermon_id": "dQq2qxx8aHM",
          "timestamp": 2063.4400024414062,
          "context": "...already in John 17 and verse number four. He said, I've glorified thee, I finished. We find that in John 19 and verse number 30, he cried out on the cross of Calvary before he gave up the ghost. He said, it ..."
        }
      ]
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 17",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 1767.97998046875,
          "context": "...d that in John chapter number 17, notice what the Bible tells us. We know that this actually is, in John 17, the prayer of Jesus. And we find that oftentimes, the people will speak about the Lord's prayer, a..."
        },
        {
          "reference": "John 17",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 1767.97998046875,
          "context": "...d that in John chapter number 17, notice what the Bible tells us. We know that this actually is, in John 17, the prayer of Jesus. And we find that oftentimes, the people will speak about the Lord's prayer, a..."
        },
        {
          "reference": "John 17",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 1767.97998046875,
          "context": "...d that in John chapter number 17, notice what the Bible tells us. We know that this actually is, in John 17, the prayer of Jesus. And we find that oftentimes, the people will speak about the Lord's prayer, a..."
        },
        {
          "reference": "John 19",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 1913.5799560546875,
          "context": "... He understood that was the purpose. It was for Me that He died on that cross. We find that it's in John 19 in verse 30 that Jesus lifts up His head and as it says, it is finished. And He bowed His head and ..."
        },
        {
          "reference": "John 10",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 1913.5799560546875,
          "context": "...ead and as it says, it is finished. And He bowed His head and gave up the ghost. We've been told in John 10 that He's the Good Shepherd and that the Good Shepherd lays down His life for the sheep. And Jesus ..."
        },
        {
          "reference": "John 21",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 2414.4199562072754,
          "context": "...the wrong place. Know your race. Know your course. Know your ministry. Super practical. Notice what John 21 tells us. The Lord Jesus Christ in this passage of Scripture is speaking to Peter. He's speaking to..."
        },
        {
          "reference": "John 21",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 2414.4199562072754,
          "context": "...the wrong place. Know your race. Know your course. Know your ministry. Super practical. Notice what John 21 tells us. The Lord Jesus Christ in this passage of Scripture is speaking to Peter. He's speaking to..."
        },
        {
          "reference": "John 21",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 2414.4199562072754,
          "context": "...the wrong place. Know your race. Know your course. Know your ministry. Super practical. Notice what John 21 tells us. The Lord Jesus Christ in this passage of Scripture is speaking to Peter. He's speaking to..."
        },
        {
          "reference": "John 21",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 2488.1999588012695,
          "context": "do you love me? Peter, do you love me? And I want you to notice what John 21 in verse number 21 says. Peter seeing him, this him is speaking of John according to verse number 2..."
        },
        {
          "reference": "John 15",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 2650.0399627685547,
          "context": "... Remain humble. Finally, this morning, number four, depend fully on Christ. Depend fully on Christ. John 15 speaks about the importance of abiding in him. You're the"
        },
        {
          "reference": "John 15",
          "sermon_id": "uGo1HL4c1vk",
          "timestamp": 2721.659942626953,
          "context": "... Remain humble. Finally, this morning, number four, depend fully on Christ. Depend fully on Christ. John 15 speaks about the importance of abiding in him. You're the branches, Jesus said, but I am the vine. ..."
        }
      ]
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 13",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 1130.7400512695312,
          "context": "...clared thy strength among the people. I mentioned last Sunday as we talked about God's love, and in John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that..."
        },
        {
          "reference": "John 13",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 1198.0400390625,
          "context": "John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that..."
        }
      ]
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 10",
          "sermon_id": "BTHY_qWho6M",
          "timestamp": 1409.0399475097656,
          "context": "...hepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfol..."
        },
        {
          "reference": "John 10",
          "sermon_id": "BTHY_qWho6M",
          "timestamp": 1473.43994140625,
          "context": "...hepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfol..."
        },
        {
          "reference": "John 10",
          "sermon_id": "BTHY_qWho6M",
          "timestamp": 1473.43994140625,
          "context": "...hepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfol..."
        }
      ]
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 8",
          "sermon_id": "TOJWIvB7SDM",
          "timestamp": 1671.3400268554688,
          "context": "...ut they know how to lie. Right? It's part of the old man. The devil is a liar and the father of it. John 8, verse 44. The ninth commandment, bear ye not false witness. Right? Stop lying. You know what's int..."
        }
      ]
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 17",
          "sermon_id": "d8tHudo0_3I",
          "timestamp": 0.0,
          "context": "...as been given and we have been sent and we have a Responsibility and Jesus made that declaration in John 17 before he would go to the cross of Calvary Of course We are mindful of the fact that after the resu..."
        },
        {
          "reference": "John 15",
          "sermon_id": "d8tHudo0_3I",
          "timestamp": 2223.840057373047,
          "context": ".... You know what Jesus said, newsflash, if they hate you, they hated me. Isn't that what Jesus said, John 15? You go and look at it, that's what Jesus said. They say, what will this babbler say? You know that..."
        }
      ]
    },
    {
      "sermon_id": "G50UWUcArHE",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 17",
          "sermon_id": "G50UWUcArHE",
          "timestamp": 1928.3399963378906,
          "context": "...r what Jesus said right before He would go to the cross of Calvary as He's praying to His Father in John 17. And we find that He's praying there. And He says this, \"...sanctify them through Thy truth. Thy wo..."
        },
        {
          "reference": "John 17",
          "sermon_id": "G50UWUcArHE",
          "timestamp": 1928.3399963378906,
          "context": "...r what Jesus said right before He would go to the cross of Calvary as He's praying to His Father in John 17. And we find that He's praying there. And He says this, \"...sanctify them through Thy truth. Thy wo..."
        }
      ]
    }
  ]
}