{
  "book": "Philippians",
  "sermons": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 1",
          "sermon_id": "jNCO80tyoMQ",
          "timestamp": 2766.3800048828125,
          "context": "...ul to see the relationship that they had, the love. And notice what Paul says to these believers in Philippians 1 and verse number 6, being confident. Don't you like that word? That's a good word. Being confident ..."
        }
      ]
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 3",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 605.8400292396545,
          "context": "... of God's Word that our faith increases. It's through this book that I know my Savior, Paul says in Philippians 3, that I may know Him and the power of His resurrection. And if you want to know God, you need to kn..."
        },
        {
          "reference": "Philippians 1",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 1609.8800354003906,
          "context": "...r lives. And He's developing us and He's causing us to grow. It's exciting. He's working. Notice in Philippians 1, in verse number six, the Bible says this. I believe, Brother Tony, you often mention this verse of..."
        },
        {
          "reference": "Philippians 4",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 1770.52001953125,
          "context": "...re with regard to the provision in which my mind is thinking of this evening. We'll mention briefly Philippians 4 as He speaks about that monetary blessing. But notice here in Ephesians 1, the Bible says this in v..."
        },
        {
          "reference": "Philippians 4",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 1842.7600173950195,
          "context": "...y? Because that's the way that God is providing for us spiritually. What a joy! What a blessing! In Philippians 4, we notice here in this portion of Scripture that Paul is communicating with these believers, and h..."
        }
      ]
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 4",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 70.0,
          "context": "...ire for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 ..."
        },
        {
          "reference": "Philippians 4",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 128.16000366210938,
          "context": "for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 ..."
        }
      ]
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 3",
          "sermon_id": "QRS13lJ0CSY",
          "timestamp": 2622.739990234375,
          "context": "... lets us know him. That should just cause our mind to explode this morning, seriously. Paul says in Philippians 3 that I may know him, the power of his resurrection, the fellowship of his sufferings he speaks abou..."
        }
      ]
    },
    {
      "sermon_id": "V5wHGLUSkdE",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 2",
          "sermon_id": "V5wHGLUSkdE",
          "timestamp": 1620.8799743652344,
          "context": "...the Bible tells us in the book of Philippians that God hath highly exalted Him speaking of Jesus in Philippians 2 and verse 9, given Him a name which is above every name, that in the name of Jesus, every knee shou..."
        }
      ]
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 2",
          "sermon_id": "BTHY_qWho6M",
          "timestamp": 795.47998046875,
          "context": "...that the Bible gives us a wonderful truth with regard to the name of Jesus. The Bible says there in Philippians 2 in verse 9 that the name"
        },
        {
          "reference": "Philippians 2",
          "sermon_id": "BTHY_qWho6M",
          "timestamp": 870.3199768066406,
          "context": "...that the Bible gives us a wonderful truth with regard to the name of Jesus. The Bible says there in Philippians 2 in verse 9 that the name of Jesus every knee, every knee should bow of things in heaven, things in ..."
        }
      ]
    },
    {
      "sermon_id": "G50UWUcArHE",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Philippians 1",
          "sermon_id": "G50UWUcArHE",
          "timestamp": 1854.0799980163574,
          "context": "...ord, is Yours to control for me to live is Christ and to die is gain is what he says in the book of Philippians 1 and v. 21. And we find here that he understood the miracle, but he also understood the ministry. He..."
        },
        {
          "reference": "Philippians 1",
          "sermon_id": "G50UWUcArHE",
          "timestamp": 2384.1599731445312,
          "context": "... truths result Paul did, in the Apostle Paul saying, I'm living for Christ. As I've quoted already, Philippians 1 and verse 21, for me to live is Christ, and to die is gain. See, I believe, as we trace the steps o..."
        },
        {
          "reference": "Philippians 3",
          "sermon_id": "G50UWUcArHE",
          "timestamp": 2004.1799926757812,
          "context": "...iracle of reconciliation, but we understand the ministry of reconciliation. Paul put it this way in Philippians 3 in verse number 20, \"...for our conversation is in heaven. From whence also we look for the Savior,..."
        }
      ]
    }
  ]
}