{
  "book": "Psalms",
  "sermons": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 121",
          "sermon_id": "KVAB3-ajXLM",
          "timestamp": 2017.2200317382812,
          "context": "with you. Man, they had some communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I am with you always. Hebrews 13 and v. 5, a precious promise of the Word of God. He will never leave thee nor forsake thee. When we understand the truth of v. 6, He is my Helper. Therefore, who or what am I going to fear? The psalmist said in Psalm 121, I will lift up mine eyes unto the hills. From whence cometh my help? My help cometh from the Lord which made heaven and earth. He is my Helper. He's your Helper. And here, these men, they find themselves in the fiery furnace, they find themselves enjoying some communion with God. Can I tell you this morning that if you're going to stand and if I'm going to stand, we may face some consequences. But can I tell you, God will be with you. God will be with you. And you'll have seasons of communion that are sweeter than you've ever enjoyed any time before. I think about Paul and Silas when they were in prison. They were cast into the prison fast, locked away. But man, they were singing, were they not? Singing to God, they were having communion with God. See, this morning,"
        }
      ]
    },
    {
      "sermon_id": "G38C0Tuh6UA",
      "sermon_title": "Sermon G38C0Tuh6UA",
      "url": "https://www.youtube.com/watch?v=G38C0Tuh6UA",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 46",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 288.4800109863281,
          "context": "hope for you as well because we need God's grace. His grace is amazing. We sing the song. I know every time we get near the 180s that Brother Don says, why can't it be 187, right? Sing Amazing Grace and it's such a wonderful song and a wonderful truth. God's grace is abundant but he said that his grace is sufficient for me and he said that his grace is sufficient for you. I preached the very first message this year that it's a promise that is explained but it's a promise that must be embraced and how important it is that we go through life understanding the joy it is to experience the grace of God as Paul fulfilled the will of God in his life, I would say this, he had hardships. He had hardships. In fact, Job chapter 14 speaks of the man that's born of woman is a few days and full of trouble. He had hardships but I want you to understand this morning that Paul had hardships but he had God's help. I'm so thankful that Hebrews chapter 13 in verse number six reminds us that we can have that confidence that God, he is our helper. I'm thankful for Psalm 46 and in fact, if you study the entirety of Psalm 46, it's amazing what the Psalmist says but he speaks about in verse number one how God is a very present help in the time of trouble"
        },
        {
          "reference": "Psalms 46",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 288.4800109863281,
          "context": "hope for you as well because we need God's grace. His grace is amazing. We sing the song. I know every time we get near the 180s that Brother Don says, why can't it be 187, right? Sing Amazing Grace and it's such a wonderful song and a wonderful truth. God's grace is abundant but he said that his grace is sufficient for me and he said that his grace is sufficient for you. I preached the very first message this year that it's a promise that is explained but it's a promise that must be embraced and how important it is that we go through life understanding the joy it is to experience the grace of God as Paul fulfilled the will of God in his life, I would say this, he had hardships. He had hardships. In fact, Job chapter 14 speaks of the man that's born of woman is a few days and full of trouble. He had hardships but I want you to understand this morning that Paul had hardships but he had God's help. I'm so thankful that Hebrews chapter 13 in verse number six reminds us that we can have that confidence that God, he is our helper. I'm thankful for Psalm 46 and in fact, if you study the entirety of Psalm 46, it's amazing what the Psalmist says but he speaks about in verse number one how God is a very present help in the time of trouble"
        },
        {
          "reference": "Psalms 46",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 357.739990234375,
          "context": "that confidence that God, he is our helper. I'm thankful for Psalm 46 and in fact, if you study the entirety of Psalm 46, it's amazing what the Psalmist says but he speaks about in verse number one how God is a very present help in the time of trouble and you find that as the verses continue in Psalm 46 in verse two and three, the catastrophic events that the Psalmist references in that Psalm but yet he says, my God is a very present help in the time of trouble. Paul dealt with hardships but Paul experienced God's help and what a blessing that is as we look at the passage of scripture, look at it in verse number eight, begin reading with me. The Bible says this, we are troubled on every side yet not distressed, we are perplexed but not in despair, persecuted but not forsaken, cast down but not destroyed. Always bearing about in the body, the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body. For we which live are always delivered unto death for Jesus' sake, that the life also of Jesus might be made manifest in our mortal flesh. So then death worketh in us but life in you, we having the same spirit of faith, according as it is written, I believed and therefore have I spoken, we also believe and therefore speak, knowing that he which raised up the Lord Jesus"
        },
        {
          "reference": "Psalms 46",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 357.739990234375,
          "context": "that confidence that God, he is our helper. I'm thankful for Psalm 46 and in fact, if you study the entirety of Psalm 46, it's amazing what the Psalmist says but he speaks about in verse number one how God is a very present help in the time of trouble and you find that as the verses continue in Psalm 46 in verse two and three, the catastrophic events that the Psalmist references in that Psalm but yet he says, my God is a very present help in the time of trouble. Paul dealt with hardships but Paul experienced God's help and what a blessing that is as we look at the passage of scripture, look at it in verse number eight, begin reading with me. The Bible says this, we are troubled on every side yet not distressed, we are perplexed but not in despair, persecuted but not forsaken, cast down but not destroyed. Always bearing about in the body, the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body. For we which live are always delivered unto death for Jesus' sake, that the life also of Jesus might be made manifest in our mortal flesh. So then death worketh in us but life in you, we having the same spirit of faith, according as it is written, I believed and therefore have I spoken, we also believe and therefore speak, knowing that he which raised up the Lord Jesus"
        },
        {
          "reference": "Psalms 46",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 357.739990234375,
          "context": "that confidence that God, he is our helper. I'm thankful for Psalm 46 and in fact, if you study the entirety of Psalm 46, it's amazing what the Psalmist says but he speaks about in verse number one how God is a very present help in the time of trouble and you find that as the verses continue in Psalm 46 in verse two and three, the catastrophic events that the Psalmist references in that Psalm but yet he says, my God is a very present help in the time of trouble. Paul dealt with hardships but Paul experienced God's help and what a blessing that is as we look at the passage of scripture, look at it in verse number eight, begin reading with me. The Bible says this, we are troubled on every side yet not distressed, we are perplexed but not in despair, persecuted but not forsaken, cast down but not destroyed. Always bearing about in the body, the dying of the Lord Jesus, that the life also of Jesus might be made manifest in our body. For we which live are always delivered unto death for Jesus' sake, that the life also of Jesus might be made manifest in our mortal flesh. So then death worketh in us but life in you, we having the same spirit of faith, according as it is written, I believed and therefore have I spoken, we also believe and therefore speak, knowing that he which raised up the Lord Jesus"
        },
        {
          "reference": "Psalms 116",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 1655.3399658203125,
          "context": "What affects you? How does it impact you? But we need to remember that we're dead with Christ. We're dead with Christ. Notice verse 11. For we which live are always delivered unto death for Jesus' sake. The life also of Jesus might be made manifest in our mortal flesh. So then death worketh in us, but life in you. We, having the same spirit of faith, according as it is written, I believed and therefore have I spoken. We also believe and therefore speak. He quotes back to the psalmist in Psalm 116. And I'm so thankful that we've been given truth, and then we speak the truth. We have been, listen, in 1 John, you read 1 John, chapter number one, John starts out talking about we're his witnesses. We're eyewitnesses of this. And we speak what we have received and what a blessing it is to know that God would use us. And we come to verse number 15. I'll get to verse 14 here in just a moment. But I want you to see verse number 15. For all things are for your sakes that the abundant grace might through the thanksgiving of many redound to the glory of God. Now I want you to think about verse 15. He speaks about all things are for your sakes. Paul was a man that was surrendered. He was yielded. He understood for me to live as Christ and to die as gain."
        },
        {
          "reference": "Psalms 119",
          "sermon_id": "G38C0Tuh6UA",
          "timestamp": 2740.2599487304688,
          "context": "set before him, he endured the cross. This word affliction in verse number 17 of our text of Scripture, the word troubled in verse number eight is the root word for that word affliction. We're troubled on every side, we're dealing with these afflictions. This morning again in Sunday school, Mark went over to Psalm 119, the psalmist says, it was good for me to be afflicted. Now, most of us would never say that. Why, we don't like being afflicted. Are we honest this morning? You don't like affliction? But the psalmist says it was good for me to be afflicted, why, because then I learned thy statutes. There's some things that we learn about God. There's some things that we learn about God's grace and about God's power, about God's purpose through the times of affliction, through the times of difficulty. And Paul says, it's just light affliction, it's just for a moment. Then notice what he says, because he understands that God is working to accomplish something great. He's working to accomplish something that would bring glory to his name. Notice in verse number 17, he says, for our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory. Paul, beaten, stoned, shipwrecked. Oh, God's working. He's working something good. He's working something great. He's working something for his glory. He's helping me to be conformed to his image. It's wonderful, but it's all based on perspective."
        }
      ]
    },
    {
      "sermon_id": "jNCO80tyoMQ",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 121",
          "sermon_id": "jNCO80tyoMQ",
          "timestamp": 2859.6199951171875,
          "context": "and he wants to deceive me, and one thing that he uses is fear, fear. When we look at these promises of God that we've looked at in the New Testament, and we are mindful that over and over that God says to his people, fear not, be not afraid. Over and over and over we read those words in this precious book. I'm mindful of the truth of Hebrews 13, in verses 5 and 6, the Bible says in Hebrews 13 verse 5, let your conversation be without covetousness, and be content with such things as you have, completely different message in that portion of verse number 5, but notice what he says at the end of verse number 5, for he hath said, I will never leave thee nor forsake thee, isn't that precious? But you know what the result of that understanding is, is verse number 6, so that we may boldly say the Lord is my helper, and I will not fear what man shall do unto me. Why is it that you do not have any fear? Because the Lord is my helper, the Lord is my helper, and he said I'll never leave thee nor forsake thee. Remember Psalm 121, I will lift up mine eyes unto the hills, from whence cometh my help? My help cometh from the Lord, notice this, which made heaven and earth. Now how did he make it? He spoke and it was so, amen?"
        },
        {
          "reference": "Psalms 121",
          "sermon_id": "jNCO80tyoMQ",
          "timestamp": 2949.1799926757812,
          "context": "I'll never leave thee nor forsake thee. Remember Psalm 121, I will lift up mine eyes unto the hills, from whence cometh my help? My help cometh from the Lord, notice this, which made heaven and earth. Now how did he make it? He spoke and it was so, amen? The wonder of creation, God said and it was so. The power of creation, and he's my helper, he's your helper, he's Nehemiah's helper. How could Nehemiah continue with all that was going on? I mean day after day after day, the work being opposed and all of the adversity, he's a man of prayer. He learned how to recognize the enemy. He learned how to resist the enemy, and I believe that as we look at the completion of the wall, we rejoice in the work of God. This morning I pray that God would help us to recognize the enemy and to resist the enemy and to keep on keeping on. One day it's all going to be over, whether it's by death or by rapture, it's going to be over. But until then, oh that God would help us. to just press on and say, look, I'm not looking for some cave to run to and hide in. I'm not. People want to move to Idaho and wherever else they want to move to, we're 16 miles from the White House. Oh, man, we're in the thick of it, amen? Come on."
        }
      ]
    },
    {
      "sermon_id": "Qk9420819_w",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 109",
          "sermon_id": "Qk9420819_w",
          "timestamp": 1872.6399383544922,
          "context": "I worked in the corporate world, people would say, well, it's good enough for government work. You ever hear that? And you hear that phraseology, see the guy in the Air Force, he's like, oh yeah, I know all about that. But the reality is that we've heard that phraseology. Listen, the work that we're doing is for God Almighty. We never, but never should mail it in, so to speak, because we're doing a work for God. And we recognize that this is a great work. I won't take you there, but in Psalm 109 and verse 27, the Bible speaks about how people would see that it was God that did the work. We find that that's exactly what the enemy recognized in Nehemiah 6 and verse number 16. Now, I want you to think about this. The Bible tells us as to the day in which the work was completed. In verse number 15 of Nehemiah 6, it tells us that the wall was finished on the 25th day of the month, Elul. Now, that's the sixth month in the Jewish calendar. And I want you to go forward, if you will, to chapter number eight, and we're gonna just kind of pick it up right here in the beginning of chapter number eight. And I want you to see what the Bible says. And all the people gathered themselves together as one man in verse number one into the street that was before the water gate."
        }
      ]
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 12",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 251.6199951171875,
          "context": "given us many, many promises. And these promises are indeed exceeding great and precious. This evening I have a list of 15 promises that I want to give you. And the list is not exhaustive. You can go and you can find many, many promises within the Word of God. I'm going to start with two promises with regard to the Word of God. And then if you follow, hopefully, the logic, it makes as much sense to you as it does to me, I'm going to kind of begin at salvation where we begin in promises that pertain to our walk with God and eventually through eternity. Consider this promise, the promise that God has given us to preserve his Word. Turn to the book of Psalms, if you will, in Psalm chapter number 12. And I want you to notice a few verses of scripture here with regard to the promise of preservation. And the first two that I mentioned that we'll look at are dealing with the Word of God. The reason is because it's this book that contains the promises. And therefore, I thought it best that we would look at some promises that God has given us with regard to his Word, so that we could use that as really foundation for these other promises that we'll look to. In Psalm 12, in verse number six, the Bible says, \"'The words of the Lord are pure words."
        },
        {
          "reference": "Psalms 12",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 310.6199951171875,
          "context": "would look at some promises that God has given us with regard to his Word, so that we could use that as really foundation for these other promises that we'll look to. In Psalm 12, in verse number six, the Bible says, \"'The words of the Lord are pure words. As silver tried in a furnace of earth, purified seven times. Thou shalt keep them, O Lord. Thou shalt preserve them from this generation forever.'\" And as you recall, this morning, as we looked at the person of Jesus Christ, being thankful for his person, who he is, the very first thing that we mentioned is he is Alpha and Omega, he's eternal. And here we find that he's promised that he would preserve his words, these words that are pure words, he's gonna preserve them from this generation forever. And to be mindful of the fact this evening that the eternal God has given us a promise to preserve the precious Word of God ought to cause us to rejoice because I can have full confidence in faith in what the Word of God says. Why? Because God said he was going to preserve it. And since God said he was gonna preserve it because God is trustworthy and dependable and always does what he says he will do, we can rest assured that God has indeed preserved his Word. Notice, if you will, in Psalm 119 in verse number 89, the Bible tells us, of course,"
        },
        {
          "reference": "Psalms 119",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 310.6199951171875,
          "context": "would look at some promises that God has given us with regard to his Word, so that we could use that as really foundation for these other promises that we'll look to. In Psalm 12, in verse number six, the Bible says, \"'The words of the Lord are pure words. As silver tried in a furnace of earth, purified seven times. Thou shalt keep them, O Lord. Thou shalt preserve them from this generation forever.'\" And as you recall, this morning, as we looked at the person of Jesus Christ, being thankful for his person, who he is, the very first thing that we mentioned is he is Alpha and Omega, he's eternal. And here we find that he's promised that he would preserve his words, these words that are pure words, he's gonna preserve them from this generation forever. And to be mindful of the fact this evening that the eternal God has given us a promise to preserve the precious Word of God ought to cause us to rejoice because I can have full confidence in faith in what the Word of God says. Why? Because God said he was going to preserve it. And since God said he was gonna preserve it because God is trustworthy and dependable and always does what he says he will do, we can rest assured that God has indeed preserved his Word. Notice, if you will, in Psalm 119 in verse number 89, the Bible tells us, of course,"
        },
        {
          "reference": "Psalms 119",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 384.4599914550781,
          "context": "God said he was gonna preserve it because God is trustworthy and dependable and always does what he says he will do, we can rest assured that God has indeed preserved his Word. Notice, if you will, in Psalm 119 in verse number 89, the Bible tells us, of course, you're familiar with this chapter in Psalm 119 dealing with the Word of God and all the wonderful characteristics and the ways in which the psalmist is relating to the Word of God and its place in his life. And here in Psalm 119 in verse 89, the Bible says, forever, O Lord, thy Word is settled in heaven. Forever. His Word is settled in heaven. Jesus said this in Matthew 24 in verse number 35 as he's speaking here and giving instruction, he gives note with regard to the Word of God and he says, heaven and earth shall pass away, but my words shall not pass away. There are people that are trying to revise the Bible. They're trying to remove the Bible, right? We live in a society in which they're trying to revise it, they're trying to remove it, but we find that God has promised that he's going to preserve it. And it doesn't matter, as we mentioned this morning, our God is victorious. It doesn't matter of the scheme and plan of the evil one and the wicked one to try to rid our society of this book."
        },
        {
          "reference": "Psalms 119",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 384.4599914550781,
          "context": "God said he was gonna preserve it because God is trustworthy and dependable and always does what he says he will do, we can rest assured that God has indeed preserved his Word. Notice, if you will, in Psalm 119 in verse number 89, the Bible tells us, of course, you're familiar with this chapter in Psalm 119 dealing with the Word of God and all the wonderful characteristics and the ways in which the psalmist is relating to the Word of God and its place in his life. And here in Psalm 119 in verse 89, the Bible says, forever, O Lord, thy Word is settled in heaven. Forever. His Word is settled in heaven. Jesus said this in Matthew 24 in verse number 35 as he's speaking here and giving instruction, he gives note with regard to the Word of God and he says, heaven and earth shall pass away, but my words shall not pass away. There are people that are trying to revise the Bible. They're trying to remove the Bible, right? We live in a society in which they're trying to revise it, they're trying to remove it, but we find that God has promised that he's going to preserve it. And it doesn't matter, as we mentioned this morning, our God is victorious. It doesn't matter of the scheme and plan of the evil one and the wicked one to try to rid our society of this book."
        },
        {
          "reference": "Psalms 119",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 384.4599914550781,
          "context": "God said he was gonna preserve it because God is trustworthy and dependable and always does what he says he will do, we can rest assured that God has indeed preserved his Word. Notice, if you will, in Psalm 119 in verse number 89, the Bible tells us, of course, you're familiar with this chapter in Psalm 119 dealing with the Word of God and all the wonderful characteristics and the ways in which the psalmist is relating to the Word of God and its place in his life. And here in Psalm 119 in verse 89, the Bible says, forever, O Lord, thy Word is settled in heaven. Forever. His Word is settled in heaven. Jesus said this in Matthew 24 in verse number 35 as he's speaking here and giving instruction, he gives note with regard to the Word of God and he says, heaven and earth shall pass away, but my words shall not pass away. There are people that are trying to revise the Bible. They're trying to remove the Bible, right? We live in a society in which they're trying to revise it, they're trying to remove it, but we find that God has promised that he's going to preserve it. And it doesn't matter, as we mentioned this morning, our God is victorious. It doesn't matter of the scheme and plan of the evil one and the wicked one to try to rid our society of this book."
        }
      ]
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 118",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 70.0,
          "context": "and this earth, and I believe the enemy wants us to quit and just turn back and not live for the Lord, but we understand this morning, even as we'll look at this message and then look at the message this evening, that all of us have personally experienced trials. And you might say this morning, Pastor, you have no idea, I'm in the midst of a trial right now, and I understand, a preacher of yesteryear said you're either in the midst of one, you've just come out of one, or there's one on the horizon, and for many we can say that's pretty true with regard to trials in our lives. We may not always respond properly in the midst of a trial. I'm sure that if you were to evaluate your life, if I were to evaluate my life, there are times in the midst of a trial that we do not respond appropriately, we do not respond biblically. We find, however, that God has given us in His Word the instruction that we are to rejoice always, not just to rejoice when things go well, when things are the way that we desire for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 and verse 24, this is the day the Lord hath"
        },
        {
          "reference": "Psalms 118",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 128.16000366210938,
          "context": "for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 and verse 24, this is the day the Lord hath made, we will rejoice and be glad in it. And it's a determination, it's being purposed in the fact that we're going to rejoice no matter what comes our way in that particular day, we're going to rejoice in the Lord. And we have to be intentional about it, we have to be purposed in it, and we find that God will bless. Not only have we been given instruction with regard to rejoicing through trials, but we find that as we study through the pages of this precious book that we can read the record that God has given us of many who have rejoiced in the midst of great trials. Their behavior in the midst of trials was appropriate and I would say was exemplary as we have the opportunity to be able to study those portions of Scripture. I know in my life that I will face more trials. The reality this morning is that I know in your life that you will face more trials. We will face trials collectively, corporately as a church, and we understand that we will face trials. The question really this morning is not, will I face a trial?"
        },
        {
          "reference": "Psalms 118",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 198.75999450683594,
          "context": "will face more trials. The reality this morning is that I know in your life that you will face more trials. We will face trials collectively, corporately as a church, and we understand that we will face trials. The question really this morning is not, will I face a trial? The question this morning is this, how will I behave in the midst of the trial? Maybe I'll turn it this way to go along with the title this morning, will I rejoice through trials? Will I rejoice through trials? And I told you to look at 1 Peter and I would get there in a moment, but I want to read three portions of Scripture very quickly this morning. The first one is from the book of Habakkuk, and I want to read Habakkuk chapter number three. And as we look in Habakkuk chapter number three and look at what the prophet of old says with regard to rejoicing, again we'll look at two other examples in the New Testament as we get into the message this morning, and understanding that we've been given that command that we are to rejoice in the Lord always. Again, as we mentioned, the psalmist made that great declaration in Psalm 118. We sing the song, but it says, this is the day which the Lord hath made. We will rejoice and be glad in it. And we find here that Habakkuk, if you found your place there in Habakkuk chapter number"
        },
        {
          "reference": "Psalms 118",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 261.4599914550781,
          "context": "mentioned, the psalmist made that great declaration in Psalm 118. We sing the song, but it says, this is the day which the Lord hath made. We will rejoice and be glad in it. And we find here that Habakkuk, if you found your place there in Habakkuk chapter number three, notice in verse 17, notice what the Bible says, although the fig tree shall not blossom. That's not a good situation. The fig tree is supposed to blossom, amen, produce fruit. Neither shall fruit be in the vines. That's unfortunate. The labor of the olive shall fail, and the fields shall yield no meat. The flock shall be cut off from the fold, and there shall be no herd in the stalls. If you read Habakkuk 3 in verse 17, that paints a very, very dim picture. Would you agree? The Bible says that the fig tree shall not blossom, the fruit shall not be on the vines, the labor of the olive shall fail, the field shall yield no meat, the flock shall be cut off from the fold, and there shall be no herd in the stalls. And yet the writer says, yet I will rejoice in the Lord. Habakkuk, did you see what you just wrote in verse 17? Yeah. That's why I said it's purposed, it's intentional. It's a, I'm going to rejoice in the Lord always. I'm going to determine, even in the midst, going through the trials of life, I'm going"
        }
      ]
    },
    {
      "sermon_id": "8h5bAwPFWSc",
      "sermon_title": "Sermon 8h5bAwPFWSc",
      "url": "https://www.youtube.com/watch?v=8h5bAwPFWSc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 48",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 0.0,
          "context": "18, Exodus chapter number 18, and really this morning, we'll be transitioning into phase two of our annual theme, our theme for this year. As you know, you see on the banners there, great is the Lord, and then it says this, and greatly to be praised, Psalm 48, verse number one. We've been singing as our theme song, Psalm 48, one and two all year. And the first part, the phase one, if you will, for our annual theme this year, has really been dealing with the idea of discovering God's greatness. Each of us would, I believe, agree this morning that our God is great. We wanna be able to have some substance as to why we would make that claim. Why is it that we would tell somebody else that our God is great? What sets him apart? And so as we've studied for all of these months, and we've looked at so many various subjects and passages of scripture, topics, as to why our God is great, and we've discovered God's greatness, phase two is going to be this, declare God's greatness. And you'll remember with me as we began studying this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this,"
        },
        {
          "reference": "Psalms 48",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 0.0,
          "context": "18, Exodus chapter number 18, and really this morning, we'll be transitioning into phase two of our annual theme, our theme for this year. As you know, you see on the banners there, great is the Lord, and then it says this, and greatly to be praised, Psalm 48, verse number one. We've been singing as our theme song, Psalm 48, one and two all year. And the first part, the phase one, if you will, for our annual theme this year, has really been dealing with the idea of discovering God's greatness. Each of us would, I believe, agree this morning that our God is great. We wanna be able to have some substance as to why we would make that claim. Why is it that we would tell somebody else that our God is great? What sets him apart? And so as we've studied for all of these months, and we've looked at so many various subjects and passages of scripture, topics, as to why our God is great, and we've discovered God's greatness, phase two is going to be this, declare God's greatness. And you'll remember with me as we began studying this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this,"
        },
        {
          "reference": "Psalms 135",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 0.0,
          "context": "18, Exodus chapter number 18, and really this morning, we'll be transitioning into phase two of our annual theme, our theme for this year. As you know, you see on the banners there, great is the Lord, and then it says this, and greatly to be praised, Psalm 48, verse number one. We've been singing as our theme song, Psalm 48, one and two all year. And the first part, the phase one, if you will, for our annual theme this year, has really been dealing with the idea of discovering God's greatness. Each of us would, I believe, agree this morning that our God is great. We wanna be able to have some substance as to why we would make that claim. Why is it that we would tell somebody else that our God is great? What sets him apart? And so as we've studied for all of these months, and we've looked at so many various subjects and passages of scripture, topics, as to why our God is great, and we've discovered God's greatness, phase two is going to be this, declare God's greatness. And you'll remember with me as we began studying this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this,"
        },
        {
          "reference": "Psalms 135",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 83.80000305175781,
          "context": "this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this, for I know that the Lord is great, that our Lord is above all gods. Each and every individual, every child of God needs to know and be fully persuaded in their own heart and mind that God is great. And we ought to be able to say with the psalmist, for I know that the Lord is great. God wants us to know his greatness. He has given us his precious word. He's revealed to us his character, his nature, and he helps us to understand how great he is. But then in Psalm 145, in verse number six, the psalmist makes that second statement that is so impactful with regard to our theme for this year. And at the end of that verse of scripture, the psalmist says this, and I will declare thy greatness. I will declare thy greatness. Near the end of the year, we'll get into phase three of our series for this particular annual theme. And phase one, discover God's greatness. Phase two, declare God's greatness. And then we're gonna deal with a number of messages, just a handful of messages on this thought of living"
        },
        {
          "reference": "Psalms 135",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 1568.6199645996094,
          "context": "no doubt as Moses is sharing these testimonies and giving the report to his father-in-law that Jethro is understanding the power and the might of Jehovah God. But I want you to notice that he says, now I know, now I know that the Lord is greater than all gods. He had heard in verse number one of chapter 18 of all that God had done for Moses. He had heard much of no doubt what Moses actually reported to him. But now after hearing it firsthand, after having this reunion with Moses, he stands and he rejoices and he then makes this verbal declaration of his own personal understanding of how great God is. As we're gonna think about this statement and I mentioned by way of introduction where the psalmist says in Psalm 135 in verse number five, for I know that the Lord is great. Listen, we need to have this kind of understanding in our lives just as Jethro is going to declare verbally what he knows to be true. Listen, we as the people of God, we need to be able to stand and say, I know that God is great. There's no one that's gonna convince me otherwise, no one is gonna persuade me otherwise for I am convinced, I am persuaded, I know in whom I have believed. And we get into the Bible and we allow the Bible to get into us and as we have the truth of God's word"
        },
        {
          "reference": "Psalms 145",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 83.80000305175781,
          "context": "this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this, for I know that the Lord is great, that our Lord is above all gods. Each and every individual, every child of God needs to know and be fully persuaded in their own heart and mind that God is great. And we ought to be able to say with the psalmist, for I know that the Lord is great. God wants us to know his greatness. He has given us his precious word. He's revealed to us his character, his nature, and he helps us to understand how great he is. But then in Psalm 145, in verse number six, the psalmist makes that second statement that is so impactful with regard to our theme for this year. And at the end of that verse of scripture, the psalmist says this, and I will declare thy greatness. I will declare thy greatness. Near the end of the year, we'll get into phase three of our series for this particular annual theme. And phase one, discover God's greatness. Phase two, declare God's greatness. And then we're gonna deal with a number of messages, just a handful of messages on this thought of living"
        }
      ]
    },
    {
      "sermon_id": "bPt92Z2dPIg",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 70",
          "sermon_id": "bPt92Z2dPIg",
          "timestamp": 2021.8800048828125,
          "context": "and in your life, there are some things that we hold grips on a little tighter than other things. Is it not true? Sometimes we struggle with the idea of surrender. Why? Because I want it. I want to do what I want to do. I want to have my control in my life. We find that they first gave their own selves to the Lord and unto us by the will of God. What's the result of living a surrendered life? Well, it's obedience and submission to the Lord, but what does it lead to? What does it look like? What happens? What is the result when we live a life that is surrendered to the Lord? Well, I believe, first of all, the Lord is magnified. The Lord is magnified. Listen, in our lives, in your life and in my life, we ought to desire nothing more, nothing less, but then for Jesus Christ alone to be magnified, to be exalted. You know how that's achieved? You know how that's accomplished? By living a life of surrender, by living a life of surrender. Because through living that life of surrender, which results in obedience and submission to the Lord, it leads to a place of God being magnified. Let God be magnified. You read that in Psalm 70. Let God be magnified. You read that John the Baptist, he said, he must increase, I must decrease."
        },
        {
          "reference": "Psalms 70",
          "sermon_id": "bPt92Z2dPIg",
          "timestamp": 2083.3999938964844,
          "context": "that life of surrender, which results in obedience and submission to the Lord, it leads to a place of God being magnified. Let God be magnified. You read that in Psalm 70. Let God be magnified. You read that John the Baptist, he said, he must increase, I must decrease. And the idea this morning that we desire that through our lives that the Lord Jesus Christ would be magnified. I said this by way of introduction that when we struggle with the idea, when our response of resisting the idea of surrender, that it leads to great struggle in the life of a believer and it hinders our effectiveness for the Lord. You want God to be magnified? I hope your answer would be yes. Live a life of surrender. Lord, take my life and let it be. Lord, you died for me. You loved me. You gave me life. I just want to live for you. We find that it will lead to the Lord being magnified. I believe this morning that it will lead to brethren being edified. We see it here in 2 Corinthians chapter number 8. How that through this gift that they would give, how that others would benefit and be encouraged and be edified. And we know that Paul is using this passage of scripture not only as a great encouragement to him. I believe that if you read verse number 5,"
        }
      ]
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 48",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 86.41999816894531,
          "context": "it would cause us to be mindful of our relationship To the Lord and the fact that God Almighty is our father and he is the Lord God Omnipotent that he reigns and rules but he is my father I have access because I have relationship to as many as as we've believed on the Lord Jesus Christ as many as received him to them gave he power to become the sons of God according To John 1 in verse number 12, and I'm so thankful that I can say father and Go to the Lord knowing that I have relationship. We understand that we would be mindful of the holiness and the Greatness of our God hallowed be thy name and you think about his greatness our father Which are in heaven the psalmist said we know I know that the Lord is great The psalmist said in Psalm 48 great is the Lord and greatly to be praised and you read through that portion of Scripture in Psalm 48 and you get to the very last verse of that passage and the Bible says this God is our God and After he goes through and describes the greatness of God and what a blessing to be mindful of how great our God is and the Reality that he is holy. We're mindful of his provision"
        },
        {
          "reference": "Psalms 48",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 86.41999816894531,
          "context": "it would cause us to be mindful of our relationship To the Lord and the fact that God Almighty is our father and he is the Lord God Omnipotent that he reigns and rules but he is my father I have access because I have relationship to as many as as we've believed on the Lord Jesus Christ as many as received him to them gave he power to become the sons of God according To John 1 in verse number 12, and I'm so thankful that I can say father and Go to the Lord knowing that I have relationship. We understand that we would be mindful of the holiness and the Greatness of our God hallowed be thy name and you think about his greatness our father Which are in heaven the psalmist said we know I know that the Lord is great The psalmist said in Psalm 48 great is the Lord and greatly to be praised and you read through that portion of Scripture in Psalm 48 and you get to the very last verse of that passage and the Bible says this God is our God and After he goes through and describes the greatness of God and what a blessing to be mindful of how great our God is and the Reality that he is holy. We're mindful of his provision"
        }
      ]
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 566.7000122070312,
          "context": "We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us and reveals to us what His will is for mankind. How is it that I can align my will with God's will? Because that's really what it boils down to, is how is it that we can align our will with God's will? Take your Bible quickly, if you will. Turn to the book of Psalm, Psalm 37. I believe in Psalm 37, God gives us some really nuggets of truth, some indicators, if you will, for how we, as God's people, can align our will. with His will, because Jesus, in responding to the request of the disciple, Lord, teach us to pray, gave this framework, this pattern for prayer, and within the framework, He says, Thy will be done. In Psalm chapter 37, the Bible says this in verse number 3. I'm going to look at verses 3 through 7. Notice what the Bible says. Trust in the Lord and do good. So shalt thou dwell in the land, and verily thou shalt be fed. Delight thyself also in the Lord, and He shall give thee the desires of thine heart. How many times have you heard verse 4 taken completely out of context?"
        },
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 566.7000122070312,
          "context": "We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us and reveals to us what His will is for mankind. How is it that I can align my will with God's will? Because that's really what it boils down to, is how is it that we can align our will with God's will? Take your Bible quickly, if you will. Turn to the book of Psalm, Psalm 37. I believe in Psalm 37, God gives us some really nuggets of truth, some indicators, if you will, for how we, as God's people, can align our will. with His will, because Jesus, in responding to the request of the disciple, Lord, teach us to pray, gave this framework, this pattern for prayer, and within the framework, He says, Thy will be done. In Psalm chapter 37, the Bible says this in verse number 3. I'm going to look at verses 3 through 7. Notice what the Bible says. Trust in the Lord and do good. So shalt thou dwell in the land, and verily thou shalt be fed. Delight thyself also in the Lord, and He shall give thee the desires of thine heart. How many times have you heard verse 4 taken completely out of context?"
        },
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 849.0999755859375,
          "context": "It's found in His word, how much time we must spend in God's word every day of our lives. Notice with me in verse number 5, commit thy way unto the Lord. And then we see again, trust also in Him. So we are told to trust in the Lord. We're told to delight thyself also in the Lord. We're told to commit thy way unto the Lord, trusting Him. Listen, because we know who He is, then we can commit our way unto Him. And then we find in verse number 7, notice these words, rest in the Lord. Rest in the Lord. You know, when we look at the truth that God gives us here in Psalm 37 in verses 3 through 7, these four nuggets of truth as we seek to answer the question, how can I align my will with God's will? We find that it's necessary that we're in His presence, that we're trusting Him, that we're delighting in Him, that we're committing our way unto Him, that we're resting in Him. This morning as we think about the subject of prayer and looking at these four words, thy will be done, two thoughts for you this morning. When we pray thy will be done, number one, we recognize that His will or His way is superior. When we pray, thy will be done. Now understand, that's not just a cliche that we add to the end of a prayer."
        },
        {
          "reference": "Psalms 37",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 1417.5199737548828,
          "context": "he going to do that? A variety of ways. But we find this morning that as we look at David and he gives this testimony, his way is perfect. Notice the word of the Lord is tried. He is a buckler to all them that trust in him, a shield. Do you remember Psalm 37 twice in those verses of Scripture, trust in the Lord. And we find here this morning that when we understand thy will be done, we are recognizing when we pray that way, when our prayer life is influenced and impacted by this phrase, we are recognizing that his way, his will is best. It's best. You say, well, it might not be what I've chosen. You don't know what God's going to do. You don't know how God is going to work. The book of Philippians in the first chapter, Paul says to the believers in Philippi, I want you to understand something. What I want you to understand is that the things that have happened to me have happened for the furtherance of the gospel. Praise God. In chapter number four, he speaks about those of Caesar's household that send their greetings. No doubt they heard the gospel because Paul was imprisoned. You say, well, I don't want to be in prison. You can read of many countless that have gone on before us that have suffered. They faced persecution and difficulty and we find that in so doing, God was glorified."
        },
        {
          "reference": "Psalms 1611",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 708.0999755859375,
          "context": "in verse number 5, trust also in Him. You know, it's important that we trust Him. The Bible says, trust in the Lord with all thine heart. Not part of it, not most of it, but with all of it. We find that we sing the song, trust and obey, and there's no other way to be happy in Jesus but to trust and obey. Trusting Jesus, simply trusting. I'm so glad I learned to trust Him, the songwriter said. And indeed, our God is trustworthy. And He says to His people that we're to trust in the Lord. Notice verse number 4, the instruction, the nugget of truth given to us, delight thyself also in the Lord. On the front of our bulletins for today, if you looked at it, is Psalm 1611. And thy presence is fullness of joy. And what a blessing to enter into the presence of God, to understand the joy that God gives as we enter into His presence. But we delight thyself also in the Lord. And as we delight ourselves in the Lord, notice it says, and He shall give thee the desires of thine heart. I believe this morning as we look at this truth, and we actually see it in Psalm 21 and verse number 2, thou hast given him his heart's desire, and hast not withholding the request of his lips. I believe that as we delight ourselves in the Lord, that our desires are really God's desires."
        },
        {
          "reference": "Psalms 21",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 708.0999755859375,
          "context": "in verse number 5, trust also in Him. You know, it's important that we trust Him. The Bible says, trust in the Lord with all thine heart. Not part of it, not most of it, but with all of it. We find that we sing the song, trust and obey, and there's no other way to be happy in Jesus but to trust and obey. Trusting Jesus, simply trusting. I'm so glad I learned to trust Him, the songwriter said. And indeed, our God is trustworthy. And He says to His people that we're to trust in the Lord. Notice verse number 4, the instruction, the nugget of truth given to us, delight thyself also in the Lord. On the front of our bulletins for today, if you looked at it, is Psalm 1611. And thy presence is fullness of joy. And what a blessing to enter into the presence of God, to understand the joy that God gives as we enter into His presence. But we delight thyself also in the Lord. And as we delight ourselves in the Lord, notice it says, and He shall give thee the desires of thine heart. I believe this morning as we look at this truth, and we actually see it in Psalm 21 and verse number 2, thou hast given him his heart's desire, and hast not withholding the request of his lips. I believe that as we delight ourselves in the Lord, that our desires are really God's desires."
        },
        {
          "reference": "Psalms 21",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 781.0999755859375,
          "context": "we look at this truth, and we actually see it in Psalm 21 and verse number 2, thou hast given him his heart's desire, and hast not withholding the request of his lips. I believe that as we delight ourselves in the Lord, that our desires are really God's desires. So what happens is God's desires become our desires. I wonder this morning, before you got saved, were there certain desires or ambitions that you had, somebody said to you when you were a teenager, if you were not saved at that point in your life, they said, hey, what do you want to do with your life? I mean, what are you going to do? And we have our desires, our ambitions, our ideas of what we're going to do. And then we understand that as we look at the truth of God's word, that we are His children. And if we delight ourselves in the Lord, His desires really become our desires. The more time you spend with the Lord, the more that you're in His presence, the more that you're trusting Him, the more that His will and His desire becomes your will and your desire. It's found in His word, how much time we must spend in God's word every day of our lives. Notice with me in verse number 5, commit thy way unto the Lord. And then we see again, trust also in Him. So we are told to trust in the Lord."
        },
        {
          "reference": "Psalms 18",
          "sermon_id": "YCUS9wAR_oA",
          "timestamp": 1717.8999633789062,
          "context": "of the earth that wants a difficulty, honestly. I like it when things go easy, Brother Armando. I really do. But sometimes in the midst of those hardships, God's proving Himself and God's developing His children and God's allowing for His glory to be known to those that are watching. If thy strength fail in the day of adversity, if thy faith fail in the day of adversity, thy strength is small. See this morning, we understand that His way is perfect. You can see in Psalm 18, it's the similar passage that we see in 2 Samuel 22, but not only is His way perfect, but He always does right. We cannot say of ourselves that we always do the right thing. In fact, there are many times that we mess things up. Many of our difficulties are the result of our own doing. We just mess things up. But the Bible tells us that God always does what's right. Notice in Genesis 18 and verse 25, in Genesis 18 and verse 25, the Bible tells us in this text of Scripture a great truth. Notice what the Bible says in Genesis 18 and verse 25, that be far from thee to do after this manner to slay the righteous with the wicked, and that the righteous should be as the wicked, that be far from thee. But then notice at the end of the verse, shall not the judge of all the earth do right?"
        }
      ]
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 91",
          "sermon_id": "2cDKZaPlI5s",
          "timestamp": 1632.9199829101562,
          "context": "want Pharaoh's strength? Do you understand? But this is what they're doing. It says at the end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not. You know the verses, right? And we find here this evening that they are going to seek to be strengthened by the strength of Pharaoh who is inferior to God Almighty and God had made it abundantly clear and demonstrated that truth. And then they're going to trust in the shadow of Egypt. That's a sad commentary, is it not? I mean, what a sad, sad indictment against the children of Israel here. And we find that we are to abide. You don't need to turn there, but I'm mindful this evening of the truth of Psalm 91. He that dwelleth in the secret place of the Most High shall abide under the shadow of the Almighty. Not the shadow of Pharaoh of Egypt, but of the shadow of the Almighty. I will say to the Lord, He is my refuge and my fortress. My God, in Him will I trust. Wow. If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help"
        },
        {
          "reference": "Psalms 121",
          "sermon_id": "2cDKZaPlI5s",
          "timestamp": 1715.9199829101562,
          "context": "Him will I trust. Wow. If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help and stay on horses and trust in chariots. Why are they trusting in chariots? Because there aren't any. And in horsemen, because why? They're very strong. But they look not unto the Holy One of Israel, neither seek the Lord. Verse 2, yet He also is wise and will bring evil and will not call back His words, but will rise against the house of the evildoers and against the help of them that work iniquity. Now the Egyptians, notice what God says here in verse number 3. Now the Egyptians are men and not God, and their horses flesh and not spirit. When the Lord shall stretch out His hand, both he that helpeth shall fall and he that is hopin' shall fall down and they shall fail together. He says, woe to them that go down to Egypt for help. They look not unto the Holy One of Israel, neither seek the Lord. The psalmist says in Psalm 121, we used it as a theme verse a couple of years ago. I will lift up mine eyes into the hills from whence cometh my help. My help cometh from the Lord, which made heaven and earth."
        },
        {
          "reference": "Psalms 121",
          "sermon_id": "2cDKZaPlI5s",
          "timestamp": 1796.9199829101562,
          "context": "One of Israel, neither seek the Lord. The psalmist says in Psalm 121, we used it as a theme verse a couple of years ago. I will lift up mine eyes into the hills from whence cometh my help. My help cometh from the Lord, which made heaven and earth. And so if we know the book of Hebrews in the 13th chapter says, the Lord is my helper. Aren't you thankful for that? What a blessing. And the little group that I was in this morning, I didn't offer a whole lot in the Sunday school time when we sat around the table. I asked some questions to try to promote some thinking, but I really didn't help them fill out some things. But one of the words that was on the list, the table that I was with in Sunday school this morning under the letter H was helper. He's my helper. And there are a bunch of little kids at our table. And I was excited to hear them put together and to have that idea. Joseph was there and Holly and I, and then some younger children there. And what a blessing. Listen, God is my helper. I don't need to run down to Egypt for help. And let me say this to you this evening, and I'm saying this to myself as well. And you understand, I said this when I prayed this morning. Listen, when I preach messages,"
        },
        {
          "reference": "Psalms 12",
          "sermon_id": "2cDKZaPlI5s",
          "timestamp": 2400.1199951171875,
          "context": "eternal destiny, you can trust him with tomorrow. Whatsoever he sayeth unto you, do it. To whom do we cry? To whom do we go in times of crisis? We all face them. We all have times of great difficulty. And I hope tonight that we run to the cross. that we run to the Lord Jesus Christ and we say, Lord, help me. You ever read Psalm 12? Help, Lord. That's how it begins. You know, sometimes that's all we can pray. Help, Lord. I just need help and I know that you're the helper and you said that you would give us help. Aren't you so thankful that we have a wonderful Savior and He offers to give us the counsel, the direction that we need. He's our shepherd and as our shepherd, He takes good care of His sheep. Let's pray this evening. Father, we love You. We thank You for loving us. We thank You for Your Word, the truth contained therein. I pray that even as we look at this historical event, this time in Egypt when Joseph is there and this famine begins and the land is famished, Lord, I pray that tonight as we can understand the historical context of this event that we also would be able to make application in our lives. Lord, I pray that You'd help us tonight to run to You in times of difficulty, of great need, of great distress, times of crisis."
        }
      ]
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 78",
          "sermon_id": "bsk8iNEnRVo",
          "timestamp": 1618.2999877929688,
          "context": "land for forty days. They saw that there were giants in the land. They saw that they had fortified cities. They observed those things and therefore they concluded we be not able. But can you just for a moment rehearse in your mind all of the things that they had seen God do? When they were in Egypt and when they were there and they were under great turmoil. And God sends Moses and there's a series of plagues. You think about those ten plagues and you think about the power of God that was displayed. They saw that. Then you go forward and you begin to think about the crossing of the Red Sea. What power was displayed by our God? You think about after they crossed the Red Sea and you think about the water that God provided. You think about the manna that God provided. You think about more water that God provided. And you just begin to think about all that they saw God do. Then they go in and they spot a land and they see some giants and they see some fortified cities and all of a sudden they don't believe that God is able. Doubt and unbelief. In Psalm 78 the Bible says that they limited the Holy One of Israel. You know how we limit the unlimited God? Doubt. Unbelief. You say He's the unlimited God. How could He be limited? By our unbelief. He did not many miracles there. Why?"
        },
        {
          "reference": "Psalms 78",
          "sermon_id": "bsk8iNEnRVo",
          "timestamp": 1692.4999694824219,
          "context": "is able. Doubt and unbelief. In Psalm 78 the Bible says that they limited the Holy One of Israel. You know how we limit the unlimited God? Doubt. Unbelief. You say He's the unlimited God. How could He be limited? By our unbelief. He did not many miracles there. Why? Because of their unbelief. It's time that we believe God and that other people can see in us that God is real. That God does answer prayer. That God does work and God is still on His throne. We see the perception. We see the proposal. I want you to notice as we finish up the chapter this evening here in Genesis 21. I want you to notice the priority of Abraham. The priority of Abraham. The Bible says in verse 33, And Abraham planted a grove in Beersheba. Now understand that this is pre-law. Understand that this was a valid process, a place where he would worship, no doubt, as the Bible says, and called there on the name of the Lord God, the everlasting God. In the law it would be forbidden to have groves, but we find this again predates. And Abraham planted a grove there. He planted it with the purpose. Obviously there's work involved. Abraham is an old man at this point. We understand that. But there's work that's involved. He plants this grove in Beersheba and he worships. The Bible says that he called there on the name of the Lord."
        }
      ]
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 121",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 930.1000366210938,
          "context": "us the knowledge that he has of God and of his word. I would submit to you this morning that it's imperative as us, as the people of God, to be people of the book, that we know the God of the Bible, that we know the word of God. Listen, when we understand that he's able to do exceeding abundantly above all that we ask or think, when we understand that he said, call unto me and I will answer thee and show thee great and mighty things which thou knowest not, when we understand the promises of the word of God, it will cause us to run to him for help. We've been singing our theme song since June from Psalm 121. I will lift up mine eyes unto the hills from whence cometh my help. My help cometh from the Lord, which made heaven and earth. When I understand that he said, let there be light and there was light, when I understand that he created everything out of nothing that he said and it was done, man, it causes me to understand that he's able to help me and he's able to help you. Notice in verse number five, the Bible says that Jehoshaphat stood in the congregation of Judah and Jerusalem in the house of the Lord before the new court and said, this is where the prayer begins, oh Lord God of our fathers, art not thou God in heaven"
        },
        {
          "reference": "Psalms 46",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 1263.5000228881836,
          "context": "And so we find that Jehoshaphat, with facing this dilemma, with dealing with this difficulty, his knowledge of who God is, but also his knowledge of what God has said, that God wants to be your helper. Listen, we understand the psalmist has declared this throughout the Psalms, and we've studied many of them as we've had the opportunity to speak about the truth that our God is our helper, and we think about this truth, you don't need to turn there, but in Psalm 46 and verse number 1, the psalmist declares God is our refuge and strength, a very present help in trouble. He's not only able to help, he's available to help. Have you ever known somebody that's able to help, but they just don't have any availability? You need help with a project, and you know so-and-so can help you, because they have the know-how, but they're just simply not available. They're busy, they have other appointments, they have other tasks that they're working on. That never happens with God. He's a very present help in the time of trouble. It's interesting what the psalmist continues to say in Psalm 46 and verses 2 and 3. He says, therefore, based upon our understanding that God is our refuge and our strength and a very present help in trouble, will not we fear, though the earth be removed and though the mountains be carried into the midst of the sea, though the waters thereof roar"
        },
        {
          "reference": "Psalms 46",
          "sermon_id": "oGfQDeDvcH0",
          "timestamp": 1263.5000228881836,
          "context": "And so we find that Jehoshaphat, with facing this dilemma, with dealing with this difficulty, his knowledge of who God is, but also his knowledge of what God has said, that God wants to be your helper. Listen, we understand the psalmist has declared this throughout the Psalms, and we've studied many of them as we've had the opportunity to speak about the truth that our God is our helper, and we think about this truth, you don't need to turn there, but in Psalm 46 and verse number 1, the psalmist declares God is our refuge and strength, a very present help in trouble. He's not only able to help, he's available to help. Have you ever known somebody that's able to help, but they just don't have any availability? You need help with a project, and you know so-and-so can help you, because they have the know-how, but they're just simply not available. They're busy, they have other appointments, they have other tasks that they're working on. That never happens with God. He's a very present help in the time of trouble. It's interesting what the psalmist continues to say in Psalm 46 and verses 2 and 3. He says, therefore, based upon our understanding that God is our refuge and our strength and a very present help in trouble, will not we fear, though the earth be removed and though the mountains be carried into the midst of the sea, though the waters thereof roar"
        }
      ]
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 90",
          "sermon_id": "8LNBaTbwuzM",
          "timestamp": 1093.97998046875,
          "context": "we're not going to allow the external influences to hinder my walk with God. I'm not willing to sacrifice my walk with God because of some external influence in my life. I'm not willing to get into a carnal match of wits and of fleshly ambitions as Rachel and Leah find themselves in and seeing my spirituality just disappear. No. I'm walking with my King. And you can't influence my walk with God. Oh, that we'd really be in that place. If we'd be honest this evening, there are times no doubt that external influences do in fact impact our walk with God. I'm not speaking this evening just of the positive influences. I'm speaking primarily of the negative influences. That we allow the behavior of others that we would respond in like manner, that we would go to the same level of carnality as others would deal with and that we would jeopardize our walk with God. It's tragic. It happens so often. Turn to Psalm 90, if you will. I want to look at just a reference here in Psalm 90. Psalm 90 is a prayer of Moses. We don't have time to look at the entirety of the Psalm this evening, but I want you to begin looking with me in verse number nine. He says, for all our days are passed away in thy wrath. We spend our years as a tale that is told. The days of our years are three score years and 10."
        },
        {
          "reference": "Psalms 90",
          "sermon_id": "8LNBaTbwuzM",
          "timestamp": 1093.97998046875,
          "context": "we're not going to allow the external influences to hinder my walk with God. I'm not willing to sacrifice my walk with God because of some external influence in my life. I'm not willing to get into a carnal match of wits and of fleshly ambitions as Rachel and Leah find themselves in and seeing my spirituality just disappear. No. I'm walking with my King. And you can't influence my walk with God. Oh, that we'd really be in that place. If we'd be honest this evening, there are times no doubt that external influences do in fact impact our walk with God. I'm not speaking this evening just of the positive influences. I'm speaking primarily of the negative influences. That we allow the behavior of others that we would respond in like manner, that we would go to the same level of carnality as others would deal with and that we would jeopardize our walk with God. It's tragic. It happens so often. Turn to Psalm 90, if you will. I want to look at just a reference here in Psalm 90. Psalm 90 is a prayer of Moses. We don't have time to look at the entirety of the Psalm this evening, but I want you to begin looking with me in verse number nine. He says, for all our days are passed away in thy wrath. We spend our years as a tale that is told. The days of our years are three score years and 10."
        },
        {
          "reference": "Psalms 90",
          "sermon_id": "8LNBaTbwuzM",
          "timestamp": 1093.97998046875,
          "context": "we're not going to allow the external influences to hinder my walk with God. I'm not willing to sacrifice my walk with God because of some external influence in my life. I'm not willing to get into a carnal match of wits and of fleshly ambitions as Rachel and Leah find themselves in and seeing my spirituality just disappear. No. I'm walking with my King. And you can't influence my walk with God. Oh, that we'd really be in that place. If we'd be honest this evening, there are times no doubt that external influences do in fact impact our walk with God. I'm not speaking this evening just of the positive influences. I'm speaking primarily of the negative influences. That we allow the behavior of others that we would respond in like manner, that we would go to the same level of carnality as others would deal with and that we would jeopardize our walk with God. It's tragic. It happens so often. Turn to Psalm 90, if you will. I want to look at just a reference here in Psalm 90. Psalm 90 is a prayer of Moses. We don't have time to look at the entirety of the Psalm this evening, but I want you to begin looking with me in verse number nine. He says, for all our days are passed away in thy wrath. We spend our years as a tale that is told. The days of our years are three score years and 10."
        }
      ]
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 23",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 1580.8800048828125,
          "context": "like what God had provided for them. They're eating manna and they're saying, my soul loatheth, I hate this manna. We have nothing to eat. God miraculously was providing this. They were complaining and complaining and complaining. Complaining is the result of discontent. We find that we must learn contentment. Paul continues and says, I know both how to be abased and I know how to abound. Everywhere and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. God knows what we need, doesn't He? And He's capable of providing for us. You remember that familiar Psalm, Psalm 23, the Lord is my shepherd. What does He say? I shall not want. I shall not want. The Lord is a good shepherd, amen? He provides for us. And what a blessing. We must learn contentment. I would say this, we must seek the Lord Jesus Christ. Notice in Colossians 3, we studied this portion of Scripture last year as we studied through the book of Colossians, but these first few verses of Colossians 3 are so powerful. When the Bible says this, if you then be risen with Christ, seek those things which are above. Where Christ sitteth on the right hand of God, set your affection on things above, not on things of the earth. And as I do this, as I understand that I'm in the world but I'm not of the world, when"
        },
        {
          "reference": "Psalms 2",
          "sermon_id": "1_NCe9SHoA0",
          "timestamp": 1995.4400024414062,
          "context": "avoid these pitfalls because God's warned me about them? And the reality is that there's record of people in the Word of God that forsook because they love this world. I don't want to be there. So how do I avoid it? Number three this morning, finally, I'd say this. As you continue through the passage, you come to verse number 17, I would say that there's a promise to embrace. It's really a twofold promise that is given to us here, and I hope that this twofold promise that is given to us would cause us to be encouraged. Notice what the Bible says. It begins by telling us this, and the world passeth away and the lust thereof. This world is going to pass away. The world system, listen, there are times in which we look at and we understand when the Bible tells us, why do the heathen rage, right? And you look at Psalm 2 and you understand how the kings of the earth, they set themselves against the Lord. And you look at all that's taking place and you understand this world system in which we're living and we're operating, and you find that in this world system there are some that would try to get us to think that this world system has some level of permanence. But no, the world system, we have the promise of God Almighty that this world passeth away and the lust thereof."
        }
      ]
    },
    {
      "sermon_id": "CuDgnvg3ek8",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 139",
          "sermon_id": "CuDgnvg3ek8",
          "timestamp": 1922.9599838256836,
          "context": "and Armando would rather inspect me. That's the reality of life. Why? Because it's a hard thing to inspect yourself, to examine yourself. You know why? We think we're better than we are. We think we really don't have any problems. We think we've got it all together. But then God starts working. That bitterness, lack of forgiveness, that contention, unresolved. I mean you just go down a list. I'm not going to go down through a list tonight. I'm just going to mention a few things. But the reality is that God is working. Listen this was something that happened 20 years earlier. I think that the brothers probably tried to suppress it as much as they possibly could. Isn't that what we try to do? Try to suppress those things. Try to suppress them. But you know what God does? He brings it right to the forefront. We can deal with this. I can handle this. I'm thankful that God was working locally and globally but God was working personally. Our God is a personal God. And He works in the lives of His people. And as we allow Him to have His way, as we say as the psalmist does in Psalm 139, God search me oh God. Search me oh God. And show me if there be any wicked way in my life. Right? That's what the Bible teaches us. That process of self-examination."
        },
        {
          "reference": "Psalms 139",
          "sermon_id": "CuDgnvg3ek8",
          "timestamp": 1990.959976196289,
          "context": "as we allow Him to have His way, as we say as the psalmist does in Psalm 139, God search me oh God. Search me oh God. And show me if there be any wicked way in my life. Right? That's what the Bible teaches us. That process of self-examination. And so we find that God is working in the lives of these brothers. They say what is this that God hath done unto us? Surely we are guilty concerning our brother. And they understand what is taking place and how God is working. God is at work in the life of Joseph. God is at work in the lives of the ten brothers. I believe that God is at work in Jacob's life. Look at verse 29. And they, nine of them, He sent ten out. And they, nine of them, came unto Jacob their father unto the land of Canaan. And notice what the next phrase says. And told him all that befell unto them. They didn't just come back with some food. They came back with a story. With an account of what took place. Here's what happened. Dad you sent us there. We came back with food but a whole lot more. Now they don't reveal everything to Jacob. They don't reveal to Jacob at this particular juncture. We don't, we see that not a place here where they reveal what they have done and really the conviction"
        }
      ]
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 48",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 0.0,
          "context": "to have a Bible, and what a blessing. Numbers 14, we're gonna be jumping right in the middle of a text of scripture, verses 11 through 20 will be our text this morning. In Numbers 14, verses 11 through 20, I wanna read to you by way of introduction, verse 18 and 19, and then we'll get into the message this morning. But notice in Numbers 14, verse number 18, the Bible says this, this is Moses now talking back to the Lord, the Lord is long-suffering, is recalling what God has said, and of great mercy, forgiving iniquity and transgression, and by no means clearing the guilty, visiting the iniquity of the fathers upon the children unto the third and fourth generation. Notice this in verse 19, pardon, I beseech thee, the iniquity of this people, according unto the greatness of thy mercy, and as thou hast forgiven this people from Egypt even until now. You'll notice there right in the midst of verse number 19, according unto the greatness of thy mercy, and I've used that as the title for the message this morning. We've spent the calendar year of 2023 talking about the truth that our God is great, and I'm so thankful that his greatness is revealed to us in the pages of this precious book, and what a blessing it is to know great is the Lord and greatly to be praised, as we sang from Psalm 48, verses one and two this morning,"
        },
        {
          "reference": "Psalms 48",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 84.0999984741211,
          "context": "God is great, and I'm so thankful that his greatness is revealed to us in the pages of this precious book, and what a blessing it is to know great is the Lord and greatly to be praised, as we sang from Psalm 48, verses one and two this morning, and every service of this year, we've had the opportunity to sing that wonderful song and be reminded, as you come in, you see the banners on the wall, and understanding that great is the Lord, and what is it about God that makes him great? Well, there's several things, many things, and we've been studying those things, and we've kind of, as we've kind of taken the first part of 2023, to kind of categorize it this way, let's discover God's greatness. What is it that would cause you, that would cause me to say God is great? And then, as we enter into the latter part of the year, we'll deal with the subject of declaring his greatness. Of course, that was the theme for our missions conference just a couple of weeks ago, and we'll spend several messages at the end of this year. Now that we have discovered the greatness of God, we ought to be declaring the greatness of God. This morning in this text of scripture, we find that Moses makes reference to the greatness of God's mercy, and it's a blessing to consider that our God is merciful."
        },
        {
          "reference": "Psalms 77",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 984.5800170898438,
          "context": "sin, and that will by no means clear the guilty, visiting the iniquity of the fathers upon the children and upon the children's children and to the third and to the fourth generation. Isn't it amazing, as you read the account in Numbers chapter 14, our text for this morning, that when we deal with this truth, as we look through this passage of scripture, we notice first what Moses recalled, Moses recalled exactly what God had previously revealed to him. And I think about Moses making this recollection as mine, and I think about what the prophet says, the prophet Jeremiah, you don't need to turn there, but in the book of Lamentations, the third chapter, a very familiar passage of scripture for us, but we find that the third chapter of the book of Lamentations in verse number 21, here's what the writer says, this I recall to my mind, therefore have I hope. It is of the Lord's mercies that we are not consumed, because His compassions fail not. Where new every morning, great is thy faithfulness. Jeremiah, after the Babylonian captivity, as he's lamenting all that's taken place, he says, this I recall, therefore have I hope. What? It is of the Lord's mercies. The Lord's mercies. Notice what the psalmist says, notice in Psalm 77, if you would turn there, Psalm 77, and notice what the Bible says in these few verses of scripture."
        },
        {
          "reference": "Psalms 77",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 984.5800170898438,
          "context": "sin, and that will by no means clear the guilty, visiting the iniquity of the fathers upon the children and upon the children's children and to the third and to the fourth generation. Isn't it amazing, as you read the account in Numbers chapter 14, our text for this morning, that when we deal with this truth, as we look through this passage of scripture, we notice first what Moses recalled, Moses recalled exactly what God had previously revealed to him. And I think about Moses making this recollection as mine, and I think about what the prophet says, the prophet Jeremiah, you don't need to turn there, but in the book of Lamentations, the third chapter, a very familiar passage of scripture for us, but we find that the third chapter of the book of Lamentations in verse number 21, here's what the writer says, this I recall to my mind, therefore have I hope. It is of the Lord's mercies that we are not consumed, because His compassions fail not. Where new every morning, great is thy faithfulness. Jeremiah, after the Babylonian captivity, as he's lamenting all that's taken place, he says, this I recall, therefore have I hope. What? It is of the Lord's mercies. The Lord's mercies. Notice what the psalmist says, notice in Psalm 77, if you would turn there, Psalm 77, and notice what the Bible says in these few verses of scripture."
        },
        {
          "reference": "Psalms 77",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 1065.780029296875,
          "context": "that's taken place, he says, this I recall, therefore have I hope. What? It is of the Lord's mercies. The Lord's mercies. Notice what the psalmist says, notice in Psalm 77, if you would turn there, Psalm 77, and notice what the Bible says in these few verses of scripture. We won't read the entirety of the Psalm, but we find that in the first verse of Psalm 77, that the psalmist reveals that he's trying out to the Lord. He's in a day of trouble, according to verse number two, and he says, I've sought the Lord, but we'll pick it up in verse number six, the Bible says this, I call to remembrance my song in the night. I commune with mine own heart, my spirit made diligent search. Notice what he asks, these questions, will the Lord cast off forever? And will He be favorable no more? Is His mercy clean gone forever? Doth His promise fail forevermore? Hath God forgotten to be gracious? Hath He in anger shut up His tender mercies? Selah. Listen, there are times you might feel this way. You know what's different about us and the psalmist, and we understand some of the inspirational Holy Spirit of God, but for far too many of us, we fail in this area of transparency. And even being transparent with the Lord, there are times in which we deal with difficulties in our lives."
        },
        {
          "reference": "Psalms 77",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 1065.780029296875,
          "context": "that's taken place, he says, this I recall, therefore have I hope. What? It is of the Lord's mercies. The Lord's mercies. Notice what the psalmist says, notice in Psalm 77, if you would turn there, Psalm 77, and notice what the Bible says in these few verses of scripture. We won't read the entirety of the Psalm, but we find that in the first verse of Psalm 77, that the psalmist reveals that he's trying out to the Lord. He's in a day of trouble, according to verse number two, and he says, I've sought the Lord, but we'll pick it up in verse number six, the Bible says this, I call to remembrance my song in the night. I commune with mine own heart, my spirit made diligent search. Notice what he asks, these questions, will the Lord cast off forever? And will He be favorable no more? Is His mercy clean gone forever? Doth His promise fail forevermore? Hath God forgotten to be gracious? Hath He in anger shut up His tender mercies? Selah. Listen, there are times you might feel this way. You know what's different about us and the psalmist, and we understand some of the inspirational Holy Spirit of God, but for far too many of us, we fail in this area of transparency. And even being transparent with the Lord, there are times in which we deal with difficulties in our lives."
        },
        {
          "reference": "Psalms 77",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 1065.780029296875,
          "context": "that's taken place, he says, this I recall, therefore have I hope. What? It is of the Lord's mercies. The Lord's mercies. Notice what the psalmist says, notice in Psalm 77, if you would turn there, Psalm 77, and notice what the Bible says in these few verses of scripture. We won't read the entirety of the Psalm, but we find that in the first verse of Psalm 77, that the psalmist reveals that he's trying out to the Lord. He's in a day of trouble, according to verse number two, and he says, I've sought the Lord, but we'll pick it up in verse number six, the Bible says this, I call to remembrance my song in the night. I commune with mine own heart, my spirit made diligent search. Notice what he asks, these questions, will the Lord cast off forever? And will He be favorable no more? Is His mercy clean gone forever? Doth His promise fail forevermore? Hath God forgotten to be gracious? Hath He in anger shut up His tender mercies? Selah. Listen, there are times you might feel this way. You know what's different about us and the psalmist, and we understand some of the inspirational Holy Spirit of God, but for far too many of us, we fail in this area of transparency. And even being transparent with the Lord, there are times in which we deal with difficulties in our lives."
        },
        {
          "reference": "Psalms 77",
          "sermon_id": "N3xsGpOdIxU",
          "timestamp": 1198.0400390625,
          "context": "John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that cycle that I talked about last Sunday morning with regard to reminding ourselves that God loves us, and then resting in His love, and then rejoicing for His love. I'm so thankful that as we go through that process. that I said that we need to remind ourselves of God's love for us. Why? Because there are times in which the accuser, the brethren, would like to whisper to you and whisper to me that God has forgotten us and God's not loving us and God's mercies are dried up, as the psalmist says here in Psalm 77. But no, we remind ourselves that no, God does love me. No, God is merciful. And we find that here in this passage of scripture in Numbers 14 that Moses has recalled what God has previously revealed. It's so important for us to be students of God's word. You cannot recall what you do not know. You just can't. We understand we speak about God's word and we talk about revelation, all scripture is given by inspiration of God, and we understand that God was speaking through His men. Holy men of God spake as they were moved by the Holy Ghost. But you understand that the canon of scripture is closed. God's given us this book and He's told us to be students of this book."
        }
      ]
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 2",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 1169.780029296875,
          "context": "stronger or better than your dad. They have those kind of conversations. You know what the Bible tells us? Our rock is not like their rock. Who's it referring to? Our God. And I'm so thankful this morning that our God is greater and we find that they respond properly. And for us this morning, how we respond to great adversity really reveals what we know and believe about God. When we face great opposition, we face great difficulty in opposition, how we respond reveals in great measure what we know and believe to be true of God. We find how they respond, but then I want you to note in our text. of Scripture, what they requested. I want you to notice, they pray, and in verses 25 through 27, they speak about the truth that had been revealed in the Old Testament, reference to Psalm 2, with regard to the heathen raging and the kings of the earth standing against the Lord, and so on and so forth. And you find in verse 27 and 28, speaking about the Lord Jesus Christ and how He would He was, of course, determined to go to the cross of Calvary. And then we come to verse 29, and that's where we really see what it is that they requested. In verse 29 and verse number 30, and when I begin to note their request, when I notice"
        },
        {
          "reference": "Psalms 121",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2205.340057373047,
          "context": "were counted worthy to suffer shame for His namesake. Last week, the enemy was eliminated. 185,000 killed, Sennacherib goes back, his own sons kill him. We read it. This week, however, the opposition remains. But God's people are empowered. God's people are empowered to fulfill the task. We've often referenced Psalm 121, verses 1 and 2, where the psalmist says, I will lift up my eyes into the hills. From whence cometh my help? My help cometh from the Lord, which made heaven and earth. Last week with Hezekiah, he faced great adversity, but he understood that the Creator God was his helper. This week, we look at the disciples. They face opposition, adversity, threats, commands, but they understood that the Creator God is their helper. And I want you to notice what the psalmist says in Psalm 146. Look over and we'll finish here with this passage of Scripture in Psalm 146. Oh, indeed, creation reveals to us the greatness of God, His great power, His great wisdom. We see it throughout the pages of Scripture. You can walk out this afternoon and you can see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm"
        },
        {
          "reference": "Psalms 146",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2205.340057373047,
          "context": "were counted worthy to suffer shame for His namesake. Last week, the enemy was eliminated. 185,000 killed, Sennacherib goes back, his own sons kill him. We read it. This week, however, the opposition remains. But God's people are empowered. God's people are empowered to fulfill the task. We've often referenced Psalm 121, verses 1 and 2, where the psalmist says, I will lift up my eyes into the hills. From whence cometh my help? My help cometh from the Lord, which made heaven and earth. Last week with Hezekiah, he faced great adversity, but he understood that the Creator God was his helper. This week, we look at the disciples. They face opposition, adversity, threats, commands, but they understood that the Creator God is their helper. And I want you to notice what the psalmist says in Psalm 146. Look over and we'll finish here with this passage of Scripture in Psalm 146. Oh, indeed, creation reveals to us the greatness of God, His great power, His great wisdom. We see it throughout the pages of Scripture. You can walk out this afternoon and you can see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm"
        },
        {
          "reference": "Psalms 146",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2205.340057373047,
          "context": "were counted worthy to suffer shame for His namesake. Last week, the enemy was eliminated. 185,000 killed, Sennacherib goes back, his own sons kill him. We read it. This week, however, the opposition remains. But God's people are empowered. God's people are empowered to fulfill the task. We've often referenced Psalm 121, verses 1 and 2, where the psalmist says, I will lift up my eyes into the hills. From whence cometh my help? My help cometh from the Lord, which made heaven and earth. Last week with Hezekiah, he faced great adversity, but he understood that the Creator God was his helper. This week, we look at the disciples. They face opposition, adversity, threats, commands, but they understood that the Creator God is their helper. And I want you to notice what the psalmist says in Psalm 146. Look over and we'll finish here with this passage of Scripture in Psalm 146. Oh, indeed, creation reveals to us the greatness of God, His great power, His great wisdom. We see it throughout the pages of Scripture. You can walk out this afternoon and you can see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm"
        },
        {
          "reference": "Psalms 146",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2299.6600341796875,
          "context": "see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm 146, verse number 1 says, \"'Praise ye the Lord! Praise the Lord, O my soul! While I live will I praise the Lord. I will sing praises unto my God while I have any being. Put not your trust in princes, nor in the Son of Man, in whom there is no help.'\" How often are we guilty of verse number 3? Putting our trust in someone or something else. Sometimes putting our trust in ourselves. I got this. I can handle this. I need to do something. No, no. He says, \"'Put not your trust in princes, nor in the Son of Man, in whom there is little help.'\" No, no. He says, no help. \"'His breath goeth forth, he returneth to his earth, and that very day his thoughts perish.'\" But then notice verse 5 and 6. \"'Happy is he that hath the God of Jacob for his help, whose hope is in the Lord his God.'\" The word happy is often also translated as blessed. He says, listen, don't trust in these things, but happy or blessed is the one that has as his help the God of Jacob for his help, whose hope"
        }
      ]
    }
  ]
}