{
  "reference": "1 Chronicles 12",
  "occurrences": [
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 437.0400085449219,
      "text": "reached the Mediterranean, nor did it fully reach the Sea of Galilee, but we find that they were tucked within that region, and as being such, they would be merchants, and there would be much travel that would take place, and we find that as we would consider their position, if you will, their place, as Jacob mentions it, we understand the need and how nations would be dependent upon those that would be merchants. It's interesting that in 2 Chronicles, or excuse me, 1 Chronicles chapter number 12, and you might wanna stick a bookmark there, maybe a ribbon if you have them in your Bible, we'll make reference here to 1 Chronicles 12 a couple of times this evening, but in 1 Chronicles 12, in verse 33, and again in verse number 40, we read some things that God gives us about Zebulun here. Notice what the Bible says in verse 33 of 1 Chronicles 12. 1 Chronicles 12, 33, of Zebulun, such as went forth to battle, expert in war, with all instruments of war, 50,000, which could keep rank, then notice what it says, they were not of double heart. That's a good testimony that would be said there, but look in verse 40 with regard to the idea of merchants and looking at these descendants. It says in verse 40, moreover, they that were nigh them, even unto Issachar and Zebulun and Naphtali, brought bread on asses and on camels",
      "context": "...stick a bookmark there, maybe a ribbon if you have them in your Bible, we'll make reference here to 1 Chronicles 12 a couple of times this evening, but in 1 Chronicles 12, in verse 33, and again in verse number 40, ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=437",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 656.2400093078613,
      "text": "done. And we find that it says in Deuteronomy 33, in v. 18, when Moses is sharing the blessings, if you will, before his death, He said to Zebulun, rejoice at thy going out, but of Issachar, it says, rejoice in thy tents. Rejoice at thy going out to Zebulun, but rejoice in thy tents. When we look at Issachar, as I mentioned that it seems as if Zebulun, that his descendants were known as merchants, if you will, and we look at Issachar and they would be known as being farmers. Those that would work the land, those that would help to sustain a nation. And the reality is that we find that any nation is dependent on merchants and farmers. And I think about farming in America, and obviously much of our farmland in America has been sold and it's been purchased for various means and what have you. And really that can become a critical issue to a nation with regard to its sustenance that it needs and the productivity of that particular land and the yield that is required to sustain its people. And so we find here this evening that as we look at this portion of scripture and we think about these two men and really what their descendants would be, we're given a little bit of additional insight. I told you to hold your place there in 1 Chronicles 12. And I want you to see what the Bible says of these",
      "context": "...ts would be, we're given a little bit of additional insight. I told you to hold your place there in 1 Chronicles 12. And I want you to see what the Bible says of these",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=656",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 728.9600067138672,
      "text": "this portion of scripture and we think about these two men and really what their descendants would be, we're given a little bit of additional insight. I told you to hold your place there in 1 Chronicles 12. And I want you to see what the Bible says of these that are of the tribe, if you will, of Zebulun in 1 Chronicles. Notice what the Bible says. We've read verse 33 and verse number 40, but look at verse number 32 with me. The Bible says, and of the children of Issachar, which were men that had understanding of the times to know what Israel ought to do, the heads of them were 200, and all their brethren were at their commandment. And I like that the Bible says of the men of Issachar here, the children of Issachar, that they were men that had understanding of the times to know what Israel ought to do. We see again with regard to the inheritance that both of these men would receive and what their tribes would be known for. But we also notice as we look here at these two tribes and these two individuals, Zebulun and Issachar, and I'm mindful this evening that it's important for us to be content with what God's plan is for our lives. You know, not everyone could be a Judah. There were those that needed to be merchants and those that needed to be farmers,",
      "context": "...ts would be, we're given a little bit of additional insight. I told you to hold your place there in 1 Chronicles 12. And I want you to see what the Bible says of these that are of the tribe, if you will, of Zebulun ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=728",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 872.6600036621094,
      "text": "that was not given to them. It was not their lot, and there was turmoil, there was conflict, there was contention and division, and there was judgment because of it. But this evening, we find that as we look at these portions of Scripture with regard to these particular descendants, that it's a reminder for us tonight that God has a plan for each of us. And I'm thankful that as God has a plan for each of us, that we can embrace what that plan is. You know, it's a sad thing for God to have equipped you, for God to have called you and has a purpose and a plan for you, and all the while, you don't embrace it while you're trying to do something that God hasn't really called you or equipped you to do. And I'll tell you this evening, that could be quite frustrating, and it causes much problem. We find this evening that when we look at this truth in 1 Chronicles 12, when the Bible says there were men of understanding of the times, I'm thankful this evening that we have a Bible. And as we have the whole canon of Scripture that God would allow us to have an understanding of the times, if we could say as the children of Issachar that they were men that had understanding of the times, that we today, as the people of God, we need to have an understanding",
      "context": "...te frustrating, and it causes much problem. We find this evening that when we look at this truth in 1 Chronicles 12, when the Bible says there were men of understanding of the times, I'm thankful this evening that w...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=872",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}