{
  "reference": "1 Corinthians 6",
  "occurrences": [
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 1346.780029296875,
      "text": "many of God's people, how often in my life I try to live for myself, I try to take back that control. Paul, he didn't simply beg others, he did not simply encourage others to live a surrendered life, but we find that Paul himself lived a life of surrender. In fact, we're familiar with Galatians 2 in verse 20. Why does Paul say I'm crucified with Christ? Why does he say this truth of his position of surrender? If you look at the end of the verse, he says this, who loved me and gave himself for me. What's the reason, child of God? What's the reason that we should live a surrendered life? Because he loved me and he gave himself for me. Because without him, I'd be hopeless and helpless. You know where you'd be this morning without Christ? I don't even like to think about it. I don't know where I would be like geographically today without Christ, I'm not sure. But I know where I would be headed today without Christ and that's to a Christless eternity to a place called the Lake of Fire. Oh, what grace and what mercy, what love. We find that in 1 Corinthians 6 in verses 19 and 20 that Paul, as he's speaking to the believers there in Corinth, he says what? Know ye not that your body is the temple of the Holy Ghost which is in you, which you have of God,",
      "context": "...rnity to a place called the Lake of Fire. Oh, what grace and what mercy, what love. We find that in 1 Corinthians 6 in verses 19 and 20 that Paul, as he's speaking to the believers there in Corinth, he says what? Kn...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=1346",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 1419.780029296875,
      "text": "what love. We find that in 1 Corinthians 6 in verses 19 and 20 that Paul, as he's speaking to the believers there in Corinth, he says what? Know ye not that your body is the temple of the Holy Ghost which is in you, which you have of God, and you're not your own, why? He says it this way, for you are bought with a price. Therefore, because you've been bought with a price, we are to glorify God. How is it that we live a life that would bring glory to God? Will we live a life that would bring glory to God by living a life of surrender? He says therefore glorify God in your body and your spirit which are God's. Listen, I am bought with his precious blood. If you're saved this morning, you've been bought with the precious blood of Christ, you are no longer the owner of you. Amen? You're not. And by the way, you thought you owned yourself before, but you were really owned by the devil. If you go back and you read the book of John, you'll understand in John chapter number eight that truth. Listen, I'm so thankful that I'm owned by Christ. I've been bought with a price. Therefore, what's the impact of that? The impact is that I live a surrendered life. Now understand this morning that though we can give the reason, and even as I said by way of introduction,",
      "context": "what love. We find that in 1 Corinthians 6 in verses 19 and 20 that Paul, as he's speaking to the believers there in Corinth, he says what? Kn...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=1419",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 2010.1399536132812,
      "text": "sight of the Lord and he shall lift you up. You know what is required for submission? Humility. Humility. Without humility, you're never going to submit. You're just not. But why should we humble ourselves? Well, we find that God instructs us to. He says that we're to humble ourselves. He says that God resisteth the proud, but he gives grace unto the humble. He says that we're to humble ourselves and that we're to be clothed with humility. We can read of that as Peter writes in 1 Peter chapter 5. And by the way, pride. We said that it requires humility. Pride is a major issue in many people's lives. It's my life. Have you ever heard anyone say that? I'm going to do what I want to do. Well, there's a problem if you're a Christian because 1 Corinthians 6, 19 and 20 says, what? Know ye not that your body is the temple of the Holy Ghost which is in you, which you have of God? And you're not your own, for you're bought with a price. Therefore, glorify God in your body and your soul, which are his. See, I'm no longer my own. I've been bought. You've been bought. With the precious blood of Christ. And therefore, it requires that we have humility in our lives and that that humility leads to submission. And when we pray, thy will be done, what's being evidenced, what's being revealed through that prayer",
      "context": "... say that? I'm going to do what I want to do. Well, there's a problem if you're a Christian because 1 Corinthians 6, 19 and 20 says, what? Know ye not that your body is the temple of the Holy Ghost which is in you, ...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=2010",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}