{
  "reference": "1 Corinthians 12",
  "occurrences": [
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 1034.2799987792969,
      "text": "not receive? He's going to build upon this as we go through the book of 1 Corinthians, and we'll look at a few more verses. He says, now if thou didst receive it, why dost thou glory as if thou hadst not received it? And we find that he's speaking, we look at this idea of the ability to serve the Lord, and we rejoice that God's given us the ability. Why? Because it's God who has equipped us. It is God who has enabled us. Think about this, the God of the universe, the one who spoke it all into existence, the one who formed man from the dust of the ground and then breathed the life into them through the breath of God, that he would allow us, he would allow you to serve him. It's amazing that he would allow us to serve him in any capacity. It's amazing the ability that he's given us to serve him. In 1 Corinthians chapter 12, notice as he continues to help this group of believers in Corinth to understand the subject matter of spiritual gifts and to understand the ability that God had given them to be able to serve the Lord. Remember, we don't serve God, we don't do good works to be saved, we don't serve the Lord or do good works to stay saved, but because we are saved, we are to serve Christ. We are to do good works. Notice in 1 Corinthians 12,",
      "context": "...to stay saved, but because we are saved, we are to serve Christ. We are to do good works. Notice in 1 Corinthians 12,",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=1034",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 1104.0400085449219,
      "text": "to serve the Lord. Remember, we don't serve God, we don't do good works to be saved, we don't serve the Lord or do good works to stay saved, but because we are saved, we are to serve Christ. We are to do good works. Notice in 1 Corinthians 12, now, verse number one, concerning spiritual gifts, brethren, I would not have you ignorant. Ye know that ye were Gentiles, carried away unto these dumb idols, even as ye were led. Wherefore, I give you to understand that no man speaking by the Spirit of God calleth Jesus a curse, and that no man can say that Jesus is the Lord, but by the Holy Ghost. Now there are diversities of gifts, but notice this, the same Spirit. Verse number five, and there are differences of administrations, but the same Lord. And there are diversities of operations, but it is the same God which worketh all in all. But the manifestation of the Spirit is given to every man to profit with all. Every man has been equipped and enabled to be able to serve Christ. Every child of God. Remember the book of 1 Corinthians has been written to save people, to people that have been born again, saved by the grace of God. And he says that the manifestation of the Spirit is given to every man to profit with all. For to one, notice verse eight, is given by the Spirit the word of wisdom.",
      "context": "...to stay saved, but because we are saved, we are to serve Christ. We are to do good works. Notice in 1 Corinthians 12, now, verse number one, concerning spiritual gifts, brethren, I would not have you ignorant. Ye kno...",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=1104",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}