{
  "reference": "1 Corinthians 9",
  "occurrences": [
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 299.5400085449219,
      "text": "faint in your minds. This morning, if you're taking notes, I've simply entitled the message, Run the Race. Run the Race. As you know, the Bible uses analogies to describe the Christian life. Here, the analogy of running a race is in clear view. The Apostle Paul has used this analogy in other portions of Scripture. In fact, if you hold your place here in the book of Hebrews and turn over to 1 Corinthians chapter number 10, I want you to notice what he writes to this church in Corinth. In 1 Corinthians chapter number 10, verses 23-27, we find that he's writing, I said chapter 10, I meant chapter 9, please excuse me. 1 Corinthians chapter 9, verses 23-27. Notice what Paul says here as he's writing and challenging these believers in Corinth. Beginning in verse number 23 of 1 Corinthians 9, the Bible says this, and this I do for the gospel's sake, that I might be partaker thereof with you. Verse 24, know ye not that they which run in a race run all, but one receiveth the prize. So run that ye may obtain. Of course, there's an analogy being used here. They would have some level of understanding of what Paul is dealing with, with the games that were so common, and he says here in verse number 25, and every man that striveth for the mastery is temperate in all things. Now, they do it, those that run those temporal races, they",
      "context": "...ys here as he's writing and challenging these believers in Corinth. Beginning in verse number 23 of 1 Corinthians 9, the Bible says this, and this I do for the gospel's sake, that I might be partaker thereof with yo...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=299",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 616.860013961792,
      "text": "what Paul says with regard to this responsibility that he had. As we consider the responsibility, and this is his perspective, you will find why it was that Paul went from city to city, and as the Scriptures will say, as his manner was, he would enter into a city and begin to preach the Gospel. It's a perspective that we need. It's a perspective that I need. That we would have this perspective that I am dead here. Notice 1 Corinthians 9 and verse 16. For though I preach the Gospel, I have nothing to glory of, for necessity is laid upon me. Yea, woe is unto me if I preach not the Gospel. Notice in verse 23. And this I do for the Gospel's sake, that I might be partaker thereof with you. Begin to see that Paul says, woe is unto me there in verse 16, if I preach not the Gospel. I wonder how often we go through our lives, and I wonder if perhaps there's a period, a season of time in our lives where maybe there's a few days or maybe even a few weeks that would pass by, and we've not had the privilege of sharing the Gospel with someone. I wonder if we'd say like Jeremiah that it's just bubbling in me. It's like a fire within me. I just can't wait to give the Gospel to someone, anyone that would listen, because I understand the truth",
      "context": "...ed. It's a perspective that I need. That we would have this perspective that I am dead here. Notice 1 Corinthians 9 and verse 16. For though I preach the Gospel, I have nothing to glory of, for necessity is laid upo...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=616",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}