{
  "reference": "1 Corinthians 13",
  "occurrences": [
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 599.97998046875,
      "text": "we find as we look at this truth of be patient toward all men that it's we're not going to be patient Toward all men in our own power own strength and your flesh and in my flesh We must be filled with the Spirit of God. We must walk in the Spirit. We find that the Bible tells us, we begin to understand here where it says, love, joy, peace, long-suffering, and we think about the truth of charity or love. You know what the Bible says in 1 Corinthians 13 about love or charity? It says this, charity suffereth long. You know what that word is? It's the same word that's translated long-suffering. Same word. Charity in 1 Corinthians 13 and verse number 4 is described this way, it suffereth long. You know we're instructed to love one another. John 13 records it this way, if you would turn there in John 13. The Bible says this, Jesus of course as we know is going to provide this command after he'd washed the feet of the disciples and then of course he's explaining to them about his soon going to the cross of Calvary and all the things that are going to take place and he says this in verse number 34 of John chapter 13, he says a new commandment I give unto you. What is this? That you love one another as I have",
      "context": "...e, long-suffering, and we think about the truth of charity or love. You know what the Bible says in 1 Corinthians 13 about love or charity? It says this, charity suffereth long. You know what that word is? It's the s...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=599",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 667.1399841308594,
      "text": "his soon going to the cross of Calvary and all the things that are going to take place and he says this in verse number 34 of John chapter 13, he says a new commandment I give unto you. What is this? That you love one another as I have loved you that you also love one another. So we understand that we're to love as Christ loved and he says this in verse 35, by this, by what? By this love that we have one toward another. By this shall all men know that you are my disciples if you have love one to another. We find that the Bible tells us that Jesus gives this command that we're to love one another. We find that the Bible tells us if you want to jot it down we won't turn there but in 1 Peter 4 and verse number 8 the Bible says that we're to have fervent charity among yourselves. Fervent charity, this love, but the Bible describes charity or love in 1 Corinthians 13 as it suffereth long. And so this evening as we begin to understand and try to unwrap if you will this truth that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'd each be transparent and honest this is an area in which we struggle with. People can really kind of get on our",
      "context": "...nt charity among yourselves. Fervent charity, this love, but the Bible describes charity or love in 1 Corinthians 13 as it suffereth long. And so this evening as we begin to understand and try to unwrap if you will t...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=667",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1746.47998046875,
      "text": "timeframe, amen? Sometimes we think that we would like for God to work on our timeline, but God's working on his timeline. And by the way, his timeline is perfect, amen? Mine's not, neither is yours. So we find that the application is given. Number one, let us draw near. Number two, let us hold fast. Notice verse number 24 and 25. Number three, if you're taking notes, let us consider one another. Notice here, and let us consider one another to provoke unto love and to good works. We'll get to verse number 25 here in just a moment. It's interesting as you note that word consider, it means to attentively perceive. You find that he says, here, let us consider one another, and then he uses this word to provoke. You know, that word typically is used in a negative connotation, is it not? But here, we find that it's used in a very positive manner. Why? Because of what it is that we're provoking someone to, what it is that we're inciting them to do. Number one, he says that we're to provoke unto love. Unto love. 1 Corinthians 13 deals with the subject matter of charity, and how important that subject matter is. matter is we understand the Lord Jesus Christ in John chapter 13 before he gave that great promise that we so often refer to in the first several verses of",
      "context": "... is that we're inciting them to do. Number one, he says that we're to provoke unto love. Unto love. 1 Corinthians 13 deals with the subject matter of charity, and how important that subject matter is. matter is we un...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1746",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1809.5799369812012,
      "text": "love. Unto love. 1 Corinthians 13 deals with the subject matter of charity, and how important that subject matter is. matter is we understand the Lord Jesus Christ in John chapter 13 before he gave that great promise that we so often refer to in the first several verses of chapter 14 but after he'd washed the disciples feet and we find that he comes and he's speaking to them and at the end of chapter number 13 he says this beginning in verse number 31 of John 13 therefore when he was gone out Jesus said now is the Son of Man glorified and God is glorified in him verse 32 if God be glorified in him God shall also glorify him in himself and shall straightway glorify him little children yet a little while I am with you you shall seek me and as I said unto the Jews whither I go you cannot come to come so now I say to you notice this in verse 34 and 35 a new commandment I give unto you that you love one another as I have loved you that you also love one another by this by what our loved one for another by this shall all men know that you're my disciples if you have love one to another what a great subject matter and what a great truth it's not so much that we're to love our",
      "context": "love. Unto love. 1 Corinthians 13 deals with the subject matter of charity, and how important that subject matter is. matter is we un...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1809",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}