{
  "reference": "1 Corinthians 14",
  "occurrences": [
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 509.44000244140625,
      "text": "we read the New Testament, we read it as if, and in fact, any of the portion of the Bible, we read it as if it's chronological that the book of Romans must have been written before the book of 1 Corinthians because it's in our Bibles in that order. But the reality is that the book of 1 Corinthians was written about 55 AD. The next book to be written with regard to these three that deal with spiritual gifts is the book of Romans that was written two to three years later between 57 and 58 AD. And then you go to the book of Ephesians which was written in AD 61. So there's six years in between the writing of 1 Corinthians and the writing of Ephesians. Why do I bring that out? Well, when Paul says whether there be tongues, they shall cease and tongues is addressed in the book of 1 Corinthians, but it's omitted in the book of Romans and the book of Ephesians. It seems as if it was already beginning to fade away as the scriptures were coming into completion, all right? Is everyone tracking with that? So we find that as we study the scripture. So what is the purpose of tongues? In 1 Corinthians 14, you're here in chapter 13, turn to chapter 14 if you will and look at verse number 21. We'll read a few verses of scripture here as we seek to answer the question,",
      "context": "...racking with that? So we find that as we study the scripture. So what is the purpose of tongues? In 1 Corinthians 14, you're here in chapter 13, turn to chapter 14 if you will and look at verse number 21. We'll read ...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=509",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 575.6799926757812,
      "text": "that as we study the scripture. So what is the purpose of tongues? In 1 Corinthians 14, you're here in chapter 13, turn to chapter 14 if you will and look at verse number 21. We'll read a few verses of scripture here as we seek to answer the question, what is the purpose of tongues? Again, it's gonna be difficult. It's gonna be challenging for us to answer when tongues will cease if we do not understand the purpose of tongues. In 1 Corinthians 14 and verse 21, the Bible says in the law, it is written with men of other tongues and other lips, will I speak unto this people. And yet for all that, will they not hear me, saith the Lord? Wherefore, tongues are for a sign, not to them that believe, but to them that believe not. But prophesying serveth not for them that believe not, but for them which believe. If therefore the whole church be come together into one place, and all speak with tongues, and there come in those that are unlearned or unbelievers, will they not say that you are mad? But if all prophesy, and there come in one that believeth not, or one unlearned, he is convinced of all, he is judged of all, and thus are the secrets of his heart made manifest. And so falling down on his face, he will worship God, and report that God is in you of a truth.",
      "context": "that as we study the scripture. So what is the purpose of tongues? In 1 Corinthians 14, you're here in chapter 13, turn to chapter 14 if you will and look at verse number 21. We'll read ...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=575",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 858.2000122070312,
      "text": "you look at Peter where he would heal people, and you look at that situation, but then later on down the road of ministry, you find that Paul mentions people by name that he left sick. He didn't heal them, because healing them was not just his own volition of, bam, I want to heal you. No, the healing was confirming the word that was being preached. The same is true with tongues. So what was the purpose? Why did God use this? And I want you to understand this distinction. It's important in 1 Corinthians 14 that we understand to whom the sign is given, because it helps us to understand why. The Jews are always looking for a sign. That's what the Bible tells us. The Bible tells us, in fact, in this very book that we're looking at in 1 Corinthians, the Bible speaks about the truth that the Jewish people are looking for a sign. In verse 22 of chapter 1, it says, for the Jews require a sign, and the Greeks seek after wisdom. So the Jews require a sign. God's given them this sign of tongues. So I want you to consider what's taking place. The Jewish people, and as we study the Scriptures, we find evidence of this in an abundance. There was a great disdain for Gentiles. The Jewish people, by and large, they hated Gentiles. They viewed them as dogs. Biblical. We see it. We understand it.",
      "context": "...the purpose? Why did God use this? And I want you to understand this distinction. It's important in 1 Corinthians 14 that we understand to whom the sign is given, because it helps us to understand why. The Jews are a...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=858",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 2112.3600158691406,
      "text": "the book of Acts. We don't have time this evening. It's already 6.50. We don't have time this evening. But you can study through the book of Acts and you can read of other people that trusted Christ as their Savior that did not speak in tongues. Were they saved? Absolutely. They were saved. But they didn't speak in tongues. Why? Well, maybe there were no Jews there. Sometimes you see that to be the case and you find that there was no need for that evidence to be displayed to the Jewish people because there were no Jewish people there. And so you look at each of the situations independently and understand the reason, the purpose. So we answer the question, what's the purpose of tongues? Then we answer the question, the biblical usage of tongues. Turn to our 1 Corinthians 14. I know I've given you a lot this evening, but look here in 1 Corinthians 14, if you will. People that talk about, well, when will tongues cease or have tongues ceased. Those that would argue that tongues have not ceased and that they're still an active, valid sign gift for today, they still have to answer the question, when are they going to cease? So here's what I've often said to people, okay, if you believe that tongues are still for today, which I don't, I believe they've ceased, I'll give you that in conclusion this evening.",
      "context": "...t's the purpose of tongues? Then we answer the question, the biblical usage of tongues. Turn to our 1 Corinthians 14. I know I've given you a lot this evening, but look here in 1 Corinthians 14, if you will. People t...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=2112",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 2170.1400146484375,
      "text": "sign gift for today, they still have to answer the question, when are they going to cease? So here's what I've often said to people, okay, if you believe that tongues are still for today, which I don't, I believe they've ceased, I'll give you that in conclusion this evening. But if you believe that they're still in existence today, then you have to agree that they have to follow the biblical principles that God has set forth for how tongues were to be utilized. Because God put forth regulations, if you will, in 1 Corinthians 14 for how tongues were to be utilized. Understand with me that in 1 Corinthians 14, the instruction that's given in verse 26 through 40 is almost always violated in the modern charismatic Pentecostal movement today. There are many times that I've said, hey, okay, so you believe that speaking in tongues is for today. Do you believe that there needs to be an interpreter? Well, it depends if the Spirit wills. Sorry, the Spirit has already willed. How do I know that? God told us in His Word that if they're going to speak in tongues, there has to be an interpreter. So it's not if the Spirit wills at that moment, He already has. Does that make sense? And so we begin to find that if they're violating the regulations that are laid forth in the Scripture for the proper biblical usage of tongues, we have to say, hold on, is that",
      "context": "...s set forth for how tongues were to be utilized. Because God put forth regulations, if you will, in 1 Corinthians 14 for how tongues were to be utilized. Understand with me that in 1 Corinthians 14, the instruction t...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=2170",
      "channel": "Unknown",
      "publish_date": 20240902
    }
  ]
}