{
  "reference": "1 John 3",
  "occurrences": [
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 769.3999786376953,
      "text": "it is written, Be holy, for I am holy. See, we must understand that there's a balance within the Word of God, and His attributes, His character traits are always in perfect harmony. And we find that it is a popular message still even to this day to preach and to proclaim this God is love and do whatever you want to do, and you can get a great number of people because everything's just wishy-washy, you do whatever you want. But when you begin to preach and teach what the Word of God actually says and the truth of sanctification and the truth of our behavior, all of a sudden, people don't like that message so much. Nevertheless, it's true. And here we find as we look at the passage of Scripture, if you are taking notes, notice with me first of all that John speaks about sin. He speaks about sin. In verse number 4, notice what he says, Whosoever committeth sin transgresseth also the law. Notice what he says, For sin is the transgression of the law. It's a very simple statement that we find here in 1 John 3 and verse number 4 with regard to the definition or the description of sin. I would say this, as we look at verse number 4 and we understand that John speaks about sin, that we'd understand this morning that sin is awful. It is stated as being a",
      "context": "...he says, For sin is the transgression of the law. It's a very simple statement that we find here in 1 John 3 and verse number 4 with regard to the definition or the description of sin. I would say this, as we...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=769",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1658.7599792480469,
      "text": "To be born once is to die twice, because you'll die a physical death and you die a spiritual death, but to be born twice is to die just once, because you're born of the flesh and you're born of the Spirit, and you'll just die once, a fleshly death. The reality this morning is that as we understand the redemption that was made possible through the work at Christ at Calvary, that which was accomplished for us to be born again, he says here that we're born of God, but then notice this, for his seed remaineth in him, right in the middle of the verse in 1 John 3 and verse number 9, and it reminds us not only when we think about this second birth, the new seed, the new nature. We find that in 1 Peter chapter number 1, just a few pages over, I want you to remember what Peter said with regard to our redemption. In 1 Peter 1, beginning in verse number 18, Peter says this, for as much as you know that you were not redeemed with corruptible things as silver and gold from your vain conversation received by tradition from your fathers. Nope, no silver, no gold could redeem mankind, but, verse 19, with the precious blood of Christ, as of a lamb without blemish and without spot, who verily was foreordained before the foundation",
      "context": "...rn of God, but then notice this, for his seed remaineth in him, right in the middle of the verse in 1 John 3 and verse number 9, and it reminds us not only when we think about this second birth, the new seed,...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1658",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1725.5999755859375,
      "text": "with corruptible things as silver and gold from your vain conversation received by tradition from your fathers. Nope, no silver, no gold could redeem mankind, but, verse 19, with the precious blood of Christ, as of a lamb without blemish and without spot, who verily was foreordained before the foundation of the world, but was manifest in these last times, notice that phrase, for you, for you, who by him do believe in God that raised him up from the dead and gave him glory that your faith and hope might be in God, seeing you have purified your souls and obeying the truth through the spirit unto unfeigned love of the brethren, see that you love one another with a pure heart fervently, notice this in verse 23, being born again not of corruptible seed but of incorruptible, by the word of God which liveth and abideth forever. In 2 Peter 1 and verse number 4, notice what he says here with regard to this truth of redemption and being born again. He says this in 2 Peter 1 and verse number 4, whereby are given unto us exceeding great and precious promises that by these ye might be partakers, notice this, of the divine nature, having escaped the corruption that is in the world through lust. And as we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3 because we're born of God, his seed remaineth in us.",
      "context": "...through lust. And as we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3 because we're born of God, his seed remaineth in us.",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1725",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1800.4599609375,
      "text": "be partakers, notice this, of the divine nature, having escaped the corruption that is in the world through lust. And as we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3 because we're born of God, his seed remaineth in us. understand here that we have been born again. We have this new seed, this new nature, this second birth. And so John speaks of sin. He speaks of our Savior. When he speaks of our Savior, he says, I want to remind you of what was accomplished at Calvary. I want to remind you why He came. And you know this, but I want to remind you that He came first to take away our sins. He came to destroy the works of the devil. He came to redeem mankind. The Bible says that the Son of Man came to seek and to save that which was lost. He's a seeking Savior. Listen, if you don't know the Lord Jesus Christ is your personal Savior this morning, He wants to save you. He wants to be your Savior. He wants to be your Redeemer. He loves you. He loves you beyond what you could ever imagine. Not only does He love you, but He died for you. He took your place, the perfect substitute. The atonement was made. You say, I'm going to try to figure it out myself. You could never pay the debt",
      "context": "...through lust. And as we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3 because we're born of God, his seed remaineth in us. understand here that we have been born again. ...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1800",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}