{
  "reference": "1 John 1",
  "occurrences": [
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2331.4199829101562,
      "text": "God is come. Let me just pause right there as we talk about and rejoicing for the provision of God this time of year. We speak about the incarnation, the birth of Christ. Listen, I'm thankful that He provided Himself. He left the throne room of heaven. He left all of the glory and all of the splendor of heaven, and though He was rich, He became poor for our sakes, that we might be made rich. Think about that wonderful truth, and it says in verse number 20, and we know that the Son of God is come. He already has come. It is truth. It is settled truth that God was manifest in the flesh, that Jesus Christ, God in flesh, that He came and He dwelt among us. Remember, John started the passage by talking about in verse number 2 of 1 John 1, for the life was manifested, and we have seen it and bear witness and show unto you that eternal life which was with the Father and was manifested unto us. John says, I was an eyewitness. I heard, I saw, I handled of the word of life. Man, that's awesome. And we ought to rejoice this morning that God was willing to provide Himself. He came to the sin-cursed world. We understand this morning that if He didn't come, there's no salvation apart from Jesus Christ. Without the incarnation, there is no salvation. But He came.",
      "context": "...ame and He dwelt among us. Remember, John started the passage by talking about in verse number 2 of 1 John 1, for the life was manifested, and we have seen it and bear witness and show unto you that eternal l...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2331",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 0.0,
      "text": "Number three, back to the book of 1 John, the book that we've been studying. We've been away for a couple of months, actually. And the book that we've been studying here on Sunday morning is our theme. Of course, the banners are back up. We had our missions banners up the last two Sundays, but walking in the light from 1 John 1 and verse number seven this morning will be in chapter number three, looking at verses four through 10. But let me just remind you, since it's been a while since our last lesson or message from this particular book, let me remind you of how we started 1 John chapter number three. And really, John reminds the readers, the recipients, he reminds us of our position in Christ. And you look at the first verse of 1 John chapter number three, and the Bible says, behold, what manner of love the Father hath bestowed upon us. Aren't you thankful for the love of God? And what a blessing to know that God so loved the world that he gave his only begotten son, that whosoever believeth in him should not perish, but have everlasting life. And then we understand not only did he declare his love, but he demonstrated his love. For the Bible says that God commendeth his love toward us, and that while we were yet sinners, Christ died for us in Romans five and verse number eight.",
      "context": "...ers are back up. We had our missions banners up the last two Sundays, but walking in the light from 1 John 1 and verse number seven this morning will be in chapter number three, looking at verses four through...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 2475.1400756835938,
      "text": "you'd stop pushing my buttons, I wouldn't, you understand, the context of anger and wrath and malice. When we apologize, have you ever heard somebody apologize to someone and say, I'm sorry, but if you wouldn't have done blah, blah, blah, blah, then I wouldn't have, is that an apology? Is it not an apology? It's always confusing, right? And so what I'm saying this morning is that when we learn to identify sin in our lives, then we need to, number two, refuse to excuse sin in our lives. There's no excuse for this. There's no justification for this. This is a time in which I gave place to my flesh, that I walked in the flesh as opposed to the spirit, and then we come to number three of these three thoughts for consideration is that we then determine to confess and forsake sin in our lives. You know, it is an absolute joy to know that we have the promise of forgiveness. Amen? 1 John 1 and verse number 9. If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness. You read the Old Testament and you find that some of the attributes that are revealed to us of God in the Old Testament, the Bible tells us that he's gracious and merciful and we can enjoy and appreciate those attributes. But the Bible says this with regard to forgiveness,",
      "context": "...n our lives. You know, it is an absolute joy to know that we have the promise of forgiveness. Amen? 1 John 1 and verse number 9. If we confess our sins, he is faithful and just to forgive us our sins and to c...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=2475",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}