{
  "reference": "1 Kings 19",
  "occurrences": [
    {
      "sermon_id": "qKPSzK25Qso",
      "timestamp": 1899.5600051879883,
      "text": "text of scripture, because God has a task for us. But here's the thing. We can't allow the threats from others to take us on a trip somewhere that will keep us from fulfilling the task. That's exactly what the enemy wants to do. Elijah had an enemy named Jezebel. We have an enemy named Satan. And Satan will threaten us. It's the tactic that he used in the book of Acts. He used the religious leaders of the day to threaten the disciples of not speaking in the name of Jesus any longer. They bring these threats. Why? Because they wanna shut us down. They wanna keep us from fulfilling what God has called us to do. God's given us a task. What happens if we're not careful, that threat comes and we take a trip like Elijah did. We go someplace and in that place, we're not able to fulfill the task that God has for us. Tonight, God has a task for us. Individually and corporately as a church, he has a task for us to complete. There's a work to be done. So we begin to think about this question this evening as we kinda conclude here tonight. We think about this recurring question in 1 Kings 19. What doest thou hear, Elijah? And I wonder tonight, if we were to be asked that question, how well we would be able to answer the question. I wonder tonight if we would have assurance",
      "context": "... question this evening as we kinda conclude here tonight. We think about this recurring question in 1 Kings 19. What doest thou hear, Elijah? And I wonder tonight, if we were to be asked that question, how well...",
      "sermon_title": "Sermon qKPSzK25Qso",
      "url": "https://www.youtube.com/watch?v=qKPSzK25Qso&t=1899",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "qKPSzK25Qso",
      "timestamp": 1970.7000122070312,
      "text": "we kinda conclude here tonight. We think about this recurring question in 1 Kings 19. What doest thou hear, Elijah? And I wonder tonight, if we were to be asked that question, how well we would be able to answer the question. I wonder tonight if we would have assurance of being able to stand and say with absolute certainty that I know that I'm in the place where God wants me to be, doing the work that God wants me to do, that I have that confidence, that assurance. I want you to think about Joseph and use two examples tonight by way of closing. I want you to look back at Genesis chapter 45 and many of us are familiar with the life of Joseph and what a great life it is. Of course, not long ago, we finished up on Sunday nights looking and studying through the book of Genesis and of course, the latter chapters dealing specifically with the life of Joseph. We come to Genesis chapter 45 and this is the place in which Joseph reveals his identity to his brethren. We find that his brothers have come, they're seeking sustenance and he had made himself unknown to them and now he's revealed his identity. And in chapter number 45 in verse number seven, after he revealed his identity and he says they were troubled according to verse number three at his presence and he calls them close to him",
      "context": "we kinda conclude here tonight. We think about this recurring question in 1 Kings 19. What doest thou hear, Elijah? And I wonder tonight, if we were to be asked that question, how well...",
      "sermon_title": "Sermon qKPSzK25Qso",
      "url": "https://www.youtube.com/watch?v=qKPSzK25Qso&t=1970",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "qKPSzK25Qso",
      "timestamp": 2283.8999938964844,
      "text": "the Jewish people being annihilated, and of course, Haman, the enemy of the Jewish people, and all that was taking place, and we find this correspondence comes back and forth, and verse number 12, I'll pick it up. They told to Mordecai Esther's words. Then Mordecai commanded to answer Esther, think not with thyself that thou shalt escape in the king's house more than all the Jews. In other words, he's saying to her, just because you're in that place doesn't mean there's going to be safety there. Haman was a wicked man. He wanted all the Jewish people killed, and of course, we understand the influence of Satan in that situation to destroy the messianic line, and so on and so forth, but in verse 14, it says, for if thou altogether holdest thy peace at this time, then shall their enlargement and deliverance arise to the Jews from another place. You know what Mordecai had? He had confidence and faith that God would deliver them, that God would raise up somebody, but notice what he says, but thou and thy father's house shall be destroyed, and who knoweth whether thou art come to the kingdom for such a time as this? That you've come to the kingdom for such a time as this. You begin to think about the perspective of Mordecai with regard to the subject that we're dealing with from 1 Kings 19, when God says to Elijah, what doest thou hear, Elijah?",
      "context": "... to think about the perspective of Mordecai with regard to the subject that we're dealing with from 1 Kings 19, when God says to Elijah, what doest thou hear, Elijah?",
      "sermon_title": "Sermon qKPSzK25Qso",
      "url": "https://www.youtube.com/watch?v=qKPSzK25Qso&t=2283",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "qKPSzK25Qso",
      "timestamp": 2343.2200317382812,
      "text": "for such a time as this? That you've come to the kingdom for such a time as this. You begin to think about the perspective of Mordecai with regard to the subject that we're dealing with from 1 Kings 19, when God says to Elijah, what doest thou hear, Elijah? When we ask ourselves as if God were asking us tonight, what are we doing here? I wonder tonight, do we have that perspective of Joseph, that assurance that I know that I'm in the place where God has me? Do we have the perspective of Mordecai that God has me here for such a time as this? You know, so often I hear people, and I don't mean to say anyone here specifically, there's no one that I have specifically in mind that's in the congregation this evening, but I hear generally speaking in our world today about how difficult the days are in which we're living, and I understand they're difficult days, but understand that God has us here for such a time as this. I've heard people complaining about the day in which we're living, and they seem to wanna curse the day, but the reality is that God has called us to be the light in a dark, wicked world, and we're here for such a time as this. And so we must be able to answer the question this evening, what are we doing here?",
      "context": "... to think about the perspective of Mordecai with regard to the subject that we're dealing with from 1 Kings 19, when God says to Elijah, what doest thou hear, Elijah? When we ask ourselves as if God were asking...",
      "sermon_title": "Sermon qKPSzK25Qso",
      "url": "https://www.youtube.com/watch?v=qKPSzK25Qso&t=2343",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "qKPSzK25Qso",
      "timestamp": 2398.2999877929688,
      "text": "seem to wanna curse the day, but the reality is that God has called us to be the light in a dark, wicked world, and we're here for such a time as this. And so we must be able to answer the question this evening, what are we doing here? here. I know that God words it, what doest thou hear, Elijah? But if I could say it this evening and I could ask us tonight by closing and beginning our invitation, what are we doing here? I have asked myself that question so many times this week as God just arrested my attention on 1 Kings 19. It just caused me to really do some examination. What are we doing? What are we doing? Why does God have us here? If God was done with us, He'd take us home. I believe that. I believe that if you're here tonight, if you're living and breathing then God has a purpose for you. To boil this purpose down into one statement as I taught in our Sunday school class this morning, your purpose and my purpose in life is to bring glory to God. To bring glory to God. What are we doing? Are we bringing glory to God? I said this in the Sunday school class this morning. It's a marriage class. We're talking about the purpose in marriage and the purpose of our individual lives is to",
      "context": "...ere? I have asked myself that question so many times this week as God just arrested my attention on 1 Kings 19. It just caused me to really do some examination. What are we doing? What are we doing? Why does Go...",
      "sermon_title": "Sermon qKPSzK25Qso",
      "url": "https://www.youtube.com/watch?v=qKPSzK25Qso&t=2398",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}