{
  "reference": "1 Kings 11",
  "occurrences": [
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2146.740020751953,
      "text": "mighty, the Lord was with him and the Lord gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's servants. And again, we see these interactions that are taking place and all of a sudden we begin to connect these dots of what's going on in the days of Solomon. It's a sad thing, but the Bible tells us of Solomon, we know that he had many wives. You know, he had some wives that were the descendants of Edom, Edomites, Moabites, I mean, others, but Edomites were one of them that are specifically listed in 1 Kings 11 and verse number one. We find that in that text of scripture, it says, but King Solomon loved many strange women together with the daughter of Pharaoh, women of the Moabites, Ammonites, Edomites, Zidaneans and Hittites. Again, we see the Edomites referenced. It's interesting that God tells us in this same chapter in 1 Kings 11, it tells us how that God was angry with Solomon, why? Because of his evil, where he built these places of worship for these false gods of these wives that he married and all that was taking place. And we find that he also was burning incense and sacrificed one of their gods.",
      "context": "..., Edomites, Moabites, I mean, others, but Edomites were one of them that are specifically listed in 1 Kings 11 and verse number one. We find that in that text of scripture, it says, but King Solomon loved many ...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2146",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2207.6600036621094,
      "text": "how that God was angry with Solomon, why? Because of his evil, where he built these places of worship for these false gods of these wives that he married and all that was taking place. And we find that he also was burning incense and sacrificed one of their gods. And the Bible then tells us in verse 14 of 1 Kings 11, and the Lord stirred up an adversary unto Solomon, hey, dad, the Edomite. Hey, dad, the Edomite. He was the king's seed in Edom. The days of Amaziah, king of Judah, there's conflict, there are disputes with the Edomites. But I want you to think about the judgment upon the Edomites. I won't take time to look at any of the references. We're near the end this evening. But turn to the book of Jeremiah, if you will. Read two verses from the book of Jeremiah and Ezekiel and I encourage you to read the small book of Obadiah. And the book of Obadiah completely deals with Edom, the sons of Esau. Specifically goes back to Numbers 20. To the event that we read of in Numbers 20 where they said we're gonna pass through. He said, no, you're not. If you read the book of Obadiah, just a short book, you'll see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly,",
      "context": "...so was burning incense and sacrificed one of their gods. And the Bible then tells us in verse 14 of 1 Kings 11, and the Lord stirred up an adversary unto Solomon, hey, dad, the Edomite. Hey, dad, the Edomite. H...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2207",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}