{
  "reference": "1 Peter 2",
  "occurrences": [
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 164.0,
      "text": "level. However, this is church, and I'm not a dietician. Amen. Praise the Lord for that. I'm a pastor. God's given me the responsibility of preaching the word of God, and we find that God's word, and here in this text of Scripture, when I ask how is your diet, I'm not referring to your physical diet. I'm referring to your spiritual diet. God likens his word to food, and our text, as I've read already twice now in verse number 6, speaks about being nourished up in the words of faith and of good doctrine. 1 Peter 2 and verse number 2 says, As newborn babes desire the sincere milk of the word, that ye may grow thereby. We understand that as God would liken his word to food, and even in that truth in 1 Peter 2, he gives the understanding as newborn babes, if you're saved this morning, praise God for your salvation through the Lord Jesus Christ. If you're not saved this morning, you don't know that heaven is your home. Today is the day of salvation. It could be the day of your second birth. We find that those that are born again, we are babes in Christ. You grow in your Christian life. I've now had the privilege of knowing the Lord and walking with the Lord for some 20, almost 7 years, and I praise the Lord for that. And the reality is that when I first got saved,",
      "context": "... now in verse number 6, speaks about being nourished up in the words of faith and of good doctrine. 1 Peter 2 and verse number 2 says, As newborn babes desire the sincere milk of the word, that ye may grow the...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=164",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 230.0,
      "text": "born again, we are babes in Christ. You grow in your Christian life. I've now had the privilege of knowing the Lord and walking with the Lord for some 20, almost 7 years, and I praise the Lord for that. And the reality is that when I first got saved, and when you first got saved, you were a babe. I hope you're not still a babe, amen, unless you just got saved recently. Why? Because we're to grow in grace and knowledge of our Lord and Savior Jesus Christ. And he says in 1 Peter 2, As newborn babes desire what? The sincere milk of the word, that ye may grow thereby. You know what babies need? They need milk. And he refers to the milk of the word, but we find that in Hebrews 5 and verse 14, God says this, But strong meat belongeth to them that are of full age, even those who by reason of use have their senses exercised to discern both good and evil. I'm thankful that there's the milk of the word, but I'm thankful that there's the meat of the word. You know, the more you, the longer you have been saved, and the more you read the Bible, and the closer you get to the Lord, the more you find out how deep this book really is, and the treasures within God's word, and I'm so thankful for it. As we think this morning about this question",
      "context": "...y? Because we're to grow in grace and knowledge of our Lord and Savior Jesus Christ. And he says in 1 Peter 2, As newborn babes desire what? The sincere milk of the word, that ye may grow thereby. You know wha...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=230",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 1709.5599975585938,
      "text": "But yet, so many do. 2 Timothy 2 and verse 15 tells us to study. Study what? Study the Word of God to show ourselves approved. It tells us, study to show thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the Word of truth. I gotta read it if I'm gonna study it. 1 Peter 2 and verse number two says, as newborn babes desire the sincere milk of the Word, that ye may grow thereby. 2 Timothy 3 and verse 18 says, but grow in grace in the knowledge of our Lord and Savior, Jesus Christ, to whom be glory and honor forever and ever. Amen. This book produces growth in God's people. And so the question this evening with regard to Bible reading is will we make a commitment to God perhaps to read the book of Proverbs each month, perhaps to read the New Testament in one year, perhaps to read the entirety of God's Word in one year, and make that commitment to God? You say, well, I already do that. Good. Continue. Maybe add to it. I change it up year by year. I think it was in 2018. I read the Bible through twice, but I read the book of Psalms every month. It requires that you read five Psalms a day, and you do that, and you get through the whole book of Psalms each month.",
      "context": "...edeth not to be ashamed, rightly dividing the Word of truth. I gotta read it if I'm gonna study it. 1 Peter 2 and verse number two says, as newborn babes desire the sincere milk of the Word, that ye may grow t...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=1709",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WWASD9CXEro",
      "timestamp": 410.8399963378906,
      "text": "unkind or whatever, but I believe that many of them have absolutely no idea what Jesus would do because they've never actually studied the Scriptures to know how Christ behaved and how He lived. They say, well, Christ loved, listen, the way that they say that He loved is different than how He actually loved, amen, because they think, well, Jesus is love, God is love, so He permits us to do whatever we want to do because He loves me. That's not what the Bible teaches, and so we must get into the Scriptures. Notice in 1 Peter 2 and verse 21, for even here unto were ye called, because Christ also suffered for us, leaving us an example that we should follow His steps, who did no sin, neither was guile found in His mouth, who when He was reviled, reviled not again. When He suffered, He threatened not, but committed Himself to Him that judgeth righteously, who His own self bare our sins in His own body on the tree, that we, being dead to sins, should live unto righteousness by whose stripes ye are healed. For ye were as sheep going astray, but are now returned to the shepherd and bishop of your souls. And by the way, aren't you thankful that you're not what you once were? Because we were as sheep going astray, but now, He says, are returned to the shepherd and bishop of your souls.",
      "context": "...e He loves me. That's not what the Bible teaches, and so we must get into the Scriptures. Notice in 1 Peter 2 and verse 21, for even here unto were ye called, because Christ also suffered for us, leaving us an...",
      "sermon_title": "Sermon WWASD9CXEro",
      "url": "https://www.youtube.com/watch?v=WWASD9CXEro&t=410",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 0.0,
      "text": "and we'll get back to the Book of Colossians. We will finish it up this year, but thinking about Thanksgiving, this upcoming week on Thursday, and seeking the Lord with regard to direction for message. And I hope that between this morning and this evening, that you will leave church today with a whole list of reasons to rejoice, amen? And so get your fingers ready. We're gonna begin here in 1 Peter 2. It's just gonna be our launching spot, and we'll look at a number of passages of scripture throughout the morning and this evening as well. And I am so thankful for the Word of God, amen? And we have much to be thankful for. The Bible says, let the redeemed of the Lord say so, and we ought to have a song in our hearts. We ought to have praise on our lips. The Bible says, let everything that hath breath, praise the Lord, praise ye the Lord, amen? And man, I was encouraged by the children this morning, memorizing Psalm 100, and what a blessing to hide the Word of God in your heart, and the songs that they sang. God is good, amen? He is good all the time, and what a blessing to know the Lord. The songwriter said this, Jesus is the sweetest name I know. I agree with the songwriter, amen? When you hear the name Jesus, something just happens. I mean, you hear the name of Jesus,",
      "context": "... a whole list of reasons to rejoice, amen? And so get your fingers ready. We're gonna begin here in 1 Peter 2. It's just gonna be our launching spot, and we'll look at a number of passages of scripture through...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 85.94000244140625,
      "text": "good, amen? He is good all the time, and what a blessing to know the Lord. The songwriter said this, Jesus is the sweetest name I know. I agree with the songwriter, amen? When you hear the name Jesus, something just happens. I mean, you hear the name of Jesus, it's as if when His name is spoken, that immediately my mind, my heart, my soul fills with thoughts that both encourage me and comfort me. The name of Jesus. We have a wonderful Savior. And we find this morning that as we look at this portion of Scripture in 1 Peter 2, and really just as a launching point as I mentioned, notice in verse number one, the Bible says, wherefore laying aside all malice and all guile and hypocrisies and envies and all evil speakings, as newborn babes desire the sincere milk of the Word, that ye may grow thereby. I noticed in verses one and two that we're immediately confronted with the fact that we're dealing with believers. We're dealing with those that have trust at Christ as their Savior. Of course, you can find that in chapter one as well, but you find that there's some things that need to be laid aside according to verse number one. There's a growth process in the Christian life, and we find that detailed for us in verses one and two. We find that in verse number three, how similar the statement is to what David says",
      "context": "...e have a wonderful Savior. And we find this morning that as we look at this portion of Scripture in 1 Peter 2, and really just as a launching point as I mentioned, notice in verse number one, the Bible says, w...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=85",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 803.4400024414062,
      "text": "apart, but you find that He upholds all things by the Word of His power. Phenomenal. He's precious. He's Alpha and Omega. He's Almighty. He's Creator. He is the sustainer. Notice He is compassionate. I love the fact that you find throughout the Word of God and in Matthew 9, we'll look there at this portion of Scripture, but you find the compassion of Christ. You find that our God is compassionate. And here in Matthew 9, the Bible tells us that there was a multitude and Jesus saw the multitudes in verse number 36 and it tells us that He was moved with compassion on them. Why? Because they fainted and were scattered abroad as sheep having no shepherd. He was moved with compassion. We mentioned this morning in our Sunday school hours, we're studying the miracles of Christ that we were able to witness the compassion of Christ and the power of Christ. I'm thankful here that as you note here that He's moved with compassion, you find this referenced in other portions of Scripture as well that He is compassionate. He is gracious. Faith sang about God's grace this morning. We understand that many of us, even as we sang at the conclusion of our service last Sunday morning, amazing grace, that we are very thankful for the grace of God. In our text of Scripture in 1 Peter 2, in verse number 3, we read it just a moment ago, and the Bible says this",
      "context": "...morning, amazing grace, that we are very thankful for the grace of God. In our text of Scripture in 1 Peter 2, in verse number 3, we read it just a moment ago, and the Bible says this",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=803",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 877.8800048828125,
      "text": "even as we sang at the conclusion of our service last Sunday morning, amazing grace, that we are very thankful for the grace of God. In our text of Scripture in 1 Peter 2, in verse number 3, we read it just a moment ago, and the Bible says this with regard to the grace of God, if so be that ye have tasted that the Lord is gracious. It's part of His nature. It's who He is. He's gracious. And you think about the grace of God. His saving grace. His serving grace. And you find that we sing about His amazing grace. Paul speaks about His abundant grace. And you find that as we understand the grace of God, and we understand this morning that we have been the recipients of His grace. For by grace are you saved through faith. And that not of yourselves, it is the gift of God, but not of works, lest any man should boast. Oh, the grace of God. How precious our God is. He's merciful. Grace and mercy are often used together. And we find that when you speak of these two attributes of our God, that yes, indeed, they are similar, yet there are contrasts between the two. God giving us what we do not deserve in one aspect, and then God not giving us what we do deserve. Turn over to Ephesians 2. The reality is that we deserve punishment. Listen, we are guilty. Amen?",
      "context": "...morning, amazing grace, that we are very thankful for the grace of God. In our text of Scripture in 1 Peter 2, in verse number 3, we read it just a moment ago, and the Bible says this with regard to the grace ...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=877",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 1846.7599830627441,
      "text": "this book and conclude that He's wonderful, the reality is that He's more than wonderful. I stood in that foyer years ago and I said to an individual, they were struggling and asking questions, and I said, listen, let me ask you this morning, in your mind, in your heart, in your mind this morning, how great is God? And they gave me an answer. And I said, with all due respect, He's greater. Why? Because our mind cannot fully comprehend Him. He transcends us. My finite mind cannot comprehend an infinite God. But I can agree with 1 Peter 2 in verse 7, when the Bible says, unto you therefore which believe, He is precious. I say, I agree with that. I've believed on Him. I've put my faith and trust in Him. And He is precious. This morning, we're going to be thankful for His Person, for who He is. This morning, we're going to be thankful for His presence. Not only for His Person, for who He is, but for His presence. I'm so thankful. The Bible tells us that He is with us. What joy and comfort, what peace floods my soul when I consider this morning the presence of God Almighty. Notice, if you will, back in Psalm 23. We're just going to look at a few more verses. Psalm 23, it's a very familiar psalm. One in which we have heard many times. We want to be mindful of the presence of God,",
      "context": "...ehend Him. He transcends us. My finite mind cannot comprehend an infinite God. But I can agree with 1 Peter 2 in verse 7, when the Bible says, unto you therefore which believe, He is precious. I say, I agree w...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=1846",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}