{
  "reference": "1 Peter 5",
  "occurrences": [
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1848.8399772644043,
      "text": "purpose, we find that it says, if need be, ye are in heaviness through manifold temptations. Notice that the trial of your faith, being much more precious than of gold that perisheth, though it be tried with fire, might be found unto praise and honor and glory at the appearing of Jesus Christ, whom having not seen, ye love, and whom though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory, receiving the end of your faith, even the salvation of your souls. I'll read also in 1 Peter 5, I read these verses a moment ago, but notice in verse 10 and 11 of 1 Peter 5, it says, but the God of all grace who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, establish, strengthen, settle you. To him be glory and dominion forever and ever. Amen. From these two portions of Scripture in 1 Peter 1, verses 6 through 9, and in 1 Peter 5, verses 10 and 11, we really have the opportunity through these two portions of Scripture in 1 Peter to understand two purposes that God has. First and foremost, I believe that God's purpose is to bring honor and glory to himself. That's the primary purpose, is for God to be honored and glorified. And we find that at times God",
      "context": "...full of glory, receiving the end of your faith, even the salvation of your souls. I'll read also in 1 Peter 5, I read these verses a moment ago, but notice in verse 10 and 11 of 1 Peter 5, it says, but the God...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1848",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 2566.979949951172,
      "text": "see him. We sang last week, face to face, I shall behold him. One day, I'm going to see my savior. Man, that should encourage every single believer this morning, I'm going to see him. We find, it says that we can have this joy, unspeakable and full of glory in 1 Peter 5 and verse 10. It says that after you've suffered a while, that he will make you perfect, establish, strengthen, and settle you. I want you to think about that work that God's doing through the trial and developing us spiritually. No doubt that we could stand here this morning and we could give testimonies. We could open up for opportunity for some to give some testimonies this morning of, listen, how has God taught you certain things? How has God grown you spiritually? And I can guarantee you that there will be some trials that are referenced as to how God developed us. Job said it this way in Job 23. Verse number 10, but he knoweth the way that I take. When he hath tried me, I shall come forth as gold. As gold. I want you to think about Job just for a moment. You say, man, I had a bad day. Read Job. Seriously. How many of you have read Job before? Okay. If you've read Job, I'm guessing that you've never had a day like Job had. And Job says, he knoweth the way that I take.",
      "context": "... I'm going to see him. We find, it says that we can have this joy, unspeakable and full of glory in 1 Peter 5 and verse 10. It says that after you've suffered a while, that he will make you perfect, establish,...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=2566",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 767.3599853515625,
      "text": "I'm thankful for biblical promises that we have with regard to the work of God, the work of Christ and how we can prevail. But we must be mindful that the enemy, that there are many adversaries and the enemy has a plan in his plan. Remember what Peter said. I mentioned the very beginning of the message that it's easy for most of us to acknowledge that we have an enemy. And we find that Peter says this and understand that Peter understood. Remember in Luke, it was Jesus when He said to Peter, He said, Peter, Satan hath desired to have you that he may sift you as wheat. But then He gives them some encouragement. He says, but I have prayed for thee. I've prayed for thee. And He says, when thou art converted, strengthen thy brethren. And God would use Peter to write first and second Peter. And we find there in 1 Peter 5 that Peter begins to encourage and strengthen the brethren by reminding them that we have an enemy and that He walketh about seeking whom He may devour. We note, first of all, the plan of the enemy. We note, number two, the prayer of God's people. What a great response to the enemy. To go to God in prayer. Sometimes I feel as if in many of our lives, throughout the history, I guess maybe, of our churches, sometimes we have not fully acknowledged the true power of prayer.",
      "context": "...engthen thy brethren. And God would use Peter to write first and second Peter. And we find there in 1 Peter 5 that Peter begins to encourage and strengthen the brethren by reminding them that we have an enemy ...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=767",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}