{
  "reference": "1 Samuel 3",
  "occurrences": [
    {
      "sermon_id": "qBNqkK_OxzA",
      "timestamp": 891.9800109863281,
      "text": "is? Listen, I don't know how many times I've read the Bible through, and I don't say that for any prideful type of reason. I just really don't know. I read the Bible through multiple times a year. I've preached through, I have, as the pastor of Fellowship Adventist Church for 13, a little over 13 years, I've preached through like 29 books of the Bible, all right? That's how many books I have preached through, verse by verse, chapter by chapter, but I still read it every day. You know what I find? There are times, Kevin, that I read a portion of Scripture that I just got done preaching, and God shows me something that I never saw the first time that I read it, or the 50th time that I read it, or even when I preached it and studied to preach that message. This book is awesome. And I come to it expecting, desiring to hear from God. I think about that verse that I quoted in Psalm 118. I think about the reference to Samuel by way of introduction this evening when he said, \"'Speak, Lord, for thy servant heareth.'\" And those are two prayers that I pray each day when I open up my Bible and I begin to read. I pray those two thoughts from Scripture, Psalm 119 and verse 18, and 1 Samuel 3 and verse 10, because I wanna hear from God. I wanna hear from God.",
      "context": "...my Bible and I begin to read. I pray those two thoughts from Scripture, Psalm 119 and verse 18, and 1 Samuel 3 and verse 10, because I wanna hear from God. I wanna hear from God.",
      "sermon_title": "\"We Ought To Listen Up - Part 2\" Hebrews 2:1-4",
      "url": "https://www.youtube.com/watch?v=qBNqkK_OxzA&t=891",
      "channel": "Unknown",
      "publish_date": 20241026
    },
    {
      "sermon_id": "qBNqkK_OxzA",
      "timestamp": 954.780029296875,
      "text": "those are two prayers that I pray each day when I open up my Bible and I begin to read. I pray those two thoughts from Scripture, Psalm 119 and verse 18, and 1 Samuel 3 and verse 10, because I wanna hear from God. I wanna hear from God. Turn over if you go to Psalm 42, and I want you to see the imagery that God gives us. It's a text that no doubt you're familiar with, but I want you to see it this evening. In Psalm 42, verses one and two, the Bible says, as the heart panteth after the water brooks, so panteth my soul after thee, O God. Notice it says, my soul thirsteth for God, for the living God. When shall I come and appear before God? I wonder if your soul's ever thirsted for God. You need to hear from God. You need a message from the Lord. You're longing to have that communication from God, and you go to his word and you receive it. Listen, I've read accounts of individuals that have not had the privilege of having a Bible like you and like me. They've been outlawed. There are people that were killed, martyred, burned at the stake simply for having a copy of the Bible. There are people that were Christians living under communist rule, that the communist, even, I mean, I'm talking just 100 years ago. I'm not talking 400 years ago. In portions of Europe,",
      "context": "...my Bible and I begin to read. I pray those two thoughts from Scripture, Psalm 119 and verse 18, and 1 Samuel 3 and verse 10, because I wanna hear from God. I wanna hear from God. Turn over if you go to Psalm 42...",
      "sermon_title": "\"We Ought To Listen Up - Part 2\" Hebrews 2:1-4",
      "url": "https://www.youtube.com/watch?v=qBNqkK_OxzA&t=954",
      "channel": "Unknown",
      "publish_date": 20241026
    }
  ]
}