{
  "reference": "1 Thessalonians 4",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 2636.3600463867188,
      "text": "saved us but then all that He's doing in and through us and how He's working and He's empowered us and sin has no dominion over us and all those things that we've mentioned and then to understand that He's coming back for us. He's gonna give us this glorified body. We're gonna reign with Him. What a joy. And finally this evening, eternity with my Savior. He's promised me. He's promised you if you've trusted Him as your Savior that you'll spend eternity with Him. We read the last part of 1 Thessalonians 4 and verse number 17 when the Bible says, there and so shall we ever be with the Lord. You know, many times people ask the question, what is heaven like? There are individuals that have sought to write books and sell books about being in heaven and Paul couldn't talk about it and so I don't think anyone else could talk about it. Amen? The reality is that God tells us some things about heaven but you know what makes heaven heaven? We're gonna be with Him. If you remove Him, it's not heaven. It's not heaven. But the reality that for all of eternity and it's hard for our minds to really grasp eternity because we're stuck in time. I love the the last verse. I think it's the last verse in our hymnal. I know Amazing Grace. It depends what hymnal you look in.",
      "context": "... if you've trusted Him as your Savior that you'll spend eternity with Him. We read the last part of 1 Thessalonians 4 and verse number 17 when the Bible says, there and so shall we ever be with the Lord. You know, man...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=2636",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 1501.0199584960938,
      "text": "And we preach the gospel in every place that we can go. It works on every continent of the world. It works for any people group around the globe, and we preach the gospel of Jesus Christ, and we are engaged in that work. Now, I'm thankful. Listen, the reality, yes, there are churches that are closing. There are churches that are faltering and so on and so forth, but there are good churches around the globe. There are good churches here in our county. There are good churches in Virginia. There are good churches in the United States of America. There are good churches all around the globe. We're all engaged in the same great work. We're not all together in the same place, but we're all engaged in the great work. And here's the reality that we're engaged in the work until when? Until the trumpet of the Lord shall sound. Amen? Remember, at the end of the church age, there's this wonderful thing that we call the rapture. Some people criticize the rapture because they say the word's not in the Bible. Well, the word means caught up. And the Bible tells us in 1 Thessalonians 4, for this we say unto you, by the word of the Lord, that we which are alive and remain unto the coming of the Lord shall not prevent them which are asleep. For the Lord Himself shall descend from heaven with a shout, with the voice of the archangel,",
      "context": "...use they say the word's not in the Bible. Well, the word means caught up. And the Bible tells us in 1 Thessalonians 4, for this we say unto you, by the word of the Lord, that we which are alive and remain unto the com...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=1501",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}