{
  "reference": "1 Thessalonians 2",
  "occurrences": [
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 827.3800201416016,
      "text": "privilege, but we have this treasure, the Gospel of Jesus Christ. Paul, in between the two verses that we've read here in 2 Corinthians 4 and verse three and verse number seven, we find that he mentions about the work of the enemy to keep blinded the minds of those that have not received the Gospel of Jesus Christ. And we understand that the enemy is alive and active and he's working. This morning, as Paul says here in verse number five, we preach not ourselves, but Christ Jesus the Lord and ourselves your servants for Jesus's sake. We don't preach ourselves. I often say to individuals as I have the privilege of sharing the Gospel with them, I'm not asking you to come to our church. I'm not asking you to give to our church. I'm not asking you to do any. I'm just trying to share with you the truth of what Jesus Christ did for you because one day you're going to die. Are you ready? Are you ready? See, I am dead hurt. Notice what he says in 1 Thessalonians 2. We'll move on to verse number 15 in Romans 1 here, but look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica",
      "context": "... day you're going to die. Are you ready? Are you ready? See, I am dead hurt. Notice what he says in 1 Thessalonians 2. We'll move on to verse number 15 in Romans 1 here, but look at what he says here in 1 Thessalonian...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=827",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 898.5400085449219,
      "text": "look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica and now he's writing this epistle back to these believers. And I want you to notice what he says in 1 Thessalonians 2 in verse number four. And I believe that this will continue to help us understand this perspective of Paul. Notice what he says. But as we were allowed of God, notice what he says, to be put in trust with the gospel. Even so we speak, not as pleasing men, but God which trieth our hearts. I notice a few things here from verse number four of 1 Thessalonians 2. Number one, I understand that it's a privilege. He says we are allowed of God. Isn't it amazing that God would allow us to be his spokespeople, to be his messengers. In 2 Corinthians 5, Paul says that we are ambassadors. And you think about that unique privilege and opportunity that is ours. And here Paul says that we were allowed of God. And then notice that phrase, to be put in trust with the gospel. He says it this way in 1 Thessalonians that we were entrusted to be put in trust with the gospel. In Romans one, I am debtor.",
      "context": "look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=898",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}