{
  "reference": "1 Thessalonians 5",
  "occurrences": [
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 667.1399841308594,
      "text": "his soon going to the cross of Calvary and all the things that are going to take place and he says this in verse number 34 of John chapter 13, he says a new commandment I give unto you. What is this? That you love one another as I have loved you that you also love one another. So we understand that we're to love as Christ loved and he says this in verse 35, by this, by what? By this love that we have one toward another. By this shall all men know that you are my disciples if you have love one to another. We find that the Bible tells us that Jesus gives this command that we're to love one another. We find that the Bible tells us if you want to jot it down we won't turn there but in 1 Peter 4 and verse number 8 the Bible says that we're to have fervent charity among yourselves. Fervent charity, this love, but the Bible describes charity or love in 1 Corinthians 13 as it suffereth long. And so this evening as we begin to understand and try to unwrap if you will this truth that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'd each be transparent and honest this is an area in which we struggle with. People can really kind of get on our",
      "context": "...s evening as we begin to understand and try to unwrap if you will this truth that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=667",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 734.0999755859375,
      "text": "that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'd each be transparent and honest this is an area in which we struggle with. People can really kind of get on our nerves, right? I mean be transparent tonight don't leave me up here on an island by myself, amen? And the reality is people can, they can be annoying from time to time. I can be annoying, amen? You can be annoying. We all can but but he says be patient toward all men. I want to go over and consider an example that we read of in Matthew chapter 18. Look in Matthew 18 if you will with me tonight and here's the reality and begin to think about this instruction where the Bible says be patient toward all men. We could find ourselves if we're not careful being patient with certain people and then lacking patience with others. We could find ourselves in a position where we desire for others to be patient toward us while we are not demonstrating patience toward others. But again we must recognize and we must understand that this is not something that you're going to conjure up in your own flesh. It's not something that you're just gonna, you know, sometimes oh well they're just patient. I mean they were",
      "context": "that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=734",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 1176.8200073242188,
      "text": "to be able to pay back the debt. He did not forgive the debt and excuse it all like he had experienced and what he had received. He didn't even have enough compassion to have enough patience to let this servant work to pay it off. The Bible says that he cast him into prison till he should pay the debt. I understand that we could look at this passage of Scripture and we could make many applications and understand this evening that as we look at this particular passage in light of the truth of 1 Thessalonians 5 and verse number 14. so often that when we consider the thought of patience, when we consider the thought of being long-suffering, we're here, God gives us clearly this instruction to the local church, he says, now we exhort you, brethren. And he says, warn them that are unruly. And no doubt, that's a necessity, that's something that needs to happen. I said this a few weeks ago, ignoring the problem of the unruly is not going to resolve the problem, it's just going to make the situation worse. It has to be addressed, it has to be dealt with, and God in his sovereignty and his omniscience, he knew that local churches would deal with some that would be unruly. I'm thankful that it's not all the time that people and all the people are unruly, but you find that God gives the instruction.",
      "context": "...ons and understand this evening that as we look at this particular passage in light of the truth of 1 Thessalonians 5 and verse number 14. so often that when we consider the thought of patience, when we consider the t...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=1176",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}