{
  "reference": "1 Timothy 1",
  "occurrences": [
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 1806.3999705314636,
      "text": "Just go back to Matthew and read what he says about those Pharisees and those Sadducees. When they prayed those big high prayers and they wanted to be noticed of men, they have their reward. reward. That's what Jesus says. What's the reward? The applause of man. Did you hear him? No, no, no. It's for the audience of one. And when our motive is to please Christ, when our motive is to please Christ and to serve Christ and to do it with a pure heart then he is the one that's exalted and magnified and it's all about him. Will you make people upset? Yeah, you will. But when you keep your focus on I'm serving the Lord, I'm serving the Lord. Paul says it this way in 1 Timothy chapter 1. Think about what Paul says here. It's a verse of scripture that Holly has on her signature of her email and I appreciate this verse of scripture. Many of us have what we might refer to as a life verse. Maybe we sign a card or an email with a particular verse and again Holly has verse 12 of 1 Timothy 1. I want you to notice what Paul says in this verse of scripture. And I thank Christ Jesus our Lord who hath enabled me for that he counted me faithful putting me into the ministry. Notice verse 13 with it. Who was before a blasphemer and a persecutor and injurious",
      "context": "...ife verse. Maybe we sign a card or an email with a particular verse and again Holly has verse 12 of 1 Timothy 1. I want you to notice what Paul says in this verse of scripture. And I thank Christ Jesus our Lord ...",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=1806",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 818.3000030517578,
      "text": "that he is, and that he's a rewarder of them that diligently seek him, in Hebrews 11, in verse number six. Listen, we believe this book by faith. Someone said, you mean to tell me that you believe a whale swallowed Jonah? Yeah. And a preacher said this in response, if God's word told me that a Jonah swallowed a whale, I'd believe it, too. Amen? Why? Because God's word is truth. God's word is truth. There's some things that are unhealthy. In 1 Timothy 1, 4, we see how it ministers questions. Notice in verse six, the Bible says, from which some having swerved, notice this, have turned aside unto vain jangling. I love the way that that phrase is recorded for us and really translated for us. And it has this idea of useless talk. Sometimes you listen to these, and I hope you're not listening to them, but you come across something, and it's just vain jangling. It's just useless talk. It's just ministering questions. It's not edifying. It's not building up. It's not honoring God. It's not building up your faith. We find that there's some things, again, that we as God's people must simply refuse. We must be selective. Why? Because there's some things that are unhealthy. We must be selective. Why? Because there's some things that are healthy. I'm thankful for God's word. I'm thankful for resources that are available that are helpful, that are healthful, that God uses to build up our faith.",
      "context": "...? Why? Because God's word is truth. God's word is truth. There's some things that are unhealthy. In 1 Timothy 1, 4, we see how it ministers questions. Notice in verse six, the Bible says, from which some having ...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=818",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}