{
  "reference": "1 Timothy 5",
  "occurrences": [
    {
      "sermon_id": "hwLKY1FAuwU",
      "timestamp": 2824.199981689453,
      "text": "reality is that no doctor is ever going to prescribe to an individual that has stomach issues to drink alcohol. Furthermore, there's a study. It came out just a couple of years ago. I didn't bring it with me. It's on my desk. But there's a study that came out. I saw it on Fox News a couple of years ago, and I said, man, this is wonderful. And I printed that thing out, saved it, and it said this. It said no person under 40 years old should ever drink alcohol. There are zero health benefits. You should be a total abstainer. Now, can I tell you this morning, that's not popular with all the beer manufacturers and all the alcohol, why? There's a huge industry. Those people make lots of money, okay? So those studies are not popular, but they came out with it, and I have the article printed, and it says there is zero, not there's some, there are zero health benefits to alcohol. Now, if scientists and if medicine and if Google can figure all that stuff out in 2024, I submit to you this morning that the creator God, who is the omniscient God, knows all things, and he never in his word would have told Paul to give Timothy alcoholic beverage for his stomach's sake. Not a chance. So if you wanna find a verse that's going to justify your behavior, you can't use 1 Timothy 5 anymore, amen, honestly.",
      "context": "...ke. Not a chance. So if you wanna find a verse that's going to justify your behavior, you can't use 1 Timothy 5 anymore, amen, honestly.",
      "sermon_title": "\"Honorable Elders\" I Timothy 5:17-25",
      "url": "https://www.youtube.com/watch?v=hwLKY1FAuwU&t=2824",
      "channel": "Unknown",
      "publish_date": 20240623
    },
    {
      "sermon_id": "hwLKY1FAuwU",
      "timestamp": 2897.959991455078,
      "text": "the omniscient God, knows all things, and he never in his word would have told Paul to give Timothy alcoholic beverage for his stomach's sake. Not a chance. So if you wanna find a verse that's going to justify your behavior, you can't use 1 Timothy 5 anymore, amen, honestly. It's just not a valid interpretation of scripture. I have found, however, and you cannot find this online where it has been something that has been verified, but I did some research years ago, and I found this to be the case. I read it in a couple of studies. There are others that have come out and said, no, it's not true, but I can tell you that we've practiced it personally, and that is this, that pure grape juice is actually a huge benefit if you have stomach issues. In fact, there are some studies that have suggested, and again, they say that they're not verifiable. They have suggested that if you are exposed to a stomach virus, now, how many of you like stomach viruses? Amen. During that whole COVID thing, everyone wanted to ask you about, do you have this symptom, this symptom, this symptom, this symptom, and I was so like just wanting to mess with people and say, man, I don't have any of that, but I've been throwing up like crazy, and I just got this, because they didn't seem to care about any of that sort of thing,",
      "context": "...ke. Not a chance. So if you wanna find a verse that's going to justify your behavior, you can't use 1 Timothy 5 anymore, amen, honestly. It's just not a valid interpretation of scripture. I have found, however, ...",
      "sermon_title": "\"Honorable Elders\" I Timothy 5:17-25",
      "url": "https://www.youtube.com/watch?v=hwLKY1FAuwU&t=2897",
      "channel": "Unknown",
      "publish_date": 20240623
    },
    {
      "sermon_id": "hwLKY1FAuwU",
      "timestamp": 3093.399971008301,
      "text": "water, but drink wine, period. That would be open to all kinds of different interpretations and understandings. But he says, don't do it for this reason. And when we understand that reason, it helps us to come to a proper conclusion. This morning, we look at this passage of Scripture in 1 Timothy 5 and verse 17 through 25, and we see that in this passage it's dealing specifically with elders. But I said to you a few minutes ago, and I'll say it again, every child of God, their conduct should be honorable. It's not just honorable elders, it should be honorable Christians. That we live in such a way that we bring honor and glory to our God, that we are pursuing purity in our lives, that we are rejecting partiality, that we are understanding that there are things, behaviors that are appropriate and pleasing, and there are behaviors that are not appropriate, they're inappropriate, they're displeasing. As I mentioned to you at that conference, they said, if you do any of these things, you're out. No refund. Can I tell you that the sponsors and organizers of that conference, they're not our audience. God Almighty, the thrice holy God, He is the one that we serve. And oh, how our behavior should align biblically, that we can thank God for the encouragement that He gives us, we can thank God for the warnings that He provides, and we can thank God for the instruction that He gives.",
      "context": "..., it helps us to come to a proper conclusion. This morning, we look at this passage of Scripture in 1 Timothy 5 and verse 17 through 25, and we see that in this passage it's dealing specifically with elders. But...",
      "sermon_title": "\"Honorable Elders\" I Timothy 5:17-25",
      "url": "https://www.youtube.com/watch?v=hwLKY1FAuwU&t=3093",
      "channel": "Unknown",
      "publish_date": 20240623
    },
    {
      "sermon_id": "346_VFj2Pb0",
      "timestamp": 153.5,
      "text": "chapter, we find that Paul begins to provide instruction with regard to relationships within the church. You find that we, obviously as a church, we're a church family, and there are relationships that we have in the church, and so Timothy is instructed on how he is to interact with those that are making up the church, the members of the church, and his behavior and interactions with church family would be an example to the rest of the body. The pastor is to set forth the pattern. We find in this chapter in 1 Timothy 5 that God, the first 16 verses we're going to look at this morning, God deals with relationships in the church. In verses one and two, notice the Bible says, rebuke not an elder, but entreat him as a father and the younger men as brethren, the elder women as mothers, the younger as sisters with all purity. Verse three, honor widows that are widows indeed. We'll skip down and look at verse 16, and we'll get into the message this morning. The Bible says, if any man or woman that believeth have widows, let them relieve them, and let not the church be charged that it may relieve them that are widows indeed. So as we come to this fifth chapter, look at 1 Timothy, we find that God provides this instruction with regard to relationships within the church.",
      "context": "...example to the rest of the body. The pastor is to set forth the pattern. We find in this chapter in 1 Timothy 5 that God, the first 16 verses we're going to look at this morning, God deals with relationships in ...",
      "sermon_title": "\"Relationships In The Church\" I Timothy 5:1-16",
      "url": "https://www.youtube.com/watch?v=346_VFj2Pb0&t=153",
      "channel": "Unknown",
      "publish_date": 20240526
    }
  ]
}