{
  "reference": "1 Timothy 6",
  "occurrences": [
    {
      "sermon_id": "7YFnql3gWjE",
      "timestamp": 2690.259979248047,
      "text": "said, this is a faithful saying and worthy of all acceptation that Christ Jesus came into the world to save sinners of whom I am chief. So Jesus came to save humanity. And so he has a desire for people to be saved. And that of course is his plan. And so with regard to the aspect of the plan of his return, he's not slack concerning his promise. He is going to come back, but he's long suffering. Why? Because he's not willing that any should perish, but that all should come to repentance. Back in the text of scripture, it says in verse 16 in 1 Timothy 6, who only hath immortality dwelling in the light, which no man can approach unto whom no man hath seen, nor can see to whom be honor and power everlasting. Amen. Isn't that exciting? I mean, just the climax, if you will, of how this charge is given. The text continues in verse 17 through the end of the chapter, really highlighting on some truth with regard to now giving a charge to those that's already been referenced earlier in the chapter in verse 17, charge them that are rich in this world. Now, remember the problem of verse number nine was not they that are rich, but they that will be rich. That's their motivation. That's their drive. That's all they're consumed with. It's not a problem to be rich. It's a problem if that's our driving, motivating,",
      "context": "...rish, but that all should come to repentance. Back in the text of scripture, it says in verse 16 in 1 Timothy 6, who only hath immortality dwelling in the light, which no man can approach unto whom no man hath s...",
      "sermon_title": "\"King Of Kings And Lord Of Lords\" I Timothy 6:13-21",
      "url": "https://www.youtube.com/watch?v=7YFnql3gWjE&t=2690",
      "channel": "Unknown",
      "publish_date": 20240714
    },
    {
      "sermon_id": "VUxY_FF000Q",
      "timestamp": 1264.859992980957,
      "text": "Thomas answered and said unto him, my Lord and my God. By the way, Jesus didn't rebuke him. Why? Because he's God. If you came up here and said to me, my Lord and my God, I'd stop you in a heartless and I am not, but Jesus is God. So when Thomas says, my Lord and my God, Thomas is not rebuked for that because it's the truth. But I want you to notice what Jesus says in verse 29, Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed. What are they that have not seen and yet have believed? I want you to understand this morning that God wants us to be people of faith. He wants us to have faith that God is real, that God's on his throne, that we believe this book. I preached a message on Wednesday evening, the totality of scripture and dealing with the fact that Paul says, I believe all things that are written in the law and in the prophets and the importance that we understand that we take God at his word, that we believe God. What are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also to follow after love. There's a whole chapter, 1 Corinthians 13, that's committed to charity or to love.",
      "context": "... we believe God. What are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also...",
      "sermon_title": "\"Flee, Follow, Fight\" I Timothy 6:11-12",
      "url": "https://www.youtube.com/watch?v=VUxY_FF000Q&t=1264",
      "channel": "Unknown",
      "publish_date": 20240708
    },
    {
      "sermon_id": "VUxY_FF000Q",
      "timestamp": 1334.6199951171875,
      "text": "are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also to follow after love. There's a whole chapter, 1 Corinthians 13, that's committed to charity or to love. And we understand that Jesus said this as the end of John, chapter number 13, he says, a new commandment I give you. What is this new commandment I give unto you that you love not in the same way that you love yourself, but as I have loved? See, in the Old Testament, love your neighbor as thyself, but in the New Testament, we find that he says, love as I have loved. It's amazing. He says, by this, by what, by your love one for another, you'll know, all men will know that you are my disciples. First John deals with it very plainly. Don't say that you love God, but you don't love your brethren. How can you love God if you don't love your brethren? We find this morning that here he says love. Now understand with me, I believe that as we're pursuing love, that first and foremost, we're speaking about love for God, love for God. We're to love him with every part of our being, love him supremely. Now understand this morning that when we say that we love the Lord, we love him because he first loved us.",
      "context": "are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also...",
      "sermon_title": "\"Flee, Follow, Fight\" I Timothy 6:11-12",
      "url": "https://www.youtube.com/watch?v=VUxY_FF000Q&t=1334",
      "channel": "Unknown",
      "publish_date": 20240708
    },
    {
      "sermon_id": "VUxY_FF000Q",
      "timestamp": 2267.260009765625,
      "text": "commit thou to faithful men who shall be able to teach others also. Thou therefore endure hardness as a good soldier of Jesus Christ. O man, that warreth and tangleth himself with the affairs of this life, that he may please him who hath chosen him to be a soldier. Those verses of Scripture go perfect with what we're looking at in 1 Timothy 6 verses 11 and 12. The one that's warring, the good soldier that's going to endure hardness, he's not going to entangle himself with the things, the affairs of this world, verses 9 and 10 in 1 Timothy chapter 6, but he's going to seek after, he's going to follow after why that he might please him who hath chosen him to be a soldier. And oh, as we look here at this truth of the battleground that we're engaged in, this battle that's raging all around us. Many today have tried to use various terms to describe the battle. Cultural wars, social wars, you name whatever it might be, political wars. I want you to understand it's spiritual war. It is spiritual war. And we're engaged in spiritual warfare. I'm thankful that Paul, as he's writing to the church in Corinth, that our weapons are not carnal. No, they're spiritual. Can I tell you that we must recognize that we're fighting a spiritual battle. We wrestle not against flesh and blood, according to Ephesians 6. We wrestle against spiritual wickedness in high places.",
      "context": "...hath chosen him to be a soldier. Those verses of Scripture go perfect with what we're looking at in 1 Timothy 6 verses 11 and 12. The one that's warring, the good soldier that's going to endure hardness, he's no...",
      "sermon_title": "\"Flee, Follow, Fight\" I Timothy 6:11-12",
      "url": "https://www.youtube.com/watch?v=VUxY_FF000Q&t=2267",
      "channel": "Unknown",
      "publish_date": 20240708
    },
    {
      "sermon_id": "VUxY_FF000Q",
      "timestamp": 2349.9000244140625,
      "text": "as he's writing to the church in Corinth, that our weapons are not carnal. No, they're spiritual. Can I tell you that we must recognize that we're fighting a spiritual battle. We wrestle not against flesh and blood, according to Ephesians 6. We wrestle against spiritual wickedness in high places. And can I tell you this morning, every day of your life you better put on the whole armor of God because there's not a day off in this battle. There's not a day off in this battle. And the day that you think that there's a day off is the day that the enemy will fire as many fiery darts at you as he possibly can fire. You say, oh, I wish I had the shield of faith that can quench all the fiery darts. No, I went out without the armor on. Put on the whole armor of God. Be strong in the Lord and the power of His might. It's a battleground. Notice in verse number 12 of 1 Timothy 6, he says, fight the good fight of faith. But then he gives this following truth that's so important for us to understand. He says, lay hold. on eternal life, whereunto thou art also called and hast professed a good profession before many witnesses. This phraseology of lay hold on eternal life, it's not the idea of getting saved, it's the idea that because you are saved,",
      "context": "...Be strong in the Lord and the power of His might. It's a battleground. Notice in verse number 12 of 1 Timothy 6, he says, fight the good fight of faith. But then he gives this following truth that's so important...",
      "sermon_title": "\"Flee, Follow, Fight\" I Timothy 6:11-12",
      "url": "https://www.youtube.com/watch?v=VUxY_FF000Q&t=2349",
      "channel": "Unknown",
      "publish_date": 20240708
    },
    {
      "sermon_id": "53lojYZz2_0",
      "timestamp": 2834.0799865722656,
      "text": "get wealth. God gave you the power to work. No, I have a, whatever job you have, whatever mind you have, whatever ability you have, God gave that to you. And so it says, the Lord gave and the Lord hath taken away. Blessed be the name of the Lord. In all this, Job sinned not nor charged God foolishly. The book of Psalms in Psalm 62 and verse number 10 tells us this. In Psalm 62 and verse number 10, trust not in oppression and become not vain in robbery. If riches increase, set not your heart upon them. If riches increase, set not your heart upon them. Your riches may increase. God may choose to bless monetarily. And that's okay. But set not your heart upon them. Why? Well, I think in verse, in Proverbs chapter 23, God gives us a good reason. Obviously, we're, our hearts are to be kept with all diligence for out of it are the issues of life in Proverbs chapter 4. But in Proverbs chapter 23, we're to have a heart for the Lord. Amen? A heart for God. In Proverbs 23 and verse 4, it says, labor not to be rich. Cease from thine own wisdom. You know, the, the truth of verse number 4, labor not to be rich, is really coupled with what we see in 1 Timothy 6 and verse number 9, they that will be rich. He says, listen,",
      "context": "...know, the, the truth of verse number 4, labor not to be rich, is really coupled with what we see in 1 Timothy 6 and verse number 9, they that will be rich. He says, listen,",
      "sermon_title": "\"Developing Biblical Perspective\" I Timothy 6:1-10",
      "url": "https://www.youtube.com/watch?v=53lojYZz2_0&t=2834",
      "channel": "Unknown",
      "publish_date": 20240702
    },
    {
      "sermon_id": "53lojYZz2_0",
      "timestamp": 2914.3999633789062,
      "text": "4, it says, labor not to be rich. Cease from thine own wisdom. You know, the, the truth of verse number 4, labor not to be rich, is really coupled with what we see in 1 Timothy 6 and verse number 9, they that will be rich. He says, listen, labor not to be rich. Cease from thine own wisdom. Wilt thou set thine eyes upon that which is not? For certainly, for riches certainly make themselves wings, they fly away as an eagle toward heaven. It's amazing, the truth of that verse of Scripture. In a moment, it could just all be gone. Some in our congregation, none that I believe are here this morning, literally experienced all that took place in the Great Depression, but their parents did and they're familiar with the impacts of that. But you know, it's just amazing how an economy can collapse. Can I tell you this morning, I'm not, I'm not an economist. It is not my arena of expertise. I readily admit that. Okay. But in everything that I see in our society today, our economy is fake. Our economy is fake right now. And it's just going to be a matter of just a few things that could happen. Bam. Just, but listen, that's why we don't set our heart upon riches. Godliness with contentment is great gain. You have food and raiment, be content. God takes care of us. Amen? And I'm thinking, listen, and I'm",
      "context": "...know, the, the truth of verse number 4, labor not to be rich, is really coupled with what we see in 1 Timothy 6 and verse number 9, they that will be rich. He says, listen, labor not to be rich. Cease from thine...",
      "sermon_title": "\"Developing Biblical Perspective\" I Timothy 6:1-10",
      "url": "https://www.youtube.com/watch?v=53lojYZz2_0&t=2914",
      "channel": "Unknown",
      "publish_date": 20240702
    }
  ]
}