{
  "reference": "2 Chronicles 29",
  "occurrences": [
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 1694.3400268554688,
      "text": "middle of our life at some point in our life, and we can try to tell other people how good we are and how, man, how we've made it in all of these successes that we've had in our lives, and look at my life and look what I've accomplished. But Jacob, he says, let me tell you what God has done. Let me tell you how God met with me. Let me tell you how God blessed me. Let me tell you how God promised me. Let me tell you how God provided for me. Let me explain to you what I expect God to continue to do. Why? Because God always honors his word. He always does what he says he's going to do. Turn over, if you will, to 2 Chronicles. I want you to see a passage of scripture in 2 Chronicles 29, and it's a period of time in Israel's history where they have revival under the ministry, really the leadership, Hezekiah is the king of Judah at this particular time in Judah's history. We find that they have revival during his reign as king. It's not the only time we find that Judah had revival. They had revival during the time of Jehoshaphat. They had revival during the time of Josiah. But we see here in Hezekiah's reign, it's very interesting what happens. And as we begin to, we're just jumping right in the middle of a passage of scripture",
      "context": "...s going to do. Turn over, if you will, to 2 Chronicles. I want you to see a passage of scripture in 2 Chronicles 29, and it's a period of time in Israel's history where they have revival under the ministry, really t...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=1694",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 1760.1400146484375,
      "text": "find that Judah had revival. They had revival during the time of Jehoshaphat. They had revival during the time of Josiah. But we see here in Hezekiah's reign, it's very interesting what happens. And as we begin to, we're just jumping right in the middle of a passage of scripture and how they were cleansing the house of the Lord and all that they did. And the Bible begins to talk about this revival. And I want you to pick it up with me in 2 Chronicles 29. And I want you to see what God's people did and how they worship. The Bible says in verse 28, and all the congregation worshiped and the singers sang. You know, singing is part of worship. Singing is part of worship. When we sing, we're not trying to bring any kind of acknowledgement, recognition to ourselves. No, the real true heart of those that are singing ought to be to worship our God, to sing praise. He's unto His name. The Bible says that we're to sing and to make a joyful noise unto the Lord. We find that the Bible says that they were singing, they worshiped and the singer sang and the trumpeters sounded. Amen? I told Tim this morning, we've not had the trumpet for a couple of weeks. And I said to Tim, I said, man, it was good to hear the trumpet this morning. Amen? I enjoy that.",
      "context": "... they did. And the Bible begins to talk about this revival. And I want you to pick it up with me in 2 Chronicles 29. And I want you to see what God's people did and how they worship. The Bible says in verse 28, and ...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=1760",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}