{
  "reference": "2 Corinthians 5",
  "occurrences": [
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 451.9200134277344,
      "text": "God tells us exactly what it is that would compel or constrain us. And here's what the truth is, it is the love of Christ. We must never get over the fact that God loves us. We must never get over the truth that we are loved by God. And what does love reveal to us? What does love teach us? We find this morning that God loves us, and so God instructs us. And of course, the greatest demonstration of God's love for us is sending His Son to die for us so that we could be saved, so that we could be born again. But we find that He loved in love. You know what God does? He corrects us. Whom the Lord loveth, He chasteneth. You say, well, that's not very loving. No, it is loving. That is actually exactly what love is. If love, if someone loves an individual, if God loves you as His child and He sees you going astray, it is an act of love to correct and to chasten us. And how thankful we ought to be for that. But notice in 2 Corinthians 5 and verse 14, the Bible says, for the love of Christ constraineth us, because we thus judge, that if one died for all, then we're all dead. Listen, you were dead in your sins and your trespasses. You were dead. Here's the truth that someone",
      "context": "...n act of love to correct and to chasten us. And how thankful we ought to be for that. But notice in 2 Corinthians 5 and verse 14, the Bible says, for the love of Christ constraineth us, because we thus judge, that i...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=451",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 517.4400024414062,
      "text": "notice in 2 Corinthians 5 and verse 14, the Bible says, for the love of Christ constraineth us, because we thus judge, that if one died for all, then we're all dead. Listen, you were dead in your sins and your trespasses. You were dead. Here's the truth that someone spoke. They articulated it this way that brought great conviction in the life of my Father. It led Him to going to a Baptist church and hearing the gospel proclaimed and trusting Christ as His Savior. Here's what it was. There's a lot of dead people that are walking around. My dad said, what in the world is that guy talking about? And he said, well, here's the reality. There's a lot of people that are dead spiritually. They're just alive physically. I hope that's not you this morning. I mean, you have life physically, but I wonder this morning, do you have life spiritually? Have you been born again? I'm not asking if you go to church. I know you're here this morning. I'm not asking if you've done some kind of religious duties and you're following some type of religion mandate. No, I'm asking, have you trusted Jesus Christ as your personal Savior? It's the only way to be made alive. It's the only way to be born again is through the Lord Jesus Christ. He said, I'm the way, the truth, and the life. No man, no one's going to get around",
      "context": "notice in 2 Corinthians 5 and verse 14, the Bible says, for the love of Christ constraineth us, because we thus judge, that i...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=517",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 575.6799926757812,
      "text": "asking, have you trusted Jesus Christ as your personal Savior? It's the only way to be made alive. It's the only way to be born again is through the Lord Jesus Christ. He said, I'm the way, the truth, and the life. No man, no one's going to get around that. No man cometh unto the Father but by me. But I'm sincere. You can be sincerely wrong. It's only through Jesus Christ. The love of Christ constraineth us because we thus judge that if one died for all, then we're all dead. That word constraineth, we talked about the definition of surrender, to give or deliver up possession upon compulsion. or demand, and really, it's that being compelled or being constrained, and the word here in 2 Corinthians 5 and verse number 14, to the love of Christ constraineth us, it really carries two ideas with it. One of them is this, to urge with irresistible power. And then it carries with it this idea, to hold together. And really, when you think about those two truths and how they're coupled together in that simple verse of scripture, that the love of Christ constraineth us, it urges us with irresistible power. Listen, what does it urge us to do? In just a minute, we'll read verse 15 and we'll see what it urges us to do, but we find also that it holds us together. It's as if the love of Christ, it holds us together,",
      "context": "...ulsion. or demand, and really, it's that being compelled or being constrained, and the word here in 2 Corinthians 5 and verse number 14, to the love of Christ constraineth us, it really carries two ideas with it. On...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=575",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1291.0399780273438,
      "text": "So sin is a universal condition. Every single human being that you see, that I see, has the same condition that we have. Sin. What makes me different? Mine's been forgiven. I know that He came. I have the knowledge. He came and He took away our sins. Wow, what joy. 2 Corinthians 5 verse 21 says that He, God, hath made Him, Christ, to be sin for us, who knew no sin, that we might be made the righteousness of God in Him. Man, what a transaction that took place. The songwriter said it's not in our songbook. Many of you might be familiar with it. The old account was settled long ago. The old account was settled. The transaction was completed. Jesus said it is finished. It was paid in full. He paid for our sins. I mentioned earlier, but there in 1 Peter chapter 3 and verse number 18, the Bible says, for Christ also hath once suffered for our sins, the just for the unjust, that He might bring us to God, being put to death in the flesh, but quickened by the Spirit. Notice not only as He speaks of our Savior here in 1 John chapter number 3, does He remind the recipients, does He remind us this morning that He took away our sins, that was accomplished at the cross of Calvary, but I want you to notice as well that He",
      "context": "...given. I know that He came. I have the knowledge. He came and He took away our sins. Wow, what joy. 2 Corinthians 5 verse 21 says that He, God, hath made Him, Christ, to be sin for us, who knew no sin, that we might...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1291",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 898.5400085449219,
      "text": "look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica and now he's writing this epistle back to these believers. And I want you to notice what he says in 1 Thessalonians 2 in verse number four. And I believe that this will continue to help us understand this perspective of Paul. Notice what he says. But as we were allowed of God, notice what he says, to be put in trust with the gospel. Even so we speak, not as pleasing men, but God which trieth our hearts. I notice a few things here from verse number four of 1 Thessalonians 2. Number one, I understand that it's a privilege. He says we are allowed of God. Isn't it amazing that God would allow us to be his spokespeople, to be his messengers. In 2 Corinthians 5, Paul says that we are ambassadors. And you think about that unique privilege and opportunity that is ours. And here Paul says that we were allowed of God. And then notice that phrase, to be put in trust with the gospel. He says it this way in 1 Thessalonians that we were entrusted to be put in trust with the gospel. In Romans one, I am debtor.",
      "context": "...d of God. Isn't it amazing that God would allow us to be his spokespeople, to be his messengers. In 2 Corinthians 5, Paul says that we are ambassadors. And you think about that unique privilege and opportunity that ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=898",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2073.040008544922,
      "text": "the Lord Jesus Christ.\" What a blessing to know that my citizenship is in heaven. That I'm a child of the King. This world is not my home. I'm looking forward to the day that I get to meet my Savior face to face. And forever and ever and ever spend eternity with Him in heaven. What a blessing that is. That's the miracle of reconciliation. But while we're here on earth, we're to be engaged in the ministry of reconciliation. We are His ambassadors. Notice how he continues the verse there in 2 Corinthians 5 in verse number 20, as though God did beseech you by us. We pray you in Christ's stead, be ye reconciled to God. Notice, as we're engaged in this ministry of reconciliation, that we're to go, we understand that mankind apart from Christ, that they're without God. They have no hope in the world. They have no peace. And the only way to have peace with God is through the atonement of Jesus Christ on the cross of Calvary. And only then can they be reconciled to God. It's interesting that in the preceding text of Scripture, in verses 10-13 of 2 Corinthians 5, really Paul's dealing with a completely different subject. That of the judgment seat of Christ or the bema seat of Christ. And we find that he makes an interesting statement in verse 11 of that text of Scripture that I believe is pertinent to our study this morning",
      "context": "... the ministry of reconciliation. We are His ambassadors. Notice how he continues the verse there in 2 Corinthians 5 in verse number 20, as though God did beseech you by us. We pray you in Christ's stead, be ye recon...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2073",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2152.480010986328,
      "text": "Corinthians 5, really Paul's dealing with a completely different subject. That of the judgment seat of Christ or the bema seat of Christ. And we find that he makes an interesting statement in verse 11 of that text of Scripture that I believe is pertinent to our study this morning with regard to the ministry of reconciliation. He says, knowing therefore the terror of the Lord, we persuade men. We persuade men, but we remain manifest unto God and I trust also remain manifest in your conscience. And I think about this truth there of 2 Corinthians 5 in verse 11 that we have an understanding, we know therefore the terror of the Lord, that we persuade men. Have you ever read Revelation 20? You read in verses 11-15 of the great white throne judgment. It will happen. Listen, it's a sad thing that people are dying from this COVID-19. We find that we're praying and we're asking God to work and to have doctors with wisdom with regard to how to treat patients and all of those things. And you think about all of the efforts that are going forth in order to preserve, to save life, and we're applauding them and we're thankful for their efforts and their attempts, but we understand that there is, as of the point of end to man, wants to die. But after this, the judgment. You know that every day globally, 150,000 people die. Every day, globally. That's about the number",
      "context": "...unto God and I trust also remain manifest in your conscience. And I think about this truth there of 2 Corinthians 5 in verse 11 that we have an understanding, we know therefore the terror of the Lord, that we persua...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2152",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2308.1199951171875,
      "text": "from some other means, we find that death is certain. We find that Solomon says this, there's a time to be born and there's a time to die. And I'm not trying to minimize death. I'm simply saying that it's something that we face. We face this thing of death and there are many that have a fear of death. That's why we're called, as we've experienced the miracle of reconciliation, to be engaged in the ministry of reconciliation. That we would say to people, be reconciled to God. To quote, once again, the text that I received from the retired pastor last evening, the question, what can wash away my sins, is so much more important than what can wash away my germs. Again, I'm not trying to diminish or to dismiss the situation we're dealing with with COVID-19. But can I tell you that for someone that experiences healing, for someone that never deals with the exposure to this particular virus, they still have a problem. It's called sin. It is a universal condition that affects all mankind. And we find that as we would look at the passage of Scripture that is before us, and many of you know that 2 Corinthians 5 and verse number 15 is my life verse, where the Bible says, and that He died for all, that they which live should not henceforth live unto themselves. But unto Him which died for them and rose again.",
      "context": "...find that as we would look at the passage of Scripture that is before us, and many of you know that 2 Corinthians 5 and verse number 15 is my life verse, where the Bible says, and that He died for all, that they whi...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2308",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2384.1599731445312,
      "text": "is before us, and many of you know that 2 Corinthians 5 and verse number 15 is my life verse, where the Bible says, and that He died for all, that they which live should not henceforth live unto themselves. But unto Him which died for them and rose again. And we find that the Apostle Paul, as we would look at this passage of Scripture, I believe that the truths that we find in this passage that Paul was sharing of the miracle of reconciliation and the ministry of reconciliation, that these two truths result Paul did, in the Apostle Paul saying, I'm living for Christ. As I've quoted already, Philippians 1 and verse 21, for me to live is Christ, and to die is gain. See, I believe, as we trace the steps of Paul, that you see Paul recognized the miracle of reconciliation. He never got over the fact that he was reconciled to God. And he understood what salvation was as he grew, and he understood this truth of, yes, being redeemed and being justified, but being reconciled to God. That I was at enmity with God because of my sin, but now that relationship has been restored. I've been reconciled. It's a miracle. But not only did he recognize the miracle of reconciliation, I believe that Paul embraced the ministry of reconciliation. Why do we say that? Traces steps. Everywhere he goes, he's preaching Christ.",
      "context": "is before us, and many of you know that 2 Corinthians 5 and verse number 15 is my life verse, where the Bible says, and that He died for all, that they whi...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2384",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}