{
  "reference": "2 Corinthians 9",
  "occurrences": [
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 2765.1600036621094,
      "text": "to God out of a heart of love and obedience. And God is pleased with it. By the way, our giving not only pleases God, but it's also an evidence of our faith. That we believe, if we just start with the tithe and just mention the tithe for just a moment, that we believe that God will do with 90 percent more than what could be done with 100 percent. It's believing God. It's just taking God at his word. That God said that you've robbed me in the book of Malachi, where have we robbed thee? In tithes and offerings. And he said that prove me is what he said in Malachi chapter 3. And what would he do? Not only would he bless them, but he would also rebuke the devourer for their sakes. Our God is able, and it's a matter of faith, it's a matter of obedience, but it's pleasing to the Lord. Notice the people in 2 Corinthians chapter 9, and I have to hurry here, 2 Corinthians chapter 9, in verses 6 and 7, the Bible says this, in 2 Corinthians 9, it's interesting if you, I don't have time, but if you want to go back later this afternoon and read chapter 8, you'll notice that the very people that he's speaking of in chapter 9 that we're giving, that they were in deep poverty, but yet they gave.",
      "context": "...er 9, and I have to hurry here, 2 Corinthians chapter 9, in verses 6 and 7, the Bible says this, in 2 Corinthians 9, it's interesting if you, I don't have time, but if you want to go back later this afternoon and re...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=2765",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 2832.1600036621094,
      "text": "Corinthians 9, it's interesting if you, I don't have time, but if you want to go back later this afternoon and read chapter 8, you'll notice that the very people that he's speaking of in chapter 9 that we're giving, that they were in deep poverty, but yet they gave. And he says this, that they first gave of them their own selves to the Lord, and then of their substance. But notice in 2 Corinthians 9 in verse 6, the Bible says, but this I say, he which soweth sparingly shall reap also sparingly, and he which soweth bountifully shall reap also bountifully. Now we understand this from a perspective of agriculture, do we not? If you plant a bunch of seeds, you're going to expect to have a big crop. If you plant just a few seeds, you're going to expect to have a smaller crop. You're not going to plant a few seeds and think that you're going to have an abundance of crop, right? We understand agriculturally, but he's making the application here to our giving, whether we're giving sparingly or whether we're giving bountifully. Notice in verse number 7, every man according as he purposeth in his heart, so let him give. But notice what it says, not grudgingly or of necessity, for God loveth a cheerful giver. It's a wonderful truth that we find here. We mentioned in Philippians chapter number 4 that God is well pleased with this, with our giving.",
      "context": "...at they first gave of them their own selves to the Lord, and then of their substance. But notice in 2 Corinthians 9 in verse 6, the Bible says, but this I say, he which soweth sparingly shall reap also sparingly, an...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=2832",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 2900.6200256347656,
      "text": "he purposeth in his heart, so let him give. But notice what it says, not grudgingly or of necessity, for God loveth a cheerful giver. It's a wonderful truth that we find here. We mentioned in Philippians chapter number 4 that God is well pleased with this, with our giving. But here in 2 Corinthians 9, the Bible says that God loveth a cheerful giver, that the perspective is not this that I'm giving grudgingly or of necessity. It's not that I have to, it's that I get to. It's that God blessed me and God has enabled me to give back to him. God is pleased with that. Why? Because we're honoring him, we're exalting him, and he's pleased. This morning we've answered the question that yes, indeed, I can please God. And then we've considered some ways in which we are able to please him. How can I do it? Okay, I understand that I can, but then how? You continue to apply the principle of Ephesians 5, 10 to your life and prove what is acceptable unto the Lord, and you'll find a number of reasons. I've given you three simple thoughts this morning on how we can please God, but understand the Bible is full of examples of how your behavior and my behavior can please our God, and that we would have this idea, we'd have this perspective that we find in 2 Timothy",
      "context": "...ed in Philippians chapter number 4 that God is well pleased with this, with our giving. But here in 2 Corinthians 9, the Bible says that God loveth a cheerful giver, that the perspective is not this that I'm giving ...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=2900",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "20HHrsvLvZg",
      "timestamp": 1643.1200256347656,
      "text": "deal with this truth this morning, my gift to him is not to try to get his gift to me. My gift to him is not to try to keep his gift that he's given me. My gift to him is out of gratitude for what he's done for me. And we understand that as we go through the Scriptures that there is a response that we find littered throughout the New Testament, the Old Testament as well, how that the people of God as they've received this gift, how they respond by thanking God, by praising God, by living for God, because they understand this gift. I've said this before from this pulpit. The reality is that if we could lose the gift, if we could lose the salvation, we would have lost it the day we got it. I know, there's no way I can keep it the same way I can't earn it. Amen? I'm kept by the power of God. But what's my gift back to him? Number 1, I would say this, it's my praise. My praise. Is he not worthy of our praise? When we understand the gift that he's given to us, when we understand this gift of God, which is eternal life, we ought to lift our voice and praise him and thank him. 2 Corinthians 9 and verse 15 said, but thanks be to God for his unspeakable gift. I'm thanking him and I'm praising him. Why?",
      "context": "...d this gift of God, which is eternal life, we ought to lift our voice and praise him and thank him. 2 Corinthians 9 and verse 15 said, but thanks be to God for his unspeakable gift. I'm thanking him and I'm praising...",
      "sermon_title": "Sermon 20HHrsvLvZg",
      "url": "https://www.youtube.com/watch?v=20HHrsvLvZg&t=1643",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "20HHrsvLvZg",
      "timestamp": 1711.760009765625,
      "text": "given to us, when we understand this gift of God, which is eternal life, we ought to lift our voice and praise him and thank him. 2 Corinthians 9 and verse 15 said, but thanks be to God for his unspeakable gift. I'm thanking him and I'm praising him. Why? Because I understand that he's given me this gift. I couldn't earn it, I couldn't work for it, I'm without hope, I'm dead in my sins and my trespasses. I am hopeless and I am helpless, but God in his grace and his mercy, he says, I have a gift for you. And what's my gift back to him? I praise him. I praise him. Consider Hebrews 13. Turn over there if you will and consider Hebrews 13 and what the word of God says with regard to our praise for our God. We of course could go to the book of Psalms and we could read many passages of Scripture in the book of Psalms with regard to our praise and lifting our voice and praising our God and the fact that he is worthy of our praise. And here in Hebrews 13 and verse number 15, the Bible speaks here about the praise of his people. By him, therefore, let us offer the sacrifice of praise to God. How often? Continually. That is the fruit of our lips giving thanks to his name. He is worthy of our praise.",
      "context": "...d this gift of God, which is eternal life, we ought to lift our voice and praise him and thank him. 2 Corinthians 9 and verse 15 said, but thanks be to God for his unspeakable gift. I'm thanking him and I'm praising...",
      "sermon_title": "Sermon 20HHrsvLvZg",
      "url": "https://www.youtube.com/watch?v=20HHrsvLvZg&t=1711",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}