{
  "reference": "2 Corinthians 10",
  "occurrences": [
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 1551.6999816894531,
      "text": "your spirit, which are God's. Let me just point out a few things this morning. When we think about this recognition, we've reviewed and we recognize, well, what is it, preacher, that I should review? Number one, we should review what I read. What I read. What am I reading? What am I putting into my mind? The first three that I have in my notes this morning, what I read, what I watch, and what I listen to. The reason why I have those three in my list this morning that I believe the Lord led me to those three things to begin with is because we must recognize this morning how those three things affect my thoughts. What I read, what I watch, and what I listen to. The reality this morning is that when we begin to use the Word of God and we think about what He tells us with regard to our thought life and we understand how that these three areas will impact my thinking, we find that Paul says this to the believers in Philippi in Philippians 4 and verse number eight, finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report, if there be any virtue and if there be any praise, think on these things. In 2 Corinthians 10 and verse number five, he says that we're to bring into captivity",
      "context": "...gs are of good report, if there be any virtue and if there be any praise, think on these things. In 2 Corinthians 10 and verse number five, he says that we're to bring into captivity",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=1551",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 1621.8999633789062,
      "text": "honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report, if there be any virtue and if there be any praise, think on these things. In 2 Corinthians 10 and verse number five, he says that we're to bring into captivity every thought to the obedience of Christ. How's my thought life being impacted by what I'm reading? How's my thought life being impacted by what I'm watching? The psalmist said, I will set no wicked thing before mine eyes. How's my thought life being impacted by the things I listen to? You ever been in a situation where you get into somebody's car and they turn off the music real quick? They must have some level of understanding that what they had been listening to probably isn't good for your presence. What about God's presence? I'm thankful this morning that our God is omnipotent. He has all power. I'm thankful this morning that our God is omniscient, that He knows all things. And I'm thankful this morning that our God is omnipresent, that He is everywhere present. And that truth of God's omnipresence is a comforting truth. I will never leave thee nor forsake thee. I am with thee. It's also a convicting truth. He's always with us. If it wouldn't be appropriate if God were sitting next to you physically, bodily to hear, read, or watch something, then you ought not be doing it. Amen? It's very simple.",
      "context": "...gs are of good report, if there be any virtue and if there be any praise, think on these things. In 2 Corinthians 10 and verse number five, he says that we're to bring into captivity every thought to the obedience of...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=1621",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}