{
  "reference": "2 Corinthians 3",
  "occurrences": [
    {
      "sermon_id": "nKp-m3cnElM",
      "timestamp": 89.66000366210938,
      "text": "what it's there for. And we find that in chapter number 3 he's talking about the glory of the ministry, that we see, yes, the law, the letter, it killeth, but the spirit, grace, it gives life. And this was temporary, but this is permanent, and we have been given. Notice he says, therefore, seeing we have this ministry. And oh, what a ministry it is, and how glorious it is to know the truth of the word of God. This ministry that Paul is referring to is the one that gives life. It's the one that he refers to in 2 Corinthians 3 as the ministration of righteousness. And we talked about chapter 5 and verse 21, how God made Jesus to be sin for us who knew no sin, that we might be made the righteousness of God in Him. It's the ministry that excels in glory. And again, I can almost hear the excitement in the voice of the apostle Paul as he says, Therefore, seeing we have this ministry, notice, as we have received mercy, we faint not, but have renounced the hidden things of dishonesty, not walking in craftiness, nor handling the word of God deceitfully, but by manifestation of the truth, commending ourselves to every man's conscience in the sight of God. But if our gospel be hid, it is hid to them that are lost, in whom the God of this world",
      "context": "...is ministry that Paul is referring to is the one that gives life. It's the one that he refers to in 2 Corinthians 3 as the ministration of righteousness. And we talked about chapter 5 and verse 21, how God made Jesu...",
      "sermon_title": "\"This Treasure In Earthen Vessels\"  II Corinthians 4:1-7",
      "url": "https://www.youtube.com/watch?v=nKp-m3cnElM&t=89",
      "channel": "Unknown",
      "publish_date": 20250216
    },
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "timestamp": 1283.0800247192383,
      "text": "he was commanded. And so we find that verse 35, and the children of Israel saw the face of Moses, that the skin of Moses' face shone, and Moses put the veil upon his face again until he went in to speak with him. It's important to recognize that Moses, his face did not shine until the day of his death. It was a fading glory. He really, as you look at 2 Corinthians 3, it seems as if Paul, again, the idea and the teaching of progressive revelation, that Paul is helping us understand something about Exodus 34 that we may not find contextually, specifically there at the first read, but it seems as if Moses is putting this veil on because this glory would fade. And as the glory would fade, it would not be visible to the other people, the children of Israel, that the glory was fading, but it was representative of the fact, as we talk about the law specifically, which glory was to be done away. We find that, again, the law has purpose. Look at Romans chapter number seven. The law condemns, but understand this morning that we cannot throw the law out just because the law condemns, because there is a purpose. God, he doeth all things well. He has a perfect plan. He is the eternal God. He is the one that knows the end from the beginning, and he gave the law and he gave it with purpose.",
      "context": "...his face did not shine until the day of his death. It was a fading glory. He really, as you look at 2 Corinthians 3, it seems as if Paul, again, the idea and the teaching of progressive revelation, that Paul is help...",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E&t=1283",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "timestamp": 1810.6599922180176,
      "text": "lamb had to be sacrificed in order to provide the covering of skin, blood was shed, you think about the situation. with Abraham and Isaac, and God said, I will provide myself a lamb, a substitute. We find that you look at the Passover and you go over and over, and it's blood and it's blood and it's blood. Why? Because it pointed to Messiah, who would one day come and shed his precious blood for the sin of the world. The law. Paul says very plainly in 2 Corinthians 3, it condemns. It's temporary, has a fading glory. It had a purpose. But we find this morning that the law condemns. The contrast, I told you, that's found in 2 Corinthians 3, as you turn back there throughout the chapters, there's this contrast between law and grace. Law and grace. The letter killeth, but the spirit giveth life. And we find that this chapter provides this contrast, and if we were to look at the passage, we would say, number one, this morning, that the law condemns, but number two this morning, the gospel converts. What is the gospel? Well, Paul answers that question in 1 Corinthians 15, verses three and four. It's the death, burial, and resurrection. In that passage, he says repeatedly, according to the scriptures. And I love that he uses that phraseology, why? Because he's referring to the Old Testament scriptures. He's saying he died according to the scriptures.",
      "context": "...e day come and shed his precious blood for the sin of the world. The law. Paul says very plainly in 2 Corinthians 3, it condemns. It's temporary, has a fading glory. It had a purpose. But we find this morning that t...",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E&t=1810",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "timestamp": 2912.6199951171875,
      "text": "we all, with open face, beholding as in a glass the glory of the Lord are changed into the same image from glory to glory, even as by the spirit of the Lord. Who was allowed on the Mount in Exodus chapter 34? Moses alone, no other man, just Moses. But here we find that we all, if you're saved this morning, you have direct access to God. If you're saved this morning, you can spend as much time with God as you want. And really, I believe that what is being revealed to us in verse 18 is the truth of sanctification, that we're to be conformed to the image of Christ, to the Romans 8, 29 talks about being conformed to the image of his dear son, of the Lord Jesus Christ, and we find that we're changed from glory to glory. As it says there in verse number 18, and that's through spending time with the Lord, being in his presence, as Moses was in his presence and it was evidenced in his life, so too as we are in the presence of our Savior, that it's evidenced in our lives, that process of sanctification. And here's the truth this morning. As we look at this contrast between the law and grace and looking at 2 Corinthians 3 and all that God gives us, I want you to understand this morning that according to Galatians 3 and verse 24,",
      "context": "...here's the truth this morning. As we look at this contrast between the law and grace and looking at 2 Corinthians 3 and all that God gives us, I want you to understand this morning that according to Galatians 3 and ...",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E&t=2912",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "timestamp": 2975.8999633789062,
      "text": "our lives, that process of sanctification. And here's the truth this morning. As we look at this contrast between the law and grace and looking at 2 Corinthians 3 and all that God gives us, I want you to understand this morning that according to Galatians 3 and verse 24, we read it a moment ago, the law brings us to Christ. But according to 2 Corinthians 3 and verse 18, grace makes us like Christ. I want you to think about that just for a moment as we close this morning. The law, the purpose of the law is to bring us to Christ. It condemns. Life cannot come. cannot do, it is weak. But it points us, it's the schoolmaster to bring us to Christ. How did you know you were a sinner? Well, Paul says in Romans 7, I had not known sin except for the law said, thou shalt not covet. But as we trust Christ as our Savior, it is the grace of God that makes us like Christ. And what a glorious truth that is. They were called Christians first in Antioch. Why? Because they were like Christ. This morning, if you're not saved, if you don't know for sure that heaven is your home, today is the day of salvation. Do not delay. Trust Christ today. He said that whosoever shall call upon the name of the Lord shall be saved. The gospel converts. He said, I've been trying to keep the law.",
      "context": "...here's the truth this morning. As we look at this contrast between the law and grace and looking at 2 Corinthians 3 and all that God gives us, I want you to understand this morning that according to Galatians 3 and ...",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E&t=2975",
      "channel": "Unknown",
      "publish_date": 20250211
    }
  ]
}