{
  "reference": "2 Peter 1",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 173.02000427246094,
      "text": "promise is only as good as the person who makes it. The character of the promiser is what gives the promise its value. Now think about that. The character of the promiser, the one who's making the promises, the character of that individual is what gives the promise its value. Now we mentioned here that Peter says in 2 Peter 1 and verse number 4, whereby are given unto us exceeding great and precious promises. The thought continues and says, the promises of God are meant to ignite faith, expectation and desire, and then to point us to him. And you think about the way that the promises of God should ignite faith in us and expectation and should cause us to draw closer to him. His promises act to bind our hearts to his. The song says, every promise of the book is mine. And what a blessing to think about the many promises that are contained within the Word of God. Numbers 23 and verse number 19 tells us that God is not a man that he should lie. I'm so thankful that our God is faithful. He's trustworthy. He's dependable. He is truth. And he's given us many, many promises. And these promises are indeed exceeding great and precious. This evening I have a list of 15 promises that I want to give you. And the list is not exhaustive. You can go and you can find many, many promises within the Word of God.",
      "context": "...er of that individual is what gives the promise its value. Now we mentioned here that Peter says in 2 Peter 1 and verse number 4, whereby are given unto us exceeding great and precious promises. The thought co...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=173",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1770.52001953125,
      "text": "He's working in us, how we learn more of who He is and what He's able to do, what a joy. Say, thank you, Lord. Thank you, Lord, for your work in my life. Let me say this, number nine, He provides for us. I'm so thankful for His provision. This evening, I'm not simply speaking of any sort of monetary provision, though we could understand that to be the case. But I want you to notice back in Ephesians 1, if you will, and I want you to see what the Word of God says here with regard to the provision in which my mind is thinking of this evening. We'll mention briefly Philippians 4 as He speaks about that monetary blessing. But notice here in Ephesians 1, the Bible says this in verse number three. Ephesians 1 and verse number three. Blessed be the God and Father of our Lord Jesus Christ, notice this, who hath blessed us with all spiritual blessings in heavenly places in Christ. And you think about the provision, the spiritual provision. You think about this. You couple that verse with 2 Peter 1 and verse number 3, and we read that just a few moments ago by way of introduction, but in 2 Peter 1 and verse number 3, the Bible says this, according as His divine power, notice what it says, hath given unto us all things that pertain unto life and godliness through the knowledge of Him",
      "context": "...hink about the provision, the spiritual provision. You think about this. You couple that verse with 2 Peter 1 and verse number 3, and we read that just a few moments ago by way of introduction, but in 2 Peter ...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1770",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1842.7600173950195,
      "text": "read that just a few moments ago by way of introduction, but in 2 Peter 1 and verse number 3, the Bible says this, according as His divine power, notice what it says, hath given unto us all things that pertain unto life and godliness through the knowledge of Him that hath called us to glory and virtue. I'm thankful for the provision of God, the spiritual provision. I'm thankful that God has provided us with the Word of God. I'm thankful that God has given us the Spirit of God who is our divine teacher. I'm thankful that God in His wisdom has blessed us with spiritual teachers and instructors, and He's equipped the church with pastors and teachers. Why? Because that's the way that God is providing for us spiritually. What a joy! What a blessing! In Philippians 4, we notice here in this portion of Scripture that Paul is communicating with these believers, and he's rejoicing in the goodness of God and the provision of God and how God used this church at Philippi to help in His time of need. He says this in v. 15, Now ye Philippians know also that in the beginning of the Gospel when I departed from Macedonia, no church communed it with me as concerning giving and receiving, but ye only. He's commending them for that. He says, for even in Thessalonica, ye sent once and again unto my necessity. They were mindful of the opportunity",
      "context": "read that just a few moments ago by way of introduction, but in 2 Peter 1 and verse number 3, the Bible says this, according as His divine power, notice what it says, hath g...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1842",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1994.780014038086,
      "text": "care of. And He will supply. If you're reading our daily devotional, you read about that individual that gave that gold piece. And he gave that gold piece. And man, he got back, I think it was 12, and then there were two more, so he got 14 for one. And he gave it to that widow. And the widow said, I'm gonna pray for you. I'm gonna pray God's blessing. And he got 14 pieces of gold. He had given one. He thought, this is wonderful. And then he found out just a short time later that there was an estate that was left, and they left, I think it was 512 or something like that pieces of gold. Huh. You can't outgive God. And we can rejoice in God's provision monetarily, and we ought to rejoice in His provision and the way that He takes care of us and how good He's been to us. But I want you to think this evening of how He's provided for us spiritually as we mentioned in Ephesians 1 and in 2 Peter 1. He has given us all things that pertain unto life and godliness. And I'm so thankful for that. And I hope that you'd be thankful for that promise. He's promised that He has given us those things. Let me say this. As we think about our Christian life, He has promised that our labor is not in vain. Our labor is not in vain, number 10.",
      "context": "...to think this evening of how He's provided for us spiritually as we mentioned in Ephesians 1 and in 2 Peter 1. He has given us all things that pertain unto life and godliness. And I'm so thankful for that. And...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1994",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1725.5999755859375,
      "text": "with corruptible things as silver and gold from your vain conversation received by tradition from your fathers. Nope, no silver, no gold could redeem mankind, but, verse 19, with the precious blood of Christ, as of a lamb without blemish and without spot, who verily was foreordained before the foundation of the world, but was manifest in these last times, notice that phrase, for you, for you, who by him do believe in God that raised him up from the dead and gave him glory that your faith and hope might be in God, seeing you have purified your souls and obeying the truth through the spirit unto unfeigned love of the brethren, see that you love one another with a pure heart fervently, notice this in verse 23, being born again not of corruptible seed but of incorruptible, by the word of God which liveth and abideth forever. In 2 Peter 1 and verse number 4, notice what he says here with regard to this truth of redemption and being born again. He says this in 2 Peter 1 and verse number 4, whereby are given unto us exceeding great and precious promises that by these ye might be partakers, notice this, of the divine nature, having escaped the corruption that is in the world through lust. And as we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3 because we're born of God, his seed remaineth in us.",
      "context": "...t of corruptible seed but of incorruptible, by the word of God which liveth and abideth forever. In 2 Peter 1 and verse number 4, notice what he says here with regard to this truth of redemption and being born...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1725",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}