{
  "reference": "2 Thessalonians 3",
  "occurrences": [
    {
      "sermon_id": "0lpK3XY3NtI",
      "timestamp": 229.17999267578125,
      "text": "and here's the title for the lesson tonight, how to avoid growing weary. How to avoid growing weary. I think each of us could acknowledge this evening that it's possible to grow weary. It's possible, as we go through life, to grow weary. It's possible when we are doing right or doing that which is appropriate, as we find in this text of scripture, and yet there are others that are not, that it can become difficult for us, and so we find that the charge is given, the encouragement, but ye, brethren, be not weary in well-doing. As we take this thought from 2 Thessalonians 3, and of course, having the whole canon of scripture, I believe that as we look and compare scripture that there are at least three things this evening that if we would keep in mind that it would help us as we live life to avoid growing weary. Now, I'm sure that you could add things. I could add things. The list is not exhaustive this evening, but three quick thoughts for our Bible study tonight. Number one, if you're taking notes, remember who you serve. Remember who you serve. See, the reality this evening is that it is absolutely necessary. I'd say it's imperative that we remain focused on the one we serve. We serve the Lord Christ, the Lord Jesus Christ, our Savior. He is the one that we serve, and when our focus is on the fact that we're serving Christ,",
      "context": "...iven, the encouragement, but ye, brethren, be not weary in well-doing. As we take this thought from 2 Thessalonians 3, and of course, having the whole canon of scripture, I believe that as we look and compare scriptur...",
      "sermon_title": "Sermon 0lpK3XY3NtI",
      "url": "https://www.youtube.com/watch?v=0lpK3XY3NtI&t=229",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "0lpK3XY3NtI",
      "timestamp": 1070.6000061035156,
      "text": "must rely on his power. Number three, I would say this. If we're going to avoid growing weary, we must rest in his promise. What promise is that? Well, turn to the book of Galatians, if you will. We see that as the book of Galatians comes to an end, that here in the sixth chapter of the book of Galatians, God gives us a truth that is very similar to the truth that we see in 2 Thessalonians 3 in verse 13. But ye brethren, and he says be not weary in well doing. As we come to Galatians chapter six and beginning in verse number seven, the Bible says this, be not deceived. God is not mocked. For whatsoever a man soweth, that shall he also reap. Now, I admit to you this evening that oftentimes when we look at the truth of Galatians six and verse seven, many times we deal with it from a perspective of the negative. But the reality is that the text of scripture deals with it from both a negative and a positive perspective. If you sow bad seed, you're gonna reap bad harvest. If you sow good seed, you're gonna have a good harvest. And we see that in verse number eight, notice he says, for he that soweth to his flesh shall of the flesh reap corruption. But he that soweth to the spirit shall of the spirit reap life everlasting.",
      "context": "...ter of the book of Galatians, God gives us a truth that is very similar to the truth that we see in 2 Thessalonians 3 in verse 13. But ye brethren, and he says be not weary in well doing. As we come to Galatians chapt...",
      "sermon_title": "Sermon 0lpK3XY3NtI",
      "url": "https://www.youtube.com/watch?v=0lpK3XY3NtI&t=1070",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 410.739990234375,
      "text": "by the hand of me, Paul. Now note, it's important that we see what he's saying here and why he's mentioning this. Many scholars believe and theologians that Paul had a terrible situation with his eyesight that probably was a result of the bright light in Acts chapter number nine. And we find that he had a problem with his eyesight and therefore, though the Lord would use the apostle Paul to write many of the books of the New Testament, someone else, he would dictate that to them and someone else would actually be the scribe, if you will. But Paul would always write the salutation with his own hand. Notice what the Bible says over in 2 Thessalonians. Hold your hand here in Colossians 4 and look in 2 Thessalonians 3. I only mention this just to encourage us this morning to understand the importance of why Paul is making this statement in verse number 18. Here to the believers in Thessalonica now understand something by way of background that he, Paul, ministered to these believers in Thessalonica. He had ministered there for a short period of time. They were a faithful church. But just like what happened in Colossian, which continues to happen even still to this day, there are false teachers that creep in. And here in the city of Thessalonica, what was happening is someone wrote a letter and sent it to the believers to the church in Thessalonica",
      "context": "...Notice what the Bible says over in 2 Thessalonians. Hold your hand here in Colossians 4 and look in 2 Thessalonians 3. I only mention this just to encourage us this morning to understand the importance of why Paul is ...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=410",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}