{
  "reference": "Acts 11",
  "occurrences": [
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1448.739974975586,
      "text": "to understand that there are many that have fulfilled their course, that have fulfilled their ministry. I want to give you just a few examples from the New Testament here this morning. In Acts chapter number 12, in verse number 25, go over to the book of Acts, we'll look at a few verses of Scripture in the book of Acts, and just give you a few examples this morning of this cloud of witnesses. In Acts chapter number 12, in verse number 25, the Bible says this, in verse 24, But the word of God grew and multiplied, and Barnabas and Saul returned from Jerusalem, Notice this phrase in verse number 25, When they had fulfilled their ministry, and took with them John, whose surname was Mark. What did they do? They fulfilled their ministry. It says that, and Barnabas and Saul returned from Jerusalem when they had fulfilled their ministry. And what a blessing to understand, if you look back in chapter number 11, and really beginning in verse number 22, all the way through the end of the passage of Scripture, you'll have the understanding of what that ministry was. It says in verse 22 of Acts 11, Then tidings of these things came unto the ears of the church which was in Jerusalem, and they sent forth Barnabas, that he should go as far as Antioch. And it says,",
      "context": "...ssage of Scripture, you'll have the understanding of what that ministry was. It says in verse 22 of Acts 11, Then tidings of these things came unto the ears of the church which was in Jerusalem, and they sen...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1448",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1511.8999938964844,
      "text": "Scripture, you'll have the understanding of what that ministry was. It says in verse 22 of Acts 11, Then tidings of these things came unto the ears of the church which was in Jerusalem, and they sent forth Barnabas, that he should go as far as Antioch. And it says, Who, when he came, and had seen the grace of God, was glad, and exhorted them all, that with purpose and heart they would cleave unto the Lord. For he was a good man, and full of the Holy Ghost, and of faith, and much people was added unto the Lord. Then departed Barnabas to Tarsus. Why? For to seek Saul. And when he had found him, he brought him unto Antioch, and it came to pass that a whole year they assembled themselves with the church, and taught much people, and the disciples were called Christians first in Antioch. And they're serving God, and they're ministering in this young church that we read of in chapter number 13 that becomes the sending church for the first missionary team. Saul, of course we know Paul, Paul and Barnabas are there, and they fulfilled their ministry. They were given a responsibility at the end of the text of Scripture to provide relief for the brethren that dwelt in Judea. And it tells us in verse 30, which also they did and sent it to the elders by the hands of Barnabas and Saul.",
      "context": "Scripture, you'll have the understanding of what that ministry was. It says in verse 22 of Acts 11, Then tidings of these things came unto the ears of the church which was in Jerusalem, and they sen...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1511",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}