{
  "reference": "Acts 9",
  "occurrences": [
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1430.5400085449219,
      "text": "with blood, and without shedding of blood is no remission. And we find this miracle of reconciliation. See, Paul, as he's writing to the believers in Corinth, and he comes to this section that we're studying this morning in 2 Corinthians chapter number 5, he's speaking about this miracle of reconciliation. Consider how he says in verse number 17, therefore if any man be in Christ, that's being saved, being born again, understanding that there's only one way to be saved, and that's through the blood of Jesus Christ. It says, He is a new creature. Old things are passed away, behold all things are become new. You see that in the life of the Apostle Paul, don't you? We read the portion in Acts 9 at his conversion. He's going out and he's seeking to persecute, he's making havoc of the church, and then he's saved and he begins to preach Christ. There's a change in his life. There is a miracle that had taken place. It's the miracle of the new birth, the miracle of reconciliation. Let me share with you one other passage of Scripture in the book of Ephesians, if you will. Turn over there and look at a few verses of Scripture in Ephesians chapter number 2, and find here how the Apostle Paul deals with the subject of reconciliation to the believers in Ephesus. Remember, if any man be in Christ",
      "context": "...ngs are become new. You see that in the life of the Apostle Paul, don't you? We read the portion in Acts 9 at his conversion. He's going out and he's seeking to persecute, he's making havoc of the church, a...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1430",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2468.080009460449,
      "text": "God because of my sin, but now that relationship has been restored. I've been reconciled. It's a miracle. But not only did he recognize the miracle of reconciliation, I believe that Paul embraced the ministry of reconciliation. Why do we say that? Traces steps. Everywhere he goes, he's preaching Christ. Everywhere he goes, he's calling people to accept the Lord Jesus Christ as their personal Savior. When he stood there before Agrippa, and Agrippa is there and he hears the message, and in that particular passage of Scripture, we find that Paul, once again, shared his testimony of what we looked at in Acts 9 of his conversion, and he shared for those that were there, Agrippa in particular, that day in his life when he was saved. That Agrippa says, almost thou persuadest me to be a Christian. And Paul said, I would to God that not only thou, but also all that hear me this day were both almost and altogether such as I am, accept these bonds. We find that in Acts, that Paul often, excuse me, in the book of Romans, that Paul often mentions his heart's desire. You find that he says in chapter 10, in verse number 1, brethren, my heart's desire and prayer to God for Israel is that they might be saved. See, Paul embraced this ministry of reconciliation. After our first point, I kind of addressed those that maybe had never trusted the Lord Jesus Christ as their personal Savior.",
      "context": "...r passage of Scripture, we find that Paul, once again, shared his testimony of what we looked at in Acts 9 of his conversion, and he shared for those that were there, Agrippa in particular, that day in his ...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2468",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}