{
  "reference": "Acts 23",
  "occurrences": [
    {
      "sermon_id": "othOg-hLUps",
      "timestamp": 727.5800170898438,
      "text": "had as he got along with God that there was something that he should have done or could have changed or had to make right. No, he had a clear conscience. In fact, in verse 23, he said, moreover, I call God for a record upon my soul that to spare you, I came not as yet unto Corinth. Hold your place here in the book of 2 Corinthians and turn to the book of Acts, if you will, just for a moment. I want you to look at Acts 23 and 24. I want to note two verses of scripture that are so important as we begin to consider the apostle Paul and how he lived his life and how he desired to have a conscience that was a pure conscience. We find that in Acts 23 and verse number one, notice what Paul says as he's standing here and giving account here before the religious leaders, the Sanhedrin, the Bible says in verse one of Acts 23, and Paul earnestly beholding the council said, men and brethren, I have lived in all good conscience before God until this day. That's a powerful statement that the apostle Paul is able to make as he stands before this religious body and begins to give an account. And he says that, that he's lived in all good conscience before God until this day.",
      "context": "...f 2 Corinthians and turn to the book of Acts, if you will, just for a moment. I want you to look at Acts 23 and 24. I want to note two verses of scripture that are so important as we begin to consider the ap...",
      "sermon_title": "\"When You Are Misunderstood\" II Corinthians 1:12-2:4",
      "url": "https://www.youtube.com/watch?v=othOg-hLUps&t=727",
      "channel": "Unknown",
      "publish_date": 20250112
    },
    {
      "sermon_id": "Mxme6byM7mw",
      "timestamp": 1254.5799865722656,
      "text": "rose up and came into the city, and the next day he departed with Barnabas to Derbe. And it's very interesting because he goes now to Derbe and notice in verse 21 that the Bible says, and when they had preached the gospel to that city and had taught many, they returned again to Lystra and to Iconium and Antioch. And he went back to the very cities in which he had faced the persecution. He had boldness and he had courage and he was walking with the Lord and pleasing the Lord. And we find that Paul says, listen, I've experienced some difficulty. I've experienced some persecution and some affliction. And Timothy, you know that, you fully are aware of what I have experienced. And Paul is sharing that experience. We could look this morning at a variety of passages. Let me just use one more in Acts 23 and let me show you here what's happening in Acts 23. In fact, this is a portion of scripture that causes me to laugh often as I look at the situation that's unfolding here in Acts 23 and how God worked so miraculously. But we find the beginning in verse number 11, the Bible says in the night following, the Lord stood by him and said, be of good cheer, Paul, for as thou hast testified of me in Jerusalem, so must thou bear witness also at Rome. By the way, that right there",
      "context": "...g that experience. We could look this morning at a variety of passages. Let me just use one more in Acts 23 and let me show you here what's happening in Acts 23. In fact, this is a portion of scripture that ...",
      "sermon_title": "\"Preparation For Persecution\" II Timothy 3:10-12",
      "url": "https://www.youtube.com/watch?v=Mxme6byM7mw&t=1254",
      "channel": "Unknown",
      "publish_date": 20241110
    }
  ]
}