{
  "reference": "Acts 10",
  "occurrences": [
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 1372.2000122070312,
      "text": "by the grace of God. And the Holy Spirit fell on them. \"'And they of the circumcision.'\" Now who are those? Those are the Jewish people that accompanied Peter on this journey. It says, \"'And they of the circumcision which believed were astonished.'\" \"'As many as came with Peter.'\" Why? \"'Because then on the Gentiles also was poured out the gift of the Holy Ghost.'\" But how did they know? Somebody can tell you, I have the Holy Ghost. How do you know? Now Ephesians reveals to us as now having the whole canon of Scripture. But remember, at this point in Acts 10, at the point in 1 Corinthians, Ephesians hasn't been written yet. Ephesians chapter 5 reveals to us when the Bible says, \"'But be not drunk with wine, where it is in excess, but be filled with the Spirit, speaking to yourselves.'\" It gives us what the evidence of being Spirit-filled is. But here, why were these Jewish people astonished that on the Gentiles, the Holy Ghost, the gift of the Holy Ghost was poured upon them? How did they know that? Verse 46, \"'For they.'\" Who's they? That's the circumcision, the Jewish people. \"'They heard them speak with tongues and magnify God.'\" So God allowed those Gentile believers to speak in tongues to show the evidence that they too had been saved, that they received the Holy Spirit. Are we tracking? Now, in verse 47, \"'Can any man forbid water, that these should not be baptized,",
      "context": "... Ephesians reveals to us as now having the whole canon of Scripture. But remember, at this point in Acts 10, at the point in 1 Corinthians, Ephesians hasn't been written yet. Ephesians chapter 5 reveals to u...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=1372",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 2043.2000122070312,
      "text": "to be saved. There's not many ways that lead to heaven. There's not just be sincere about what you believe and everything's going to work out. No, there's one way. Jesus said, I am the way, the truth and the life. No man cometh unto the father, but by me. Verse 10, now therefore, why tempt ye God to put a yoke upon the neck of the disciples, which neither our fathers nor we were able to bear? But we believe that through the grace of the Lord Jesus Christ, we shall be saved even as they. Hallelujah. But understand that in Acts 10 and 11 and 15, that in each of these passages of scripture, we see the purpose of tongues and how it gave evidence that these Gentiles were saved. So here's what happens. Oftentimes, people say, okay, well, then you have to speak in tongues if you get saved. That's the evidence of being saved. No, no, no. Back up. Hold on just a minute. It happened in the book of Acts. But understand that there were many people that got saved in the book of Acts that never spoke in tongues. So you can study through the book of Acts. We don't have time this evening. It's already 6.50. We don't have time this evening. But you can study through the book of Acts and you can read of other people that trusted Christ as their Savior that did not speak in tongues. Were they saved?",
      "context": "... grace of the Lord Jesus Christ, we shall be saved even as they. Hallelujah. But understand that in Acts 10 and 11 and 15, that in each of these passages of scripture, we see the purpose of tongues and how i...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=2043",
      "channel": "Unknown",
      "publish_date": 20240902
    }
  ]
}