{
  "reference": "Acts 25",
  "occurrences": [
    {
      "sermon_id": "Mxme6byM7mw",
      "timestamp": 1644.6999816894531,
      "text": "world today do not have that perspective that death is gain. Many people in our world today actually fear dying because they have no idea, they have no assurance or confidence what will happen when they die. They have the fear of death that the book of Hebrews speaks of, but I'm thankful that my God conquered sin, death, and the grave. He's alive forevermore, and he's given to us the deliverance from the fear of death. And we find that Paul says that I suffered these things, I experienced great difficulty, but I want you to know, Timothy, that not only did I experience difficulty, but I experienced deliverance. I'm thankful for the full picture that God gives us in this passage of Scripture. I'm thankful for the examples that God has given us in his word that we can go to and that we can see how God delivered his people. It's interesting, in Acts 25, if you look at verses one through four, that you see another, a miraculous situation where the apostle Paul was dealing with people that were trying to persuade those in authority to cause Paul to come in order that he might be killed. And in Acts chapter 25, it was Festus that came, and the Bible says that he ascended from Caesarea to Jerusalem in verse number one of Acts 25. And so if you get in your mind's eye, what he did is he left Caesarea and he went to Jerusalem.",
      "context": "...n his word that we can go to and that we can see how God delivered his people. It's interesting, in Acts 25, if you look at verses one through four, that you see another, a miraculous situation where the apo...",
      "sermon_title": "\"Preparation For Persecution\" II Timothy 3:10-12",
      "url": "https://www.youtube.com/watch?v=Mxme6byM7mw&t=1644",
      "channel": "Unknown",
      "publish_date": 20241110
    },
    {
      "sermon_id": "Mxme6byM7mw",
      "timestamp": 1711.6399841308594,
      "text": "killed. And in Acts chapter 25, it was Festus that came, and the Bible says that he ascended from Caesarea to Jerusalem in verse number one of Acts 25. And so if you get in your mind's eye, what he did is he left Caesarea and he went to Jerusalem. He took this journey to go there from his place in Caesarea to go to Jerusalem. And so the high priest and the chief of the Jews informed him against Paul and besought him. Here's what they desired for him to do. They desired that they would bring Paul to Jerusalem. Why? So that they would have opportunity to kill him. You know what Festus says? No, I'll go back to Caesarea and I'll hear him there. You read in verse number four. And this is amazing to me. What's so amazing to me is that this man, Festus, just left Caesarea to go to Jerusalem, and then it would have been much more convenient for him to simply have Paul come from Caesarea to Jerusalem to hear him there. By the way, those that would bring the charges against Paul were already in Jerusalem, and it would have been much more convenient. But guess what? My God was at work. And God moved in the heart of Festus to say, no, I'm gonna go back up there to Caesarea. And if you guys wanna bring accusation against him, if you wanna come for the trial,",
      "context": "...us that came, and the Bible says that he ascended from Caesarea to Jerusalem in verse number one of Acts 25. And so if you get in your mind's eye, what he did is he left Caesarea and he went to Jerusalem. He...",
      "sermon_title": "\"Preparation For Persecution\" II Timothy 3:10-12",
      "url": "https://www.youtube.com/watch?v=Mxme6byM7mw&t=1711",
      "channel": "Unknown",
      "publish_date": 20241110
    }
  ]
}