{
  "reference": "Acts 4",
  "occurrences": [
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 2221.4200134277344,
      "text": "adversity, when we know that we've been falsely accused, when we know that it's been kind of stacked against us so to speak, how can we be faithful? Can we be faithful? Absolutely. We can be faithful. And we must have our inner man renewed day by day. I believe that what Paul is referring here, referring to in this passage of Scripture with the inward man being renewed day by day, is that personal walk with God. That spiritual strength that comes from being with the Lord. I want you to think about two passages. We're going to look at one in the book of Acts and then one in the book of Ephesians as we close this evening. But I want to remind you of Acts chapter number 4. And in this passage of Scripture, we looked at Acts 5 this morning. But in Acts chapter number 4, again, the religious leaders are not happy with all that's taken place and the miracle of the healing of the lame man in chapter number 3 and all of the results of that. And we find that the Bible tells us that they were inquiring, they were questioning, interrogating if you will. Peter stands up and John is there. And we find that Peter begins to speak and he makes that great declaration in Acts 4 in verse 12, neither is there salvation in any other for there's",
      "context": "...up and John is there. And we find that Peter begins to speak and he makes that great declaration in Acts 4 in verse 12, neither is there salvation in any other for there's",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=2221",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 2279.540008544922,
      "text": "Bible tells us that they were inquiring, they were questioning, interrogating if you will. Peter stands up and John is there. And we find that Peter begins to speak and he makes that great declaration in Acts 4 in verse 12, neither is there salvation in any other for there's none other name under heaven given among men whereby we must be saved. And I want you to think about the strength, spiritual strength of Peter to stand up in the face of this adversity and this opposition and make this bold proclamation with regard to their continuing and following the Lord. And the Bible says that they saw the boldness of Peter and John in verse number 13. These religious leaders, they saw, it was evident that the boldness, and it says that they perceived that they were unlearned and ignorant men, they marveled. And they noticed this as they took knowledge of them that they had been with Jesus. They'd been with Jesus. And so when they're spending time with the Lord Jesus Christ, their inward man is being strengthened and they have that spiritual strength that in the face of that adversity, when those religious leaders are saying, listen, you cannot do this. You cannot speak in this name. We're going to do this to you. If you continue, we find that Peter is able to stand up with boldness. Why? Because he's been with Jesus. He's have, he has that spiritual",
      "context": "...up and John is there. And we find that Peter begins to speak and he makes that great declaration in Acts 4 in verse 12, neither is there salvation in any other for there's none other name under heaven given...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=2279",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 2531.240005493164,
      "text": "words come out of Peter's mouth, silver and gold have I none. What disappointment that man might have had in that moment. Why? Because that's what he was looking for. But such as I have, give I thee in the name of Jesus Christ of Nazareth, rise up and walk. He got a whole lot more than he was looking for. Amen? And the Bible tells us that he gets up, man, he's leaping and praising God. He goes into the temple. It's amazing what happens. You come to Acts chapter number four. And there's a big stir and a big controversy. Because the religious leaders of the day, the Sadducees and the Pharisees and the Sanhedrin, they don't like what's taking place. They don't like all these people getting saved and all these things happening. And they're not profiting the way they'd like to profit. And they call these men into question. Peter stands and he says, if we be questioned on this day of the miracle that took place. And he goes through and he says, look, it's not in our power, it's not in my name. It's in the name of Jesus. And he says this, and there's no other name under heaven given among men whereby ye must be saved. The boldness. They didn't like it. If you read the very next verse, I believe it's Acts 4.13, it says that they perceived that they were ignorant and unlearned men.",
      "context": "...e must be saved. The boldness. They didn't like it. If you read the very next verse, I believe it's Acts 4.13, it says that they perceived that they were ignorant and unlearned men.",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=2531",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 2601.6800079345703,
      "text": "Jesus. And he says this, and there's no other name under heaven given among men whereby ye must be saved. The boldness. They didn't like it. If you read the very next verse, I believe it's Acts 4.13, it says that they perceived that they were ignorant and unlearned men. But that they had been with Jesus. Is that what it says? I closed my Bible, that's what it says, right? They perceived they were ignorant and unlearned men, but they had been with Jesus. Does anyone know that we've been with Jesus? Seriously. You look at Abraham and Abimelech says, God is with thee in all that thou doest. Therefore, I need to make a covenant with you. I need to have a peace treaty. And we see at the end of the passage, the priority of Abraham that is the key to the observation that is made in the beginning of our text this evening. Why is it that Abimelech perceived? Why is it that he observed that God is with thee in all that thou doest? Because Abraham made a priority to worship God. And when we make a priority to worship God, when we spend time with Jesus, when we take and we protect that time, when we say nothing's gonna interrupt this time, I'm going to spend time with God, it's gonna make a difference. And people will perceive you've been with Jesus. And God works, and God does amazing things.",
      "context": "...e must be saved. The boldness. They didn't like it. If you read the very next verse, I believe it's Acts 4.13, it says that they perceived that they were ignorant and unlearned men. But that they had been w...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=2601",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}