{
  "reference": "Acts 20",
  "occurrences": [
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2673.6799926757812,
      "text": "elders, turn over to the book of 2nd Timothy, if you will, and I'm going to read to you a portion from Acts chapter number 20. You're in 2nd Timothy chapter number 4. I'm going to meet you there in just a moment. But in Acts chapter number 20, the Apostle Paul is speaking to these church leaders from Ephesus. He's beginning to sharing with these men some of the things in which he dealt with. He speaks about the bonds and afflictions that abide him. And in verse 24 he says, \"...but none of these things move me, neither count I my life dear unto myself, so that I might finish my course with joy, and the ministry which I have received of the Lord Jesus to testify the gospel of the grace of God.\" It's a great desire that the Apostle Paul has that he expresses to the leaders of the church at Ephesus in Acts 20 and verse 24. This morning perhaps each of us could stand and say, I want to finish my course with joy. Can I tell you, that's a good intention. There's some things you need to do in order to come to that place. And as the Apostle Paul had that desire and expressed that desire, it led him to do certain things in his life that brought him to the place where you are in 2nd Timothy chapter number 4, where he's now writing knowing that he soon would die.",
      "context": "...great desire that the Apostle Paul has that he expresses to the leaders of the church at Ephesus in Acts 20 and verse 24. This morning perhaps each of us could stand and say, I want to finish my course with ...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2673",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2757.3800048828125,
      "text": "to that place. And as the Apostle Paul had that desire and expressed that desire, it led him to do certain things in his life that brought him to the place where you are in 2nd Timothy chapter number 4, where he's now writing knowing that he soon would die. And he's able to say this, \"...for I am now ready to be offered, and the time of my departure is at hand.\" Verse 7 of 2nd Timothy 4, \"...I have fought a good fight, I have finished my course, I have kept the faith.\" I submit to you this morning that when Paul says this in 2nd Timothy chapter number 2, if we notice what is being said, we would conclude it didn't happen on accident. It didn't happen by chance that he finished the course. There were some things that he did, because he mentions all the way back in Acts 20, when he's speaking to those leaders in the church at Ephesus, \"...I want to finish my course with joy.\" You could study the life and ministry of the Apostle Paul, and you can see various things that he did along the way, and some difficulties in which he endured, and no doubt as he endured great affliction. And he mentions this, he says that \"...we're troubled on every side, yet not distressed. We're perplexed, but not in despair. Persecuted, but not forsaken. Cast down, but not destroyed.\" You know what he",
      "context": "...he finished the course. There were some things that he did, because he mentions all the way back in Acts 20, when he's speaking to those leaders in the church at Ephesus, \"...I want to finish my course with ...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2757",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2200.5799560546875,
      "text": "happen by chance or by accident. I'm convinced of that this morning. We're not just going to skate through life and just come to the place where we say like Paul said, I have fought a good fight. I have finished my course. It's not going to happen by accident. We better plan and we better purpose to fulfill our ministry. Let me give you four practical ways this morning that as we close out the book of Colossians, that as we look at the charge from Archippus that we could also fulfill our ministry. Look in Acts 20 and verse 24 and then we'll give you the four thoughts this morning on how it is that we can fulfill our ministry. I mentioned that it's not going to happen by accident. It's not going to happen by chance. Paul in 2 Timothy 4 gives us that great declaration of finishing, but in Acts 20 before he arrives in Jerusalem when he stops and speaks to the leaders of the church at Ephesus, notice what Paul says in Acts 20 in verse 24, but none of these things move me. Neither count I my life dear unto myself, notice what he says, so that I might finish my course with joy. And the ministry which I have received of the Lord Jesus to testify the gospel of the grace of God. Isn't that so familiar to what we've read at the end of Colossians in the 17th verse",
      "context": "...ians, that as we look at the charge from Archippus that we could also fulfill our ministry. Look in Acts 20 and verse 24 and then we'll give you the four thoughts this morning on how it is that we can fulfil...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2200",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2428.3600273132324,
      "text": "a vision, be not afraid but speak and hold not thy peace. For I am with thee and no man shall set on thee to hurt thee for I have much people in this city. You know what Jesus said when he gave the Great Commission as it's recorded in Matthew chapter 28? The last words in lo I am with you always, right? He's with us and Paul receives encouragement because of this opposition and Corinth he goes and he's preaching the gospel and God says the Lord says be not afraid but speak and hold not thy peace. Be not afraid and speak. He says I am with thee. What a precious promise of the Word of God. Turn over another couple of pages if you will and look at Acts 20. I want you to notice what Paul says here in Acts 20. He's here speaking to the leaders of the church at Ephesus. We think about the passion of Paul to give the truth of the gospel. Notice what he says in verse 20 and 21. And how I kept back nothing that was profitable unto you but have showed you and have taught you publicly and from house to house testifying both to the Jews and also to the Greeks repentance toward God and faith toward our Lord Jesus Christ. Skip down in verse number 31 if you will. Therefore watch",
      "context": "...at a precious promise of the Word of God. Turn over another couple of pages if you will and look at Acts 20. I want you to notice what Paul says here in Acts 20. He's here speaking to the leaders of the chur...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2428",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}