{
  "reference": "Acts 2",
  "occurrences": [
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 2851.1400451660156,
      "text": "can be manufactured. What do I mean by that? Well, someone can stand up and say they're speaking in tongues and you don't know if they are or not. But no one's walking around healing somebody without you knowing whether they were healed. Am I right? No one's drinking poison without you knowing if that poison affected them or not. People trying to handle snakes, crazy people trying to handle snakes outside of their mind. They're not shaking it off like Paul did. What happened when he shook that beast off, that serpent? They went from saying he was a murderer to saying he was a God. And you know what that allowed him to do? Preach the gospel and those people got saved. That was the purpose of the... Paul wasn't walking around playing with snakes and letting them bite him and showing that he's immune to it. No, it was a sign to confirm the word. Amen. And so tongues so often today can be manufactured in people looking at the fact that, oh, I spoke in tongues and some elevation of a position of being spirit-filled or otherwise, and you don't know if they are or are not. But you know one thing that's interesting about speaking of tongues in the Bible? It was always a known language. It was a known language. Every man heard them in Acts 2 in his own tongue. That's why they marveled.",
      "context": "...gues in the Bible? It was always a known language. It was a known language. Every man heard them in Acts 2 in his own tongue. That's why they marveled.",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=2851",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 2920.8800048828125,
      "text": "and you don't know if they are or are not. But you know one thing that's interesting about speaking of tongues in the Bible? It was always a known language. It was a known language. Every man heard them in Acts 2 in his own tongue. That's why they marveled. How is it that all of us are hearing in our own tongue? We're gonna go to Panama in two weeks. I don't speak but about 20 words of Spanish. I'm gonna need an interpreter. Why? Because I don't speak the language. I'm not gonna hear them in my language. They're not gonna hear me in their language. We're gonna need an interpreter. This evening, we see the answer to the question, but I say tonight as well, it's so awesome that in the plan of God, he allowed for this sign gift of tongues to be given so that the Jewish people would know that the Gentile people were saved the same way. We sang to start the service this evening since Jesus came into my heart. I hope you know tonight that you're saved, that you know for sure that heaven is your home, that you understand that you're a sinner. There's only one savior. His name is Jesus. For all have sinned and come short of the glory of God. I mentioned that on Saturday, this upcoming week will be 27 years since I trusted Christ as my savior.",
      "context": "...gues in the Bible? It was always a known language. It was a known language. Every man heard them in Acts 2 in his own tongue. That's why they marveled. How is it that all of us are hearing in our own tongue...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=2920",
      "channel": "Unknown",
      "publish_date": 20240902
    }
  ]
}