{
  "reference": "Acts 1",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 1287.1800384521484,
      "text": "From the top to the bottom. See, remember, as we would look at the shadow of the Old Testament, we think about the tabernacle, and then even into the temple, and you would think about that holy of holies. Yes, there was the outer court that had the brazen altar, and had the laver, but you would come to the holy place, that there you would find that much of the ministry would take place, but then that was separated from the holy of holies that could only be entered on that one day a year, the day of atonement. And you find that that veil that separated the holy place from the holy of holies, that it was rent in twain, showing that now access was available. We'll deal with that as we get into chapters 9 and 10 in more detail, but we understand that when Jesus died on the cross of Calvary, He paid, He was our substitute, and then He rose from the dead. Acts 1 as well as Luke 24 record for us the ascension of Jesus Christ, and the Bible tells us in verse 2 that He is a minister of the sanctuary and of the true tabernacle which the Lord pitched, and not man. We've read some of these verses already, but you notice as I repeat in Hebrews 4 and verse number 14, the Bible says, seeing then that we have a great high priest that is passed into the heavens.",
      "context": "...Jesus died on the cross of Calvary, He paid, He was our substitute, and then He rose from the dead. Acts 1 as well as Luke 24 record for us the ascension of Jesus Christ, and the Bible tells us in verse 2 t...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=1287",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 876.7200317382812,
      "text": "and neither can you. You know what's so frustrating is when we try, when we try to live the Christian life in our own power, in our own strength, and we try to live it in our own flesh, and it's frustrating, but He promised that He would empower us. We find in Acts 1.8 as He says to the disciples as they're there after they had heard this great commission and before they would go, of course, to the ascension and then wait for the promise of the Father. We find that Jesus says, but you shall receive power after the Holy Ghost has come upon you. I'm thankful for the empowering of Christ. I'm thankful that He's promised to empower us, that it's not in my flesh. Remember, Paul said, I know that in me that is in my flesh dwelleth no good thing. For to will is present. But then how do we accomplish that, right? Oh, woe is me, oh wretched man that I am. And we find here that He's promised to empower us that we're to be filled with the Spirit of God. Ephesians 5 and verse number 18, be not drunk with wine wherein is excess, but be filled with the Spirit of God. And we understand that importance of daily being filled with His Spirit. The Bible says in Galatians 5, walk in the Spirit, and ye shall not fulfill the lust of the flesh.",
      "context": "...ive it in our own flesh, and it's frustrating, but He promised that He would empower us. We find in Acts 1.8 as He says to the disciples as they're there after they had heard this great commission and befor...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=876",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}