{
  "reference": "Acts 15",
  "occurrences": [
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "timestamp": 296.3399963378906,
      "text": "recommendation in your lives are the testimony that we need. But we get into the text, and we find that Paul begins to unfold for us and help us understand that the law condemns. We find that as the apostle Paul is writing again to these individuals that are being influenced and impacted by these false teachers, these Judaizers as they've come to be known, where they're seeking to mingle law and grace. Okay, fine, you can have that, but you've got to have this as well. And you find that in Acts chapter number 15, there's much discourse that is given to us in Acts 15 with regard to the council at Jerusalem. And what were they saying? Well, unless you're circumcised after the manner of Moses, you cannot be saved. This is mingling grace and law, and we find that after much deliberation that they concluded in Acts chapter number 15 that everyone is saved the same way. What is that way? It's Jesus. I am the way, the truth, and the life. No man cometh unto the Father but by me. We're all saved by grace through faith. You can't be saved by your works. You can't be saved by keeping the law. You can't be saved by being baptized, taking some kind of communion. There's no other way. It's the blood of the Lord Jesus Christ. And what he did on the cross of Calvary, his substitutionary death and his glorious",
      "context": "...as well. And you find that in Acts chapter number 15, there's much discourse that is given to us in Acts 15 with regard to the council at Jerusalem. And what were they saying? Well, unless you're circumcised...",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E&t=296",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "timestamp": 361.5799865722656,
      "text": "by your works. You can't be saved by keeping the law. You can't be saved by being baptized, taking some kind of communion. There's no other way. It's the blood of the Lord Jesus Christ. And what he did on the cross of Calvary, his substitutionary death and his glorious resurrection is the only way that mankind can get to heaven. And we find that it's declared this way in Acts 15 and verse number 11, but we believe that through the grace of the Lord Jesus Christ, we shall be saved even as they. What a great declaration. What a great truth. We go forth and we seek to share the gospel with individuals because we understand that the law condemns. We understand there's one way to get to heaven and Jesus is that way. And we find that as we look at this portion of scripture and we see that the law condemns, we read in verse number six already, he says, the letter killeth. When he's speaking about the letter, he's referring to the law. We see that contextually, we'll get through the verses and you'll find how that he specifically goes back to Moses in the book of Exodus and receiving the law and all that takes place. And we find that he says, the letter killeth, but notice, he says, the spirit giveth life. But as we deal with the subject of the law condemning, we see in verse six, the letter killeth.",
      "context": "...rrection is the only way that mankind can get to heaven. And we find that it's declared this way in Acts 15 and verse number 11, but we believe that through the grace of the Lord Jesus Christ, we shall be sa...",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E&t=361",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "HyiDXKZbWS8",
      "timestamp": 2420.7000007629395,
      "text": "But we understand, listen, when you and I use that term saved, we understand what we mean by that. If someone were to ask me, are you saved? And I say, yes, I'm saved. I'm answering that question understanding that I was lost on my way to a Christless eternity. I was helpless and I was hopeless. I was dead spiritually in my sins. And I was in need of the only savior, the Lord Jesus Christ. The Bible says that Jesus said, \"'I am the way, the truth, and the life. \"'No man cometh unto the Father but by me.' \"'Peter proclaims, there's no other name under heaven, \"'given among men, whereby we must be saved.' \"'Sirs, what must I do to be saved?' \"'Believe on the Lord Jesus Christ, \"'and thou shalt be saved, and thy house.'\" Listen, the word saved is a Bible word. You know what happens in Acts 15? There's these that are going out and saying, hey, they cannot be saved, it's the word they use, except they be circumcised after the manner of Moses. No, no, no, no, that's false, that's false teaching. You read Acts chapter 15, there's a council that assembles, there's a debate that ensues, and we find that they get it straight. And in fact, they stand in Acts 15 and they make this declaration. What a great declaration they make. In verse number 11, \"'For we believe that through the grace",
      "context": "...u shalt be saved, and thy house.'\" Listen, the word saved is a Bible word. You know what happens in Acts 15? There's these that are going out and saying, hey, they cannot be saved, it's the word they use, ex...",
      "sermon_title": "\"Perilous Times\" II Timothy 3:1-9",
      "url": "https://www.youtube.com/watch?v=HyiDXKZbWS8&t=2420",
      "channel": "Unknown",
      "publish_date": 20241104
    },
    {
      "sermon_id": "HyiDXKZbWS8",
      "timestamp": 2490.6600036621094,
      "text": "chapter 15, there's a council that assembles, there's a debate that ensues, and we find that they get it straight. And in fact, they stand in Acts 15 and they make this declaration. What a great declaration they make. In verse number 11, \"'For we believe that through the grace \"'of the Lord Jesus Christ, we shall be saved even as they.'\" Praise the Lord, they got it right. They were false teachers. They were dealt with, they were exposed. But you know that there are some that would use the same word, but they mean something different by it. They mean maybe that they were baptized as an infant. They mean maybe that they did some religious exercise of whatever level it had to be. Maybe it's that they partook of the Lord's Supper. And they think that by doing those things that they're saved. No, that's not what the Bible teaches about salvation. And so we find that there are those that would stand and they would profess to be the apostles of Christ, but we find that the Bible says that they're deceitful workers. They're false apostles. Everything must be lined up with the truth of this book. We find in 1 John that the Bible says, try the spirits. How do we do that? Well, we take their message and look at what God has given us. We're Bereans and we search the scriptures and we say if these things are so.",
      "context": "...es, there's a debate that ensues, and we find that they get it straight. And in fact, they stand in Acts 15 and they make this declaration. What a great declaration they make. In verse number 11, \"'For we be...",
      "sermon_title": "\"Perilous Times\" II Timothy 3:1-9",
      "url": "https://www.youtube.com/watch?v=HyiDXKZbWS8&t=2490",
      "channel": "Unknown",
      "publish_date": 20241104
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 1922.6000137329102,
      "text": "died in vain. And she said, not a bit. No way. I said, and he died so that you could be saved. He died so that I could, because being baptized isn't going to save me. Being circumcised isn't going to save these people. This was, these were the Judaizers. So what happens, verse two, when therefore Paul and Barnabas had no small dissension and disputation with them is a big deal. They determined that Paul and Barnabas and certain other of them should go up to Jerusalem and to the apostles and elders about this question. So they, they convened this, this council and they're going to answer the question. These guys are running around saying you got to be circumcised after the matter of Moses or you cannot be saved. And this is not true biblically. And I mean, that's a big deal. So what happens? Well, Peter stands up and he makes some comments. Notice with me in verse number eight, I'll back up in verse number seven. And when there had been much disputing, Peter rose up and said unto them, men and brethren, we know how that a good while ago God made choice among us that the Gentiles by my mouth shall hear the word of the gospel and believe. What is Peter referring to in Acts 15 in verse eight, seven? He's referring to what we just read in the life of Cornelius. It's exactly what he's referring to.",
      "context": "...e Gentiles by my mouth shall hear the word of the gospel and believe. What is Peter referring to in Acts 15 in verse eight, seven? He's referring to what we just read in the life of Cornelius. It's exactly w...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=1922",
      "channel": "Unknown",
      "publish_date": 20240902
    },
    {
      "sermon_id": "XmrMnXINE5Q",
      "timestamp": 1979.6000061035156,
      "text": "God made choice among us that the Gentiles by my mouth shall hear the word of the gospel and believe. What is Peter referring to in Acts 15 in verse eight, seven? He's referring to what we just read in the life of Cornelius. It's exactly what he's referring to. He says that God determined, made choice among us that the Gentiles by my mouth should hear the word of the gospel and believe. So Peter is standing after much disputation or disputing takes place and he says, listen, we all know what happened. God sent me to the house of Cornelius and they believed, notice in verse eight, in God, which knoweth the hearts, bear them witness, giving them the Holy Ghost, even as he did unto us. How do we know that he gave them the Holy Ghost? They spoke in tongues. It was a sign for the Jews. So it says in verse number nine, and put no difference between us and them, purifying their hearts by faith. By the way, I'm thankful there's no difference between us and them. There's only one way to be saved and it's Jesus. There's only one way to be saved. There's not many ways that lead to heaven. There's not just be sincere about what you believe and everything's going to work out. No, there's one way. Jesus said, I am the way, the truth and the life. No man cometh unto the father, but by me.",
      "context": "...e Gentiles by my mouth shall hear the word of the gospel and believe. What is Peter referring to in Acts 15 in verse eight, seven? He's referring to what we just read in the life of Cornelius. It's exactly w...",
      "sermon_title": "\"Tongues Shall Cease\" I Corinthians 13:8",
      "url": "https://www.youtube.com/watch?v=XmrMnXINE5Q&t=1979",
      "channel": "Unknown",
      "publish_date": 20240902
    }
  ]
}