{
  "reference": "Acts 19",
  "occurrences": [
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 1651.4200134277344,
      "text": "greet that one and so on and so forth, grace and peace and mercy and so on. John says, under the inspiration of the Holy Spirit of God, little children, keep yourselves from idols. Amen. Wow. You know, John is writing from Ephesus. That's where he's writing this book from. And I want you to think about Ephesus being a center of idol worship. We understand that Paul went into Ephesus and people were saved, a church was established at Ephesus. In fact, that church is written to in the book of Revelation, those seven letters that are written back to the churches, the church at Ephesus being the first of those. But we find that in Ephesus, it was a place of idol worship and Acts chapter number 19, you don't need to turn there. I just want to read two verses to you that describe for us the scene of idolatry in the city of Ephesus. In Acts 19 and verse number 28, they pronounce this. They say, when they heard these sayings, they were full of wrath and cried out saying, great is Diana of the Ephesians. And then a few verses later in verse number 34, it says, but when they knew that he was a Jew, all with one voice, about the space of two hours, cried out, great is Diana of the Ephesians. I don't know if you've ever really meditated upon that verse in Acts 19 and verse 34, but",
      "context": "...ant to read two verses to you that describe for us the scene of idolatry in the city of Ephesus. In Acts 19 and verse number 28, they pronounce this. They say, when they heard these sayings, they were full o...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=1651",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 1713.1000366210938,
      "text": "verse number 34, it says, but when they knew that he was a Jew, all with one voice, about the space of two hours, cried out, great is Diana of the Ephesians. I don't know if you've ever really meditated upon that verse in Acts 19 and verse 34, but I spent some time this week meditating upon that. Two hours is a long time. And the Bible says in verse 34 that for the space of two hours, all with one voice, cried out, great is Diana of the Ephesians. Wow. The idolatry that was present there in Ephesus and Paul writing from the city of Ephesus, no doubt, obviously under the inspiration of the Holy Spirit of God, this danger of idols. This morning, idolatry in our world looks different than it looked in John's world. Idolatry here in our community looks different than it does in some places around the globe. There are some places around the globe that when you talk about idolatry, you actually see little figurines and you see little idols and incense being burned to these images and so on and so forth. And that would be very consistent with much of what you see of idolatry in the Old Testament and even that which you would see in Ephesus. But idolatry truly is anything that would take the place of God. Anything in your life or my life that would take that first place.",
      "context": "...t, great is Diana of the Ephesians. I don't know if you've ever really meditated upon that verse in Acts 19 and verse 34, but I spent some time this week meditating upon that. Two hours is a long time. And t...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=1713",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}