{
  "reference": "Acts 6",
  "occurrences": [
    {
      "sermon_id": "AZytGOf3GPA",
      "timestamp": 2394.06005859375,
      "text": "have qualified men to be a deacon, that you leave the office vacant. It would be better to have the office vacant than to fill the office with someone who's not qualified, amen? And we find here this morning, it's very similar, in Acts chapter number 6, hold your place here in 1 Timothy, but turn back to Acts 6 if you will, and we find that in Acts chapter number 6, there's a situation. that happens. Now, the word deacon is not used here. There are some that would argue over Acts chapter number 6, whether it's the first deacons or not. But as we look at Acts chapter number 6, it fits the context of understanding the responsibility in the office of a deacon. And we look here in Acts chapter number 6. I've often said over the years, and it's a good rule of practice, that you do not build doctrine from the book of Acts. The book of Acts is a transitional book, okay? And in the early church in the first century, there was a lot of transition that's taking place. You don't necessarily build doctrine from the book of Acts, but as the Bible is continuing to be written and the instruction is given to the local church, such as we find in 1 Timothy, as we're studying through this book, we can go back to the book of Acts and see, as the instruction is provided and doctrine",
      "context": "...g, it's very similar, in Acts chapter number 6, hold your place here in 1 Timothy, but turn back to Acts 6 if you will, and we find that in Acts chapter number 6, there's a situation. that happens. Now, the...",
      "sermon_title": "\"Behavior In God's Church - Part 2\" I Timothy 3:1-15",
      "url": "https://www.youtube.com/watch?v=AZytGOf3GPA&t=2394",
      "channel": "Unknown",
      "publish_date": 20240422
    },
    {
      "sermon_id": "AZytGOf3GPA",
      "timestamp": 2447.2600440979004,
      "text": "Acts, but as the Bible is continuing to be written and the instruction is given to the local church, such as we find in 1 Timothy, as we're studying through this book, we can go back to the book of Acts and see, as the instruction is provided and doctrine is being built, how it's applied in the book of Acts. In Acts 6, it says, and in those days, in verse number 1, and in those days when the number of the disciples was multiplied, by the way, the church was growing, praise the Lord for that, there arose a murmuring of the Grecians against the Hebrews. You know what? When a church grows, sometimes there are problems. Hallelujah. You ever hear somebody say, growing pains? It happens. You know why? Because not everyone that's going to be added to a church is going to come from the same background that you've came from. Listen, it's a good thing when people visit church that are lost. Amen? Not everybody that walks through that door is going to look like you and talk like you and sound like you, but they need the truth of the gospel. They need a church family, a church home. Amen? It says, because their widows were neglected of the daily ministration, then the twelve called the multitude of the disciples unto them and said, it is not reason that we should leave the word of God and serve tables. It wasn't",
      "context": "...s the instruction is provided and doctrine is being built, how it's applied in the book of Acts. In Acts 6, it says, and in those days, in verse number 1, and in those days when the number of the disciples ...",
      "sermon_title": "\"Behavior In God's Church - Part 2\" I Timothy 3:1-15",
      "url": "https://www.youtube.com/watch?v=AZytGOf3GPA&t=2447",
      "channel": "Unknown",
      "publish_date": 20240422
    }
  ]
}