{
  "reference": "Amos 2",
  "occurrences": [
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 814.6199798583984,
      "text": "somehow avoid judgment. They think that somehow it's not gonna come to them. No, no, the Bible says that righteousness exalteth a nation, but sin is a reproach to any people. And we find that our God is righteous, but sin brings reproach. We find in the book of Amos, would you turn to the book of Amos with me this evening, and Hosea, Joel, Amos, Obadiah, Jonah, just so you have an idea of where it is, one preacher as he was going to a minor prophet, he says it's just after Genesis and just before Revelation, and that helps a whole lot, does it not? And so we find Amos, a prophet of God, and we read this book of Amos, and we find that primarily that Amos is prophesying to the nation of Israel, the 10 tribes of the north. That's the primary focus of his ministry, of his prophecy. But in Amos 1.1 through Amos 2.8, we see that in rapid succession, a number of regions and peoples are described. I do not have the time this evening to develop all that is contained in Amos 1 and 2, and really, obviously, studying through the whole book of Amos is a profitable study, but I want you to notice what the Bible says in the verse number one. It says, the words of Amos, who was among the herdmen of Tekoa, which he saw concerning Israel in the days of Uzziah, king of Judah.",
      "context": "...es of the north. That's the primary focus of his ministry, of his prophecy. But in Amos 1.1 through Amos 2.8, we see that in rapid succession, a number of regions and peoples are described. I do not have th...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=814",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 1956.5199584960938,
      "text": "Lord of lords.\" Listen, he's coming back and he is going to execute righteous judgment. But I would submit to you this evening that each of those nations that we looked at, each of those people groups that we referenced in Amos 1 and in the first eight verses of Amos 2, they all received judgment before the Lord came back. And what I would submit to you this evening is that I understand that God will come back. At the end of the seven-year tribulation period, He will come back and execute righteous judgment. But I would submit to you this evening that there are plenty of folks that are judged before that time period comes. And again, America is ripe for judgment. It breaks my heart to say that, it honestly does. But we find that God is righteous. Number two, sin is a reproach. Sin brings reproach. Number three, if you're taking notes, repentance is required. Repentance is required. What's the answer? When you look at the wickedness of a people group, when you look at the announcement of judgment, what is the answer? How do you spare judgment? How do you avoid the judgment? How is it that we can come to the place where we acknowledge the fact that God Almighty is righteous and that sin brings reproach, and we'd say this evening that as we look at our beloved nation, that yes, our nation, because of the wickedness, because of the",
      "context": "...ooked at, each of those people groups that we referenced in Amos 1 and in the first eight verses of Amos 2, they all received judgment before the Lord came back. And what I would submit to you this evening ...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=1956",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}