{
  "reference": "Colossians 3",
  "occurrences": [
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 1580.8800048828125,
      "text": "like what God had provided for them. They're eating manna and they're saying, my soul loatheth, I hate this manna. We have nothing to eat. God miraculously was providing this. They were complaining and complaining and complaining. Complaining is the result of discontent. We find that we must learn contentment. Paul continues and says, I know both how to be abased and I know how to abound. Everywhere and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. God knows what we need, doesn't He? And He's capable of providing for us. You remember that familiar Psalm, Psalm 23, the Lord is my shepherd. What does He say? I shall not want. I shall not want. The Lord is a good shepherd, amen? He provides for us. And what a blessing. We must learn contentment. I would say this, we must seek the Lord Jesus Christ. Notice in Colossians 3, we studied this portion of Scripture last year as we studied through the book of Colossians, but these first few verses of Colossians 3 are so powerful. When the Bible says this, if you then be risen with Christ, seek those things which are above. Where Christ sitteth on the right hand of God, set your affection on things above, not on things of the earth. And as I do this, as I understand that I'm in the world but I'm not of the world, when",
      "context": "...lessing. We must learn contentment. I would say this, we must seek the Lord Jesus Christ. Notice in Colossians 3, we studied this portion of Scripture last year as we studied through the book of Colossians, but t...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=1580",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 0.0,
      "text": "started last Sunday morning. Last Sunday morning we're in Colossians 3 and we're looking at verses 5-7. This morning we'll be looking at verses 8-9 and of course as we noted last week we said that Paul understood the danger of the flesh and therefore he provided the believers in Colossians. Of course we have the word of God preserved for us this morning and therefore for us as well with direct and detailed instruction. We find that in this particular section that we'll begin studying this morning and really we'll look at it next week as well, that we find that the Apostle Paul begins this section in instructing the believers to put off and put on. And you'll notice the terminology that is being used in the portion of Scripture and we of course would understand that Paul really is relating to something that each of us are very familiar with. The reality is that we wear garments and our garments get dirty. And when our garments get dirty, what do we do? We put them off. We take them off, they need to be laundered, they need to be cleaned, and then we put on some clean garments. And as Paul would use that analogy if you will, something that would be very familiar to us, we find that as believers we have been changed. Amen? I mean listen, we're not what we used to be. Some of y'all need to sing again this morning. Amen? Some",
      "context": "started last Sunday morning. Last Sunday morning we're in Colossians 3 and we're looking at verses 5-7. This morning we'll be looking at verses 8-9 and of course as we no...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 490.67999267578125,
      "text": "portion of Scripture in which we're looking at this morning has got some sister passages. I'm not going to read them, but perhaps you want to jot these down in your notes. Galatians 5, verses 19-21, in that portion of Scripture, God details what the works of the flesh are. They're manifested in this way, and you find a long, detailed list of how the works of the flesh are manifested, and you'll see that in Galatians 5, verses 19-21. But then also in Ephesians chapter number 4, verses 17-32. In Ephesians 4, verses 17-32, again Paul will use the same terminology, similar terminology, as he uses here in Galatians, Colossians 3, with regard to put off and put on. And that passage of Scripture would be a great help to you. I believe that as we think about this passage that is before us and those sister passages that I mentioned before just a moment ago, I believe that really this is the outworking of the truth that Peter gives in 1 Peter chapter number 1. If you want to hold your place there in Colossians, let me just read a few verses to you in 1 Peter chapter number 1, and then we'll jump right back over there to Colossians chapter number 3 and deal with this portion of Scripture. We find here that in 1 Peter chapter number 1, in verse number 13, notice what Peter says,",
      "context": "...17-32, again Paul will use the same terminology, similar terminology, as he uses here in Galatians, Colossians 3, with regard to put off and put on. And that passage of Scripture would be a great help to you. I b...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=490",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 625.3200302124023,
      "text": "not fashioning yourselves according to the former lust and your ignorance, but as He which hath called you is holy. Aren't you thankful that God is holy? The psalmist says that we're to give thanks, the remembrance of His holiness, and we serve a God that is holy, holy, holy. And the Bible says that as He which hath called you is holy, so be ye holy in all manner of conversation because it is written, be holy for I am holy. Again, in this portion of Scripture in Colossians 3, even as we noted last week in verses 5 through 7, again in verses 8 and 9, we will find that Paul will continue to be very direct and very detailed. Notice the list with me, if you will. Beginning in Colossians 3 and verse number 8, the Bible says this, but now ye also put off all these, anger, wrath, malice, blasphemy, filthy communication out of your mouth. Lie not one to another, seeing that ye have put off the old man with his deeds. Put off all these. Let's look at the list that is provided to us, the detail. Of course, he was direct in saying, put off all these. He's detailed in providing us with this list. Notice number one that is given to us in verse number 8, anger, anger. Anger can be defined as an agitation of the soul. Anger is an emotion that we each deal with, amen?",
      "context": "...f conversation because it is written, be holy for I am holy. Again, in this portion of Scripture in Colossians 3, even as we noted last week in verses 5 through 7, again in verses 8 and 9, we will find that Paul ...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=625",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}