{
  "reference": "Colossians 2",
  "occurrences": [
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 420.739990234375,
      "text": "to have our eyes upon our Savior to look to Jesus The author and finish of our faith that we would lift up our eyes unto the hills from whence cometh our help Understanding and knowing with assurance that our help cometh from the Lord which made heaven and earth I'm so thankful for the truth of that theme and how it encouraged and strengthened and challenged me personally last year and this year complete in Christ complete in Christ in Colossians 2 in verse number 10 the Apostle Paul and we're going right in the middle of a Discussion that he's having with these believers in the in Colossi and the Bible says and ye are Complete in him which is the head of all principality and Power Lord willing and with the help of the Lord we will study through the book of Colossians this year We will not start this morning in Colossians 1, but we will Go through exegetically through the book of Colossians and study verse by verse But this morning we will consider this statement from this verse of Scripture as we will use it for our theme for this calendar year in 2021 we understand that as the Word of God says you're complete in him We've used as our theme complete in Christ The hymn is very obvious that it's Christ If you look back in verse number 5 the Bible says for though I be absent in the flesh",
      "context": "...hened and challenged me personally last year and this year complete in Christ complete in Christ in Colossians 2 in verse number 10 the Apostle Paul and we're going right in the middle of a Discussion that he's h...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=420",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1217.1199970245361,
      "text": "And so we find that these recipients of this book, if we were to understand this morning, the book of Colossians is being written to believers, is being written to those that have been born again, those that have been saved, and that is why the Apostle Paul is saying to them in Colossians 2 and verse number 10, and ye are complete in him. We understand what it means to be complete in him, and we understand why Paul would tell them that they are complete in him, is because they've been saved, they've been born again. Back in the book of Ephesians, as we've referenced Ephesians 2 and verse number 1, the fact that you were dead in your trespasses and sins, and you hath he quickened who were dead in your trespasses and sins. In Ephesians 2 and verse number 4, the Bible says, but God who is rich in mercy for his great love wherewith he loved us, even when we were dead in sins, hath quickened us together with Christ. By grace you're saved, and hath raised us up together and made us sit together in heavenly places in Christ Jesus, that in the ages to come he might show the exceeding riches of his grace and his kindness toward us through Christ Jesus. For by grace are you saved through faith, and that not of yourselves, but of the gift of God, not of works lest any man should boast.",
      "context": "... been born again, those that have been saved, and that is why the Apostle Paul is saying to them in Colossians 2 and verse number 10, and ye are complete in him. We understand what it means to be complete in him,...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1217",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1501.9199829101562,
      "text": "penalty for breaking the law of God. I understand that God in flesh, the Lord Jesus Christ, died for me. And I placed my faith and trust in the finished work of Christ at Calvary. And you were born again. You may not remember the exact date. I seek to encourage those that God has allowed me to minister to, and to lead them to a saving knowledge of the Lord and Savior Jesus Christ, to remember the date in which they trusted Christ, the date in which they were born again. I encourage people in that thought or that way because I was encouraged in that way. And so I remember that it was on August 31st, in the year 1997, when I placed my faith and trust in the finished work of Christ at Calvary. And I'm so thankful that on that day, I was made alive. So thankful that on that day, I was born again. And I didn't understand that that day on that moment, I didn't understand all that that meant. But I understand as I read the scriptures, and I understand that as we look specifically at this truth this morning, from this thought in Colossians 2, that I am complete in Him, in Christ. What a joy. What a blessing. This morning, if you say, I'm not complete. I've never trusted Jesus Christ as my personal Savior. I'm incomplete. Yes, we've been made body, soul, and spirit, but I've",
      "context": "...res, and I understand that as we look specifically at this truth this morning, from this thought in Colossians 2, that I am complete in Him, in Christ. What a joy. What a blessing. This morning, if you say, I'm n...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1501",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1574.8399963378906,
      "text": "morning, from this thought in Colossians 2, that I am complete in Him, in Christ. What a joy. What a blessing. This morning, if you say, I'm not complete. I've never trusted Jesus Christ as my personal Savior. I'm incomplete. Yes, we've been made body, soul, and spirit, but I've never been born again. I'm dead in my trespasses and sins. Can I tell you this morning that Jesus saves. We sing about it. We proclaim the message. In fact, as we preached and taught through the book of Hebrews, we're mindful of that truth in Hebrews 7, in verse number 25, where the Bible says, wherefore He is able also to save them to the uttermost that come unto God by Him, seeing He ever liveth to make intercession for them. He is the Savior of the world. We sang this morning, what a wonderful Savior, and He is. The songwriter said, He's a wonderful Savior to me. It's another song in our hymnal that we sing. He's a wonderful Savior to me, and as we think about the truth and the thought of these two great hymns of the faith, the reality is that I can say from a personal perspective that He, Jesus, is a wonderful Savior, and that He is my Savior. He's a wonderful Savior to me. This morning, if you can't say that, if you don't have that peace and that",
      "context": "morning, from this thought in Colossians 2, that I am complete in Him, in Christ. What a joy. What a blessing. This morning, if you say, I'm n...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1574",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1709.6000061035156,
      "text": "calendar year, and it will probably take us most of the year to get through the book, but as we find and as we will spend time at a later date studying in great detail the second chapter of the book of Colossians, I want you to notice how the second chapter of the book of Colossians begins. It says this in verse number one, for I would that ye knew what great conflict I have for you, and for them at Laodicea, and for as many as have not seen my face in the flesh. So Paul reveals to these believers that he's writing to in Colossians 2 in verse number one, that he has a great conflict for them and for the believers in Laodicea, as we find in verse number one, and he's not yet seen them. We'll mention that as we study through the book about the relationship between Paul and these believers and so on and so forth, but as we go through and begin to study the second chapter, and I'll just make a couple of statements this morning on understanding how this truth should impact you, how it would impact these believers in Colossae, I want you to understand that Paul is saying to them, as we've mentioned already in verse number six, notice in Colossians 2 in verse 6, as ye have therefore received Christ Jesus the Lord, so walk ye in him. We've often used",
      "context": "...y as have not seen my face in the flesh. So Paul reveals to these believers that he's writing to in Colossians 2 in verse number one, that he has a great conflict for them and for the believers in Laodicea, as we...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1709",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1771.1199951171875,
      "text": "it would impact these believers in Colossae, I want you to understand that Paul is saying to them, as we've mentioned already in verse number six, notice in Colossians 2 in verse 6, as ye have therefore received Christ Jesus the Lord, so walk ye in him. We've often used this verse of Scripture to say, listen, if you've been born again, if you've received Christ Jesus the Lord, you're to walk in him. In fact, as we studied through the book of Ephesians a couple of years ago in 2019, we had the opportunity to look at our position in Christ and then how that position in Christ impacts our walk with him. And of course, there in the book of Ephesians, there are several different aspects in which... Paul addresses the believers in Ephesus about their walk. And here in Colossians, he tells these believers, you've received Christ Jesus the Lord, so walk ye in Him. Notice what he says in verse 7. Rooted and built up in Him, and established in the faith as you have been taught, abounding therein with thanksgiving. And what a great picture of what the Christian life is supposed to look like. That we are rooted and built up in Him. That we are established in the faith. That we're not tossed to and fro with every wind of doctrine. That we're not easily influenced by the false teachers that are so prevalent in the day in which we live.",
      "context": "...o understand that Paul is saying to them, as we've mentioned already in verse number six, notice in Colossians 2 in verse 6, as ye have therefore received Christ Jesus the Lord, so walk ye in him. We've often use...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1771",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1999.8600006103516,
      "text": "pages of Scripture, God gives us some warnings. Could I tell you this morning that it's important that we take heed to the warnings that God gives us in His Word? And here's where we find really the impact of this truth. He says, beware, lest any man spoil you through philosophy and vain deceit. After the tradition of men, after the rudiments of the world, and not after Christ. Can I tell you, as we note here in this text of Scripture that these believers were being hit with philosophy and deceit and tradition, they're given this warning in v. 8. Beware, lest any man spoil you through these processes. And we'll study as we deal with Colossians 2 in greater detail at a future time. We'll discuss some of the things that were prevalent during this particular time in this particular region. Some of the false teaching that would be influential, possibly influential, in the lives of these individuals. And Paul is warning them under the inspiration of the Holy Spirit of God. And he's warning them, and then he's encouraging them. It says, for in Him dwelleth all the fullness of the Godhead bodily. In who? In Christ. Dwelleth all the fullness of the Godhead bodily. In other words, we don't have to look for anywhere else, anything else in Him in Christ. Dwelleth all the fullness of the Godhead bodily. And the continuation in v. 10, ye are complete in Him,",
      "context": "...ng in v. 8. Beware, lest any man spoil you through these processes. And we'll study as we deal with Colossians 2 in greater detail at a future time. We'll discuss some of the things that were prevalent during thi...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1999",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1441.3999786376953,
      "text": "portions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye that Satan begins to triumph, thinking he's won the victory. After he died and he was put in that borrowed tomb, they set a seal. Remember, they kept watch and they made it as sure as they could. But there was nothing that could keep them from rising and conquering sin, death, and the grave. He destroyed the works of the devil. And we understand as we look at this verse of Scripture and this truth that God is giving us with regard to the work that God did there at Calvary, and He's rendered this truth of destroying, it's rendered powerless. Notice what the Bible says, if you will, over in the book of Colossians in chapter number 2 and verse number 15 with regard to this truth of Christ destroying the works of the devil. In Colossians 2 and verse number 15, the Bible, I'll read verse 14 with it. Notice what He says here in verse number 14 of Colossians chapter number 2. He says this, blotting out the handwriting of ordinances that was against us, which was contrary to us, and took it out of the way, nailing it to His cross. And having spoiled principalities",
      "context": "...ber 2 and verse number 15 with regard to this truth of Christ destroying the works of the devil. In Colossians 2 and verse number 15, the Bible, I'll read verse 14 with it. Notice what He says here in verse numbe...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1441",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}