{
  "reference": "Colossians 1",
  "occurrences": [
    {
      "sermon_id": "zo6IdkJY-nY",
      "timestamp": 220.39999389648438,
      "text": "prayer is literally entering into the throne room of heaven, that we have an intercessor, that we have a mediator, that we can go to the throne of grace, and that we can receive help in time of need, that we can pray one for another. In fact, we are instructed to pray one for another. And as we look at these few words, these four simple words in Colossians 1 and verse number 3, we would find the subject matter of intercessory prayer. We speak about prayer and we understand the prayer promises. Maybe even on Wednesday evening when I sent out the prayer bulletin, I included a number of verses of Scripture this week in my email that I sent out. What a great privilege it is as a child of God to go before the throne room of heaven, to understand that God Almighty, the sovereign God of the universe, that He has extended an invitation that we would call upon Him, that He has promised that He would hear us, and that He is able to do exceeding abundantly above all that we ask or think. Begin to zero in specifically on the subject matter before us this morning, and think about the subject matter of intercessory prayer. We would find that intercessory prayer is the area of prayer, if I could use that terminology, when I seek the face of Almighty God on the behalf",
      "context": "...e instructed to pray one for another. And as we look at these few words, these four simple words in Colossians 1 and verse number 3, we would find the subject matter of intercessory prayer. We speak about prayer ...",
      "sermon_title": "Sermon zo6IdkJY-nY",
      "url": "https://www.youtube.com/watch?v=zo6IdkJY-nY&t=220",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "zo6IdkJY-nY",
      "timestamp": 368.32000732421875,
      "text": "doctrinally, that all Scripture is given by inspiration of God, but God did use human beings, and Paul is the human penman of this book. And so that's established in verse number one. In verse number two, the recipients is established to the saints and faithful brethren in Christ, which are at Colossae. So now when we come to verse number three, he says, we give thanks. Who's we? Well, according to verse number one, it would be Paul and Timotheus. We give thanks to God and the Father of our Lord Jesus Christ, praying always for you. So who's praying? Paul and Timotheus, and they're praying for who? To the saints, to the faithful brethren in Christ, which are at Colossae. And thus we understand the subject of intercessory prayer, as we would consider this morning the subject matter of intercessory prayer. If you're taking notes, I want you to consider, first of all, with me the example of intercessory prayer. The Bible is full of examples of intercessory prayer. We're going to kind of walk through the Scriptures this morning using Colossians 1 and verse number 3 as our springboard. I want you to go back to the book of Romans, if you will, and look in Romans in chapter number one. And as the Apostle Paul is addressing these believers in Rome, we find that he again would give them this encouraging word with regard to the subject of",
      "context": "...mples of intercessory prayer. We're going to kind of walk through the Scriptures this morning using Colossians 1 and verse number 3 as our springboard. I want you to go back to the book of Romans, if you will, an...",
      "sermon_title": "Sermon zo6IdkJY-nY",
      "url": "https://www.youtube.com/watch?v=zo6IdkJY-nY&t=368",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 420.739990234375,
      "text": "to have our eyes upon our Savior to look to Jesus The author and finish of our faith that we would lift up our eyes unto the hills from whence cometh our help Understanding and knowing with assurance that our help cometh from the Lord which made heaven and earth I'm so thankful for the truth of that theme and how it encouraged and strengthened and challenged me personally last year and this year complete in Christ complete in Christ in Colossians 2 in verse number 10 the Apostle Paul and we're going right in the middle of a Discussion that he's having with these believers in the in Colossi and the Bible says and ye are Complete in him which is the head of all principality and Power Lord willing and with the help of the Lord we will study through the book of Colossians this year We will not start this morning in Colossians 1, but we will Go through exegetically through the book of Colossians and study verse by verse But this morning we will consider this statement from this verse of Scripture as we will use it for our theme for this calendar year in 2021 we understand that as the Word of God says you're complete in him We've used as our theme complete in Christ The hymn is very obvious that it's Christ If you look back in verse number 5 the Bible says for though I be absent in the flesh",
      "context": "...f the Lord we will study through the book of Colossians this year We will not start this morning in Colossians 1, but we will Go through exegetically through the book of Colossians and study verse by verse But th...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=420",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1634.6799926757812,
      "text": "great hymns of the faith, the reality is that I can say from a personal perspective that He, Jesus, is a wonderful Savior, and that He is my Savior. He's a wonderful Savior to me. This morning, if you can't say that, if you don't have that peace and that confidence, can I tell you this morning that He wants to save you. He loves you, and He wants to save you, and you can be born again today. Would you trust Christ? We've asked two questions. Number one, what does it mean to be complete in Him? Number two, why did Paul tell them, these folks, these individuals in Colossae, that they were complete in Him? Because they had been born again. Finally, this morning I would ask this question, how should this truth impact you? How should this truth impact the believers in Colossae? Again, as we will throughout this calendar year study through the book of Colossians, beginning in Colossians 1.1 in our next message, and going all the way through the end of the fourth chapter, it's not a very long book, but we will make our way through the book of Colossians in this calendar year, and it will probably take us most of the year to get through the book, but as we find and as we will spend time at a later date studying in great detail the second chapter of the book of Colossians, I want you to notice how the",
      "context": "... Again, as we will throughout this calendar year study through the book of Colossians, beginning in Colossians 1.1 in our next message, and going all the way through the end of the fourth chapter, it's not a very...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1634",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}