{
  "reference": "Colossians 4",
  "occurrences": [
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 410.739990234375,
      "text": "by the hand of me, Paul. Now note, it's important that we see what he's saying here and why he's mentioning this. Many scholars believe and theologians that Paul had a terrible situation with his eyesight that probably was a result of the bright light in Acts chapter number nine. And we find that he had a problem with his eyesight and therefore, though the Lord would use the apostle Paul to write many of the books of the New Testament, someone else, he would dictate that to them and someone else would actually be the scribe, if you will. But Paul would always write the salutation with his own hand. Notice what the Bible says over in 2 Thessalonians. Hold your hand here in Colossians 4 and look in 2 Thessalonians 3. I only mention this just to encourage us this morning to understand the importance of why Paul is making this statement in verse number 18. Here to the believers in Thessalonica now understand something by way of background that he, Paul, ministered to these believers in Thessalonica. He had ministered there for a short period of time. They were a faithful church. But just like what happened in Colossian, which continues to happen even still to this day, there are false teachers that creep in. And here in the city of Thessalonica, what was happening is someone wrote a letter and sent it to the believers to the church in Thessalonica",
      "context": "...ation with his own hand. Notice what the Bible says over in 2 Thessalonians. Hold your hand here in Colossians 4 and look in 2 Thessalonians 3. I only mention this just to encourage us this morning to understand ...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=410",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 476.70001220703125,
      "text": "church. But just like what happened in Colossian, which continues to happen even still to this day, there are false teachers that creep in. And here in the city of Thessalonica, what was happening is someone wrote a letter and sent it to the believers to the church in Thessalonica and said it was from Paul and caused great confusion because many of the things that Paul had instructed them of and had taught them, this particular letter that was written, it was not appropriate. It was very contradictory to what Paul had taught them. And we find that as Paul is then writing to these believers the second letter of 2 Thessalonians, he says in verse number 17, the salutation of Paul, notice what he says, \"'With mine own hand, which is the token in every epistle, \"'so I write.'\" That word token is defined as that by which something is distinguished from others and known. And so Paul is saying to the believers in Thessalonica, I want you to know that the salutation is with mine own hand and this is the authentication to show that this is not a fraudulent letter, this is authentic, this is from me, this is the token of every letter that he writes the salutation with his hand. So when he says that to the believers in Colossae in Colossians 4 in verse number 18, the salutation by the hand of me, Paul, again, that's the signature, the token,",
      "context": "...r that he writes the salutation with his hand. So when he says that to the believers in Colossae in Colossians 4 in verse number 18, the salutation by the hand of me, Paul, again, that's the signature, the token,",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=476",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 558.3599853515625,
      "text": "this is from me, this is the token of every letter that he writes the salutation with his hand. So when he says that to the believers in Colossae in Colossians 4 in verse number 18, the salutation by the hand of me, Paul, again, that's the signature, the token, the authentication of this particular epistle. Notice what he says to them, \"'Remember my bonds.'\" We remember that Paul is writing the book of Colossians from Roman prison. We understand that he was awaiting his eventual death and we find that God would use him to pen these words to be an encouragement to this church in Colossae, these believers that he had never met face-to-face, but yet God would use him to be an encouragement to them. And then he says this, \"'Grace be with you, amen.'\" Wow, what a blessing to be mindful in the very last statement of this book, the grace of God. aren't you thankful for God's grace? We sing amazing grace and I know for many it's a favorite hymn and we think about God's amazing grace and it's abundant and where would we be without the grace of God, amen? And we are saved by grace, we serve by grace and we're so thankful for the grace of God and we find that Paul mentions in the very last part of this letter, he reminds these believers of the grace of God. Now the focus of our message this morning",
      "context": "...r that he writes the salutation with his hand. So when he says that to the believers in Colossae in Colossians 4 in verse number 18, the salutation by the hand of me, Paul, again, that's the signature, the token,...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=558",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1252.079978942871,
      "text": "lay up for the parents, but the parents for the children. And notice what he says in verse number 15, Paul is saying this to these believers, and I will very gladly spend and be spent for you, though the more abundantly I love you, the less I be loved. Paul wasn't in it to get the love back from the believers, he understood that God had called him. If you look at the letters that God used the apostle Paul to write, and we don't have time this morning to look through them, but if you go to the first chapter and the first few verses of each of the first chapters, you'll find that in many of them that Paul acknowledges the call that God placed upon his life, the ministry that God had given Paul that he had been entrusted with. And so Paul is seeking to fulfill that ministry, and here in Colossians 4, he is seeking to give this charge to Archippus, and say to Archippus, you've been given a ministry, finish it, fulfill your ministry, you can't be on the sidelines, don't quit, I know there's opposition, I know there's difficulty, I don't think that Paul knew all of the circumstances and all of the things that he was dealing with, but God did, amen? And as God knew what it was that Archippus was dealing with, God gave the charge to Archippus to fulfill it, to finish the ministry.",
      "context": "... Paul that he had been entrusted with. And so Paul is seeking to fulfill that ministry, and here in Colossians 4, he is seeking to give this charge to Archippus, and say to Archippus, you've been given a ministry...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1252",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2067.5799560546875,
      "text": "morning that by way of application, we will look at this verse in Hebrews 12 in verse number 1 and speak of the race that is set before us as our ministry. The race. And the reality is that as we look at this passage of Scripture we see, yes, there's a cloud of witnesses. Yes, Archippus, there are many others that have fulfilled their ministry, but the charge is to Archippus to take heed to the ministry. You've been discouraged and you've dealt with whatever opposition you've dealt with, but you need to take heed to the ministry which thou hast received in the Lord that thou fulfill it. There's a cloud of witnesses. Finally this morning, there's a challenge for each of us. Contextually in Colossians 4 as we close out the book, we find that the Lord is speaking to Archippus. But by way of application, I believe this morning that this charge can be applied in each of our lives. That thou fulfill it. You say, how is it that I can fulfill the ministry that I've been given of the Lord? See, understand this morning that there are many adversaries. Understand this morning that we have an enemy. And the enemy wants to destroy us. He wants to devour us. The enemy would like to do nothing more but to derail us and to distract us, to cause us to be discouraged so that we quit. No doubt there are people",
      "context": "...e's a cloud of witnesses. Finally this morning, there's a challenge for each of us. Contextually in Colossians 4 as we close out the book, we find that the Lord is speaking to Archippus. But by way of application...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2067",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}