{
  "reference": "Daniel 7",
  "occurrences": [
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 522.9400024414062,
      "text": "if you will. The first one is the word deity. We hear the word deity often. We use the word deity or that term, and it refers to the Godhead. It refers to divinity. It is the nature and essence of the Supreme Being. That's what the word deity means. So when you hear someone, you hear a preacher, you read in a theological book, and you read about the deity of Christ, they're talking about the divinity, the fact that Jesus is God. So we think about some of the titles that are ascribed to Jesus within the Gospels. One of them is Son of God. That term Son of God, that title, is revealing to us the deity and the equality that Jesus has with the Father, that He is co-equal, He is co-eternal, and we thank the Lord for that. The term Son of Man, and we noticed here in Matthew 16 that He says, whom do men say that I, the Son of Man, am? It's interesting because this is a term that is used by Daniel in Daniel 7 in verse number 13, and we find that Jesus will use that term throughout the Gospel records in referring to Himself, and really, when you think about the term Son of Man, there's an emphasis there upon His humanity. Now, understand the truth of the Lord Jesus Christ. In fact, when we use the title Jesus Christ, we understand that Jesus is referring to His humanity,",
      "context": "...n say that I, the Son of Man, am? It's interesting because this is a term that is used by Daniel in Daniel 7 in verse number 13, and we find that Jesus will use that term throughout the Gospel records in refe...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=522",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 1730.7000122070312,
      "text": "he know what I'm thinking? Notice what he says. Whether it is easier to say to the sick of the palsy, thy sins be forgiven thee, or to say, arise and take up thy bed and walk. Then notice the statement in verse number 10. But that ye may know, and then notice the title, that the Son of Man. We talked about that title. Daniel used it in Daniel 7, the emphasis upon the humanity of Jesus Christ. Why did he take on human form? Why did he take on human flesh? So he could redeem mankind. And he said, so that you can know, so that you have this knowledge, but that ye may know that the Son of Man hath power on earth to forgive sins. So he's saying that to these religious leaders, to these scribes. He's looking directly at them, and he says, so that you know that I have power to forgive sins. And then he turns his attention to the man that was sick of the palsy, and he said unto him, arise, take up thy bed, and go thy way into thine house. And immediately he arose, took up the bed, and went forth before them all. Now that's a great miracle. But understand what Jesus is revealing to these religious leaders. He says, listen, you properly understand that only God can forgive sins. But so that you understand who I am,",
      "context": "...know, and then notice the title, that the Son of Man. We talked about that title. Daniel used it in Daniel 7, the emphasis upon the humanity of Jesus Christ. Why did he take on human form? Why did he take on ...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=1730",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}