{
  "reference": "Daniel 4",
  "occurrences": [
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 2433.9399795532227,
      "text": "control. Can I tell you this? There are some times I believe with all my heart that sometimes a way, a way, that God judges a nation is through its leadership. So how do I cope? What are some biblical principles? Number one, let me give you this verse. I'll share some things here in just a moment, but let me give you a couple of verses. Psalm 75, verses 6 and 7. For promotion cometh neither from the east nor from the west nor from the south. But God is the judge. Notice this. He putteth down one and setteth up another. So really it comes down to this. Do we believe the Bible? Do we believe these verses of Scripture? Do we believe that God's in control? Let me remind you of Daniel 4 and verse 17. The Bible says this matter is by the decree of the watchers and the demand by the word of the holy ones to the intent that the living may know. What is it that the living may know? That the Most High ruleth in the kingdom of men and giveth it to whomsoever He will and setteth up over it the basest of men. The question is do we believe the Bible? He said in Daniel 4, 17 that the living may know. As far as I know, we're all still alive here this morning. And that the living may know what? That the Most High ruleth in the kingdom",
      "context": "... Do we believe these verses of Scripture? Do we believe that God's in control? Let me remind you of Daniel 4 and verse 17. The Bible says this matter is by the decree of the watchers and the demand by the wor...",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=2433",
      "channel": "Unknown",
      "publish_date": 20241027
    },
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 2500.3999786376953,
      "text": "the basest of men. The question is do we believe the Bible? He said in Daniel 4, 17 that the living may know. As far as I know, we're all still alive here this morning. And that the living may know what? That the Most High ruleth in the kingdom of men. Listen, God did not create and then take His hands off. God is still very much involved in the affairs of mankind. God is still a very present help in the time of trouble. I'm thankful that God did not just remove His hands after creation, but that He withholds all things by the power of His hand and that He's involved. He knows. Listen, if it wasn't the truth, then prayer would never have been given to us to pray to the God who's able to do exceedingly abundantly above all that we ask or think. But He gave us prayer because He's actively involved in the affairs of mankind. Notice this truth in Proverbs 21 and verse number 1, the King's heart is in the hand of the Lord. As the rivers of water, He turneth it, the King's heart, whithersoever He will. So the question basically is this this morning, do we believe God? Do we believe God? Do we believe that in 2024 that God is still on His throne? Do we believe in 2024 that God still has a plan and that God is still able,",
      "context": "the basest of men. The question is do we believe the Bible? He said in Daniel 4, 17 that the living may know. As far as I know, we're all still alive here this morning. And that t...",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=2500",
      "channel": "Unknown",
      "publish_date": 20241027
    },
    {
      "sermon_id": "8OgJllM8BSQ",
      "timestamp": 495.0799865722656,
      "text": "about and starts recognizing we can get that big head syndrome, and we can think more highly of ourselves than we ought to think, and I'm telling you, your flesh likes that. Our flesh likes that. It's a desire of the flesh. At Nebuchadnezzar in Daniel chapter 4, and we'll look at Daniel again in just a few moments. You might want to hold your place there. Turn to Daniel chapter 4, if you will, and we'll just read one verse at this point, and then I'll come back and read a couple of verses here in just a moment, but in Daniel chapter 4, we find that there was a vision or a dream, and Daniel is going to provide that interpretation, but in verse number 30, I want you to see what happens after the interpretation was given, and Daniel provided Nebuchadnezzar with exactly what God was going to do because of the pride of this man, but in verse number 29, it says, at the end of 12 months, he walked in the palace of the kingdom of Babylon, and notice in Daniel 4, in verse number 30, notice what King Nebuchadnezzar says. It says that the king spake and said, is not this great Babylon that, notice when he says, I have built for the house of the kingdom by the might of my power and for the honor of my",
      "context": "... it says, at the end of 12 months, he walked in the palace of the kingdom of Babylon, and notice in Daniel 4, in verse number 30, notice what King Nebuchadnezzar says. It says that the king spake and said, is...",
      "sermon_title": "\"We Ought To Walk Humbly\" Romans 12:3",
      "url": "https://www.youtube.com/watch?v=8OgJllM8BSQ&t=495",
      "channel": "Unknown",
      "publish_date": 20240922
    },
    {
      "sermon_id": "8OgJllM8BSQ",
      "timestamp": 555.5599975585938,
      "text": "Daniel 4, in verse number 30, notice what King Nebuchadnezzar says. It says that the king spake and said, is not this great Babylon that, notice when he says, I have built for the house of the kingdom by the might of my power and for the honor of my majesty. He was full of himself. He was a prideful man. He was actually, I mean, he was a super powerful man. We understand that as you read throughout the book of Daniel and even other portions of scripture in Jeremiah, and you see the power of Nebuchadnezzar leading the nation of Babylon, but we find that his heart was lifted up, and just as Nebuchadnezzar here in Daniel 4 would have that desire to say, look at what I've done. Look at what I've accomplished. Look at what I've, all of that pride, and it's a desire of our flesh. If we're going to walk in humility, we must acknowledge this evening that my flesh, your flesh, that our flesh has a desire to glory. The second thing that we must acknowledge is the danger of pride, the danger of pride. God tells us several things about pride in his word. Again, this evening, it's not an exhaustive study, but we find in the book of Proverbs, Proverbs 13, if you will, God gives us a couple of truths here in the book of Proverbs with regard to pride that are important for us to point out this evening",
      "context": "Daniel 4, in verse number 30, notice what King Nebuchadnezzar says. It says that the king spake and said, is...",
      "sermon_title": "\"We Ought To Walk Humbly\" Romans 12:3",
      "url": "https://www.youtube.com/watch?v=8OgJllM8BSQ&t=555",
      "channel": "Unknown",
      "publish_date": 20240922
    }
  ]
}