{
  "reference": "Daniel 9",
  "occurrences": [
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1273.8200149536133,
      "text": "Christ in the synagogues and he would say that He is the Son of God, that He is the Messiah. You find that this was his manner throughout his ministry, that you would find that he would speak about Jesus and many of those in that day knew who that person Jesus was. They understood his ministry, they were aware of his crucifixion, but he would preach to them and he would say this, specifically I'll reference one of the passages here in Acts 17 in verse number 3, opening and alleging that Christ must needs have suffered and risen again from the dead, and that this Jesus whom I preach unto you is Christ. See, Jesus, He is God incarnate, right? Jehovah is salvation is what the name means. Christ is the Messiah, the Son of God, the Anointed One. And we find that throughout the Scriptures, that as we look at Paul preaching, he says this Jesus is the Christ. Remember when the truth was given to Mary with regard to the announcement of the birth of Christ, it says that you shall call His name Jesus. Why? For He shall save His people from their sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we studied this several weeks ago, but I want you to look at two verses of Scripture in the book of Hebrews and see the fulfillment of this",
      "context": "...s that you shall call His name Jesus. Why? For He shall save His people from their sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we stud...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1273",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1354.9000091552734,
      "text": "sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we studied this several weeks ago, but I want you to look at two verses of Scripture in the book of Hebrews and see the fulfillment of this prophecy and see this understanding really of the miracle of reconciliation. See, this morning, the miracle that is before us as we consider that which God has done in our lives for saving our souls that we now are reconciled to God, it's a miracle. In Hebrews 2, in verse number 17, it says, wherefore in all things that behooved Him to be made like unto His brethren. Notice this, that He might be a merciful and faithful high priest in things pertaining to God to make reconciliation for the sins of the people. But how does He do that? Well, we know Hebrews 9 in verse number 22, though you won't see the word reconciliation there, you find the by or reconciled or any form of the word, but you find in Hebrews 9 in verse 22, it says, and almost all things are by the law purged with blood, and without shedding of blood is no remission. And we find this miracle of reconciliation. See, Paul, as he's writing to the believers in Corinth, and he comes to this section that we're studying this morning in 2 Corinthians chapter number 5, he's speaking about this miracle of",
      "context": "sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we stud...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1354",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}