{
  "reference": "Deuteronomy 8",
  "occurrences": [
    {
      "sermon_id": "7-Svueb0C4s",
      "timestamp": 542.7999877929688,
      "text": "has given to us. We find that God is aware of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn there, if you'd like you can, in Matthew 6 and verse number 8, we find that the Bible tells us this, be not ye therefore like unto them, speaking of those that were praying, he called them hypocrites and so on and so forth, and he says here, your father knoweth what things ye have need of before ye ask him. I made the statement to someone actually today, and I said to the individual, I said, you know, the reality is that prayer, sometimes when we think about prayer, not only is it moving the hand of God, but prayer helps my own perspective. We're going to think about God and his provision for us, and the fact that he is the provider. You say, no, I go to work and I provide for my family. I understand that you're supposed to provide for your family. In fact, the New Testament speaks about those that would not provide for their family. They're worse than an infidel, but the reality is that we understand that it's God who's given us the ability, and so ultimately God is the provider. Notice what the book of Deuteronomy tells us with regard to this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember,",
      "context": "...t the book of Deuteronomy tells us with regard to this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember,",
      "sermon_title": "Sermon 7-Svueb0C4s",
      "url": "https://www.youtube.com/watch?v=7-Svueb0C4s&t=542",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7-Svueb0C4s",
      "timestamp": 608.239990234375,
      "text": "infidel, but the reality is that we understand that it's God who's given us the ability, and so ultimately God is the provider. Notice what the book of Deuteronomy tells us with regard to this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember, in this portion of the book of Deuteronomy, you would find that God is preparing his children for entrance into the land, and remember in chapter number 6, he says when you come into a land that's full of all of these things, and you have houses that you didn't build, and you have vineyards that you didn't plant, and you have all of these things, beware lest thou forget the Lord. We find that Deuteronomy 8 and verse number 18 says this, but thou shalt remember the Lord thy God, for it is he that giveth thee power to get wealth, that he may establish his covenant which he swear unto thy fathers as it is this day. Everything comes from God. He may have given you employment somewhere, and he may use that source of employment to provide for your needs, but you understand that he is the provider. We begin to think about this prayer for provision and how it would impact my perspective, and it would help me to be mindful of who he is and how he provides. Remember, he's the",
      "context": "...t the book of Deuteronomy tells us with regard to this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember, in this portion of the book of Deuteronomy, you would find that ...",
      "sermon_title": "Sermon 7-Svueb0C4s",
      "url": "https://www.youtube.com/watch?v=7-Svueb0C4s&t=608",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 2382.6599731445312,
      "text": "he says, who is that God that shall deliver you out of my hand? And then he found out who that God was. What happened to Nebuchadnezzar? God gave him over. He was like an animal out in the field, right? We must recognize this evening that everything that we have is because of the good hand of God. Every good gift, right? James 1 verse 17, it comes from where? It comes from above. It comes from God. Our God is good. And Jacob is acknowledging some powerful truth here. that is important for every child of God to recognize. In fact, later on, as God is preparing the children of Israel for entrance into the land and he's using Moses to give them instruction, God reminds them of this. God reminds them of this in Deuteronomy 8, in verse number 18, it says, \"'But thou shalt remember the Lord thy God, \"'for it is he that giveth thee power to get wealth, \"'that he may establish his covenant, \"'which he sware unto thy fathers, as it is this day.'\" And so he says, listen, Moses is given this instruction, we have to recognize that it's God that gives us the power to get this wealth. You use that terminology, you've heard it, no doubt, where people talk about being a self-made man, there's no such thing. There really isn't. We find that God, in his grace and his mercy,",
      "context": "...nd he's using Moses to give them instruction, God reminds them of this. God reminds them of this in Deuteronomy 8, in verse number 18, it says, \"'But thou shalt remember the Lord thy God, \"'for it is he that givet...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=2382",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}