{
  "reference": "Deuteronomy 10",
  "occurrences": [
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 86.72000122070312,
      "text": "you don't know the number, but we know that God is aware of how many he would say to as he did to the church of Ephesus, you've left your first love. I believe that the Lord knows and I believe that the Lord is faithful to use his word to bring conviction to the heart of the individual that would be guilty of leaving their first love. I'm reminded at the end of the letter to the church of Ephesus and to each of the churches, we find these words, he that hath an ear, let him hear what the Spirit saith unto the churches. We find that this letter must have caused the believers in Ephesus to pause, to examine, to be able to have that process of answering the question, do I really love God? Do I love God with all my heart? Remember what the Bible says there in John 21, we'll be there in just a moment, but let me read to you a couple of verses in the book of Deuteronomy in chapter six in verse number five, the Bible says this, and thou shalt love the Lord thy God with all thine heart, with all thy soul and with all thy might. We find a few chapters later in Deuteronomy 10 in verse number 12, the Bible says this, and now Israel, what doth the Lord thy God require of thee,",
      "context": "...God with all thine heart, with all thy soul and with all thy might. We find a few chapters later in Deuteronomy 10 in verse number 12, the Bible says this, and now Israel, what doth the Lord thy God require of thee...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=86",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 154.72000122070312,
      "text": "and thou shalt love the Lord thy God with all thine heart, with all thy soul and with all thy might. We find a few chapters later in Deuteronomy 10 in verse number 12, the Bible says this, and now Israel, what doth the Lord thy God require of thee, but to fear the Lord thy God, to walk in all his ways and to love him and to serve the Lord thy God with all thy heart and with all thy soul. So we begin to think about this subject matter this evening, I wanna preach a message that I've simply entitled, loving God with all your heart. Loving God with all your heart. I've invited you to turn to John 21, because I wanna review this evening, the interaction that God gives us in John chapter 21 between the Lord Jesus Christ, our resurrected Savior with Peter. And in John 21, beginning in verse number 15, notice what the Bible says, I'll read verse 15 down through verse number 19, and then we'll get into the message this evening. In verse 15, the Bible says, so when they had dined, Jesus saith to Simon Peter, Simon, son of Jonas, lovest thou me more than these? He saith unto him, yea, Lord, thou knowest that I love thee. He saith unto him, feed my lambs. He saith to him again the second time, Simon, son of Jonas, lovest thou me? He saith unto him, yea, Lord,",
      "context": "...God with all thine heart, with all thy soul and with all thy might. We find a few chapters later in Deuteronomy 10 in verse number 12, the Bible says this, and now Israel, what doth the Lord thy God require of thee...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=154",
      "channel": "Unknown",
      "publish_date": 20241202
    }
  ]
}