{
  "reference": "Deuteronomy 33",
  "occurrences": [
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1010.1799926757812,
      "text": "that time the size of the tribe of Simeon decreased by over 37,000 people. That's a lot of people. The tribe during the first census, they were counted at 59,300 and by the time of the second census they were down to 22,200. Wow. We see the decrease in Simeon. We see, and we'll note it in just a moment in Deuteronomy chapter 33, but it's interesting because in Deuteronomy chapter 33, Moses is preparing to die. Here in Genesis 49, Jacob is going to die and he brings all of his sons before him and we find that in Deuteronomy chapter 33, Moses is not going to be permitted to enter into the land and we find that prior to his death, Moses does something interesting. He begins to talk about all the tribes and, you know, if you were to study Deuteronomy chapter 33, you'll find that there's one tribe missing from all the tribes that are mentioned by Moses. That one tribe, Simeon, Simeon. It's not there and you study that and you begin to see and you look here how it talks about being scattered. He says, I will divide them in Jacob and scatter them in Israel and you think about how the Simeonites, they really did not have that identity, if you will, of their own little tribe and to see the decrease in their census of their population to understand that they're not even mentioned there by Moses in Deuteronomy 33.",
      "context": "...in their census of their population to understand that they're not even mentioned there by Moses in Deuteronomy 33.",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1010",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1077.8200073242188,
      "text": "scatter them in Israel and you think about how the Simeonites, they really did not have that identity, if you will, of their own little tribe and to see the decrease in their census of their population to understand that they're not even mentioned there by Moses in Deuteronomy 33. Levi, we see that they're both there and again, Levi is just as guilty as Simeon with regard to the situation with the sons of Shechem and we read of that and understand and he says that they shall, I will divide them in Jacob and scatter them in Israel. It's interesting when you think about Levi, there's no specific inheritance for Levi. God is their inheritance, rather we find with regard to having a particular spot, they have 48 cities that are scattered throughout the land. Now it's very interesting when you begin to think about and understand the history of Israel and looking at the Old Testament, you begin to see what is said here in Genesis chapter 49 with regard to Simeon and Levi, but then all of a sudden when you look in Deuteronomy chapter 33, Simeon is missing, but Levi, well Moses has some very interesting things to say about Levi. It's really almost as if the scattering of Levi, the tribe of the Levites really turned into a blessing. We find that the scattering of Levi, the way in which they would be found throughout the",
      "context": "...in their census of their population to understand that they're not even mentioned there by Moses in Deuteronomy 33. Levi, we see that they're both there and again, Levi is just as guilty as Simeon with regard to th...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1077",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1148.2000122070312,
      "text": "missing, but Levi, well Moses has some very interesting things to say about Levi. It's really almost as if the scattering of Levi, the tribe of the Levites really turned into a blessing. We find that the scattering of Levi, the way in which they would be found throughout the land and we'll read in just a moment there in Deuteronomy 33 and verses 10 and 11 and to see what their duties and responsibilities were, but I'd ask this question before we get to that point in history for the nation of Israel is what changed? Why is it that the Simeonites that are mentioned here by Jacob, Simeon and Levi together and the anger and cursed be their anger and I will divide them in Jacob and scatter them in Israel and we see Simeon with this decline and really no great references whatsoever, but then you see Levi scattered 48 cities and you find that they have really a place of prominence within Israel's history. What changed? Well I think, I'm not certain because God doesn't say this is what changed, but turn over to the book of Exodus if you will in the 32nd chapter. In Exodus chapter 32. We find that the people are guilty. Moses is up on the mount and the people are there and they say to Aaron, and up make us gods which shall go before us. You can read that in verse number one.",
      "context": "..., the way in which they would be found throughout the land and we'll read in just a moment there in Deuteronomy 33 and verses 10 and 11 and to see what their duties and responsibilities were, but I'd ask this quest...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1148",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1296.0800170898438,
      "text": "themselves together unto him. Perhaps this gives us a little insight as to why in Deuteronomy chapter 33, what we could look at in Genesis 49 as being this scattering, this judgment, if you will, is really turned into a blessing because of what they did. They stood for right. By the way, it's always right to stand for right. Amen? Who is on the Lord's side? Listen, I'd rather be on the Lord's side than the world's side. Amen? And notice what the Bible says in Deuteronomy 33. We'd eventually get here. In Deuteronomy chapter 33, notice what God says through Moses in verses 10 and 11. Again, this is a passage of Scripture. I'll read verse 1 and then we'll get down to verses 10 and 11. But in Deuteronomy 33 and verse 1, it says, And this is the blessing wherewith Moses, the man of God, blessed the children of Israel before his death. You can go through here and you can read beginning here in this text of Scripture in verse 6 with Reuben, and you can go right down through and you can see the tribes that are mentioned, of course, not Simeon, but all the other tribes mentioned. Look down in verse number 10. Actually, I'm going to back up to verse number 8. It says, And of Levi he said, Let thy Thummim and Urim be with thy Holy One, whom thou didst prove at Massah, and with whom thou didst strive",
      "context": "...en, I'd rather be on the Lord's side than the world's side. Amen? And notice what the Bible says in Deuteronomy 33. We'd eventually get here. In Deuteronomy chapter 33, notice what God says through Moses in verses ...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1296",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 294.82000732421875,
      "text": "path that biteth the horse heels so that his rider shall fall backward. I have waited for thy salvation, O Lord Gad. A troop shall overcome him, but he shall overcome at the last. Just as we did last week, the points tonight will be the names of the sons, and so number one, if you're taking notes, look at Zebulun in verse number 13. Notice what Jacob says. He says thou shall, he says shall dwell at the haven of the sea, and he shall be for an haven of ships. Mentions his border shall be unto Zidon. As we look at these particular statements that are given in verse 13, and we couple that with Deuteronomy 33, remember it's in Deuteronomy 33 that Moses prior to his death, he makes reference to the tribes of Israel, and what he says about Zebulun there in that portion of scripture in Deuteronomy 33 in verse 18, it says rejoice at thy going out. Rejoice at thy going out. So we see the reference here with being a haven of the sea, and he shall be for an haven of ships. Speaking about his border, which the border never quite made it to Zidon, but we see again the future view, the prophetic view with regard to the blessing of Jacob here, and so we find that Moses says rejoice at thy going out. It's interesting, Jesus speaks about Zebulun, the tribe there, if you will, in Matthew 4,",
      "context": "...idon. As we look at these particular statements that are given in verse 13, and we couple that with Deuteronomy 33, remember it's in Deuteronomy 33 that Moses prior to his death, he makes reference to the tribes of...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=294",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 581.760009765625,
      "text": "here about Issachar as well. And I'm gonna try to make application with both Zebulun and Issachar here after we look at verses 14 and 15. The Bible says that Issachar in verse 14 is a strong ass couching down between two burdens. And he saw that rest was good and the land that it was pleasant and bowed his shoulder to bear and became a servant unto tribute. As we look at those particular statements that are made and we begin to think about the usefulness, if you will, when he talks about being, in verse 14, there's a strong ass. couching down between two burdens, the strength, the dependability, the usefulness, the land that they would be given. In v. 15, it says that He saw that rest was good and the land that it was pleasant, the land that they would inherit was a land that was quite fruitful. It was a land that produced much. And so we find that He also, it seems as if when it says that He bowed His shoulder to bear, there was no reluctance on the part of hard work and doing what needed to be done. And we find that it says in Deuteronomy 33, in v. 18, when Moses is sharing the blessings, if you will, before his death, He said to Zebulun, rejoice at thy going out, but of Issachar, it says, rejoice in thy tents. Rejoice at thy going out to Zebulun,",
      "context": "...o reluctance on the part of hard work and doing what needed to be done. And we find that it says in Deuteronomy 33, in v. 18, when Moses is sharing the blessings, if you will, before his death, He said to Zebulun, ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=581",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 656.2400093078613,
      "text": "done. And we find that it says in Deuteronomy 33, in v. 18, when Moses is sharing the blessings, if you will, before his death, He said to Zebulun, rejoice at thy going out, but of Issachar, it says, rejoice in thy tents. Rejoice at thy going out to Zebulun, but rejoice in thy tents. When we look at Issachar, as I mentioned that it seems as if Zebulun, that his descendants were known as merchants, if you will, and we look at Issachar and they would be known as being farmers. Those that would work the land, those that would help to sustain a nation. And the reality is that we find that any nation is dependent on merchants and farmers. And I think about farming in America, and obviously much of our farmland in America has been sold and it's been purchased for various means and what have you. And really that can become a critical issue to a nation with regard to its sustenance that it needs and the productivity of that particular land and the yield that is required to sustain its people. And so we find here this evening that as we look at this portion of scripture and we think about these two men and really what their descendants would be, we're given a little bit of additional insight. I told you to hold your place there in 1 Chronicles 12. And I want you to see what the Bible says of these",
      "context": "done. And we find that it says in Deuteronomy 33, in v. 18, when Moses is sharing the blessings, if you will, before his death, He said to Zebulun, ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=656",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2386.280029296875,
      "text": "department, Brother Mark, and said, hey, I just wanted to find out if you guys still have trucks. Do they have gas? Do you have water? Do you have hoses? Like, I just want to make sure you're still operating. I've never made that. Have any of you ever made that phone call? No. But if I have a fire and I call 911 and I call for the fire department, I'm hoping that they're there and they're coming, right? That's not how we treat God and church. It's not just when my life is falling apart, oh, I need God, I need church. No, I need Him every moment of my life. And I must be careful that I learn lessons and say, look, don't go down the path of idolatry that we see within Dan and the tribe and introducing it. No, we must make Christ preeminent in our lives. Gad is mentioned in verse 19. Of course, the Bible says in Genesis 49 and verse 19, Gad, a troop shall overcome him, but he shall overcome at the last. Again, not a whole lot given to us about Gad. We find that it says that a troop shall overcome him, but he shall overcome at the last. It says in Deuteronomy 33 and verse number 20 that it talks about his enlarging and his strength. And Moses says like a lion is really kind of the imagery that is given there with regard to Gad.",
      "context": "...We find that it says that a troop shall overcome him, but he shall overcome at the last. It says in Deuteronomy 33 and verse number 20 that it talks about his enlarging and his strength. And Moses says like a lion ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2386",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2456.880043029785,
      "text": "a troop shall overcome him, but he shall overcome at the last. It says in Deuteronomy 33 and verse number 20 that it talks about his enlarging and his strength. And Moses says like a lion is really kind of the imagery that is given there with regard to Gad. We do know of the tribe of Gad. Remember it was Reuben, Gad, and the half tribe of Manasseh that made the decision to settle on the east side of Jordan. They saw the land, they saw that it was pleasant. They really made the request of Moses that they could settle there and they settled. And we see that it says a troop shall overcome him, but he shall overcome at the last. Settling there on the east side of Jordan would lead to being regularly attacked. And we can see of that, we can speak of that. I mentioned some of it last week with Reuben. But we find that it says here, but he shall overcome at the last. And again, I believe a view of prophetic view here with regard to Gad. There's not a whole lot that's given to us within the scriptures about the tribe of Gad. There are some that would like to give the idea that some great prophets, Elijah was of the tribe of Gad. I don't know that you can truly prove that biblically. So you can be careful on some things that you read.",
      "context": "a troop shall overcome him, but he shall overcome at the last. It says in Deuteronomy 33 and verse number 20 that it talks about his enlarging and his strength. And Moses says like a lion ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2456",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}