{
  "reference": "Ecclesiastes 7",
  "occurrences": [
    {
      "sermon_id": "6SpHqGGtcFw",
      "timestamp": 247.1999969482422,
      "text": "Scripture and think about the subject matter in which we'll deal with this evening, and we understand that generally speaking, mankind is aware of their mortality. Generally speaking, mankind is aware of their mortality. We understand that in recent, really, years at this point, in the last couple of years, it seems as if there has been a greater awareness of the mortality of individuals because of some of the things that we've dealt with in the last couple of years. But the reality is that we as the people of God, if anyone is to understand the mortality of man, we are confronted with it on a regular basis. When we go to the Word of God, we understand the wages of sin is death. We understand, as it is appointed unto man once to die, after this the judgment. We understand that, as Paul said, that death really, to be absent from this body, means to be present with the Lord. And so our perspective and our understanding on death is different than that of an unbeliever. And for that, I greatly rejoice, amen? And what a blessing to understand the truth of the Word of God with regard to mortality. When we think about the entirety of this passage of Scripture, and we think about the content and dealing with the death of Sarah and the burial of Sarah, I'm mindful of what we find in Ecclesiastes 7.",
      "context": "...content and dealing with the death of Sarah and the burial of Sarah, I'm mindful of what we find in Ecclesiastes 7.",
      "sermon_title": "Sermon 6SpHqGGtcFw",
      "url": "https://www.youtube.com/watch?v=6SpHqGGtcFw&t=247",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6SpHqGGtcFw",
      "timestamp": 315.0199890136719,
      "text": "understand the truth of the Word of God with regard to mortality. When we think about the entirety of this passage of Scripture, and we think about the content and dealing with the death of Sarah and the burial of Sarah, I'm mindful of what we find in Ecclesiastes 7. Keep your hand here in Genesis, and I want you to turn to the book of Ecclesiastes in chapter number 7, and I want you to see what we're told here in this passage of Scripture with regard to the subject that's at hand this evening. In Ecclesiastes chapter number 7, we find that God gives us this interesting truth that is pertinent to our discussion this evening from this passage of Scripture. For the Bible says in Ecclesiastes 7 and verse number 2, it is better to go to the house of mourning than to go to the house of feasting. Now at face value, I would submit to you this evening that many people would oppose what that Scripture just says. They would much prefer to go to the house of feasting than to go to the house of mourning. Would you agree? But we find that as the Scripture is written, the Bible says, for that is the end of all men, and the living will lay it to his heart. There's something sobering about going to a memorial service, a funeral service. There's something sobering about dealing with death, right?",
      "context": "...content and dealing with the death of Sarah and the burial of Sarah, I'm mindful of what we find in Ecclesiastes 7. Keep your hand here in Genesis, and I want you to turn to the book of Ecclesiastes in chapter numb...",
      "sermon_title": "Sermon 6SpHqGGtcFw",
      "url": "https://www.youtube.com/watch?v=6SpHqGGtcFw&t=315",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}