{
  "reference": "Ephesians 4",
  "occurrences": [
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 490.67999267578125,
      "text": "portion of Scripture in which we're looking at this morning has got some sister passages. I'm not going to read them, but perhaps you want to jot these down in your notes. Galatians 5, verses 19-21, in that portion of Scripture, God details what the works of the flesh are. They're manifested in this way, and you find a long, detailed list of how the works of the flesh are manifested, and you'll see that in Galatians 5, verses 19-21. But then also in Ephesians chapter number 4, verses 17-32. In Ephesians 4, verses 17-32, again Paul will use the same terminology, similar terminology, as he uses here in Galatians, Colossians 3, with regard to put off and put on. And that passage of Scripture would be a great help to you. I believe that as we think about this passage that is before us and those sister passages that I mentioned before just a moment ago, I believe that really this is the outworking of the truth that Peter gives in 1 Peter chapter number 1. If you want to hold your place there in Colossians, let me just read a few verses to you in 1 Peter chapter number 1, and then we'll jump right back over there to Colossians chapter number 3 and deal with this portion of Scripture. We find here that in 1 Peter chapter number 1, in verse number 13, notice what Peter says,",
      "context": "...ee that in Galatians 5, verses 19-21. But then also in Ephesians chapter number 4, verses 17-32. In Ephesians 4, verses 17-32, again Paul will use the same terminology, similar terminology, as he uses here in Ga...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=490",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 699.3600311279297,
      "text": "was direct in saying, put off all these. He's detailed in providing us with this list. Notice number one that is given to us in verse number 8, anger, anger. Anger can be defined as an agitation of the soul. Anger is an emotion that we each deal with, amen? Anger is something that we deal with that we can, the Bible tells us in Ephesians 4, be angry and sin not, amen? God created us as emotional people and we have emotions. By the way, there are some things that ought to cause us to have a holy anger, that ought to cause us to have a holy indignation for sin and for wickedness and so on and so forth, but that's not what Paul is dealing with here in this portion of Scripture. In fact, as we would think about the anger that is mentioned in verse number 8 and then note the next few words that are provided to us, we find that he's dealing with an anger that is not a holy anger, but is an inappropriate anger, an anger in which we're giving place to our own flesh, an anger in which even in that portion of Scripture in Ephesians 4, when God tells the believers in Ephesus, be angry and sin not, and then he says, let not the sun go down upon your wrath, neither give place to the devil.",
      "context": "...at we each deal with, amen? Anger is something that we deal with that we can, the Bible tells us in Ephesians 4, be angry and sin not, amen? God created us as emotional people and we have emotions. By the way, t...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=699",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 762.4200286865234,
      "text": "giving place to our own flesh, an anger in which even in that portion of Scripture in Ephesians 4, when God tells the believers in Ephesus, be angry and sin not, and then he says, let not the sun go down upon your wrath, neither give place to the devil. You know, the reality is that we can have this agitation of the soul, we can have this anger that when not handled properly leads us down a terrible path of digression. It really is not progression, because it's not getting any better, but it's a digression. It is something that will cause us to have regrets. Have you ever been angry and you've said something that you regret? You've done something that you regret? And maybe you say something like this, man, the anger got the better part of me. I mean, I just, I don't know what happened, I just got so angry in that moment. It's an emotion. It's this agitation of the soul, and I believe that it's an emotion that can be very dangerous, and it's an emotion that we must hold in check. Again, there's some things that we ought to be angry about. But oftentimes that's not the problem for God's people. Amen? It really isn't the problem. That's not what Paul's dealing with here. We note that because of the progression that is listed here in these words. Notice he says next, number two, wrath, wrath.",
      "context": "giving place to our own flesh, an anger in which even in that portion of Scripture in Ephesians 4, when God tells the believers in Ephesus, be angry and sin not, and then he says, let not the sun g...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=762",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 1459.0400390625,
      "text": "not necessary to speak that way. I've said to people, if those are the only adjectives that you know, you need to get a better vocabulary. Amen? Because there's some people that have very few adjectives that they know and they're all bad. Let's just be real this morning, amen? Listen, when it says here this filthy communication, listen, it ought not be that we speak like we used to speak or that we speak like a lost person speaks. We find here that he says, filthy communication out of your mouth. Put it off. All of these, anger, wrath, malice, blasphemy, filthy communication out of your mouth. You know what's interesting to me is when you think about this filthy communication that's listed at the end of verse number eight, you know sometimes what leads us to saying things we ought not say? Anger, right? You see the digression that's listed here. And we find, listen, Paul says this to the believers in Ephesus in Ephesians 4. You don't need to turn there, but in verse 29 he says, let no corrupt communication proceed out of your mouth, but that which is good to the use of edifying that it may minister grace unto the hearers. The book of Proverbs says much about our speech. The reality is that with your tongue and with my tongue, with the words that we speak, we can tear down or we can build up.",
      "context": "...e digression that's listed here. And we find, listen, Paul says this to the believers in Ephesus in Ephesians 4. You don't need to turn there, but in verse 29 he says, let no corrupt communication proceed out of...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=1459",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}