{
  "reference": "Ephesians 2",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1426.1600341796875,
      "text": "notes, I'm thankful for this promise. He promised that He would work in us. I'm thankful that He's working in me. I'm thankful that He's working in you. I mentioned this morning that little song, that little chorus that we sing with the kids, that He's still working on me to make me what I ought to be. And I'm thankful for His work in me, and I'm thankful that He's promised to do so. Notice in Ephesians 2, a verse of Scripture that we often are familiar with as we think about verses eight and nine, for by grace are you saved through faith, and that not of yourselves is the gift of God, not of works, lest any man should boast. We find that the thought really doesn't end in verse number nine, it carries into verse number 10, and we think about the truth that He promised to save us. Listen, if He was done with us at the moment of salvation, He'd just go ahead and take us to heaven, amen? And listen, on some days, maybe we'd wonder if it might not be better if we just went ahead and went to heaven, you know? But the reality is that He's doing a work in us. And the purpose of that work in us, according to Romans 8, is that we would be conformed to the image of His dear Son. It's the process of sanctification.",
      "context": "...to be. And I'm thankful for His work in me, and I'm thankful that He's promised to do so. Notice in Ephesians 2, a verse of Scripture that we often are familiar with as we think about verses eight and nine, for ...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1426",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1489.8800354003906,
      "text": "just went ahead and went to heaven, you know? But the reality is that He's doing a work in us. And the purpose of that work in us, according to Romans 8, is that we would be conformed to the image of His dear Son. It's the process of sanctification. And here we find in Ephesians 2, in verse number 10, He says, we are His workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them, in those good works. Think about that, we are His workmanship. In the Old Testament, the Bible uses the picture, the analogy of Him being the potter and we being the clay. Isn't that great imagery? How many of you ever made anything on a potter's wheel? Anyone, a few of you? I had the privilege of the only art class I ever took in high school that I enjoyed, amen? You put some paint in front of me, you put a pencil or some kind of coloring instrument in front of me, it's a mess, man. I am not artistic at all. And they said, well, you know, Chris, you have to take some art class. Are you kidding me? I need art to graduate? Yep, yep, you need to take an art class. And I was able to take pottery. I had no idea how that was gonna work, but I actually loved pottery. It was an enjoyable class.",
      "context": "... be conformed to the image of His dear Son. It's the process of sanctification. And here we find in Ephesians 2, in verse number 10, He says, we are His workmanship, created in Christ Jesus unto good works, whic...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1489",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 2072.899932861328,
      "text": "the individual always becomes the standard how do you know if you've done enough good how do you know how bad that bad thing was that canceled out those good things I mean that's a constant mess there's no assurance in that Jesus said it's not possible but we understand biblically that these truths even that we find here this this this last challenge that is given that we're to consider one another provoking to love and to good works it's not these good works are not so that we can be saved they're not even so that we can stay saved they're a result of being saved right we understand we often quote Ephesians 2 8 and 9 for my grace are you saved through faith and that not of works is excuse me and that not of yourselves of the gift of God not of works lest any man should boast but we find that verse number 10 of Ephesians 2 says for we are his workmanship created in Christ Jesus unto good works which God hath before ordained that you should walk in them remember as we study the book of Ephesians that the first three chapters of the book of Ephesians deal with our our security in Christ who we are our identity in Christ that we are accepted in Jesus aren't you thankful for that if you've trusted Jesus your personal Savior listen you're not",
      "context": "...t even so that we can stay saved they're a result of being saved right we understand we often quote Ephesians 2 8 and 9 for my grace are you saved through faith and that not of works is excuse me and that not of...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=2072",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1217.1199970245361,
      "text": "And so we find that these recipients of this book, if we were to understand this morning, the book of Colossians is being written to believers, is being written to those that have been born again, those that have been saved, and that is why the Apostle Paul is saying to them in Colossians 2 and verse number 10, and ye are complete in him. We understand what it means to be complete in him, and we understand why Paul would tell them that they are complete in him, is because they've been saved, they've been born again. Back in the book of Ephesians, as we've referenced Ephesians 2 and verse number 1, the fact that you were dead in your trespasses and sins, and you hath he quickened who were dead in your trespasses and sins. In Ephesians 2 and verse number 4, the Bible says, but God who is rich in mercy for his great love wherewith he loved us, even when we were dead in sins, hath quickened us together with Christ. By grace you're saved, and hath raised us up together and made us sit together in heavenly places in Christ Jesus, that in the ages to come he might show the exceeding riches of his grace and his kindness toward us through Christ Jesus. For by grace are you saved through faith, and that not of yourselves, but of the gift of God, not of works lest any man should boast.",
      "context": "...use they've been saved, they've been born again. Back in the book of Ephesians, as we've referenced Ephesians 2 and verse number 1, the fact that you were dead in your trespasses and sins, and you hath he quicke...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1217",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 387.0,
      "text": "is not my home, that this is not all there is for us. That's a blessing. My citizenship is in heaven. Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims. I'm not home, but I'm heading home. Isn't that a blessing? And so this morning as we look at this portion of Scripture in 1 John 2 in verses 15 through 17, I've simply titled the message this morning, love not the world. I want you to notice with me as we begin this morning the progression of worldliness, the progression of worldliness. We find here that he says, love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him in verse number 15. As we think about this progression of worldliness, we find that this term, speaking about believers and their interaction with the world, is used throughout a number of portions of Scripture. We'll review several of those this morning as we consider this progression of worldliness. But at the onset of the message this morning, I want us to be mindful of this wonderful truth that God gives us in the book of Ephesians, and I hope that it will help us as we begin here in Ephesians 2 to help develop and understand this progression and how we combat it. Notice in Ephesians chapter number 2,",
      "context": "...uth that God gives us in the book of Ephesians, and I hope that it will help us as we begin here in Ephesians 2 to help develop and understand this progression and how we combat it. Notice in Ephesians chapter n...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=387",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 448.0,
      "text": "us to be mindful of this wonderful truth that God gives us in the book of Ephesians, and I hope that it will help us as we begin here in Ephesians 2 to help develop and understand this progression and how we combat it. Notice in Ephesians chapter number 2, we must remember this truth that prior to salvation, we walked according to the course of this world. Notice in Ephesians 2 in verse number 1, it says, He made us alive. That's salvation. And I'm so thankful. Yes, I was dead in my trespasses and in my sins, but he hath quickened me by his great mercy and by his grace. It says in verse number 2, notice this, wherein in time past ye walked according to the course of this world. Notice this, according to the prince of the power of the air, the spirit that now worketh in the children of disobedience. Notice in verse number 3, among whom also we all had our conversation in times past, in the lust of our flesh, fulfilling the desires of the flesh and of the mind, and were by nature the children of wrath, even as others. We begin to understand this truth this morning when we consider the progression of worldliness. The reality is that prior to salvation, according to verses 2 and 3, we all had our conversation in this world, and we all walked according to the course of this world.",
      "context": "...uth that God gives us in the book of Ephesians, and I hope that it will help us as we begin here in Ephesians 2 to help develop and understand this progression and how we combat it. Notice in Ephesians chapter n...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=448",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1496.6200256347656,
      "text": "Scripture in the book of Ephesians, if you will. Turn over there and look at a few verses of Scripture in Ephesians chapter number 2, and find here how the Apostle Paul deals with the subject of reconciliation to the believers in Ephesus. Remember, if any man be in Christ and we find that in the first three chapters of the book of Ephesians that the Apostle Paul is dealing with the fact that you are in Christ, your position. Remember, as we studied the book of Genesis and we dealt with the flood of Noah's day, and we spoke about the importance of being in the ark. See, if you were outside of the ark, you were destroyed. You had to be in the ark. That was the place of refuge, the place of safety. We find that it was only Noah, his wife, his three sons, and their wives, and of course the animals, but we find that the only eight human beings were saved. Why? Because they were in the ark, and we need to be in Christ. We need to be saved this morning. We find in Ephesians 2, in verse number 12, it says this, that at that time you are without Christ, being aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hope, and without God in the world. See, that's before salvation. That's the condition of all people prior to coming to Christ. We",
      "context": "...use they were in the ark, and we need to be in Christ. We need to be saved this morning. We find in Ephesians 2, in verse number 12, it says this, that at that time you are without Christ, being aliens from the ...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1496",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1560.4600219726562,
      "text": "it says this, that at that time you are without Christ, being aliens from the commonwealth of Israel, and strangers from the covenants of promise, having no hope, and without God in the world. See, that's before salvation. That's the condition of all people prior to coming to Christ. We understand, if you were to read the first few verses of the second chapter of the book of Ephesians, how that Paul has already laid that truth, that this is a universal condition for all mankind, that we are at enmity with God. We are separated from God. We are without God in the world, but notice verse 13, but now in Christ Jesus, ye who sometimes were far off are made nigh by the blood of Christ, for he is our peace, who hath made both one and hath broken down the middle wall of partition between us, having abolished in his flesh the enmity, even the law of commandments contained in ordinances, for to make in himself of twain one new man, so making peace. Notice verse 16 of Ephesians 2, and that he might reconcile both unto God in one body by the cross, having slain the enmity thereby. Remember, we speak about the miracle of reconciliation. We spoke about the problem. It's sin. It causes us to be at enmity with God. What can wash away my sin? Nothing but the blood of Jesus. Your works are not sufficient. The",
      "context": "...ned in ordinances, for to make in himself of twain one new man, so making peace. Notice verse 16 of Ephesians 2, and that he might reconcile both unto God in one body by the cross, having slain the enmity thereb...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1560",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}