{
  "reference": "Exodus 36",
  "occurrences": [
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 2317.3599853515625,
      "text": "Our best is what God deserves. By the way aren't you thankful that he gave you his best? I don't want to just mail it in. I don't want to just kind of go through the motions. No, no he deserves my best. He deserves your best. Let me use an example in closing this morning. An example from the Old Testament. Turn back to the book of Exodus if you will. We won't take time to look through all of it. In fact it would be a sermon series to look at all of it. But I want you to look at Exodus 36 and we're going to kind of walk our way through a few verses of scripture throughout the end of the book of Exodus here this morning in closing. With this idea of our service to God for the audience of one. As we examine our lives and we begin to consider how is my service to God? What am I doing for God? How am I serving God? I hope that you have an answer for that question because God has equipped you. He's enabled you. He's given us the opportunity, the ability to serve him. What a privilege it is. We find that in the book of Exodus there's a lot of things that are taking place in the book of Exodus. Of course God is bringing his people out of Egyptian captivity, Egyptian bondage and as God would bring his people",
      "context": "...ough all of it. In fact it would be a sermon series to look at all of it. But I want you to look at Exodus 36 and we're going to kind of walk our way through a few verses of scripture throughout the end of the...",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=2317",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 2437.5199699401855,
      "text": "amongst us. What a privilege and what a blessing. You think about the incarnation. But here, we think about the construction of the tabernacle. All of the instruction is given. If you were to study the book of Exodus, and if you were to have an idea of the tabernacle, and all of the intricacies. I mean, it was a very elaborate structure. There was a lot of work that took place. But I want you to understand that if you were to study through the book of Exodus, and begin to try to nail down a time frame, it's about five to six months that it took them to construct the tabernacle. Now, that's pretty amazing. When you consider all that was involved with the tabernacle, and all of the pieces of furniture, and the elaborate work, five to six months for its completion. And we think about this truth as we look at this idea of our service to the Lord. And as we think about the construction of the tabernacle, God had equipped Bezalel and Aholiab. He gives us their names specifically. And by the way, he told Moses about them, not only equipping them for the work, but enabling them to teach others how to do those things. But we find that as we look here, and we think about their work for God, the Bible tells us in Exodus 36, in verse number one, notice it says,",
      "context": "...ngs. But we find that as we look here, and we think about their work for God, the Bible tells us in Exodus 36, in verse number one, notice it says,",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=2437",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 2495.839973449707,
      "text": "about them, not only equipping them for the work, but enabling them to teach others how to do those things. But we find that as we look here, and we think about their work for God, the Bible tells us in Exodus 36, in verse number one, notice it says, then wrought Bezalel and Aholiab, notice, and every wise-hearted man. And then notice this phrase, in whom the Lord put wisdom and understanding to know how to work all manner of work for the service of the sanctuary according to all that the Lord had commanded. So, who was it that equipped them? It was the Lord. Who was it that equips you? It's the Lord. We've belabored the point in the New Testament this morning, for us as God's people in 2023, that God has equipped and enabled us. And here, as we look at this Old Testament illustration to prove the point this morning, to nail it home, if you will, that it was God who had given to Bezalel, Aholiab, and every wise-hearted man, the Lord put wisdom and understanding to know how to work all manner of work for the service of the sanctuary according to all the Lord had commanded. Notice verse two, and Moses called Bezalel and Aholiab and every wise-hearted man, in whose heart the Lord had put wisdom, and every one whose heart stirred him up to come unto",
      "context": "...ngs. But we find that as we look here, and we think about their work for God, the Bible tells us in Exodus 36, in verse number one, notice it says, then wrought Bezalel and Aholiab, notice, and every wise-hear...",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=2495",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}