{
  "reference": "Exodus 14",
  "occurrences": [
    {
      "sermon_id": "Qw84YBHvTq4",
      "timestamp": 469.239990234375,
      "text": "Rahab revealed. In verses eight through 11, during this interaction, this conversation between Rahab and these two spies, we find that Rahab revealed some things to them. In verse number 10, notice the phraseology where Rahab says, for we have heard. That's not only Rahab, but that's the inhabitants there of the city of Jericho, and we find that Rahab says we've heard, and she begins to explain to these two spies what it was that they heard. Number one, they heard about the miraculous Red Sea crossing. We read about that portion of scripture and that event that's given to us and recorded for us in Exodus chapter 14, and what a mountaintop passage of scripture Exodus 14 is, and you get to read about God's deliverance of his people out of Egypt and how he miraculously parted the Red Sea, and how the children of Israel, they walked, the Bible says, on dry ground, not mucky, muddy. No, it was dry ground. God worked a miracle, and the Egyptians, they saw what happened, and they assayed to go after them, and God caused the chariot wheels to come off, and they got stuck, and they were destroyed there in the Red Sea, and God wrought wonderfully. In fact, in chapter 15 of the book of Exodus, there's great rejoicing and singing that takes place, and here we find that Rahab,",
      "context": "...s given to us and recorded for us in Exodus chapter 14, and what a mountaintop passage of scripture Exodus 14 is, and you get to read about God's deliverance of his people out of Egypt and how he miraculously ...",
      "sermon_title": "Sermon Qw84YBHvTq4",
      "url": "https://www.youtube.com/watch?v=Qw84YBHvTq4&t=469",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PVuTDINYjgU",
      "timestamp": 844.9199829101562,
      "text": "say that often, and we find that he says, listen, neither let us tempt Christ. Verse number 10 gives us our fourth example of behavior to be avoided as we're learning these lessons from history. It says in verse number 10, neither murmur ye, as some of them also murmured and were destroyed of the destroyer. To murmur is to complain. I believe that it's number 16 that is being referenced here in verse number 10. But the reality is that there's so many portions of Scripture that you could go to in looking at the nation of Israel and see they're complaining. They were a complaining people, a murmuring people. I mean, as soon as they were done singing the great song of victory after they had crossed over the Red Sea and all of the victory that they experienced in Exodus 14 and into Exodus 15, by the time you get to the end of the chapter, they're complaining. They're murmuring. And it was a constant thing for them. Listen, it is so easy. I know I've said this over the years. It is so easy for us to complain. It is so easy for us to murmur. And it reveals that discontentment. It really challenges the very character and person of God when we're murmuring and complaining and we're questioning the goodness of God. And we find that he lists these four examples from history of behavior to be avoided, idolatry, fornication, neither let us tempt Christ,",
      "context": "... of victory after they had crossed over the Red Sea and all of the victory that they experienced in Exodus 14 and into Exodus 15, by the time you get to the end of the chapter, they're complaining. They're mur...",
      "sermon_title": "Sermon PVuTDINYjgU",
      "url": "https://www.youtube.com/watch?v=PVuTDINYjgU&t=844",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}