{
  "reference": "Exodus 3",
  "occurrences": [
    {
      "sermon_id": "8klBXE7J4Mg",
      "timestamp": 129.10000610351562,
      "text": "third chapter of the book of Exodus, we begin reading about the call of Moses. Now, we must understand that a great number of years has passed between Joseph dying, the period of time of bitter, hard bondage for the children of Israel, and now Moses being called by God. We find that most of Exodus 3 and Exodus chapter number 4 record for us and provide us with a dialogue, if you will, of the interaction between God and Moses. As God calls Moses and Moses says, I think you got the wrong guy and you see the interaction with the excuses and so on and so forth. But we find that as we look at this portion of scripture, and I really want to focus on verses 7 through 12 this evening, and I hope that it'll be a blessing to you and a help to you because God says, I know their sorrows. I'm thankful that our God is an eternal God. I'm thankful that he's omniscient and that he's omnipotent. He is immutable. He never changes. He's no respecter of persons. And I'm thankful this evening that as we look at a text of scripture in Exodus 3, a period of history that literally took place thousands of years ago, that we have the opportunity to see that we serve the same God today, and if you're facing challenges and difficulties",
      "context": "...r, hard bondage for the children of Israel, and now Moses being called by God. We find that most of Exodus 3 and Exodus chapter number 4 record for us and provide us with a dialogue, if you will, of the inter...",
      "sermon_title": "\"I Know Their Sorrows\" Exodus 3:7-12",
      "url": "https://www.youtube.com/watch?v=8klBXE7J4Mg&t=129",
      "channel": "Unknown",
      "publish_date": 20240520
    },
    {
      "sermon_id": "8klBXE7J4Mg",
      "timestamp": 184.10000610351562,
      "text": "And I'm thankful this evening that as we look at a text of scripture in Exodus 3, a period of history that literally took place thousands of years ago, that we have the opportunity to see that we serve the same God today, and if you're facing challenges and difficulties and you say, I have sorrows, I want you to know tonight that God knows your sorrows. He knows. He's aware. As we look at this portion of scripture, I want you to quickly, if you're taking notes, number one, notice the perspective of God. We've read verse 7 already. I'm going to read it again. And we find that God speaks, of course, we understand the call is recorded in the first several verses of Exodus chapter 3. And he begins to, God begins to speak to Moses out of that burning bush, the bush that burned with fire but was not consumed according to verse number 2. In verse 7 it says, the Lord said, I have surely seen the affliction of my people which are in Egypt and have heard their cry by reason of their taskmasters, for I know their sorrows. Verse number 9 says this, now therefore, behold, the cry of the children of Israel has come unto me, and I've also seen the oppression wherewith the Egyptians oppress them. When I consider the perspective of God from verse 7 and verse number 9, clearly revealed to us are two truths this evening.",
      "context": "And I'm thankful this evening that as we look at a text of scripture in Exodus 3, a period of history that literally took place thousands of years ago, that we have the opportunity...",
      "sermon_title": "\"I Know Their Sorrows\" Exodus 3:7-12",
      "url": "https://www.youtube.com/watch?v=8klBXE7J4Mg&t=184",
      "channel": "Unknown",
      "publish_date": 20240520
    },
    {
      "sermon_id": "8klBXE7J4Mg",
      "timestamp": 1662.6999816894531,
      "text": "promise of God in this text of Scripture is a powerful, I'll call it a life-altering promise. And it's found in verse number 12, when God says these words, certainly I will be with thee. Wow. God says, I'm going to do this. I'm going to bring my people out. I'm going to bring them in. Moses, I'm going to send you to Pharaoh so that you can bring forth my people, the children of Israel, out of Egypt. And Moses says, who am I? And God says this, certainly I will be with thee. What a promise that God gives to Moses in Exodus 3 and verse number 12. A promise of his presence. The reality that God was not simply sending Moses on a task to stand before and he was going in his own power and his own ability. No, God says, I will be with thee. You know what's amazing is that God's promise of his presence has been given to each of us this evening as his people. God says that he will never leave us nor forsake us. Within the context of the Great Commission, we find that Jesus Christ, our Savior, the Creator, he says, and lo, I am with you always. What a great promise that God gives. We ought never seek to do the work of God in our own power. We must always be dependent upon God and we must recognize this wonderful promise.",
      "context": "...o am I? And God says this, certainly I will be with thee. What a promise that God gives to Moses in Exodus 3 and verse number 12. A promise of his presence. The reality that God was not simply sending Moses o...",
      "sermon_title": "\"I Know Their Sorrows\" Exodus 3:7-12",
      "url": "https://www.youtube.com/watch?v=8klBXE7J4Mg&t=1662",
      "channel": "Unknown",
      "publish_date": 20240520
    }
  ]
}