{
  "reference": "Exodus 32",
  "occurrences": [
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1217.0800170898438,
      "text": "will in the 32nd chapter. In Exodus chapter 32. We find that the people are guilty. Moses is up on the mount and the people are there and they say to Aaron, and up make us gods which shall go before us. You can read that in verse number one. And he tells them what to do and he fashions this molten calf. And it's a wicked scene in Exodus chapter 32. I mean, it's a bad situation. And we find that Moses, you remember singing the song, Who is on the Lord's side? Amen, it's a good song, right? And we are on the Lord's side, amen? And it's a great song and we sing it. It comes from this passage of scripture. Notice what Moses says in verse number 26. Then Moses stood in the gate of the camp and said, Who is on the Lord's side? Let him come unto me. And what does it say? All the sons of Levi gathered themselves together unto him. That's a good decision by the people of Levi, the tribe of Levi. And it says in Exodus 32 and verse 26 that all the sons of Levi gathered themselves together unto him. Perhaps this gives us a little insight as to why in Deuteronomy chapter 33, what we could look at in Genesis 49 as being this scattering, this judgment, if you will, is really turned into a blessing because of what they did. They stood for right.",
      "context": "... together unto him. That's a good decision by the people of Levi, the tribe of Levi. And it says in Exodus 32 and verse 26 that all the sons of Levi gathered themselves together unto him. Perhaps this gives us...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1217",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PVuTDINYjgU",
      "timestamp": 443.239990234375,
      "text": "behavior that resulted in God not being pleased. Why? Because I wanna make note of that behavior and ensure that I do not implement that behavior in my life. Does that make sense? I was the oldest. I only have a younger brother. Some of you are not the firstborn. You're maybe the youngest, maybe somewhere in between. But as a older sibling, there were times, no doubt, that my brother could learn from my example. There were times, he's only a couple of years younger than I am, so I could learn from his example. And there were times in which you observed someone that did something that was not pleasing, a sibling, and using that analogy, that example this evening, that was not pleasing. I said, okay, well, I don't wanna do that. It's not something I wanna do. I don't wanna follow in those tracks. And so look at the four examples that are given here, behavior to be avoided. In verse number seven, the first one is given. He says, neither be ye idolaters, as were some of them. As it is written, that people sat down to eat and drink and rose up to play. I believe, as you look at verse number seven, that it's the account in Exodus 32 that is being referenced. Won't take the time to go there, but that's the record in which God gives us of the golden calf and all that takes place.",
      "context": "...d drink and rose up to play. I believe, as you look at verse number seven, that it's the account in Exodus 32 that is being referenced. Won't take the time to go there, but that's the record in which God gives...",
      "sermon_title": "Sermon PVuTDINYjgU",
      "url": "https://www.youtube.com/watch?v=PVuTDINYjgU&t=443",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PVuTDINYjgU",
      "timestamp": 506.0199890136719,
      "text": "and rose up to play. I believe, as you look at verse number seven, that it's the account in Exodus 32 that is being referenced. Won't take the time to go there, but that's the record in which God gives us of the golden calf and all that takes place. And God had been giving Moses the law. And as Moses is receiving the law, the people are in the camp breaking the very law that God is providing. In fact, at that time, he's giving them instruction for the tabernacle. And so they've made the covenant to obey the law. And he's getting the instruction for the tabernacle, and now they're breaking that. But notice it says, neither be ye idolaters. We know that the nation of Israel, as you study the Old Testament, idolatry is something that they continually deal with, and it's a recurring sin. It's preached against. The prophets preach out against the wickedness and the sin of idolatry. But we find that the New Testament tells us, in fact, in the book of 1 John, that we're to keep ourselves from idols. And though many of us in America, in our homes, we would not have idols that we would think of in our mind's eye as being an idol, a wooden structure, something that we'd put on a shelf somewhere and pray to or bow down to. And sometimes we think of idols, we think of that in our mind,",
      "context": "and rose up to play. I believe, as you look at verse number seven, that it's the account in Exodus 32 that is being referenced. Won't take the time to go there, but that's the record in which God gives...",
      "sermon_title": "Sermon PVuTDINYjgU",
      "url": "https://www.youtube.com/watch?v=PVuTDINYjgU&t=506",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}