{
  "reference": "Exodus 33",
  "occurrences": [
    {
      "sermon_id": "rAbk_dVtRjc",
      "timestamp": 2142.5199584960938,
      "text": "we have a plan to grow spiritually? Do we consider, do we think about, do we spend time with regard to how our spiritual walk is? Do we have that time in God's Word each day, that time in prayer each day that's a priority? Because one thing is needful. And we find this evening that we must not only have a plan to grow, but we must evaluate our growth. We must refuse to be comfortable or to be content with where we are. We must continue to press on to grow in a deeper, more intimate walk with our Lord. I think of Moses and I think of Paul. Both of those men made these statements that they would know God. We begin to think about both of those men making the statements in the time that they did, Exodus 33. You know Moses had spent time with God, I mean on the mount, spent time with God. He'd been in God's presence. He was there at the burning bush. He was there and saw all of the amazing miracles of the plagues. He experienced that. He had this closeness with God so much so that he could say to Pharaoh, okay, when I leave I'm going to raise my hand and God's going to, I mean he knew God, but he says in Exodus 33 that he wanted to know God. Paul, in the book of Philippians, he says that I may know Him.",
      "context": "...now God. We begin to think about both of those men making the statements in the time that they did, Exodus 33. You know Moses had spent time with God, I mean on the mount, spent time with God. He'd been in God...",
      "sermon_title": "\"Seven Lessons From Seven Churches\"  Revelation 2-3",
      "url": "https://www.youtube.com/watch?v=rAbk_dVtRjc&t=2142",
      "channel": "Unknown",
      "publish_date": 20250331
    },
    {
      "sermon_id": "rAbk_dVtRjc",
      "timestamp": 2207.5799560546875,
      "text": "that he could say to Pharaoh, okay, when I leave I'm going to raise my hand and God's going to, I mean he knew God, but he says in Exodus 33 that he wanted to know God. Paul, in the book of Philippians, he says that I may know Him. He's in jail ready to face a martyr's death. He'd walked with God. He'd seen God do amazing things. He says that I may know Him, that I never get content in my spiritual growth, that I continue to have that thirsting and that hungering because the reality this evening is that as much as you know about God today, He's so far greater than what your mind can even comprehend. Listen, I look at my own life. I look back 10 years, 20 years in my walk with Christ and listen, if you would have asked me 20 years ago, is God great, I would have said yes. And I would have had two or three things probably to tell you on why I thought God was great. Now you ask me why God's great, I got a whole lot more things to tell you and I say, listen, as much as I could agree with the psalmist when the psalmist says I know that the Lord is great and then I say, but His greatness is unsearchable. We keep that desire that we walk with God.",
      "context": "...kay, when I leave I'm going to raise my hand and God's going to, I mean he knew God, but he says in Exodus 33 that he wanted to know God. Paul, in the book of Philippians, he says that I may know Him. He's in ...",
      "sermon_title": "\"Seven Lessons From Seven Churches\"  Revelation 2-3",
      "url": "https://www.youtube.com/watch?v=rAbk_dVtRjc&t=2207",
      "channel": "Unknown",
      "publish_date": 20250331
    }
  ]
}