{
  "reference": "Exodus 34",
  "occurrences": [
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 675.5600280761719,
      "text": "four to one another, let us make a captain and let us return to Egypt, but Moses stands there. As we look at this passage of scripture, if you're taking notes this morning, I want you to notice first of all with me what Moses recalled, notice what Moses recalled. We set the scene this morning, we understand what's taking place and we find how God has spoken to Moses and Moses has responded to the Lord, and now notice in verse 17, as we notice what God had previously revealed and now Moses recalling this, it says in verse 17, and now I beseech thee, let the power of my Lord be great. Notice what he says, according as thou hast spoken, saying, so we're noticing here what Moses recalled. In verse number 18 and 19, I read it by way of introduction, but Moses is recalling what God had previously said to him in Exodus 34. We'll go there in just a moment, but let me read it again. The Bible says this, this is Moses recalling what God has said, the Lord is long-suffering. Aren't you thankful that God's long-suffering? Many times in our lives, I've said this over the years, I rejoice in God's long-suffering in my life more than I do in God's long-suffering in your life. Why is that? Well, it's just kind of a human nature. We're so thankful when God's long-suffering to us.",
      "context": "...19, I read it by way of introduction, but Moses is recalling what God had previously said to him in Exodus 34. We'll go there in just a moment, but let me read it again. The Bible says this, this is Moses reca...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=675",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 906.1000366210938,
      "text": "return, and we find that as Moses is coming back, he hears what's taking place, they hear this noise of war in the camp is how it's described by Joshua, we find that they arrive and they find that there are calves that have been created. These are your gods. It's a terrible scene, unfortunate set of circumstances. We find that these people had sinned, but then they repented, if you read chapter 33. And you come to chapter 34, and you find that it's in Exodus chapter 34 that God would renew the covenant that had just been broken by his people. And as he renews the covenant and as he's speaking to Moses, notice the Bible says this in verse number 6 of Exodus 34, and the Lord passed by before him and proclaimed. There's a Lord speaking, it says in verse number 1, and the Lord said unto Moses, so we see that God is speaking, he's speaking here to Moses, and notice what he says, the Lord, the Lord God, merciful and gracious, long-suffering and abundant in goodness and truth, keeping mercy for thousands, forgiving iniquity and transgression and sin, and that will by no means clear the guilty, visiting the iniquity of the fathers upon the children and upon the children's children and to the third and to the fourth generation. Isn't it amazing, as you read the account in Numbers chapter 14, our text for this morning,",
      "context": "... renews the covenant and as he's speaking to Moses, notice the Bible says this in verse number 6 of Exodus 34, and the Lord passed by before him and proclaimed. There's a Lord speaking, it says in verse number...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=906",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1679.0400390625,
      "text": "unto the greatness of thy mercy. We find, again, the basis of the request is God's great mercy. And then notice as you continue in verse 19, the Bible says, and as thou hast forgiven this people from Egypt, even until now. Think about that phrase to end verse 19. His mercy has been regularly on display. He had forgiven his people. You think about the children of Israel. I mean, right after they enter or cross over the Red Sea, the complaining begins immediately. We've mentioned about the mermaid. I mean, they sing this great song in Exodus chapter number 15 about the deliverance and all that God has done. And then they get to a place where there's bitter water and they start complaining immediately. And then they complain that there's nothing to eat. Then later on, they'll complain that they don't like what God provided for them. And just the murmuring. And here, we find that Moses is praying. He's pleading with God. He's interceding on the behalf of the people that God would pardon them according to the greatness of his mercy. And he says this, as thou hast forgiven this people from Egypt, even until now. Moses makes a bold request. His request is made because of what he had recalled. He recalled what God had revealed to him as noted in Exodus 34. I'm thankful that God's mercy is on display throughout his word. You can read over and over throughout God's word",
      "context": "...quest is made because of what he had recalled. He recalled what God had revealed to him as noted in Exodus 34. I'm thankful that God's mercy is on display throughout his word. You can read over and over throug...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1679",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1765.0400390625,
      "text": "until now. Moses makes a bold request. His request is made because of what he had recalled. He recalled what God had revealed to him as noted in Exodus 34. I'm thankful that God's mercy is on display throughout his word. You can read over and over throughout God's word of God's mercy being on full display. You've experienced in your life, and I've experienced in my life, God's mercy. And I'm so thankful this morning that Moses would stand between the people and the Lord, and he would cry out and he would beseech the Lord, and he would say that it's not because they deserve it. Because what they deserve was judgment. I don't deserve to be forgiven. You don't deserve to be forgiven. But I'm certainly thankful that God chose to forgive me. us. What a blessing. You can't earn forgiveness. You can't. There are people that try. There are religious systems that have been designed and developed to try to persuade people that they can do something to earn forgiveness, to buy God's favor. It's not possible. It's not possible. As we look at the passage of Scripture here in Numbers 14, we note first what Moses recalled and what he requested, but now I want you to notice as we finish the passage of Scripture here in verse number 20, I want you to notice how God responded. Notice how God responded. It's a simple verse of Scripture. The Lord speaks back to Moses.",
      "context": "...quest is made because of what he had recalled. He recalled what God had revealed to him as noted in Exodus 34. I'm thankful that God's mercy is on display throughout his word. You can read over and over throug...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1765",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}