{
  "reference": "Ezekiel 3",
  "occurrences": [
    {
      "sermon_id": "BB7NHySh5dQ",
      "timestamp": 942.239990234375,
      "text": "over there. Notice what he says in Acts chapter 20 as he's talking to the church leaders of the church at Ephesus. He says in verse number 26 of Acts chapter 20, wherefore I take you to record this day that I am pure from the blood of all men. Now understand with me this evening that there are some commentators in Bible, theologians and what have you, that would say to you, they would make it as if Paul had no knowledge of the book of Ezekiel when he was writing these things. Paul was extremely aware of the Old Testament. He was a master in the Old Testament. He was trained at the feet of Gamaliel. He knew the Old Testament. You know what the Old Testament talks about? It talks about Ezekiel being a watchman. And as the watchman, he had a responsibility to warn. That warning being given, the watchman has no control on the response of the warned. He has a responsibility to warn, but he has no part in how they respond to that warning. And God tells Ezekiel that if you warn, then you're free. You don't have any blood on your hands. You've done what you're supposed to do. Now if they don't listen, that's on them. If you fail to warn, the blood's on your hands. Ezekiel 3 and 33, you can look at both passages and you can see that God deals with that.",
      "context": "...ed to do. Now if they don't listen, that's on them. If you fail to warn, the blood's on your hands. Ezekiel 3 and 33, you can look at both passages and you can see that God deals with that.",
      "sermon_title": "\"I Have Much People In This City\" Acts 18:1-11",
      "url": "https://www.youtube.com/watch?v=BB7NHySh5dQ&t=942",
      "channel": "Unknown",
      "publish_date": 20240603
    },
    {
      "sermon_id": "BB7NHySh5dQ",
      "timestamp": 1015.7200012207031,
      "text": "have any blood on your hands. You've done what you're supposed to do. Now if they don't listen, that's on them. If you fail to warn, the blood's on your hands. Ezekiel 3 and 33, you can look at both passages and you can see that God deals with that. So now for Paul, of course we understand in the inspiration of the Holy Spirit, he says I am clean. He says your blood be upon your own heads, I am clean. I don't know how somebody cannot see the book of Ezekiel in that statement. I don't understand in Acts chapter number 20 when he says I am pure from the blood of all men, that why does he say, well if you look at the passage, he says listen, for the space of three years I ceased not to warn everyone night and day with tears. He was doing what he was supposed to do. He had passion about what he was doing. Paul says in the book of Romans, if you look at the ninth chapter and also at the tenth chapter of the book of Romans, you find some wonderful statements that the apostle Paul makes with regard to his desire for people to be saved. In Romans chapter number nine, in verse number two he says, in verse one, I say the truth in Christ, I lie not, my conscience also bearing me witness in the Holy Ghost, that I have",
      "context": "...ed to do. Now if they don't listen, that's on them. If you fail to warn, the blood's on your hands. Ezekiel 3 and 33, you can look at both passages and you can see that God deals with that. So now for Paul, of...",
      "sermon_title": "\"I Have Much People In This City\" Acts 18:1-11",
      "url": "https://www.youtube.com/watch?v=BB7NHySh5dQ&t=1015",
      "channel": "Unknown",
      "publish_date": 20240603
    }
  ]
}