{
  "reference": "Ezra 7",
  "occurrences": [
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 1393.5400390625,
      "text": "our distinction is that the Bible the Word of God is the sole authority for faith and practice. It's something that we just kind of some traditions that we just follow like in a in a wrong manner but we're seeking to follow the Word of God. What sayeth the Lord? And if we're going to give truth if we're going to be ready to give the gospel as Paul says in Romans 1 and verse number 15 we we have to have some preparation. How is it that I'm going to give the gospel? What answer am I going to give to someone when that opportunity presents itself? I'm mindful of Ezra in the Old Testament in Ezra 7 and verse number 10 if you want to jot that reference down but Ezra says in that passage of Scripture that he prepared his heart to seek the law of the Lord and to do it and to teach in Israel statutes and judgments. What a powerful verse of Scripture. Ezra he says that he he was prepared as we would see that he understood that he sought the law of the Lord to do it and then to teach in Israel statutes and judgments the time of his preparation preceded the opportunity that was afforded him. We find that if you were to read throughout Ezra 7 that's verse number 10 if you read the remainder of chapter 7 and really get into chapter number 8 you see",
      "context": "... give to someone when that opportunity presents itself? I'm mindful of Ezra in the Old Testament in Ezra 7 and verse number 10 if you want to jot that reference down but Ezra says in that passage of Scriptu...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=1393",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 1468.300048828125,
      "text": "teach in Israel statutes and judgments the time of his preparation preceded the opportunity that was afforded him. We find that if you were to read throughout Ezra 7 that's verse number 10 if you read the remainder of chapter 7 and really get into chapter number 8 you see that opportunities are given to Ezra because of the preparation that he's already gone through. This morning as we think about these statements from Romans chapter number 1 I believe that if we have that proper perspective in verse 14 that I am dead or that it will lead us to that proper preparation of being able to say I am ready and then as we have prepared I believe that God will give us opportunities that he will present us with those opportunities. Why? Well if we take these two thoughts in connection this morning then we are mindful and we are looking for the opportunities because we have understood the perspective that I am dead or and we've gone through the preparation I am ready and therefore we are now looking for those opportunities. There are simple statements that you can make to people that cause them to stop in their tracks and inquire as to what you mean. I met a guy when I was in Bible college that every time you asked him he wasn't in Bible college he was a preacher that",
      "context": "...aration preceded the opportunity that was afforded him. We find that if you were to read throughout Ezra 7 that's verse number 10 if you read the remainder of chapter 7 and really get into chapter number 8 ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=1468",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}