{
  "reference": "Galatians 3",
  "occurrences": [
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 2474.8600540161133,
      "text": "10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just zeroes in on Abraham, and we read all of these chapters and all of these events of a hundred years of the life of Abraham. Remember it was that God said this as we read Galatians, and just hold your place, yeah, just turn over to Galatians, you don't need to hold your place in Genesis anymore, but go over to Galatians, if you will, and I want you to know what God tells us here in the book of Galatians in chapter number 3, and we find again how the the attention of Scripture, the focus of Scripture from Abraham now shifting to Isaac, and we see this in Galatians 3 and verse number 16. Notice what the Bible says, \"...now to Abraham and his seed were the promises made.\" Notice what it says, \"...he saith not unto seeds, plural, as of many, but as of one, and to thy seed, which is Christ.\" We've mentioned in the past the phraseology of the title of a book that was written by William Scroggie, the unfolding drama of redemption, and we find how God, no doubt He could have given us all of the history of any of the other descendants that He chose to give us because He knows everything, but in His plan, in His plan of redemption, the Messianic line, the birth of",
      "context": "...tention of Scripture, the focus of Scripture from Abraham now shifting to Isaac, and we see this in Galatians 3 and verse number 16. Notice what the Bible says, \"...now to Abraham and his seed were the promises ...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=2474",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 490.8599853515625,
      "text": "Christ throughout Scripture, and again, the zooming in of God upon the line of Abraham after the Tower of Babel, and then zooming in further upon that of Isaac, of course, the descendants of Isaac, of course, going through Israel there, and His Twelve, and so on and so forth. And so we would find how that the lens of Scripture will focus upon the lineage of the Lord Jesus Christ. It is interesting, however, to note in the same passage of Scripture in Galatians 3, the Bible says this in verse number 7, \"'Know ye therefore that they which are of faith, the same are the children of Abraham.' And the Scripture, foreseeing that God would justify the heathen through faith, preached before the gospel unto Abraham, saying, In thee shall all nations be blessed. So then they which be of faith are blessed with faithful Abraham.'\" And I'm thankful for the truth of the New Testament with regard to this spiritual descendant, if you will, or descendants, those that have come to the knowledge of the truth of the gospel, and those which are of faith are the same, the same are the children of Abraham. We'd find that all mankind needs to be redeemed, that there are but two categories of people in our world. There are those that have been born again, those that are saved, and there are those that are yet to be born again, those who are lost.",
      "context": "...e of the Lord Jesus Christ. It is interesting, however, to note in the same passage of Scripture in Galatians 3, the Bible says this in verse number 7, \"'Know ye therefore that they which are of faith, the same ...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=490",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 830.8599853515625,
      "text": "but I want you to notice that in Romans chapter number 4, in verse number 3, Paul is referring to an event that took place in the life of Abram in Genesis chapter number 15, well before the token of the covenant, that of circumcision, was ever explained to Abram. We find here in Romans chapter number 4, in verse number 3, the Bible says, For what sayeth the Scripture, Abraham believed God, and it was counted unto him for righteousness. Again as we've studied, and I made note of this in Genesis chapter number 15, when God was speaking with Abram and that discussion is taking place, and Abram had mentioned about one born in his house was an heir, and it says that God reconfirms for him the promise, and it says he believed in the Lord and he counted it to him for righteousness in Genesis 15 in verse number 6. Again in Galatians 3, stay here in the book of Romans, but in Galatians 3 in verse number 6, Paul refers to this same event that we just mentioned in Genesis 15, where the Bible says in Galatians 3 and 6, even as Abraham believed God, and it was accounted to him for righteousness. Again, that event in Genesis 15 predates the communication between God and Abraham that we're studying in Genesis 17 with regard to the token of the covenant, that of circumcision.",
      "context": "...ed in the Lord and he counted it to him for righteousness in Genesis 15 in verse number 6. Again in Galatians 3, stay here in the book of Romans, but in Galatians 3 in verse number 6, Paul refers to this same ev...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=830",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 896.1799926757812,
      "text": "Bible says in Galatians 3 and 6, even as Abraham believed God, and it was accounted to him for righteousness. Again, that event in Genesis 15 predates the communication between God and Abraham that we're studying in Genesis 17 with regard to the token of the covenant, that of circumcision. Look back in Romans 4 and look down at verse number 9, if you will. The Bible says this, \"...cometh this blessedness then upon the circumcision only, or upon the uncircumcision also? For we say that faith was reckoned to Abraham for righteousness.\" How was it then reckoned? When he was in circumcision or in uncircumcision? Not in circumcision, but in uncircumcision. Why? Again, Genesis 15 versus Genesis 17, the chronological order of these events in the life of Abraham, and again in verse number 11 it says, \"...and he received the sign of circumcision, a seal of the righteousness of the faith which he had, yet being uncircumcised, that he might be the father of all them that believe, though they be not circumcised, that righteousness might be imputed unto them also.\" Paul, of course, as I mentioned already, the event in Acts chapter number 15, he dealt with it quite extensively in the book of Galatians, and we find that Paul would summarize it this way in the book of Galatians, and he would say, \"...for in Christ Jesus neither circumcision availeth anything, nor uncircumcision, but a new creature.\"",
      "context": "Bible says in Galatians 3 and 6, even as Abraham believed God, and it was accounted to him for righteousness. Again, that eve...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=896",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 693.3399963378906,
      "text": "and we know that this goes back to the Abrahamic covenant. We understand that as we've studied in weeks gone by the details of the Abrahamic covenant, we see here that God says to Jacob, I am the Lord God of Abraham, thy father, the God of Isaac, the land whereon thou liest, to thee will I give it and to thy seed. Notice he continues in verse number 14, not only regarding a place, but now regarding a person, and that person being the Lord. Notice it says, and thy seed shall be as the dust of the earth, and thou shalt spread abroad to the west, to the east, to the north, and to the south, and in thee and in thy seed shall all the families of the earth be blessed. Of course, we understand seed plural with regard to the nation of Israel, but when we think about seed singular, as God spoke to Abraham, remember in Galatians 3 in verse number 16, he says, I did not say seeds, but seed, speaking of the Lord Jesus Christ. And what great truth. Of course, we know that Jacob would be married, he'd have the sons, the tribes of Israel, so on and so forth. But we find that as he gives them this promise, he talks about the way in which they'd spread abroad to the west, east, north, and south. But we think specifically about the promised Messiah, the messianic prophecy and the promise",
      "context": "...o the nation of Israel, but when we think about seed singular, as God spoke to Abraham, remember in Galatians 3 in verse number 16, he says, I did not say seeds, but seed, speaking of the Lord Jesus Christ. And ...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=693",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 764.3800048828125,
      "text": "the tribes of Israel, so on and so forth. But we find that as he gives them this promise, he talks about the way in which they'd spread abroad to the west, east, north, and south. But we think specifically about the promised Messiah, the messianic prophecy and the promise and the line that I mentioned already in Galatians 3 in verse number 16, and what a precious truth. And so as we begin to focus in and we see that Jacob, he goes to this place and he lies down to sleep and he has this dream. And as he has this dream, he hears the voice of God. God begins to speak to him. God begins to reveal truth to him. We would say that God begins to reveal his plan to him. In verse number 15, we find that he gives them truth regarding his plan and his presence. He is now speaking about Jacob's life specifically. Notice in verse 15, what encouraging promises are received here in this verse of Scripture. And behold, I am with thee, and will keep thee in all places whither thou goest, and will bring thee again into this land, for I will not leave thee until I have done that which I have spoken to thee of. Isn't that precious? Isn't that encouraging? How often we go to the Word of God and we are reminded of the precious truth of God giving",
      "context": "...e promised Messiah, the messianic prophecy and the promise and the line that I mentioned already in Galatians 3 in verse number 16, and what a precious truth. And so as we begin to focus in and we see that Jacob...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=764",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6jkKQL6IlWQ",
      "timestamp": 2289.939971923828,
      "text": "seed and we understand the birth of Isaac that would come later on here in the book of Genesis as we begin to read about that miraculous birth and how God was fulfilling the promise that he made to Abram and Sarah. And we see that in chapter number 21. But of course we understand the fullness of that Abrahamic covenant and that promise with regard to the seed is the Lord Jesus. We find that Paul mentions that in the book of Galatians. If you want to take a moment to turn there, we referenced this last week briefly and we'll reference it again this evening. We see in Galatians chapter number 3 that as the reference to Genesis chapter number 15 in verse number 6 is seen in Galatians 3 and verse number 6. The Bible says even as Abraham believed God and it was accounted to him for righteousness. And we find it in verse number 16 of Galatians 3. It says, Now to Abraham and his seed were the promises made. He saith not unto seeds as of many, but as of one, and to thy seed, which is Christ. And so we understood as we studied through the 15th chapter of the book of Genesis over these last few weeks and really over the last few chapters of the book of Genesis that this promise has been given to Abram and it's a seed and it's a land and we focus upon that",
      "context": "...ns chapter number 3 that as the reference to Genesis chapter number 15 in verse number 6 is seen in Galatians 3 and verse number 6. The Bible says even as Abraham believed God and it was accounted to him for rig...",
      "sermon_title": "Sermon 6jkKQL6IlWQ",
      "url": "https://www.youtube.com/watch?v=6jkKQL6IlWQ&t=2289",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "td5xeZwEM4k",
      "timestamp": 264.79998779296875,
      "text": "of the Lord Jesus Christ, we said this, and we looked at examples throughout the Scriptures, He demonstrated His power over the demons, He demonstrated His power over disease, He demonstrated His power over death, and He demonstrated His power over nature. I'm so thankful that our God is omnipotent, that He has all power, in fact Jesus said before He ascended to heaven, all power is given unto me in heaven and in earth, and then He gave the great commission to the disciples. So as we continue our study this evening, Jesus is all the world to me, part two, we would say this, reason number three, because of His death, burial, and glorious resurrection. I'm going to invite you to go to the book of Matthew in the 27th chapter, here in Matthew chapter number 27, we'll look through a lengthy portion of Scripture that God has given us with regard to this, the death and the burial and the resurrection of our Savior, and as you're turning to Matthew 27, I'm going to remind you of what Paul said to the believers in the region of Galatia, in Galatians 3 and verse 13, Paul said, Christ hath redeemed us from the curse of the law, being made a curse for us, for it is written, cursed is everyone that hangeth on a tree. When we think about the death, burial, and resurrection",
      "context": "...Matthew 27, I'm going to remind you of what Paul said to the believers in the region of Galatia, in Galatians 3 and verse 13, Paul said, Christ hath redeemed us from the curse of the law, being made a curse for ...",
      "sermon_title": "Sermon td5xeZwEM4k",
      "url": "https://www.youtube.com/watch?v=td5xeZwEM4k&t=264",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "td5xeZwEM4k",
      "timestamp": 329.0799865722656,
      "text": "in the region of Galatia, in Galatians 3 and verse 13, Paul said, Christ hath redeemed us from the curse of the law, being made a curse for us, for it is written, cursed is everyone that hangeth on a tree. When we think about the death, burial, and resurrection of our Lord and Savior Jesus Christ, we understand the power of what we're dealing with, and the gospel is, as Paul would say in 1 Corinthians 15, the gospel is the death, burial, and resurrection of Jesus Christ. And so when we think about Jesus is all the world to me because of His substitutionary atonement, and of course He was buried in a borrowed tomb and He rose conquering sin, death, and the grave, we must consider the suffering at Calvary. In Matthew chapter number 27, if you'd begin reading with me in verse number 27, the Bible says this, then the soldiers of the governor took Jesus into the common hall and gathered unto Him the whole band of soldiers, and they stripped Him and put on Him a scarlet robe, and when they had plaited a crown of thorns, they put it upon His head and a reed in His right hand. They bowed the knee before Him and mocked Him, saying, Hail, King of the Jews. Verse 30 tells us that they spit upon Him, took the reed, and smote Him on the head. And after",
      "context": "in the region of Galatia, in Galatians 3 and verse 13, Paul said, Christ hath redeemed us from the curse of the law, being made a curse for ...",
      "sermon_title": "Sermon td5xeZwEM4k",
      "url": "https://www.youtube.com/watch?v=td5xeZwEM4k&t=329",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}