{
  "reference": "Galatians 5",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 876.7200317382812,
      "text": "and neither can you. You know what's so frustrating is when we try, when we try to live the Christian life in our own power, in our own strength, and we try to live it in our own flesh, and it's frustrating, but He promised that He would empower us. We find in Acts 1.8 as He says to the disciples as they're there after they had heard this great commission and before they would go, of course, to the ascension and then wait for the promise of the Father. We find that Jesus says, but you shall receive power after the Holy Ghost has come upon you. I'm thankful for the empowering of Christ. I'm thankful that He's promised to empower us, that it's not in my flesh. Remember, Paul said, I know that in me that is in my flesh dwelleth no good thing. For to will is present. But then how do we accomplish that, right? Oh, woe is me, oh wretched man that I am. And we find here that He's promised to empower us that we're to be filled with the Spirit of God. Ephesians 5 and verse number 18, be not drunk with wine wherein is excess, but be filled with the Spirit of God. And we understand that importance of daily being filled with His Spirit. The Bible says in Galatians 5, walk in the Spirit, and ye shall not fulfill the lust of the flesh.",
      "context": "... of God. And we understand that importance of daily being filled with His Spirit. The Bible says in Galatians 5, walk in the Spirit, and ye shall not fulfill the lust of the flesh.",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=876",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 938.52001953125,
      "text": "number 18, be not drunk with wine wherein is excess, but be filled with the Spirit of God. And we understand that importance of daily being filled with His Spirit. The Bible says in Galatians 5, walk in the Spirit, and ye shall not fulfill the lust of the flesh. The reality is that your flesh and my flesh has lust. Our flesh, our old nature, our sinful nature, that old man, it has desires, it has fleshly desires, but the promise is that as we walk in the Spirit, we shall not fulfill the lust of the flesh. Why? Because He empowers us. I'm so thankful that it's Christ in you, the hope of glory. The reality is that He told us that we would have the indwelling of the Holy Spirit of God. Remember what He said to the disciples when He said that He was going to depart. He said, it's expedient for you that I go away. Why? Because I'm going to send the Holy Spirit, I'm going to send the Comforter. And we find that this evening at the moment of salvation, we trust Christ as our Savior, that He empowers us and He dwells within us, and we have the power of God Almighty. It's not my own power, it's not your power, it's His power through us, and I'm thankful that He empowers us. What about this? He keeps us. Aren't you thankful for that?",
      "context": "... of God. And we understand that importance of daily being filled with His Spirit. The Bible says in Galatians 5, walk in the Spirit, and ye shall not fulfill the lust of the flesh. The reality is that your flesh...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=938",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 405.05999755859375,
      "text": "us that because God knows us? Amen, God's the one that created us and he knows the sinful condition of man Of course after the garden the fall of man He understands and the reality is that many of us struggle in the area of being patient or being long-suffering Some have said and maybe you've heard it maybe you've said it you should never pray for patience You ever hear somebody say that maybe you've been guilty of saying that I've heard preachers say you shouldn't pray for patience Because then the trials come and that's how God's gonna help you get patience I've heard people say that and the reality is that the the truth as we look at the word patient and Understanding that it means to be long-suffering. It is a it's it's Described as we look at Galatians 5 in fact turned there as the fruit of the Spirit notice in Galatians 5 and as I look at the truth in Galatians 5 when the Bible says the fruit of the Spirit now It does not say but the fruits plural of the Spirit it says but the fruit of the Spirit now I believe that that's important for us to understand because as the Next phrase is given to us and all of these words are given in verse 22 and 23 of Galatians 5 We find that the fruit of the Spirit is",
      "context": "...ent and Understanding that it means to be long-suffering. It is a it's it's Described as we look at Galatians 5 in fact turned there as the fruit of the Spirit notice in Galatians 5 and as I look at the truth in...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=405",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 466.7799987792969,
      "text": "says but the fruit of the Spirit now I believe that that's important for us to understand because as the Next phrase is given to us and all of these words are given in verse 22 and 23 of Galatians 5 We find that the fruit of the Spirit is Described with all of these words these terms. It's not that I have the fruit of the Spirit I just don't have that one. Do you understand what I'm saying? And so we find here this evening This is the fruit of the Spirit. Have you ever described something? maybe you've used a number of of words and describing something you had a Good dinner and you used a number of words to describe that dinner But it's all describing the same piece of meat or the same Side salad that you had or whatever. It might be and here we find this is but the fruit of the Spirit is love joy Peace notice what it says long Suffering you see it. They're not making it up. It's right there in verse 22 gentleness goodness faith meekness Temperance against such there is no law in verse number 16 It says this I say then walk in the Spirit and you shall not fulfill the lust of the flesh And then God gives us this wonderful truth in verse 17 that all of us have proven to be Absolutely true. The Bible says the flesh lusteth against the spirit",
      "context": "...nd because as the Next phrase is given to us and all of these words are given in verse 22 and 23 of Galatians 5 We find that the fruit of the Spirit is Described with all of these words these terms. It's not tha...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=466",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 938.0,
      "text": "the Bible says, Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it in the lust thereof, neither yield ye your members as instruments of unrighteousness unto sin, but yield yourselves unto God as those that are alive from the dead, and your members as instruments of righteousness unto God. Because we're saved, we now can yield ourselves unto God. Notice the truth of verse 14, for sin shall not have dominion over you, for you're not under the law, but under grace. And I'm so thankful, notice Romans 8 and verse number 2, where the Bible says, for the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death. And I'm no longer bound by the power of sin. We understand that the Bible teaches us that our flesh still has an appetite and still has a desire. The Bible tells us in Galatians 5 that the Spirit is at enmity, or the flesh is at enmity with the Spirit, they're contrary one to the other. And it says, the flesh lusteth against the Spirit and the Spirit against the flesh, and these are contrary the one to the other, so that you cannot do the things that you would. So what's the answer? Walk in the Spirit, that you should not fulfill the lust of the flesh.",
      "context": "...Bible teaches us that our flesh still has an appetite and still has a desire. The Bible tells us in Galatians 5 that the Spirit is at enmity, or the flesh is at enmity with the Spirit, they're contrary one to th...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=938",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 369.6199951171875,
      "text": "have some level of understanding of what Paul is dealing with, with the games that were so common, and he says here in verse number 25, and every man that striveth for the mastery is temperate in all things. Now, they do it, those that run those temporal races, they do it to obtain, look at what he says, a corruptible crown. A corruptible crown. But we, what is he saying? An incorruptible. I therefore, Paul gives his testimony here, I therefore so run, not as uncertainly, so fight I, not as one that beateth the air, but I keep under my body and bring it into subjection, lest that by any means, when I have preached to others, I myself should be a castaway. As he's writing to the churches in the region of Galatia, and we know that it was there on that first missionary journey that Paul had the opportunity to go into the region of Galatia to see churches established, and as he would write the book of Galatians back to those believers, he uses once again that analogy, he alludes to the subject matter of the analogy of running a race, and here's what Paul says to those believers in the region of Galatia in Galatians 5 and verse number 7, he says, ye did run well. Who did hinder you that you should not obey the truth? Now, if you are familiar with the content of the book of Galatians, you'll understand that",
      "context": "...analogy of running a race, and here's what Paul says to those believers in the region of Galatia in Galatians 5 and verse number 7, he says, ye did run well. Who did hinder you that you should not obey the truth...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=369",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 443.3800048828125,
      "text": "Paul says to those believers in the region of Galatia in Galatians 5 and verse number 7, he says, ye did run well. Who did hinder you that you should not obey the truth? Now, if you are familiar with the content of the book of Galatians, you'll understand that there were some Judaizers that came in after the apostle Paul had been there and established those churches, and he leaves, and of course, the book of Acts would give us the record of all of those travels. We find that there were those that came in, and in the first chapter, Paul says this with regard to their ministry and their deception, that they're coming in, they're preaching another gospel, he says, which is not another. Notice in chapter number 1 of Galatians, he says this in verse number 6, I marvel that ye are so soon removed from him that called you unto the grace of Christ unto another gospel, which is not another, but there be some that trouble you and would pervert the gospel of Christ. But though we or an angel from heaven preach any other gospel unto you than that which we have preached unto you, let him be accursed. What strong language is used to deal with these false teachers? And we find that as he would, near the end of this letter that he would write",
      "context": "Paul says to those believers in the region of Galatia in Galatians 5 and verse number 7, he says, ye did run well. Who did hinder you that you should not obey the truth...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=443",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 429.8399963378906,
      "text": "from sin, or sin will keep you from this book. What do you mean by that? Well, as I'm in the Word of God and I'm feasting upon the Word of God and I'm studying and I'm applying, then God's Word helps me to have victory over the old man, over the flesh, and to sin less. Amen? But if I'm in a state of sinfulness, if I'm in a state of sinning and I've gotten comfortable with it, the reality is that I don't want to read something that's going to convict me. So therefore, sin will keep me from this book. I think it was a very appropriate statement that Brother Moody made with regard to that. This morning as we look at this portion of Scripture, I've simply entitled the message from verse number 8, put off all these. I'm going to examine the list that is provided here and then at the end of the message I just want to give three simple thoughts that I trust will help you and help me as we seek to obey the Word of God. I believe that the portion of Scripture in which we're looking at this morning has got some sister passages. I'm not going to read them, but perhaps you want to jot these down in your notes. Galatians 5, verses 19-21, in that portion of Scripture, God details what the works of the flesh are.",
      "context": "... sister passages. I'm not going to read them, but perhaps you want to jot these down in your notes. Galatians 5, verses 19-21, in that portion of Scripture, God details what the works of the flesh are.",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=429",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 490.67999267578125,
      "text": "portion of Scripture in which we're looking at this morning has got some sister passages. I'm not going to read them, but perhaps you want to jot these down in your notes. Galatians 5, verses 19-21, in that portion of Scripture, God details what the works of the flesh are. They're manifested in this way, and you find a long, detailed list of how the works of the flesh are manifested, and you'll see that in Galatians 5, verses 19-21. But then also in Ephesians chapter number 4, verses 17-32. In Ephesians 4, verses 17-32, again Paul will use the same terminology, similar terminology, as he uses here in Galatians, Colossians 3, with regard to put off and put on. And that passage of Scripture would be a great help to you. I believe that as we think about this passage that is before us and those sister passages that I mentioned before just a moment ago, I believe that really this is the outworking of the truth that Peter gives in 1 Peter chapter number 1. If you want to hold your place there in Colossians, let me just read a few verses to you in 1 Peter chapter number 1, and then we'll jump right back over there to Colossians chapter number 3 and deal with this portion of Scripture. We find here that in 1 Peter chapter number 1, in verse number 13, notice what Peter says,",
      "context": "... sister passages. I'm not going to read them, but perhaps you want to jot these down in your notes. Galatians 5, verses 19-21, in that portion of Scripture, God details what the works of the flesh are. They're m...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=490",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}