{
  "reference": "Genesis 24",
  "occurrences": [
    {
      "sermon_id": "WBrQ2Fdoczo",
      "timestamp": 533.3800048828125,
      "text": "not the number one important thing. You know what the top of the list should be for a saved person? That they're saved, amen? And then you begin to think about that truth of not being unequally yoked. It doesn't just mean saved and saved, though that's where it starts. But we ought to desire for our children to have a spouse who has a spiritual mind and a desire to serve God and live for God. We find that this instruction is given, why is it that in verse number two, he gives the instruction with regard to who was permitted. I believe that there's some insight given to us, obviously Rebecca had some influence, but go back to Genesis chapter 25 if you will and look here, Genesis 24, excuse me, I want you to look in Genesis chapter number 24. You'll be mindful of this passage of scripture, it records for us the marriage of Isaac. You'll remember that Abraham, he was concerned that Isaac properly marry. However, he says this in verse number three, and I will make thee swear by the Lord, the God of heaven and the God of the earth, that thou shalt not take a wife unto my son of the daughters of the Canaanites among whom I dwell, but thou shalt go unto my country and to my kindred and take a wife unto my son Isaac. Man, doesn't that sound similar to what Isaac did?",
      "context": "... obviously Rebecca had some influence, but go back to Genesis chapter 25 if you will and look here, Genesis 24, excuse me, I want you to look in Genesis chapter number 24. You'll be mindful of this passage of s...",
      "sermon_title": "Sermon WBrQ2Fdoczo",
      "url": "https://www.youtube.com/watch?v=WBrQ2Fdoczo&t=533",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 411.6000061035156,
      "text": "old age at the set time of which God had spoken to him, and Abraham called the name of his son that was born unto him, whom Sarah bare to him, Isaac. Now, God had given many promises to Abraham over the years with regard to this son that would be born, but, of course, Abraham and Sarah to have a son and the covenant that would be established, and we find the fulfillment of that birth there in Genesis 21. We find here in our text of Scripture, well, last week in Genesis 24, we read about the wife of Isaac, Rebekah. We looked at the entirety of chapter 24, and we find in verse number five, the Bible says of Isaac, of Genesis 25, that Abraham gave all that he had unto Isaac. We now read of these sons of Keturah. It tells us that Abraham took a wife. Her name was Keturah. Notice in verses two and three, the Bible tells us, and she bare him Zimran, and Jokshan, and Midan, and Midian, and Ishbak, and Shuah, and Jokshan begat Sheba, and Dedan, and the sons of Dedan were Asheram, and Latusham, and Lamumim, and the sons of Midian, Ephah, and Epher, and Hanok, and Abida, and Eldah. All these were the children of Keturah. And so you read of the sons, Zimran, Jokshan, Midan, Midian, Ishbak, and Shuah, and then the grandsons that are mentioned there, the descendants of these particular sons that are",
      "context": "...llment of that birth there in Genesis 21. We find here in our text of Scripture, well, last week in Genesis 24, we read about the wife of Isaac, Rebekah. We looked at the entirety of chapter 24, and we find in ...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=411",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 1019.6800231933594,
      "text": "really the quantity, but really, when we look at the text of Scripture, we find that verse number seven and part of verse number eight deals with the quantity of life, that he was 175 years old, that he was an old man, and we find the quantity of life, but really, in that phrase in verse number eight, when it says, and full of years, really what's being focused upon is the quality of life. Not only the quantity, but the quality. To think about the satisfaction, to think about the abounding nature of Abraham's life. Remember, it was back in Genesis 24, in verse number one, when the Bible tells us that Abraham was old and well stricken in age, and the Lord had blessed Abraham in all things. What a great testimony. The Lord had blessed Abraham in all things. God blesses, or the blessings of God, we think, and we mention, and we thank God for his blessings, and we are encouraged through song to count your blessings, name them one by one. I mentioned last week how that the reality is that there are times in which our understanding or definition or description of a blessing may differ from what God would look at as being a blessing. There are times when God says no, and I would submit to you this evening that that's a blessing. We say, no, I want God to say yes. Sometimes God",
      "context": "...t the satisfaction, to think about the abounding nature of Abraham's life. Remember, it was back in Genesis 24, in verse number one, when the Bible tells us that Abraham was old and well stricken in age, and th...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=1019",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "1tNRCH4gQSE",
      "timestamp": 408.9800109863281,
      "text": "nations are in thy womb, and two manner of people shall be separated from thy bowels, and the one people shall be stronger than the other people, and the elder shall serve the younger. If you are taking notes this evening, you've probably noticed already on the back of the bulletin that the title of the message tonight is The Elder Shall Serve the Younger. The elder shall serve the younger. I want you to note the supplication, as we look at the text of Scripture, God helps us and gives us some insight here as to the life of Isaac and Rebekah. Remember it was at the end of chapter 24, it was in chapter 24 in its entirety, in which Abraham had given the responsibility to his servant to go find a wife for his son Isaac. And we find that God blessed and made prosperous his journey, the servant prayed specifically and God answered specifically, and there was great rejoicing as we study Genesis 24. And we read now in Genesis 25, in verse number 19, the Bible says, and these are the generations of Isaac, Abraham's son. Abraham begat Isaac, and then notice verse number 20, and Isaac was 40 years old when he took Rebekah to wife, the daughter of Bethuel, the Syrian of Paddan Aram, the sister to Laban, the Syrian. And so we find that the Scriptures give us a point of reference with regard to the age of Isaac.",
      "context": "...ervant prayed specifically and God answered specifically, and there was great rejoicing as we study Genesis 24. And we read now in Genesis 25, in verse number 19, the Bible says, and these are the generations o...",
      "sermon_title": "Sermon 1tNRCH4gQSE",
      "url": "https://www.youtube.com/watch?v=1tNRCH4gQSE&t=408",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}