{
  "reference": "Genesis 47",
  "occurrences": [
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 0.0,
      "text": "25 or 30 minutes tonight. We got time for a quiz and birthday fellowship and all of that. And Genesis 47. Last week, we started looking at Genesis 47. We mentioned it'd be a two-part series. This evening, we'll be looking at verses 13 through 26. But let me just remind you quickly as to what we addressed last week as we looked at verses one through 12 and then verse 28 through 31. And we titled the message last Sunday evening, Jacob lived in Egypt 17 years. And we learned some very important things as we look at how God provided for his people in Egypt. Remember in Genesis chapter 46, God had given promises to Jacob before he left with regard for the journey. And God had given him protection a while they were journeying. And then they arrive in Egypt and we find that God gave them a place. And the Bible tells us in Genesis 47 that it wasn't just any place that God gave to his people. We find that he moved in the heart of Pharaoh and by the way, reference the morning message, God moved in the heart of Pharaoh. And Pharaoh said to Joseph, give them of the best of the land. And God gave them the best. He didn't just give them a place, he gave them the best place. And we said last week that part of the understanding that we have is that Jacob was in God's will",
      "context": "25 or 30 minutes tonight. We got time for a quiz and birthday fellowship and all of that. And Genesis 47. Last week, we started looking at Genesis 47. We mentioned it'd be a two-part series. This evening,...",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 144.75999450683594,
      "text": "of us at times in our lives, we need to examine our lives, see where we've been, where we're going. And if God would give us more days, weeks and months and years ahead that we would serve him faithfully. As we come to the text of scripture this evening, it's very interesting as you look at Genesis 47 because part of it, and it's not really half and half, but a portion of it deals with the children of Israel in Egypt, but then the section that we're gonna look at this evening in verses 13 through 26 really focuses in on the Egyptians and life in Egypt during this great famine. And again, we find that God's already provided to us as we studied last week, how God gave his people a place and he gave them provision, but notice the Bible tells us in verse 13, and there was no bread in all the land. That's the title for the message this evening, no bread in all the land. As we begin to understand what's taking place, we find that God is at work and God is fulfilling the promises that he had given to Joseph. And again, God had been working for years with regard to preparing all of these things. And we find that as I referenced last week in Psalm 37 and 25, you don't need to turn there, but David says, I have been young and now I'm old,",
      "context": "... faithfully. As we come to the text of scripture this evening, it's very interesting as you look at Genesis 47 because part of it, and it's not really half and half, but a portion of it deals with the children ...",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=144",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 208.24000549316406,
      "text": "given to Joseph. And again, God had been working for years with regard to preparing all of these things. And we find that as I referenced last week in Psalm 37 and 25, you don't need to turn there, but David says, I have been young and now I'm old, yet have I not seen the righteous forsaken nor his seed begging bread. And I'm thankful for how God took care of his people, even in the midst of great difficulty. By the way, our God can take care of us, amen. Our God is the great shepherd and the shepherd provides for the sheep. And I'm so thankful that our God is able and as we trust him, but as we look at this portion of scripture, we remember that God had revealed to Joseph through Pharaoh's dream that there would be seven years of famine. I want you to hold your place here in Genesis 47 and just for a moment, turn back to chapter 41 and I want you to see how God back then in chapter 41 described this period of famine. Notice with me in Genesis 41 as Joseph is interpreting Pharaoh's dream, notice what the Bible says in verse number 30. In Genesis 41 in verse 30, the Bible says, and there shall arise after them, after the seven years of great plenty, seven years of famine. Notice it says, and all the plenty shall be what?",
      "context": "...gh Pharaoh's dream that there would be seven years of famine. I want you to hold your place here in Genesis 47 and just for a moment, turn back to chapter 41 and I want you to see how God back then in chapter 4...",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=208",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 1332.3599853515625,
      "text": "and great, rich and poor, free and bond, to receive a mark in their right hand or in their foreheads. And that no man, notice what it says, might buy or sell, save he that had the mark, or the name of the beast, or the number of his name. So we're just going to say, you can't buy or sell, unless you have this. You know, people are going to get it. Because they're going to be desperate. There may be some people that say, yeah, I'm not going to do that. They get hungry enough. I think there are going to be people that line up and say, do you want to put it here or here? You can do both if you want. Honestly. People are going to do crazy stuff. Why are we saying that? Well, we see what happens in Egypt during this great famine. We see what happens in Israel in 2 Kings 6. We understand what's going to happen in Revelation 13. And as we begin to think about our lives and think about where we are, there are going to be some things that we face. We've got to keep our eyes on the Lord. Keep our eyes on the Lord. People do crazy stuff during times of desperation. It's interesting to me as you read chapter 47, the distinction in Genesis 47 between what's happening with the children of Israel and what's happening with the Egyptians.",
      "context": "...tuff during times of desperation. It's interesting to me as you read chapter 47, the distinction in Genesis 47 between what's happening with the children of Israel and what's happening with the Egyptians.",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=1332",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 1393.3599853515625,
      "text": "got to keep our eyes on the Lord. Keep our eyes on the Lord. People do crazy stuff during times of desperation. It's interesting to me as you read chapter 47, the distinction in Genesis 47 between what's happening with the children of Israel and what's happening with the Egyptians. And if you understand typology at all, there's a typology of the Egyptians. Egypt is a picture of the world. Jacob, Israel, God's people. The church is not Israel. Okay, understand that. The church is not Israel. We're not claiming to be spiritual Israel. But we are God's people. Amen? To as many as received him, to them gave he power to become the sons of God. Behold, what manner of the love the Father hath bestowed upon us that we should be called the sons of God. To God be the glory. We're his people. We're a royal priesthood according to Peter. A chosen generation. Praise the Lord. God's going to take care of us. There's one thought from this passage. Let me give you a second thought before we close tonight. I want you to think about Joseph just for a moment. I want you to think about how God used one man. How God used one man. I want you to think about tonight how God wants to use you. How God wants to use you. See, because if Joseph wasn't faithful, if Joseph didn't do,",
      "context": "...tuff during times of desperation. It's interesting to me as you read chapter 47, the distinction in Genesis 47 between what's happening with the children of Israel and what's happening with the Egyptians. And i...",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=1393",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 79.55999755859375,
      "text": "scripture is given by inspiration of God, and is profitable in the context of 2 Timothy chapter number three, we know that Paul says to Timothy, and that from a child thou hast known the holy scriptures, what's he talking about, he's talking about the Old Testament, which are able to make thee wise unto salvation, and what a blessing, Paul says to the folks in Rome, to the people in Corinth, that God's word, that which was written aforetime, was written for our learning, written for our admonition, and I am thankful for the Old Testament, God gives us very important principles, and I am thankful for those principles, and what a blessing to have God's word. In Genesis chapter 47, we spent two weeks looking at that portion of scripture, and through Genesis 47, we learn that God used Joseph to take care of his family, and of course, we know that Jacob was called for by Joseph as the brothers went back with the goods, and said, Joseph is alive, and he said to return, and we find that as they were preparing to depart, that God appeared to Jacob in chapter number 46, and said, go, and I'll be with thee, and in that place, I will build of thee a great nation, and we find that God was doing just that, and we read of that in chapter 47, we learned how God provided for his people,",
      "context": "...s word. In Genesis chapter 47, we spent two weeks looking at that portion of scripture, and through Genesis 47, we learn that God used Joseph to take care of his family, and of course, we know that Jacob was ca...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=79",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 144.72000122070312,
      "text": "Jacob in chapter number 46, and said, go, and I'll be with thee, and in that place, I will build of thee a great nation, and we find that God was doing just that, and we read of that in chapter 47, we learned how God provided for his people, they received a place, and they received the best place, according to Genesis 47, and we find that not only did they have a place, but they received provision, and they had their needs taken care of, I'm thankful that as our shepherd, that God gives us all that we need, he provides for us, he is a good God, he is a good shepherd, and I'm thankful for that. We find, the Bible tells us, there in Genesis 47, the end of the chapter, in verse 28, that Jacob lived there in Egypt for 17 years. As we enter into Genesis chapter 48, we find that the text of scripture begins by informing us that Jacob is sick, we find that this sickness that is mentioned is obviously a serious situation, for upon hearing of the news, Joseph gets a word of the circumstances of the situation, he gets his two boys, Ephraim and Manasseh, or Manasseh and Ephraim, oldest youngest, we find that he gets his two sons, and he heads over, I would say this, to have a visit with his dad. We find that the text of scripture, the details of this meeting,",
      "context": "... God provided for his people, they received a place, and they received the best place, according to Genesis 47, and we find that not only did they have a place, but they received provision, and they had their n...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=144",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}