{
  "reference": "Genesis 21",
  "occurrences": [
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1114.97998046875,
      "text": "and they may be a witness unto me that I have digged this well. This was customary in this particular time in this culture that they would deal with things in this manner. And he says that I want it to be a witness that I have digged this well. And then he called the place Beersheba because there they swear, both of them. We see that this covenant now is ratified, if you will. It's interesting, the word Beersheba, it means a well of the seven. In fact, it's still, of course, a place today that you could go and visit and see that. And the reminder, even of the name of the place, all the way back in Genesis 21, because of those seven ewe lambs that were set forward as being this token, if you will, this witness that Abraham had digged that well. So we see that the covenant is ratified. I just pause here for a moment to think about what has just transpired. And we see the perception of Abimelech and we see that he recognizes that God is with thee in all that thou doest. And therefore, he makes this proposal of this peace treaty, this covenant, if you will, and the covenant is ratified. And I wonder, as we would consider our own lives and the different era, no doubt, in which we live, but I wonder this evening, how many people know that we can pray and see God answer prayer?",
      "context": "...uld go and visit and see that. And the reminder, even of the name of the place, all the way back in Genesis 21, because of those seven ewe lambs that were set forward as being this token, if you will, this witn...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1114",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1692.4999694824219,
      "text": "is able. Doubt and unbelief. In Psalm 78 the Bible says that they limited the Holy One of Israel. You know how we limit the unlimited God? Doubt. Unbelief. You say He's the unlimited God. How could He be limited? By our unbelief. He did not many miracles there. Why? Because of their unbelief. It's time that we believe God and that other people can see in us that God is real. That God does answer prayer. That God does work and God is still on His throne. We see the perception. We see the proposal. I want you to notice as we finish up the chapter this evening here in Genesis 21. I want you to notice the priority of Abraham. The priority of Abraham. The Bible says in verse 33, And Abraham planted a grove in Beersheba. Now understand that this is pre-law. Understand that this was a valid process, a place where he would worship, no doubt, as the Bible says, and called there on the name of the Lord God, the everlasting God. In the law it would be forbidden to have groves, but we find this again predates. And Abraham planted a grove there. He planted it with the purpose. Obviously there's work involved. Abraham is an old man at this point. We understand that. But there's work that's involved. He plants this grove in Beersheba and he worships. The Bible says that he called there on the name of the Lord.",
      "context": "...ception. We see the proposal. I want you to notice as we finish up the chapter this evening here in Genesis 21. I want you to notice the priority of Abraham. The priority of Abraham. The Bible says in verse 33,...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1692",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1921.479995727539,
      "text": "that it would be in chapter 18, just a short period of time later, that God asks Abraham in verse 14, \"'Is anything too hard for the Lord?' I'm thankful that God asked Abraham that question after He had first revealed Himself to Abraham as being the Almighty God.'\" Amen? Because God says, \"'Abraham, I am El Shaddai, I am the Lord God Almighty.' And then He says a little while later, \"'Is anything too hard for Me?' Well, you just told me that you're the Lord God Almighty. The answer to the question must be no. There's nothing too hard for you. Why? Because you're the Almighty God. You're El Shaddai.'\" Here, in Genesis 21, in verse 33, He uses the name El Olam, the everlasting God. I want you to think about the significance of this. It's interesting because there have been many references to the idea of forever and eternal things that are mentioned to Abraham, but it's not here until the 21st chapter that the name El Olam is first given to us in understanding that He is the everlasting God. Again, turn back to chapter 13, if you will, and I want you to notice what God says to Abraham here in this portion of Scripture. Again, I understand his name is still Abram at this point. Forgive me if you want to be that technical, talking about the same guy. And so it says here,",
      "context": "...ere's nothing too hard for you. Why? Because you're the Almighty God. You're El Shaddai.'\" Here, in Genesis 21, in verse 33, He uses the name El Olam, the everlasting God. I want you to think about the signific...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1921",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 2067.720001220703,
      "text": "Bible says this in Genesis 17 in verse number seven, \"'And I will establish My covenant between Me and thee and thy seed after thee in their generations for an',\" what? Everlasting covenant. To be a God unto thee and to thy seed after thee. Notice in verse number eight, \"'And I will give unto thee and to thy seed after thee the land wherein thou art a stranger, all the land of Canaan for an everlasting possession, and I will be their God.'\" Notice verse 13. He says, \"'He that is born in thy house and he that is bought with thy money must needs be circumcised, and My covenant shall be in your flesh for an everlasting covenant.'\" Again in verse number 19, \"'And God said, Sarah, thy wife shall bear thee a son indeed and thou shall call his name Isaac, and I will establish My covenant with him for an everlasting covenant and with his seed after him, though the name of God El Olam is not mentioned until Genesis 21 and verse number 33.'\" No doubt we understand through the promises that had been made through the statements that God had given to Abraham that there was an understanding that He is the everlasting God. I am thankful that we serve the everlasting God. He is Alpha and Omega, the beginning and the end, the first and the last. Aren't you thankful for that? I mean, when we think about the eternality",
      "context": "...lasting covenant and with his seed after him, though the name of God El Olam is not mentioned until Genesis 21 and verse number 33.'\" No doubt we understand through the promises that had been made through the s...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=2067",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 2139.959991455078,
      "text": "to Abraham that there was an understanding that He is the everlasting God. I am thankful that we serve the everlasting God. He is Alpha and Omega, the beginning and the end, the first and the last. Aren't you thankful for that? I mean, when we think about the eternality of God, it ought to cause us to rejoice greatly that He has chosen to reveal Himself to us. That He has given us the truth in His Word with regard to His person, His character, His nature, and we understand that He is indeed the everlasting God. And the Bible says here in verse number 33 that Abraham called there on the name of the Lord the everlasting God. His reign is forever. He'll never be conquered. He'll never be defeated. He's the everlasting God. It says in verse number 34, and Abraham sojourned in the Philistine's land many days. It's interesting that we find that the Bible would reveal to us in verse 33 about him planting this grove in Beersheba and their calling on the name of the Lord. I believe this was a priority for Abraham. I believe that as you study the life of Abraham as we started many, many, many months ago back in Genesis chapter number 12 and you begin to see how Abraham, just how he worshiped the Lord and how he set up altars. And you begin to consider as we look here in Genesis 21",
      "context": "...st how he worshiped the Lord and how he set up altars. And you begin to consider as we look here in Genesis 21",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=2139",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 2216.0,
      "text": "study the life of Abraham as we started many, many, many months ago back in Genesis chapter number 12 and you begin to see how Abraham, just how he worshiped the Lord and how he set up altars. And you begin to consider as we look here in Genesis 21 and he was gonna dwell in this place for many days and understanding that this is where God had him and he's calling on the name of the Lord. I wonder this evening as we look at the context of all that's given to us here in this last section of Genesis 21, I believe that it is this truth that is given to us in verse number 33 that's a key to the observation that is made by Abimelech. It's the key. It's the priority of Abraham to worship God that results in the favor of God upon the life of Abraham. That leads to Abimelech making the observation and perceiving that God is with thee in all that thou doest. And the observation that is made in the beginning of our text of scripture this evening is the direct result, I believe, of the worship, the priority of Abraham that we read of at the end of the chapter. We must make worship a priority. We must make our time with God a priority. There are many times that we face life, listen, I understand we live in a busy time. I understand.",
      "context": "...st how he worshiped the Lord and how he set up altars. And you begin to consider as we look here in Genesis 21 and he was gonna dwell in this place for many days and understanding that this is where God had him...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=2216",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}