{
  "reference": "Genesis 40",
  "occurrences": [
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 0.0,
      "text": "night is to get through the entire chapter of Genesis 40 and we'll be making a couple of applications as we look at this portion of scripture and I mentioned this morning as we dealt with that passage in 1 Peter chapter number 1 of the importance of rejoicing through trials and I told you that the messages today both this morning and this evening are complementary. They are stand-alone messages but they certainly complement one another and as we looked at those three truths this morning as to why we can rejoice in the midst of trials we remember our position in Christ and we remember the power of God and then as we look at that we recognize that God has a purpose in everything that he allows in our lives and as we understand the ability to rejoice through trials we then look at this passage of scripture this evening in Genesis chapter number 40 and deal with faithful through trials being faithful through trials I mentioned this this morning I believe the enemy wants us to quit I believe that there are times as we go through life you think about the Apostle Paul on his journeys the missionary journeys and all of the adversity and difficulty and trials that he faced and no doubt there was pressure on the Apostle Paul to quit to just stop we mentioned this morning about the disciples in Acts chapter number 5 they were preaching they filled Jerusalem",
      "context": "night is to get through the entire chapter of Genesis 40 and we'll be making a couple of applications as we look at this portion of scripture and I mentione...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 2865.1799926757812,
      "text": "God isn't able to do. Listen, I'm thankful for the end of Joseph's life. I think most believers are. They look at the life, the account of Joseph and they rejoice greatly. Oh man, isn't that awesome? But he lived it day by day. And I'm thankful that in Genesis 40 he was faithful. He was faithful. God was orchestrating. He was moving pieces. He's in control. And He was going to work in such a way to bring to pass, ultimately, His purpose in Joseph's life to save much people alive, the Bible tells us. This evening, I don't know what God's doing in your trial or in my trial, but I desire as we kind of combine both messages today, I desire to rejoice through the trials. I don't want to be found complaining, moping, dragging my lip on the ground. Woe is me. You have no idea how bad it is. I want to rejoice. I serve a great God. I serve a God who's able to do anything. Nothing's too hard for Him. I'm going to heaven. Remember what the songwriter said? I'm not discouraged. Why? I'm heaven bound. Amen. How can you be doing wonderful in the midst of your... Because I'm going to heaven. God wants us to be faithful. I'm thankful that He's faithful. Oh, that God would help us in the midst of trials to be faithful. Let's pray. Father, we love You.",
      "context": "...y rejoice greatly. Oh man, isn't that awesome? But he lived it day by day. And I'm thankful that in Genesis 40 he was faithful. He was faithful. God was orchestrating. He was moving pieces. He's in control. And...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=2865",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}