{
  "reference": "Genesis 14",
  "occurrences": [
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1760.3399658203125,
      "text": "grove there. He planted it with the purpose. Obviously there's work involved. Abraham is an old man at this point. We understand that. But there's work that's involved. He plants this grove in Beersheba and he worships. The Bible says that he called there on the name of the Lord. Notice this, the everlasting God, El Olam. It's interesting as we begin to remind ourselves this evening of the way in which God reveals his character and his nature through his names. We find that for Abraham, it was back in Genesis chapter 14, turn back there if you will. I referenced this passage of Scripture moments ago with regard to the coalition that was formed and took Lot captive and how Abraham took the trained servants from his house and then had victory. And we find that Melchizedek, the king of Salem in verse number 18, brought forth bread and wine. and he was the priest of the Most High God.\" El Elyon, that's the first reference of this name of God in all of the Scripture. And we find that it was here that Abraham understands, his name is still Abram, but you find that he understands that God is the Most High God. It's interesting that Abraham then says this in verse 22 of Genesis 14, and Abram said to the king of Sodom, \"'I have lift up mine hand unto the Lord, the Most High God, the Possessor of heaven and earth.'\"",
      "context": "...erstands that God is the Most High God. It's interesting that Abraham then says this in verse 22 of Genesis 14, and Abram said to the king of Sodom, \"'I have lift up mine hand unto the Lord, the Most High God, ...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1760",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1838.479995727539,
      "text": "that he understands that God is the Most High God. It's interesting that Abraham then says this in verse 22 of Genesis 14, and Abram said to the king of Sodom, \"'I have lift up mine hand unto the Lord, the Most High God, the Possessor of heaven and earth.'\" Aren't you thankful that God revealed Himself to Abraham as being the Most High God before the king of Sodom was able to get to him and offer what he offered? No, no. God had Melchizedek, the king of Salem, to first meet Abraham and tell Abraham about El Elyon, the Most High God, the Possessor of heaven and earth. We find that it's in Genesis 17 that God reveals Himself to Abraham as El Shaddai. Notice the Bible says in verse number one, \"'And when Abram was 90 years old and nine, the Lord appeared to Abram and said unto him, \"'I am the Almighty God. \"'Walk before Me and be thou perfect.'\" El Shaddai, the Almighty God, the name that is mentioned here for the first time in Genesis 17 in verse number one, where God reveals Himself to Abraham as being the Almighty God. We find that it would be in chapter 18, just a short period of time later, that God asks Abraham in verse 14, \"'Is anything too hard for the Lord?' I'm thankful that God asked Abraham that question after He had first revealed Himself to Abraham as being the Almighty God.'\" Amen?",
      "context": "...erstands that God is the Most High God. It's interesting that Abraham then says this in verse 22 of Genesis 14, and Abram said to the king of Sodom, \"'I have lift up mine hand unto the Lord, the Most High God, ...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1838",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 936.2799987792969,
      "text": "his tent towards Sodom. He's not in Sodom. He's just pitched his tent towards Sodom. The Bible tells us, if you consider the progression in chapter number 14, of course you read of the battle that takes place and how Abram is going to deliver Lot, but notice what the Bible tells us about this great battle. It tells us in verse number 12 of Genesis 14, and they took Lot, Abram's brother's son. Notice this phrase, who dwelt in Sodom, and his goods, and departed, and so Lot was now, in Genesis 13, he had pitched his tent towards Sodom, but now in Genesis chapter 14 and verse number 12, the Bible tells us that he dwelt in Sodom. As you continue through the book of Genesis, you come to the 19th chapter, and you find something very interesting in the first verse. Of course, in chapter 18, God had revealed to Abraham that he was going to destroy Sodom and Gomorrah because of their wickedness, but the Bible tells us that these angels come to the city of Sodom, and even in Genesis 19 and verse number 1, and I want you to notice that the Bible says that Lot sat in the gate of Sodom. He had some level of influence and some level of responsibility, perhaps even being a judge in the city at some level, and the Bible tells us that they, as these two angels came into",
      "context": "... Lot, but notice what the Bible tells us about this great battle. It tells us in verse number 12 of Genesis 14, and they took Lot, Abram's brother's son. Notice this phrase, who dwelt in Sodom, and his goods, a...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=936",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}