{
  "reference": "Genesis 35",
  "occurrences": [
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 1647.2999877929688,
      "text": "in 30 in verse 24 when we read of the birth of Joseph and Rachel naming the 11th son of Jacob and she says that she calls his name Joseph and said the Lord shall add to me another son many things transpire between the birth of Joseph and the Final son that would be born to Jacob here in Genesis chapter 35 and over the next several weeks and months We'll study these portions of Scripture and we'll see the events in the life of Jacob and all those things that transpire But we pick it up in Genesis 35 in verse 16. The Bible says that they journeyed from Bethel there was but a little way to come to Ephra Ephrath and Rachel travailed and she had hard labor and it came to pass when she was in hard labor that the midwife said unto her fear not Thou shalt have this son also and it came to pass as her soul was in departing for she died That she called his name Ben. Oh, Ben. Oh nigh, but his father called him Benjamin verse 19 says that Rachel died and was buried in the way of Ephrath, which is in Beth Which is Bethlehem and Jacob said a pillar upon her grave. That is the pillar of Rachel's grave unto This day we find son number 12 of Jacob born here in Genesis 35 in verse number 5 15. Excuse me",
      "context": "... we'll see the events in the life of Jacob and all those things that transpire But we pick it up in Genesis 35 in verse 16. The Bible says that they journeyed from Bethel there was but a little way to come to E...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=1647",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 1708.1199951171875,
      "text": "buried in the way of Ephrath, which is in Beth Which is Bethlehem and Jacob said a pillar upon her grave. That is the pillar of Rachel's grave unto This day we find son number 12 of Jacob born here in Genesis 35 in verse number 5 15. Excuse me Rachel named him Ben. Oh nine, which means son of sorrow but we find that Jacob named him Benjamin and we often Obviously as we look at the tribe of Benjamin and we speak of Benjamin we use that name That's the name that Jacob gave him and it's it means son of my right hand or son of honor or good fortune and we understand that Rachel here dies and she is departing It says as her soul was departing in verse number 18 for she died and in the birth of Benjamin And so thus we see the twelve sons of Jacob. I mentioned this last week Obviously God could have just given us a list and just a few verses of Scripture and said here are the sons of Jacob Bam, bam, bam, bam, bam, bam and just given us all twelve But he gave us all of these details some of which we've not read for sake of the the audience and sake of the the youth that's here this evening and we've We've skipped over some of those things in the last two weeks But as God has given us this",
      "context": "...ave. That is the pillar of Rachel's grave unto This day we find son number 12 of Jacob born here in Genesis 35 in verse number 5 15. Excuse me Rachel named him Ben. Oh nine, which means son of sorrow but we fin...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=1708",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}