{
  "reference": "Genesis 17",
  "occurrences": [
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1838.479995727539,
      "text": "that he understands that God is the Most High God. It's interesting that Abraham then says this in verse 22 of Genesis 14, and Abram said to the king of Sodom, \"'I have lift up mine hand unto the Lord, the Most High God, the Possessor of heaven and earth.'\" Aren't you thankful that God revealed Himself to Abraham as being the Most High God before the king of Sodom was able to get to him and offer what he offered? No, no. God had Melchizedek, the king of Salem, to first meet Abraham and tell Abraham about El Elyon, the Most High God, the Possessor of heaven and earth. We find that it's in Genesis 17 that God reveals Himself to Abraham as El Shaddai. Notice the Bible says in verse number one, \"'And when Abram was 90 years old and nine, the Lord appeared to Abram and said unto him, \"'I am the Almighty God. \"'Walk before Me and be thou perfect.'\" El Shaddai, the Almighty God, the name that is mentioned here for the first time in Genesis 17 in verse number one, where God reveals Himself to Abraham as being the Almighty God. We find that it would be in chapter 18, just a short period of time later, that God asks Abraham in verse 14, \"'Is anything too hard for the Lord?' I'm thankful that God asked Abraham that question after He had first revealed Himself to Abraham as being the Almighty God.'\" Amen?",
      "context": "... Abraham about El Elyon, the Most High God, the Possessor of heaven and earth. We find that it's in Genesis 17 that God reveals Himself to Abraham as El Shaddai. Notice the Bible says in verse number one, \"'And...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1838",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 1994.0,
      "text": "if you will, and I want you to notice what God says to Abraham here in this portion of Scripture. Again, I understand his name is still Abram at this point. Forgive me if you want to be that technical, talking about the same guy. And so it says here, I'll just get all messed up if I keep going back and forth. In verse 15, it says, \"'For all the land which thou seest, to thee will I give it, and to thy seed,' what does He say? Forever. Is there anything that you can do that you can promise somebody forever? I will always do this. But you might not. Forever. God can say I'm going to give it to you forever because He's the everlasting God. He'd not yet revealed Himself with that name El Olam. We find that comes here in chapter 21, but notice the context of the promise that He's going to give it to His seed forever. Notice in chapter number 17, a number of references that we'll look at quickly. Notice in verse number seven, it's oft repeated throughout this passage of Scripture. The Bible says this in Genesis 17 in verse number seven, \"'And I will establish My covenant between Me and thee and thy seed after thee in their generations for an',\" what? Everlasting covenant. To be a God unto thee and to thy seed after thee. Notice in verse number eight,",
      "context": "... verse number seven, it's oft repeated throughout this passage of Scripture. The Bible says this in Genesis 17 in verse number seven, \"'And I will establish My covenant between Me and thee and thy seed after th...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=1994",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bsk8iNEnRVo",
      "timestamp": 2067.720001220703,
      "text": "Bible says this in Genesis 17 in verse number seven, \"'And I will establish My covenant between Me and thee and thy seed after thee in their generations for an',\" what? Everlasting covenant. To be a God unto thee and to thy seed after thee. Notice in verse number eight, \"'And I will give unto thee and to thy seed after thee the land wherein thou art a stranger, all the land of Canaan for an everlasting possession, and I will be their God.'\" Notice verse 13. He says, \"'He that is born in thy house and he that is bought with thy money must needs be circumcised, and My covenant shall be in your flesh for an everlasting covenant.'\" Again in verse number 19, \"'And God said, Sarah, thy wife shall bear thee a son indeed and thou shall call his name Isaac, and I will establish My covenant with him for an everlasting covenant and with his seed after him, though the name of God El Olam is not mentioned until Genesis 21 and verse number 33.'\" No doubt we understand through the promises that had been made through the statements that God had given to Abraham that there was an understanding that He is the everlasting God. I am thankful that we serve the everlasting God. He is Alpha and Omega, the beginning and the end, the first and the last. Aren't you thankful for that? I mean, when we think about the eternality",
      "context": "Bible says this in Genesis 17 in verse number seven, \"'And I will establish My covenant between Me and thee and thy seed after th...",
      "sermon_title": "Sermon bsk8iNEnRVo",
      "url": "https://www.youtube.com/watch?v=bsk8iNEnRVo&t=2067",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}