{
  "reference": "Genesis 30",
  "occurrences": [
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 169.52000427246094,
      "text": "I mentioned last week, would be in the Lord, that no longer would she be focused upon this conflict with Rachel, and what a joy and what a blessing. But we find that Rachel begins to implement some really worldly, carnal behavior because she sees that she has no children. And seeing that she has no children, we find that she goes through these extents of being able to have children legally and handmade, and we find that this competition and this depth of carnality had a great impact upon Leah. And I'm kind of reviewing these things very quickly because it's interesting when we left off with Leah at son number 8 in verse number 13 of Genesis 30, I want you to notice what Leah says, and the contrast between son number 4, Judah, and son number 8, Asher. In verse number 13 of Genesis 30, it says, and Leah said, happy am I, for the daughters will call me blessed, and she called his name Asher. We mentioned that the name Judah means praise, and she says, now will I praise the Lord, acknowledging Jehovah, and here after the carnality that Rachel employs, and after all that takes place with this fleshly living, and Leah operating in like fashion, now she can only name her son happy. She says, happy am I, and notice what it is that would bring her a level of happiness. She says, for the daughters will call me blessed.",
      "context": "...y quickly because it's interesting when we left off with Leah at son number 8 in verse number 13 of Genesis 30, I want you to notice what Leah says, and the contrast between son number 4, Judah, and son number ...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=169",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 345.44000244140625,
      "text": "was at a high point in verse number 35. In Rachel, she employed fleshly, carnal methodology, and Leah responded in like fashion. She goes from that pinnacle of spirituality, if you will, in verse 35, to a place of just slinging mud and competing with her sister. And that's tragic. As we continue through the text of Scripture, we come to verse number 18 and we see son number 9, and notice the Bible says in verse 17 of Genesis 30, it says, And God hearkened unto Leah, and she conceived and bare Jacob the fifth son. And Leah said, God hath given me my hire, because I have given my maiden to my husband, and she called his name Issachar. We find that here in verse number 18, we see son number 9, and his name Issachar means there is recompense or there is reward. I will say this for sake of the audience this evening, verses 14 through 17 I'm not going to read publicly this evening, but I want you to understand that the circumstances surrounding the birth of Issachar are unfortunate to say the least. And when you see what happens between Leah and Rachel in those verses of Scripture, and you see how Reuben the firstborn was used and how Jacob comes back and all of the carnality, it's really a sad situation. And here as she names him Issachar, there is recompense or there is reward.",
      "context": "...pture, we come to verse number 18 and we see son number 9, and notice the Bible says in verse 17 of Genesis 30, it says, And God hearkened unto Leah, and she conceived and bare Jacob the fifth son. And Leah sai...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=345",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 713.8799743652344,
      "text": "found that in chapter number 29, the Bible taught us that she was barren and she longed to have children. And I think there's a great problem here where she was envying her sister. We mentioned that last week and how terrible envy is and we ought not be envious. We ought not have envy in our lives and we understand that that was her position at the beginning of the chapter. But as we come to the latter part here of Genesis chapter number 30 and looking at the birth of Joseph, we see that the Bible tells us that God remembered her, hearkened to her and had opened her womb. And the reality is that that envy that she had at the beginning of chapter 30 led to great strife. It led to just carnality and fleshly living. And if we're not careful, envy in our lives will result in the same type of behavior. I understand that the circumstances will be quite different than what they are here in Genesis 29 and 30. But it's amazing to me how there's this, when there's envy, there's this desire for vain glory. There's this desire for attention. There's this desire. And you see that between Rachel and Leah and I believe that it's so imperative that we can make that application in our lives. The Bible tells us in verse 23 of Genesis 30 that she conceived and bear a son. And notice what she says,",
      "context": "...t's so imperative that we can make that application in our lives. The Bible tells us in verse 23 of Genesis 30 that she conceived and bear a son. And notice what she says,",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=713",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 791.8399810791016,
      "text": "attention. There's this desire. And you see that between Rachel and Leah and I believe that it's so imperative that we can make that application in our lives. The Bible tells us in verse 23 of Genesis 30 that she conceived and bear a son. And notice what she says, God hath taken away my reproach. She says God hath taken away my reproach. She recognizes that God is the giver of life. She acknowledges God here in verse number 23 as being Elohim. We see that in the verse that she says, God hath taken away my reproach, the Lord. Now remember that she says, or Jacob said this to her in verse number two of Genesis 30, when she said, give me children or else I die. He said, am I in God's stead who hath withheld from thee the fruit of the womb? Jacob is looking at Rachel and saying, this is beyond my ability. And here now we find that when she conceives and bears a son that she says, God hath taken away my reproach. We spoke last week about the significance within the culture of having children and especially having male children. You see it throughout the Old Testament and you see that culture and that society placing such an emphasis and importance upon that. And she says, God hath taken away my reproach. I want you to see in verse 24, the continuation here.",
      "context": "...t's so imperative that we can make that application in our lives. The Bible tells us in verse 23 of Genesis 30 that she conceived and bear a son. And notice what she says, God hath taken away my reproach. She s...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=791",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}