{
  "reference": "Genesis 39",
  "occurrences": [
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1001.5599975585938,
      "text": "says, the flesh lusteth against the Spirit and the Spirit against the flesh, and these are contrary the one to the other, so that you cannot do the things that you would. So what's the answer? Walk in the Spirit, that you should not fulfill the lust of the flesh. So when we understand that we have an enemy, when we understand that he's seeking to tempt us, and that temptation is going to come in our lives, and the enemy is going to seek to tempt us to do evil, and if we're mindful of how the Lord provides this framework and this model prayer, that we would be mindful of praying for God's direction and for God's deliverance with regards specifically to temptation and to evil. I'm mindful, we'll get to Genesis 39 in just a moment, but turn to Proverbs chapter number 1, if you will, and let me just share with you a thought from this portion of Scripture before we get there to Genesis chapter 39. But in Proverbs chapter number 1, verse number 10, the Bible says, My son, if sinners entice thee, consent thou not. If they say, Come with us, let us lay wait for blood, let us lurk privily for the innocent without cause. Let us swallow them up alive as the grave and whole as those that go down into the pit. We shall find all precious substance,",
      "context": "...or God's deliverance with regards specifically to temptation and to evil. I'm mindful, we'll get to Genesis 39 in just a moment, but turn to Proverbs chapter number 1, if you will, and let me just share with yo...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1001",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1123.1600341796875,
      "text": "not. We think about the temptation of our enemy. You know, he makes it look good. He makes sin look desirable. He makes sin look like it's going to benefit us somehow. And we find that he makes it look shimmery and shiny and makes it look appealing. And in doing so, he's seeking to entice us to engage in whatever that particular sinful activity is. But when we're mindful of this model prayer, if we would pray in this fashion, if we would be mindful of that which the Lord is giving to the disciples, perhaps we would become more actively aware of the escape routes that God would provide us with. And perhaps we would face less temptation because we would be mindful on a more regular basis. And we would be ready and prepared as we were praying in that fashion. Look at Genesis 39, and we'll finish here this evening before we have our time of prayer. In Genesis chapter 39, a great portion of Scripture with regard to the Bible character of Joseph, and of course we understand that he's there, and he's prospering, and God is blessing, and he's in Potiphar's house, and the Lord blessed him, and the Lord blessed the Egyptians' house for Joseph's sake, according to verse number 5. But you find that the Bible says, notice verse 6, And he left all that",
      "context": "... more regular basis. And we would be ready and prepared as we were praying in that fashion. Look at Genesis 39, and we'll finish here this evening before we have our time of prayer. In Genesis chapter 39, a gre...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1123",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1316.3200302124023,
      "text": "notice in verse number 10, it says, And it came to pass, as she spake to Joseph, what does it say? Day by day. You know what the enemy tries to do? He tries to wear you down. Bring that temptation day by day, day by day. Wear you down. Somebody said that the enemy, the devil, will go by your door, quote-unquote, every day, go by it a thousand times to find it cracked just once. And the analogy or the imagery that they were using in making that statement is that, listen, though we have responded properly and though we've walked in the Spirit, we must understand that the enemy is going to continue to come, and it says, day by day, that he hearkened not unto her, to lie by her, to be with her. And it came to pass about this time that Joseph went into the house to do his business, and there was none of the men of the house there within. And so we find that verse number 12 tells us that she was going to capitalize on this opportunity, if you will, and it says that she caught him by his garment, saying, Lie with me. And he left his garment in her hand and fled and got him out. I've often said, as I've looked at verse number 12 of Genesis 39, that Joseph lost his coat, but he retained his character.",
      "context": "...garment in her hand and fled and got him out. I've often said, as I've looked at verse number 12 of Genesis 39, that Joseph lost his coat, but he retained his character.",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1316",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1378.2000274658203,
      "text": "it says that she caught him by his garment, saying, Lie with me. And he left his garment in her hand and fled and got him out. I've often said, as I've looked at verse number 12 of Genesis 39, that Joseph lost his coat, but he retained his character. It was far better for Joseph to spend time in prison, falsely accused, than to have engaged in that sinful behavior. Amen? You say, well, that's not so great, being in prison. I understand, but we're going to stand before God. It'd be better to be falsely accused and suffer, not for wrongdoing, but suffer for being wrongly accused and being right with God. And we understand that God knew all that was going on, and God had a plan, and we're familiar with, of course, the life of Joseph and all that comes to pass, and the way in which God's plan was working out. You understand in our lives, and I don't want to get too off track from what the subject matter is this evening, but God has a plan. And if Joseph didn't end up in that prison, I'm not so sure that he would have met the butler or the baker. Right? And if he didn't meet the butler, perhaps it would not have been possible for Pharaoh, when he had a dream, to say, hey, who's going to interpret? You know? And so we begin to look at how God is God.",
      "context": "...garment in her hand and fled and got him out. I've often said, as I've looked at verse number 12 of Genesis 39, that Joseph lost his coat, but he retained his character. It was far better for Joseph to spend ti...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1378",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}