{
  "reference": "Genesis 27",
  "occurrences": [
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 1025.8600158691406,
      "text": "that we think about the subject of marriage. There's great wisdom in an individual seeking the counsel of their parents. I've said to our children many times, listen, I might not be the best dad, but I'm the dad that God gave you. And I want my kids to understand, I've tried to teach them this over the years, that I'm not perfect. I'm not going to give perfect counsel, but I'm going to seek God's face and I'm going to pray. And listen, sometimes as a parent, God sometimes just gives you an uneasiness about something that you might not even be able to verbalize. God just doesn't give you a piece about it. And we find here that there's no, as we look at the passage of Scripture, it seems like there's no interest whatsoever on the part of Esau. Again, remember, he was never concerned about spiritual things, only concerned about temporal things, that which would please him temporarily. And the Bible tells us that this was a grief of mind unto Isaac and Rebekah. But there's further insight that is given to us in chapter 28. Notice, if you will, over in chapter 28, this is after the blessing is given in Genesis 27. And now, because Esau's ready to kill Jacob because of the subtlety of Jacob and all that's taken place, now Isaac is going to send Jacob away, his flight to Paddan Aram, as we mentioned earlier, when he go to Laban.",
      "context": "...o us in chapter 28. Notice, if you will, over in chapter 28, this is after the blessing is given in Genesis 27. And now, because Esau's ready to kill Jacob because of the subtlety of Jacob and all that's taken ...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=1025",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 1082.4800109863281,
      "text": "is after the blessing is given in Genesis 27. And now, because Esau's ready to kill Jacob because of the subtlety of Jacob and all that's taken place, now Isaac is going to send Jacob away, his flight to Paddan Aram, as we mentioned earlier, when he go to Laban. And we find that Jacob is called into the presence of Isaac. And the Bible tells us in verse number one that Isaac is going to bless and charge Jacob. And notice what he says in verse number one. At the end of the verse, thou shalt not take a wife of the daughters of Canaan. Now, is that hard to understand? Very clear. Elementary education level of comprehension, basic truth. But I want you to see what the Bible says in verse number eight. And Esau, seeing that the daughters of Canaan pleased not Isaac, his father. How did he see that? Well, really, he heard the charge that was given from Isaac to Jacob. Thou shalt not take a wife of the daughters of Canaan. So we see that Jacob is receiving this instruction from his father, Isaac. And Esau, because he has no care, no concern about what his mom or dad would think. The Bible says that he sees that the daughters of Canaan pleased not Isaac, his father. Then went Esau unto Ishmael and took unto him a wife, which he had, Mahalath, the daughter of Ishmael, Abraham's son, the sister of Nebojah, to be",
      "context": "is after the blessing is given in Genesis 27. And now, because Esau's ready to kill Jacob because of the subtlety of Jacob and all that's taken ...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=1082",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 1864.5200119018555,
      "text": "struggle within the womb, there are two nations, right? It's what the Bible says. The Bible says the elder shall serve the younger. We find that God is connecting these dots for us and helping us to see what's taking place and we find, yes, the selling of the birthright, we see the subtlety of Jacob with the blessing. By the way, I mentioned this when I taught through that passage of Scripture in Genesis 27, there was no reason for Jacob to have to scheme. God had already promised in Genesis chapter number 25 that the elder shall serve the younger. There's no reason for you in your life or in my life to scheme, we just trust God. But here in Numbers chapter number 20, we find this dispute that is listed here with the Edomites or the people of Edom, the descendants of Esau. Notice, first of all, in Numbers chapter 20, in the wilderness. Notice, as the children of Israel had left Egypt, they've crossed the Red Sea, they're now in the wilderness. They've already disobeyed God, according to the evil report that was brought in Numbers chapter 14 and they said they weren't able, but we find in verse number 14, here in Numbers 20, the Bible says that Moses sent messengers from Cadiz unto the king of Edom. Thus saith thy brother Israel, thou knowest all the travail that hath befallen us, how our fathers went down into Egypt",
      "context": "... with the blessing. By the way, I mentioned this when I taught through that passage of Scripture in Genesis 27, there was no reason for Jacob to have to scheme. God had already promised in Genesis chapter numbe...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=1864",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 0.0,
      "text": "number 27 this evening, Genesis chapter number 27. And last week, I preached a message dealing with, from the book of Romans, really missions and the Great Commission, if you will. And we watched some update videos. So it's been a couple of weeks since we've been in the book of Genesis, but last time we were in Genesis chapter number 26. And at the end of the passage, after we trace the life of the events there of Isaac's life and the time that he spent in Gerar, we found that, of course, Esau was married at the end of the passage and he was 40 years old. And that made Isaac 100 years old. We know that the word of God tells us at the end of chapter 25 that when they were born, that he was 60. And so therefore, we see that Isaac would have been 100 years old at this particular time at the close of Genesis 26. As we enter into Genesis chapter number 27, as best we can tell, somewhere between 30 and 40 years have passed from the events in Genesis 26 until entering Genesis 27, 30 to 40 years. If you really wanna nail it down, it seems to be right around 37 years that have passed between the end of chapter 26 and the beginning of chapter 27. We find that at that particular time, of course, it would make Isaac about 137 years old,",
      "context": "...an tell, somewhere between 30 and 40 years have passed from the events in Genesis 26 until entering Genesis 27, 30 to 40 years. If you really wanna nail it down, it seems to be right around 37 years that have p...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 1076.219970703125,
      "text": "he says, I am Esau, thy firstborn. Notice, I have done according as thou badest me. First of all, he didn't bade you to do anything. Correct? Jacob did not receive any instruction from Isaac. But he says, I have done according as thou badest me. Arise, I pray thee. Sit and eat of my venison. Is it venison? It's not even venison! That thy soul may bless me. And Isaac said unto his son, this is terrible. It's tragic. Honestly. It's really on the edge of being blasphemous. In verse 20, Isaac says unto his son, he says, how is it that thou hast found it so quickly, my son? And he said, because the Lord thy God brought it to me. Now, he's gone to the level of saying God has provided. He's bringing God into his deceptive plan. We never do that. Be careful. Because it's within every single one of us to scheme and to devise and to lean on our own understanding and to rely on deception and whatever and how far do we go? It's tragic. My heart is saddened at Genesis 27. I said it in Sunday school this morning. I told Holland, I was driving with her yesterday. I said, this chapter, there's not a whole lot of good in this chapter. Everyone seems to be operating in the flesh and the deception and the carnality, it's sad. I would think that it's a passage of Scripture",
      "context": "...ng and to rely on deception and whatever and how far do we go? It's tragic. My heart is saddened at Genesis 27. I said it in Sunday school this morning. I told Holland, I was driving with her yesterday. I said,...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=1076",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 1794.6199951171875,
      "text": "servant's sake, as he promised to give him all way a lie into his children. In his days, and so in the days of Jehoram, the Bible says that in his days, in verse number 20, Edom revolted from under the hand of Judah and made a king over themselves. So Jehoram went over to Zear and all the chariots with him and he rose by night. and smote the Edomites which compassed him about. The captain of the chariots and the people fled into their tents.\" There's this battle, all that's taking place in verse 22. Yet Edom revolted from under the hand of Judah, notice this, unto this day. Then Libna revolted at the same time. When you see that phraseology in the scriptures unto this day, it very regularly means the time of the writing. You'll see it often in the book of Joshua, unto this day. You'll read about the memorial at Gilgal, the one in the midst of the Jordan, and they'll talk about them being there unto this day. It's unto the day of the writing. And we find that he's speaking there in 2 Kings about the revolt and really what we find in this passage back in Genesis 27, that it shall come to pass when thou shalt have the dominion that thou shalt break his yoke from off thy neck. And we find that, of course, if you look at the book of Obadiah, it's just",
      "context": "...hat he's speaking there in 2 Kings about the revolt and really what we find in this passage back in Genesis 27, that it shall come to pass when thou shalt have the dominion that thou shalt break his yoke from o...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=1794",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 1857.01997756958,
      "text": "and really what we find in this passage back in Genesis 27, that it shall come to pass when thou shalt have the dominion that thou shalt break his yoke from off thy neck. And we find that, of course, if you look at the book of Obadiah, it's just a short book, but there's many truths that are given in that Old Testament minor prophet with regard to the Edomites and the descendants of Esau and how God would deal with them because of their interactions with his people, the nation of Israel. And so we find this interaction that's recorded. Again, it's a very unfortunate set of circumstances and you see all of the scheming and all of the carnality and the deception that takes place, and Esau is in this place, and he's left in this position. And, of course, Esau is no doubt, he's discouraged by what's taken place. He, though he's carnal, he's not ever really minded anything of spiritual value that we can read of in his life, though he's carnal, he was simply doing what his dad told him to do. And things didn't work out well for him, and he receives this, really, it's a blessing that is given, but not a blessing that was the desired blessing. Think about this as we finish this evening and look at the remainder of the chapter in",
      "context": "and really what we find in this passage back in Genesis 27, that it shall come to pass when thou shalt have the dominion that thou shalt break his yoke from o...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=1857",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 2299.3999633789062,
      "text": "says that to the believers in Philippi. To the believers in Corinth, he says, be followers of me even as I'm a follower of the Lord. And we find that there are some people that we can look to and we can look at their examples and we can learn from their behavior and we can say, that is exemplary behavior that is worthy of taking and applying and adopting those behaviors in my life. But then there's passages like Genesis chapter number 27 that are just the opposite. These are things not to do. These are examples that should be warnings to us, like what we find in the book of 1 Corinthians when God says to the believers in Corinth, He says, listen, Paul is speaking to them, and he says, listen, with many of them God was not well pleased. In other words, take heed. Don't follow their example. Don't follow their behavior. And I hope this evening that we can learn from some negative behavior in Genesis 27. And we can guard against in our lives relying on our own understanding and thinking that we have to scheme. I said this often throughout the last couple of chapters of the book of Genesis. Living by faith does not require scheming. It just doesn't. We do not have to scheme in this life. We can trust God. You say, but I don't see a way. Neither did they. You don't want to go down",
      "context": "...n't follow their behavior. And I hope this evening that we can learn from some negative behavior in Genesis 27. And we can guard against in our lives relying on our own understanding and thinking that we have t...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=2299",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 2380.0399780273438,
      "text": "the last couple of chapters of the book of Genesis. Living by faith does not require scheming. It just doesn't. We do not have to scheme in this life. We can trust God. You say, but I don't see a way. Neither did they. You don't want to go down that path. Amen? As soon as you allow that thought, I don't see a way, and I have to start relying on my own understanding, you start going down a path that leads to poor decision making apart from God this evening. My heart is saddened by Genesis 27, I'm just being transparent with you this evening. As I meditated upon this passage this week, and I read it again this afternoon, and I'm like, this is heartbreaking to see so much carnality and deception in one chapter of God's precious book by people that had previously inquired of the Lord. When Isaac and Rebekah had no children, what did they do? In Genesis 25, what did they do? The two of them prayed, said, God, we have no children. God blessed. When Rebekah was, there's a struggle within the womb, she inquired of the Lord, and God answered. And how easy it is for us to rely on our own understanding, and to think that we need to figure things out. I don't know how God could have or would have worked in Genesis 27. It's hypothetical.",
      "context": "...down a path that leads to poor decision making apart from God this evening. My heart is saddened by Genesis 27, I'm just being transparent with you this evening. As I meditated upon this passage this week, and ...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=2380",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 2466.6000061035156,
      "text": "within the womb, she inquired of the Lord, and God answered. And how easy it is for us to rely on our own understanding, and to think that we need to figure things out. I don't know how God could have or would have worked in Genesis 27. It's hypothetical. Because the decisions were made that resulted in the consequences that are recorded. But wouldn't it be interesting in your mind to just think about some of the other passages of Scripture that we read and we see God moving and working in phenomenal ways and bringing to pass those things that you'd say, we never could figure out how this was going to happen. But God. You ever read those statements in the Word of God? But God. You say, man, this is exciting. Because God did what only God could do. The Bible tells us in Psalm 78, and I'll end with this. Psalm 78 is a long psalm. And it deals primarily, it records a lot of the history of Israel and it goes through a number of events. Somewhere around verse number 41, the Bible says this, that they, the children of Israel, limited the Holy One of Israel. The unlimited God, the Almighty God. What limited Him? Their unbelief. Their sin. Their scheming. This evening, I don't want to limit God. I don't want to see what my plan can bring to pass. Didn't work out well for them in Genesis 27.",
      "context": "...to think that we need to figure things out. I don't know how God could have or would have worked in Genesis 27. It's hypothetical. Because the decisions were made that resulted in the consequences that are reco...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=2466",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 2549.4199981689453,
      "text": "limited the Holy One of Israel. The unlimited God, the Almighty God. What limited Him? Their unbelief. Their sin. Their scheming. This evening, I don't want to limit God. I don't want to see what my plan can bring to pass. Didn't work out well for them in Genesis 27. For Rebekah and Jacob, their plan didn't work out well. He received the blessing. I want to see God's plan. Amen? See what God can do. Because we serve the Almighty Creator of the universe. And He is able, as I said this morning in Sunday school, to do exceeding abundantly above all that we ask or think. Joseph at once said, daddy, you forgot to emphasize that word all in Sunday school. You talked about all the other words. But all. So Joseph, there you go. All that we ask or think, amen? He is. We serve a great God. Let's trust Him and let Him have His way. Let's pray. Father, we love You. Thank You for loving us. I know that it's so easy, perhaps easier for some than others, but it's so easy as humans to want to take things, matters, into our own hands. God, I pray that tonight You'd help us to learn from this passage of Scripture to rely fully upon Thee, that we might see You do the impossible from our human perspective, that we might see You do what we might not even be able to imagine.",
      "context": "... to limit God. I don't want to see what my plan can bring to pass. Didn't work out well for them in Genesis 27. For Rebekah and Jacob, their plan didn't work out well. He received the blessing. I want to see Go...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=2549",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "hMIOkmwPfzg",
      "timestamp": 82.66000366210938,
      "text": "Lord and to avoid, of course, as we looked at the carnality and the envy that was present within the relationships of Rachel and Leah and how we need to avoid those things and seek to honor the Lord with our lives. And so we studied that portion of scripture. Now, as we lead into the end of chapter number 30 and really into the beginning of chapter number 31, we now find that the word of God is going to record for us some of the events or circumstances, if you will, that lead to Jacob's return to Canaan. You'll remember that at the end of the conversation between Jacob and his mom prior to leaving, remember Rebecca said, and Terry with him a few days in Genesis 27 and verse number 44, we've made note that those few days turned into years and was a situation in which she had never really expected that it would result in the way that it did. But now we find that these circumstances that are recorded are really going to lead back to that time in which Jacob would return to Canaan. In fact, in verse number 25, he makes that known. It says this in verse 25 of Genesis 30, and it came to pass when Rachel had born Joseph that Jacob said unto Laban, send me away that I may go unto mine own place and to my country. And we find that that request is made.",
      "context": "...between Jacob and his mom prior to leaving, remember Rebecca said, and Terry with him a few days in Genesis 27 and verse number 44, we've made note that those few days turned into years and was a situation in w...",
      "sermon_title": "Sermon hMIOkmwPfzg",
      "url": "https://www.youtube.com/watch?v=hMIOkmwPfzg&t=82",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WBrQ2Fdoczo",
      "timestamp": 165.60000610351562,
      "text": "In verses one, the end of verse number one and verse number two we see that there's information given to us with regard to this instruction that is being given regarding marriage. Notice at the end of verse number one it says specifically who was prohibited, who was not allowed. It says thou shalt not take a wife of the daughters of Canaan. Now you'll remember in our study a couple of weeks ago at the end of chapter number 26 the Bible told us in verse number 34 that Esau was 40 years old when he took to wife Judith the daughter of Barai the Hittite and Bashamath the daughter of Elon the Hittite and it tells us this which were a grief of mind unto Isaac and to Rebekah. That situation really was something that was used by Rebekah when she says to Isaac at verse number 46 in Genesis 27 she says to Isaac, I am weary of my life because of the daughters of Heth. If Jacob take a wife of the daughters of Heth such as these which are of the daughters of the land what good shall my life do me? And so we find that this instruction that is given from Isaac to Jacob begins first of all with the subject matter of marriage. He says you thou shalt not take a wife of the daughters of Canaan.",
      "context": "...ituation really was something that was used by Rebekah when she says to Isaac at verse number 46 in Genesis 27 she says to Isaac, I am weary of my life because of the daughters of Heth. If Jacob take a wife of ...",
      "sermon_title": "Sermon WBrQ2Fdoczo",
      "url": "https://www.youtube.com/watch?v=WBrQ2Fdoczo&t=165",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WBrQ2Fdoczo",
      "timestamp": 887.1800231933594,
      "text": "book of Genesis. And now we find that Isaac is now mentioning and specifically tying the blessing from God to Abraham to Jacob. It says this, to thee and to thy seed with thee that thou mayest inherit the land wherein thou art a stranger, which God gave unto Abraham. And so you find now as we look at this blessing that is regarded as the, often we refer to as the Abrahamic covenant, right? The seed and the land. And now Isaac is called Jacob. He's blessed him and he's charged him. He's given him instruction with regard to marriage. He's rehearsed the blessing. He's specifically invoking the blessing of Abraham upon him with regard to the seed and also with regard to the land. And what a blessing to see this unfolding as you continue to make your way through the book of Genesis. We leave the instruction from Isaac and we see number two this evening in verse number five, number two, the departure of Jacob. We find the Bible tells us, and Isaac sent away Jacob and he went to Paddan Aram, unto Laban, son of Bethuel the Syrian, the brother of Rebekah, Jacob's and Esau's mother. And so we see that Jacob departed just as he was instructed. And I wanna remind you as what we studied last week, if you turn back, maybe it's on the same page for you, but in Genesis 27, in verse number 43,",
      "context": "...ind you as what we studied last week, if you turn back, maybe it's on the same page for you, but in Genesis 27, in verse number 43,",
      "sermon_title": "Sermon WBrQ2Fdoczo",
      "url": "https://www.youtube.com/watch?v=WBrQ2Fdoczo&t=887",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WBrQ2Fdoczo",
      "timestamp": 955.1000061035156,
      "text": "brother of Rebekah, Jacob's and Esau's mother. And so we see that Jacob departed just as he was instructed. And I wanna remind you as what we studied last week, if you turn back, maybe it's on the same page for you, but in Genesis 27, in verse number 43, at this point, it's Rebekah speaking to Jacob. And Rebekah says, now, therefore, my son, obey my voice and arise, flee thou to Laban, my brother, to Haran, and tarry with him a few days until thy brother's fury turn away. She says this, until thy brother's anger turn away from thee and he forget that which thou hast done to him, then I will send and fetch thee from thence. Why should I be deprived also of you both in one day? And so we find that initially when Rebekah had heard about the response of Esau, his hatred, and what he said with regard to the days of mourning being at hand for the death of his father, he said, then will I slay my brother Jacob at the end of verse number 41. And Rebekah's seeking to provide some level of safety for her son, Jacob, and as she's seeking to provide this safety from Jacob, she says this, flee thou to Laban, my brother, to Haran. At this particular moment in verse number 43, she's really not thinking about a spouse for Jacob, she's simply thinking about safety for Jacob.",
      "context": "...ind you as what we studied last week, if you turn back, maybe it's on the same page for you, but in Genesis 27, in verse number 43, at this point, it's Rebekah speaking to Jacob. And Rebekah says, now, therefor...",
      "sermon_title": "Sermon WBrQ2Fdoczo",
      "url": "https://www.youtube.com/watch?v=WBrQ2Fdoczo&t=955",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}