{
  "reference": "Genesis 42",
  "occurrences": [
    {
      "sermon_id": "CuDgnvg3ek8",
      "timestamp": 0.0,
      "text": "42, and I am thankful for the blessings of the Lord. Had a number of folks that were traveling that God has brought back safely. Have some folks that continue to travel. Want you to pray for them. And then Brother Fernando, his grandmother had surgery last evening and he sent me a text. I mentioned this in Sunday School and he sent me a text and we prayed and we're thankful that that surgery went well and she's recovering well and so we praise the Lord for that. And it's amazing our God does here and answer prayer, amen. And every time we go to the Lord in prayer, we have that confidence knowing that he hears us and that he's able and we certainly are encouraged each time he answers prayer. Genesis chapter 42 this evening and we'll look at the entire chapter. Genesis 42, one through 38. I'm not gonna read the entire text this evening. I'm gonna just kind of jump through the text of scripture this evening as we deal with this subject matter. But notice beginning in verse number one in Genesis 42, the Bible says, now when Jacob saw that there was corn in Egypt, Jacob said unto his sons, why do you look one upon another? And he said, behold, I have heard that there's corn in Egypt. Get you down thither and buy for us from fence that we may live and not die.",
      "context": "... each time he answers prayer. Genesis chapter 42 this evening and we'll look at the entire chapter. Genesis 42, one through 38. I'm not gonna read the entire text this evening. I'm gonna just kind of jump throu...",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "CuDgnvg3ek8",
      "timestamp": 351.8399963378906,
      "text": "to chapter 42. So many, I mean, 20 years, at least a minimum of 20 years has passed between the time in which Jacob, his sons sold Joseph into slavery. And now as they're dealing with this great famine, and we find that as we read through Genesis chapter 42, that as we look at the dialogue that God provides of this record and this account and all the interactions that take place, really what we find is that God is at work. God is working. In fact, as we look at this portion of scripture and we look at the circumstances that are recorded here in Genesis 42, it really reminds us that God is always at work. God is always at work. We may not recognize it, we may not see it, but we can rest assured that God is always at work. And we find that as we look at this portion of scripture, I'm going to deal with two thoughts very quickly so that we can spend the bulk of our time on my final thought this evening. But when I think about looking at Genesis 42 and consider the fact that God is at work, we notice first of all, God is working locally. When I say that he's working locally, I'm saying he's working in Egypt. Joseph was there, and you understand all the circumstances with regard to the previous chapters and all that we've studied in the life of Joseph,",
      "context": "... as we look at this portion of scripture and we look at the circumstances that are recorded here in Genesis 42, it really reminds us that God is always at work. God is always at work. We may not recognize it, w...",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8&t=351",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "CuDgnvg3ek8",
      "timestamp": 689.160026550293,
      "text": "bring in our lives some conviction. Conviction is a good thing. When my toes and your toes are stepped on, it's a good thing because God's at work. Notice as we look at this portion of Scripture and consider that God is working personally, I would say, number one, that God is working in Joseph's life. God is working in Joseph's life. We find that Joseph is here. Notice we stopped reading in verse number five. Pick it up with me in verse number six of Genesis 42. The Bible says, and Joseph was the governor over the land. Now we knew that, did we not? We knew, based on studying through this portion of Scripture and studying through the life of Joseph, we know that God elevated Joseph to a place of great authority. And we find that Joseph is the governor of the land. We understand that his brothers have no clue that Joseph is the governor of the land. But Joseph is the governor of the land and he it was that sold to all the people of the land. Now I want you in your minds eye, we'll finish reading verse number six here in just a moment, but in your mind's eye this evening, I want you to consider the busyness of where Joseph is. I want you to understand the number of people that would be in and out trying to buy food. Listen,",
      "context": "... is here. Notice we stopped reading in verse number five. Pick it up with me in verse number six of Genesis 42. The Bible says, and Joseph was the governor over the land. Now we knew that, did we not? We knew, ...",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8&t=689",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "CuDgnvg3ek8",
      "timestamp": 1777.8400268554688,
      "text": "our money. That's not how they respond. It's not how they respond, why? Because God is at work. Notice in verse 28, and he said unto his brethren, my money is restored. But I think it was this kind of tone of, my money is restored? Like, what's going on? And lo, it is even in my sack. And their heart, notice what it says, failed them. Failed them. And they were afraid. Notice what they say to each other. What is this that God hath done unto us? God was at work. God was at work. And we find that in the lives of these brothers we see it very distinctly through these events that are recorded in Genesis 42 that God is working. Listen sometimes I've mentioned twice now and for a third time sometimes it's uncomfortable when God is at work. Sometimes it means we need to deal with things that quite honestly we just really don't want to deal with. You know what I mean by that? Sometimes we just rather not deal with stuff. But God says I'm working in your life. I want you to be right with me. We're going to observe the Lord's Supper tonight and only as God could do it. I had written on my calendar, my desk calendar that we'd observe the Lord's Supper tonight months ago. But I never communicated that to Holly to put in the bulletin. Yesterday",
      "context": "... in the lives of these brothers we see it very distinctly through these events that are recorded in Genesis 42 that God is working. Listen sometimes I've mentioned twice now and for a third time sometimes it's ...",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8&t=1777",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}