{
  "reference": "Genesis 41",
  "occurrences": [
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 1628.1799926757812,
      "text": "Joseph continued to be faithful. I believe that Joseph continued to do what was right before the Lord and we find that as I would look at the truth of chapter 41, that if the butler had remembered Joseph immediately and when he was restored to his place of butlership, if he sits there and he says, hey, listen, Pharaoh, I want you to know that there's this guy in prison, his name is Joseph, he's a Hebrew and we had dreams and we couldn't, there was no one to interpret them but he interpreted those dreams and they came to pass, I think Pharaoh would have said that's nice. I have magicians, I have people that can interpret my dreams. That's nice, thank you for sharing. But two years pass and Pharaoh has a dream and Pharaoh can find no one to interpret the dream. And the butler says, I remember, you're angry with me, you're angry with Baker, you put us in prison, we had a dream. There was a guy in prison that was able to interpret the dreams and it came to pass just as he said. So at that moment in time, what does Pharaoh say? Send for him, bring him here. And we understand that as we look at Genesis 41 and following and we see all of these pieces come together but Joseph didn't understand that. The point this evening as we look at this passage of scripture that we see that Joseph,",
      "context": "... in time, what does Pharaoh say? Send for him, bring him here. And we understand that as we look at Genesis 41 and following and we see all of these pieces come together but Joseph didn't understand that. The p...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=1628",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 1695.2200012207031,
      "text": "say? Send for him, bring him here. And we understand that as we look at Genesis 41 and following and we see all of these pieces come together but Joseph didn't understand that. The point this evening as we look at this passage of scripture that we see that Joseph, though ultimately God's hand was at work and we have the entire record that he was living moment by moment and day by day just as we are living and we must have a level of confidence in our God to know that he is working just like he was working in Joseph's life. I may not understand all of the ways in which God is working. I may not understand, you may not understand all of the pieces if you will that God is placing and orchestrating and what he's doing but I trust this evening and I submit to you this evening that our God knows what he is doing. I don't always know, you don't always know but we can rest in knowing that our God knows and that should bring us great comfort in the midst of trials and should enable us to be faithful through the trials. Why? Because I'm trusting my Lord. I'm walking with him day by day. These unfortunate things have happened, these trials, these difficulties, these adversities but I know that God's in control and I know that God has a purpose and I'm going to be faithful.",
      "context": "say? Send for him, bring him here. And we understand that as we look at Genesis 41 and following and we see all of these pieces come together but Joseph didn't understand that. The p...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=1695",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 0.0,
      "text": "That was just free tonight, amen, just an addendum to the song. Genesis chapter 41, we're going to finish this chapter tonight. And someone misunderstood me this morning and thought I was finishing the life of Joseph tonight. But just chapter 41, just this section of the life of Joseph. And we got lots of chapters left here through the end of the book of Genesis chapter 50. But we look at Genesis chapter 41, we spent a few weeks in this particular chapter. It is a lengthy chapter, it's 57 verses, and a lot of things happen. I mean, it is a chapter that is filled with information. And if you think about the life of Joseph and where we've been the last couple of weeks as we've studied through Genesis 41, we find that those first seven years after Joseph is promoted, we'll give him the title this evening as Prime Minister over Egypt, if we could use that terminology tonight. And I understand the Bible doesn't say that, it says that he's second in charge, second in command. But if we could use that terminology, he's set in that place. Pharaoh had made him ruler over all the land of Egypt. And as Joseph is promoted to that place, that position of Prime Minister, we find that those first seven years after he reaches that place, that position, are described for us in verse 29 of Genesis 41 as being great plenty. Notice what the Bible says.",
      "context": "...ink about the life of Joseph and where we've been the last couple of weeks as we've studied through Genesis 41, we find that those first seven years after Joseph is promoted, we'll give him the title this eveni...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 81.0,
      "text": "the land of Egypt. And as Joseph is promoted to that place, that position of Prime Minister, we find that those first seven years after he reaches that place, that position, are described for us in verse 29 of Genesis 41 as being great plenty. Notice what the Bible says. Behold, there come seven years, not just seven years of plenty, but the Bible says seven years of great plenty. And throughout all the land of Egypt, I believe that for those seven years of great plenty, they reaped a harvest that was unlike anything they had ever experienced in their lives. I believe that as they were going through and reaping during those seven years, there were probably comments that would be made of, man, we've never had a harvest like this before, and so on and so forth. And there's seven years of great plenty. We find that during those seven years, they are filled with a number of changes in the life of Joseph. Remember, when we started Genesis 41, he's in prison. He interprets the dream, he's placed in that position, and the seven years begin. And we spoke about those seven years of great plenty last week. And so we see that Joseph, just in Genesis 41, he has a new position. I would say that he has a new home, a palace, a new place to live. He is no longer there in the prison house.",
      "context": "...e first seven years after he reaches that place, that position, are described for us in verse 29 of Genesis 41 as being great plenty. Notice what the Bible says. Behold, there come seven years, not just seven y...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=81",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 149.0,
      "text": "spoke about those seven years of great plenty last week. And so we see that Joseph, just in Genesis 41, he has a new position. I would say that he has a new home, a palace, a new place to live. He is no longer there in the prison house. He has a new wife, and he has two new sons. And we spoke about those sons last week, and as we looked at the names of those sons, and we talked about being fruitful in the land of affliction. And even in the midst of affliction, we can have that fruitfulness that Joseph describes, and it requires that we forget some things, and then we see how God has blessed. In addition to all of this, all of these changes in Genesis 41, Joseph had the great responsibility to prepare the nation for those seven years of famine that would be, according to verse number 30 and 31, very grievous and would consume the land. Notice we read in verse 29 that those seven years, they would be of great plenty throughout all the land of Egypt. But then notice in verse 30 of Genesis 41, it says, And there shall arise after them seven years of famine, and all the plenty, notice what it says, shall be forgotten in the land of Egypt. And the famine shall, notice it says, consume the land. The plenty shall not be known in the land by reason of the famine following,",
      "context": "spoke about those seven years of great plenty last week. And so we see that Joseph, just in Genesis 41, he has a new position. I would say that he has a new home, a palace, a new place to live. He is no...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=149",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1467.9199829101562,
      "text": "God's Word. Why? For the natural man receiveth not the things of the Spirit of God. For there are foolishness unto him, neither can he know them. Why? Because they are spiritually discerned, 1 Corinthians 2. And we find here that God is sent in this indictment against his people because they're taking counsel but not from God. They're running down to Egypt, or walking to go down into Egypt, but have not asked of My mouth. God says ask. And what? Ye shall receive. Is that not a promise? He says ye have not because ye ask not. Right? Is that what He says? Is that Bible? And we find here this evening that He says that you've not asked of My mouth to strengthen themselves. Notice where it says, in the strength of Pharaoh. Now this is amazing to me because I think about the children of Israel. We have the Bible and we can read back and we can understand all that happened with the Exodus and so on and so forth. And I understand the Exodus is after what we've read in Genesis 41 this evening but Isaiah is after the Exodus. So I think it's fair that we could say that the children of Israel were aware of what happened during the Exodus. The children of God during the time of Isaiah's prophecy were aware of the Exodus. They were aware of the plagues.",
      "context": "...ned with the Exodus and so on and so forth. And I understand the Exodus is after what we've read in Genesis 41 this evening but Isaiah is after the Exodus. So I think it's fair that we could say that the childr...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1467",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 2191.259979248047,
      "text": "ask you this. Are you doing everything God's telling you to do? Oh, yeah. I said, no, like whatsoever he sayeth, you do it. Oh, yeah, all of it. The guy was just lying straight out of his teeth, right? But the reality is that for us as God's people, we go to God for counsel and whatsoever he sayeth, we do it. You say, but it doesn't make sense. No, no, God's way doesn't always make sense. And let me say this, God's way doesn't have to make sense. Amen? Sometimes, and listen, those of us that are more logical and what have you and have that analytical type of a mind, sometimes we struggle with that, why? Because we want things to make sense. And God's ways are not our ways. Amen? And God says, do it. And this evening, when we think about the time of crisis, the time of great difficulty, the time of great distress, to whom do we go? To whom do we cry? See, we see what happened in Genesis 41 when those seven years of dearth began. It was immediate and severe. We find that the people, they cried out, and I understand why they cried out. They cried out to Pharaoh. And Pharaoh and Ensign said, I can't help you. Go to Joseph, and whatsoever he sayeth, do it. What he sayeth to you, do. If we look at these types this evening, for us in 2023, almost 2024 now,",
      "context": "...ulty, the time of great distress, to whom do we go? To whom do we cry? See, we see what happened in Genesis 41 when those seven years of dearth began. It was immediate and severe. We find that the people, they ...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=2191",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "CuDgnvg3ek8",
      "timestamp": 877.6200256347656,
      "text": "as we look in the life of Joseph, go back to chapter 41, if you will, and look in verses 51 and 52 of Genesis chapter 41 and I want you to see that as we look at this portion of scripture here and we understand what's taking place that God tells us in Genesis 41 and verse number 51, and Joseph called the name of the firstborn Manasseh. For God said he hath made me forget all my toil and all my father's house and the name of the second called he Ephraim. For God hath caused me to be fruitful in the land of my affliction. We studied this several weeks ago when we looked at Joseph and we talked about the principle of perspective from this portion of scripture and the fact that he names his firstborn Manasseh, which means forgetfulness. He names his secondborn Ephraim, which means fruitfulness. And we looked through and we dealt with that and we understood that God had been working in the life of Joseph. But I want you to understand that now as Joseph's brothers come face to face with him, that what he had believed in and what he had handled now, those emotions are raw. He's face to face with his brothers. How are you going to respond? How are you going to deal with that? Listen, I wonder this evening if there's anything in you, someone walks into a room and you have ought against",
      "context": "...e look at this portion of scripture here and we understand what's taking place that God tells us in Genesis 41 and verse number 51, and Joseph called the name of the firstborn Manasseh. For God said he hath mad...",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8&t=877",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}