{
  "reference": "Genesis 36",
  "occurrences": [
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 173.72000122070312,
      "text": "just reading names, but really ask the spirit of God to teach you and to help you understand. You can read in some of the other chapters of God's word. Ezra and Nehemiah provide long list of names of people. Listen, I'm thankful when you read through Ezra and Nehemiah. Listen, God made it a point to write down the names of the people that left Babylon and went back. Praise God. And we get to read about them and get to understand some of what took place. When we look at Genesis 36 and we say, why did God give us this record? I believe that as we study Genesis chapter 36, it really enables us to connect some dots. That's the phraseology that I'll use this evening. We think about the life of Esau and think about all that God gives us throughout his word. This chapter helps us to be able to connect some dots biblically. In verse number one of Genesis 36, the Bible says, now these are the generations of Esau who is Edom. Esau took his wives and the daughters of Canaan, Ada, the daughter of Elon, the Hittite, and Aholobama, the daughter of Anna, the daughter of Zibion, the Hittite, and Bashamath, Ishmael's daughter, the sister of Nebojah, and Ada bared to Esau Eliphaz and Bashamath bared Rehul and Aholobama bared Jeush and Jalem and Korah. These are the sons of Esau, which were born unto him in the land of Canaan.",
      "context": "...e God. And we get to read about them and get to understand some of what took place. When we look at Genesis 36 and we say, why did God give us this record? I believe that as we study Genesis chapter 36, it real...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=173",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 1281.1800155639648,
      "text": "was pleasing. It was a place that was well watered. A place that would be appropriate and good for him. And the Bible tells us if you trace the steps of Lot, that initially he simply pitched his tent towards Sodom. He didn't move into Sodom on day one. He just pitched his tent towards Sodom. But before long, we see that he's in a place of leadership within the wicked city of Sodom. You see that progression, right? And Abraham, listen, Abraham gave him the choice. You pick. And he picked. And then we see Esau, he goes and he leaves and we see this decision that he makes with regard to his wives, the daughters of Canaan, as it's mentioned in verse number two of Genesis 36. And then we see the place where he goes. The place is Mount Seir. And we see that here. It's the south part of the Dead Sea area there. A place that was well fortified. A place that was extremely complicated for someone to come in and conquer because of just the land. The way that the land was set up and all of the caves and all of the structure and what have you. And we find that with the mountainous region there and that part of the landscape of Israel down there in Mount Seir, the southern part of the Dead Sea, it was a place that was just natural",
      "context": "...e makes with regard to his wives, the daughters of Canaan, as it's mentioned in verse number two of Genesis 36. And then we see the place where he goes. The place is Mount Seir. And we see that here. It's the s...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=1281",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2033.1600189208984,
      "text": "connecting the dots and see what's going on, the Bible says in verse 19, and the children of Israel said unto him, we'll go by the highway, and if I and my cattle drink of thy water, then I will pay for it. I will only, without doing anything else, go through on my feet. He said, thou shalt not go through. And Edom came out against him with much people and with a strong hand. Thus, Edom refused to give Israel passage through his border wherefore Israel turned away from him. The children of Israel, even the whole congregation, journeyed from Kadesh and came unto Mount Hor. We see this as a first dispute that we really see of what's going on. We see that the Bible records for us, I'm not gonna be able to take the time to go through all of them, but the Bible records for us in the times, the days of King Saul. There's battle that takes place with not only the Amalekites, we saw the grandson, Amalek, of Esau, but also with the Edomites. You can read that in 1 Samuel 14. You can read that in the days of David. Now, remember with me the history of Israel. In fact, it tells us, it's a very interesting statement that is given to us, you don't need to turn back there, but in Genesis 36 and verse number 31, it says, and these are the kings",
      "context": "...s, it's a very interesting statement that is given to us, you don't need to turn back there, but in Genesis 36 and verse number 31, it says, and these are the kings",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2033",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2090.02001953125,
      "text": "in the days of David. Now, remember with me the history of Israel. In fact, it tells us, it's a very interesting statement that is given to us, you don't need to turn back there, but in Genesis 36 and verse number 31, it says, and these are the kings that reigned in the land of Edom before there reigned any king over the children of Israel. And you read about all those dukes and those chiefs and what have you there with the Edomites, and even before the kings of Israel, they had what was going on there in that land in Seir with the Edomites, but then as you begin to think about Israel's history and Saul being the first king, well, in the time of Saul, there's a battle with the Edomites. There are disputes that takes place and battles that are recorded. In the days of David, he's the next king of Israel. And we find that during his reign in the times of David, there's disputes that take place. In fact, the Bible tells us in 2 Samuel 8 and verse number 14, that during his reign, because David was mighty, the Lord was with him and the Lord gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's servants.",
      "context": "...s, it's a very interesting statement that is given to us, you don't need to turn back there, but in Genesis 36 and verse number 31, it says, and these are the kings that reigned in the land of Edom before there...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2090",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "oHhbZQxf4Do",
      "timestamp": 0.0,
      "text": "37 this evening, Genesis chapter number 37 this evening. And I've titled the message, Joseph was 17 years old. My Joseph is only 16. And I was thinking about that this week. And as I obviously were preparing for Brianna's graduation party and all of those things, and then thinking about Joseph as I'm writing and studying this message and thinking about our youngest is 16, it's amazing how quickly time goes by. And I was thinking about the life of Joseph here in the Bible. It's interesting in Genesis chapter 36, we dealt with this chapter last week in Genesis chapter 36. The Bible talks about these are the generations of Esau. And we looked at a number of things last week from that portion of scripture and made some application that I believe would be helpful for us to understand. As we get into Genesis chapter 37, you'll note that there's a term very similar to what we see a phrase that we see in verse number one of chapter 36. Here in chapter number 37, it's verse number two. And the Bible says these are the generations of Jacob. And so we saw in Genesis 36, the generations of Esau. Here in Genesis chapter number 37, we will read of the generations of Jacob. We find that specifically it is here that the lens of scripture will focus upon the life of Joseph. Of course, we understand that from here,",
      "context": "... 37, it's verse number two. And the Bible says these are the generations of Jacob. And so we saw in Genesis 36, the generations of Esau. Here in Genesis chapter number 37, we will read of the generations of Jac...",
      "sermon_title": "Sermon oHhbZQxf4Do",
      "url": "https://www.youtube.com/watch?v=oHhbZQxf4Do&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "oHhbZQxf4Do",
      "timestamp": 82.9800033569336,
      "text": "so we saw in Genesis 36, the generations of Esau. Here in Genesis chapter number 37, we will read of the generations of Jacob. We find that specifically it is here that the lens of scripture will focus upon the life of Joseph. Of course, we understand that from here, Genesis 37 through the end of the book, chapter number 50, every portion of the remaining chapters, except for chapter 38, deal with some aspect of the life of Joseph. And what a godly young man, what a man that was used for the glory of God. And many of you know, I've shared this over the years, that Joseph is my favorite Bible character. And thus our son is not Christopher III, he is Joseph Christopher, just because of the significance of the Bible character Joseph. It's hard to believe, in just about six weeks or so, we'll be here for 12 years as being the pastor, and I've never preached through the life of Joseph. And though he's my favorite Bible character, the Lord's just never led me and never given me that liberty or direction to preach through the life of Joseph. And so I am so excited about the opportunity here on Sunday evenings for the next several months to be able to study through the life of Joseph. We first read of the character, the Bible character Joseph in Genesis chapter 30, verses 22 through 24. We won't take the time to turn back there,",
      "context": "so we saw in Genesis 36, the generations of Esau. Here in Genesis chapter number 37, we will read of the generations of Jac...",
      "sermon_title": "Sermon oHhbZQxf4Do",
      "url": "https://www.youtube.com/watch?v=oHhbZQxf4Do&t=82",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "oHhbZQxf4Do",
      "timestamp": 1290.8799743652344,
      "text": "going on as we begin to piece Scripture together and look at what God tells us about the dysfunction of the family and all that Joseph would have dealt with. But as I come and I look at the character of Joseph, I see that he's a man that's hardworking. I see that he's working even amongst those that hate him and cannot speak peaceably unto him. That tells me a lot about a man's character. That he's not fleshly minded. Remember we looked at the life there last Sunday night, looked at Genesis 36 when we talked about Esau. He's a fleshly minded man. The Bible tells us the contrast between Jacob and Esau. Remember, why was all that was taking place there even in the womb and the struggle within the womb and God answered and said there's two nations within thy womb. But we understand that by application there were two natures. Jacob representing the spirit and Esau representing the flesh. And here in the text of Scripture, we do not see that Joseph was a man that was operating within the flesh. He was a man that was trusting the Lord. By the way, if you think about all of the things that we will study, all of the events that are recorded in the life of Joseph and many of us are familiar with his life, the character of Joseph was not developed when he was in the pit.",
      "context": "...er. That he's not fleshly minded. Remember we looked at the life there last Sunday night, looked at Genesis 36 when we talked about Esau. He's a fleshly minded man. The Bible tells us the contrast between Jacob...",
      "sermon_title": "Sermon oHhbZQxf4Do",
      "url": "https://www.youtube.com/watch?v=oHhbZQxf4Do&t=1290",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}