{
  "reference": "Genesis 25",
  "occurrences": [
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 0.0,
      "text": "number 25 this evening, Genesis chapter number 25, and we'll look at verses 27 down through verse number 34. In the preceding text that we studied a couple of weeks ago on Sunday evening, Genesis 25, verses 19 through 26, we had the opportunity to read in that portion of Scripture about the birth of Esau and Jacob. And of course, as we looked at that portion of Scripture, we noted, of course, the supplication. We noted that Isaac entreated the Lord for his wife. Why? Because she was barren. But then we also learned how that Rebecca sought the face of God. Why? Because there was this struggle within her. And so we spoke about the supplication, we spoke of the struggle, and then we looked at some symbolism in that preceding text. As we move forward into the text of Scripture this evening in this chapter, we find the Bible simply says in verse number 27, and the boys grew. And now all of a sudden, we're looking at an event that takes place much later in life. In verses 20, really 19 through 26, we have the opportunity of hearing of their birth. The Bible tells us in verse number 26, and after that, speaking of Esau, now Jacob being born, and after that came his brother out, and his hand took hold on Esau's heel. And his name was called Jacob, and Isaac was three score years old when she bare them.",
      "context": "...ugh verse number 34. In the preceding text that we studied a couple of weeks ago on Sunday evening, Genesis 25, verses 19 through 26, we had the opportunity to read in that portion of Scripture about the birth ...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 535.8400268554688,
      "text": "don't get a bunch of detail. He doesn't go into it. God doesn't provide all of these details, but we find what we read here in verse number 28 is very insightful when you start looking at what happens in chapter 27. I don't want to get too far ahead of myself in our study of the book of Genesis, but you'll know that in chapter number 27, it was when Isaac called Esau, and he told Esau he was going to give him a blessing. Remember, go out and get that venison, prepare it, the kind that I love, and I'll give you a blessing. And Rebekah overhears that, and Rebekah schemes and has a meal prepared and sends Jacob in, and Jacob's concerned because, you know, dad's going to know that it's not me, and so on and so forth. And really, you see the statement here in Genesis 25 and verse number 28 that leads us to really seeing the outworking of this dysfunction in chapter number 27. Now, the thing that's interesting to me that we'll make quick note of here in this verse of Scripture is that it's very sad to me that even as you would see the dysfunction within the family here, we continue to this day to see dysfunctional families. We continue to this day to find that there are families that have been given the truth with regard to what God's plan is, and yet there are times in which",
      "context": "...s going to know that it's not me, and so on and so forth. And really, you see the statement here in Genesis 25 and verse number 28 that leads us to really seeing the outworking of this dysfunction in chapter nu...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=535",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}