{
  "reference": "Hebrews 4",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 1287.1800384521484,
      "text": "From the top to the bottom. See, remember, as we would look at the shadow of the Old Testament, we think about the tabernacle, and then even into the temple, and you would think about that holy of holies. Yes, there was the outer court that had the brazen altar, and had the laver, but you would come to the holy place, that there you would find that much of the ministry would take place, but then that was separated from the holy of holies that could only be entered on that one day a year, the day of atonement. And you find that that veil that separated the holy place from the holy of holies, that it was rent in twain, showing that now access was available. We'll deal with that as we get into chapters 9 and 10 in more detail, but we understand that when Jesus died on the cross of Calvary, He paid, He was our substitute, and then He rose from the dead. Acts 1 as well as Luke 24 record for us the ascension of Jesus Christ, and the Bible tells us in verse 2 that He is a minister of the sanctuary and of the true tabernacle which the Lord pitched, and not man. We've read some of these verses already, but you notice as I repeat in Hebrews 4 and verse number 14, the Bible says, seeing then that we have a great high priest that is passed into the heavens.",
      "context": "...e Lord pitched, and not man. We've read some of these verses already, but you notice as I repeat in Hebrews 4 and verse number 14, the Bible says, seeing then that we have a great high priest that is passed in...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=1287",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 1357.6800384521484,
      "text": "and of the true tabernacle which the Lord pitched, and not man. We've read some of these verses already, but you notice as I repeat in Hebrews 4 and verse number 14, the Bible says, seeing then that we have a great high priest that is passed into the heavens. Jesus, the Son of God, let us hold fast our profession. See, the high priest, he could only enter into the holy of holies. He could only pass through that veil, but Jesus entered into heaven. We find that in chapter number 7, we studied this a few weeks ago, but in verse number 25, the Bible says at the end of that verse, seeing He ever liveth to make intercession for them. I'm so thankful that our Savior lives. Hallelujah, what a Savior. And He is our high priest. Notice that as we look at the passage of Scripture, not only does our high priest minister in a better place, but number two, our high priest presented a better offering. He presented a better offering. As we look at the passage, we come to verse number 3 in Hebrews chapter number 8, and the Bible says this, for every high priest is ordained to offer gifts and sacrifices. He dealt with this back in chapter number 5, when he talked about the fact that they were to bring those sacrifices. Notice in verse number 1 of Hebrews 5, the Bible says,",
      "context": "...e Lord pitched, and not man. We've read some of these verses already, but you notice as I repeat in Hebrews 4 and verse number 14, the Bible says, seeing then that we have a great high priest that is passed in...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=1357",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 657.9799842834473,
      "text": "death, and the grave. And so we find that we now have access into the holiest in verses 19 and 20. Notice what we've received according to verse 21. Notice what he says. \"...and having a high priest over the house of God.\" We've often over these last several chapters literally going all the way back to the end of chapter 4. We have labored through these chapters of the book of Hebrews dealing with and proving the fact that our High Priest, our great High Priest, the Lord Jesus Christ, that He is superior. The Jewish people, the folks that were the original recipients of this book, they understood what it was to have a high priest. They understood the role of the high priest. This was something that was very common to them and something that they would be familiar with as they would leave that Judaism and that system, that Old Testament sacrificial system, they're leaving that high priest. But we find that the writer is saying, but we have a high priest. And our high priest is better. He's greater. He's over the house of God. Remember, in Hebrews 4 and verse 14, the Bible says, \"...seeing then that we have a great High Priest that is passed into the heavens. Jesus, the Son of God, let us hold fast our profession, for we have not a high priest which cannot be touched with the feeling of our infirmities,",
      "context": "... high priest. And our high priest is better. He's greater. He's over the house of God. Remember, in Hebrews 4 and verse 14, the Bible says, \"...seeing then that we have a great High Priest that is passed into ...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=657",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1229.379961013794,
      "text": "that this is a truth that is given to a believer to draw near. See, the lost person doesn't have access to God the same way that you have access to God. He must first come to the cross. Amen? He must first trust Jesus Christ as his personal Savior, and once he trusts Jesus Christ as his personal Savior, he now has this access that we're speaking of this morning. Why? Because we've been justified. We have been made righteous, declared righteous. We understand the righteousness of God has been imputed upon us, and we have remission. What a blessing. And so we can draw near. We can draw near. We find that in Hebrews 4, I mentioned I read verses 14 and 15 already, how wonderful the connection is here between Hebrews 10 and verse 22 and Hebrews 4 and verse 16. We read verses 14 and 15 a moment ago dealing with the fact that we have a great high priest. And what was the impact of that recognition of that truth? It was this in verse 16, Let us therefore come boldly unto the throne of grace, that we may obtain mercy and find grace to help in time of need. I'm so thankful that we can go boldly to the throne of grace. That we can go in full assurance, understanding that we are the children of God. Isn't that wonderful? Remember the story of the prodigal son?",
      "context": "... and we have remission. What a blessing. And so we can draw near. We can draw near. We find that in Hebrews 4, I mentioned I read verses 14 and 15 already, how wonderful the connection is here between Hebrews ...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1229",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}