{
  "reference": "Hebrews 9",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 425.67999267578125,
      "text": "book of John When he was speaking about the fact that he would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up Then said the Jews forty and six years was this temple in building and wilt thou rear it up in three days? But he Jesus spake of the temple of his body We spent a number of weeks a few years ago on Wednesday evening Studying all of the details with regard to the tabernacle and as we studied the tabernacle We understood that the tabernacle was a picture It was a type and how that every detail within the tabernacle in some way is pointing to Jesus Christ We'll deal with some of those things as we go through here in Hebrews 8 and then again in Hebrews 9 as some of those things Are dealt with but we rejoice in the fact that as we come to this passage of Scripture You notice in verse number 1 of chapter 8. It's where I've adopted the title this morning He says we have such and high priest I've simply titled we have and high priest see the reality is that these people the Jewish believers They understood what it was to have a priest and they understood the responsibility of the priest",
      "context": "...us Christ We'll deal with some of those things as we go through here in Hebrews 8 and then again in Hebrews 9 as some of those things Are dealt with but we rejoice in the fact that as we come to this passage o...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=425",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2069.5400390625,
      "text": "of death is or for the wages of sin is death and we understand that Jesus Christ God in flesh he went willingly to that old rugged cross he suffered great torment as you read through the gospel accounts and you read of all that he experienced and all that he dealt with we understand that he did that demonstrating to us his love he died for the sins of the world he died so that man could be reconciled to God see we were at enmity with God we were separated from God why because of our sin the Bible tells us that God hath made him Jesus to be sin for us who knew no sin that we might be made the righteousness of God in him it's not as Paul deals with in the book of Philippians it's not our own righteousness it's the righteousness of Christ that is imputed upon our account see he's the substitute he's we speak about the substitutionary atonement we understand that it satisfied the demands of death it satisfied the price for sin the precious sinless blood of Christ was the payment that was necessary and we find the Bible tells us as we read that passage of Scripture in Hebrews 9 in verse number 12 that what did that what did that sinless precious blood get eternal redemption for us Peter says that we're not redeemed with corruptible",
      "context": "...e payment that was necessary and we find the Bible tells us as we read that passage of Scripture in Hebrews 9 in verse number 12 that what did that what did that sinless precious blood get eternal redemption f...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2069",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2147.020050048828,
      "text": "was the payment that was necessary and we find the Bible tells us as we read that passage of Scripture in Hebrews 9 in verse number 12 that what did that what did that sinless precious blood get eternal redemption for us Peter says that we're not redeemed with corruptible things he speaks about gold and silver he says no we're not redeemed with those things we're redeemed with the precious blood of Christ and so we think about this better offering how that Jesus Christ God in flesh that he presented himself that he offered himself but then he rose victoriously conquering sin death and the grave we find that he continueth ever in Hebrews 7 in verse number 24 the Bible says but this man speaking again of Jesus because he continueth ever hath an unchangeable priesthood see what happened the priest in the Old Testament the Aaronic priesthood man they died right part of the whole study as you look as the instruction is given to Moses and then to Joshua we see that it's an implement it in the life and ministry of Joshua with the cities of refuge they had to stay there until the death of the high priest and then they could leave our high priest the Lord Jesus Christ he continueth ever why because he conquered sin death and the grave we find that Paul would make this declaration in the passage of Scripture that we often refer",
      "context": "...e payment that was necessary and we find the Bible tells us as we read that passage of Scripture in Hebrews 9 in verse number 12 that what did that what did that sinless precious blood get eternal redemption f...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2147",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2375.4600219726562,
      "text": "Savior living in the impact that that ought to have on us as the children of God listen our God rules and reigns he's still on his throne amen we have a message to tell just as the writer of Hebrews says to these believers and of course being preserved for all of these years in the canon of Scripture we have an high priest what should I think about this truth that is given in these first five verses of course I mentioned already by way of introduction that as we finish chapter number eight next week we'll deal with the new covenant that is revealed in verses 6 through 13 really going back to Jeremiah we'll get into all of that next week as we finish chapter number eight but we understand that just has as it has been the case through the book of Hebrews, we find that the the author of Hebrews will share some truth and then further discuss and expound on that truth in a following chapter. In these two truths that are presented in the first few verses of chapter number eight, that our high priest ministers in a better place and that our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've picked some of those verses to",
      "context": "... place and that our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've pick...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2375",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2440.0600624084473,
      "text": "that our high priest ministers in a better place and that our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've picked some of those verses to share with you this morning. We'll dig into them entirely as we move through the book of Hebrews, but I want you to go to 1st John chapter 2 as we conclude this morning. In 1st John chapter number 2, the book of 1st John is written to believers. The book of 1st John is dealing with the fellowship that we have with Christ, and what a joy to know that we can have fellowship with our God. Why? Because of what Jesus did in reconciling, right? He's the mediator. He is the one that reconciles, and we come to the book of 1st John and we see this truth with regard to fellowship and so on and so forth, and as we think about the truth of Hebrews chapter number 5 that we have in high priest that ministers in a better place, that presented a better offering, I come to chapter number 2 of 1st John and I look at the first two verses and the Bible says this, My little children, these things write I unto you, that ye sin not. Now, we're",
      "context": "... place and that our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've pick...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2440",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1354.9000091552734,
      "text": "sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we studied this several weeks ago, but I want you to look at two verses of Scripture in the book of Hebrews and see the fulfillment of this prophecy and see this understanding really of the miracle of reconciliation. See, this morning, the miracle that is before us as we consider that which God has done in our lives for saving our souls that we now are reconciled to God, it's a miracle. In Hebrews 2, in verse number 17, it says, wherefore in all things that behooved Him to be made like unto His brethren. Notice this, that He might be a merciful and faithful high priest in things pertaining to God to make reconciliation for the sins of the people. But how does He do that? Well, we know Hebrews 9 in verse number 22, though you won't see the word reconciliation there, you find the by or reconciled or any form of the word, but you find in Hebrews 9 in verse 22, it says, and almost all things are by the law purged with blood, and without shedding of blood is no remission. And we find this miracle of reconciliation. See, Paul, as he's writing to the believers in Corinth, and he comes to this section that we're studying this morning in 2 Corinthians chapter number 5, he's speaking about this miracle of",
      "context": "...ng to God to make reconciliation for the sins of the people. But how does He do that? Well, we know Hebrews 9 in verse number 22, though you won't see the word reconciliation there, you find the by or reconcil...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1354",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}