{
  "reference": "Hebrews 2",
  "occurrences": [
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1354.9000091552734,
      "text": "sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we studied this several weeks ago, but I want you to look at two verses of Scripture in the book of Hebrews and see the fulfillment of this prophecy and see this understanding really of the miracle of reconciliation. See, this morning, the miracle that is before us as we consider that which God has done in our lives for saving our souls that we now are reconciled to God, it's a miracle. In Hebrews 2, in verse number 17, it says, wherefore in all things that behooved Him to be made like unto His brethren. Notice this, that He might be a merciful and faithful high priest in things pertaining to God to make reconciliation for the sins of the people. But how does He do that? Well, we know Hebrews 9 in verse number 22, though you won't see the word reconciliation there, you find the by or reconciled or any form of the word, but you find in Hebrews 9 in verse 22, it says, and almost all things are by the law purged with blood, and without shedding of blood is no remission. And we find this miracle of reconciliation. See, Paul, as he's writing to the believers in Corinth, and he comes to this section that we're studying this morning in 2 Corinthians chapter number 5, he's speaking about this miracle of",
      "context": "...od has done in our lives for saving our souls that we now are reconciled to God, it's a miracle. In Hebrews 2, in verse number 17, it says, wherefore in all things that behooved Him to be made like unto His br...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1354",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2699.1600036621094,
      "text": "look back and point on a time in our life, maybe a specific day in our lives, when we trust that the Lord Jesus Christ is our personal Savior. We've experienced the miracle of reconciliation, but I wonder this morning, how are we doing with embracing the ministry of reconciliation? Understand that it's been entrusted to us that we have…what a privilege, by the way, to go and to speak to people and say, listen, the Lord Jesus Christ loved you so much that he died for you. What a joy to be engaged in the ministry of reconciliation, and at this particular time in our history, I believe that there's a greater awareness of the mortality of mankind. There is a level of fear. I mentioned this morning, a moment ago, how that many fear death, and one of the truths of being reconciled is the truth that we find in Hebrews 2 and verse number 15, where the Bible says, and deliver them who through fear of death were all their lifetime subject to bondage. See, I no longer have to fear death, why? Because I've trusted the one who's conquered death. What a joy. This morning, be ye reconciled to God. The miracle of reconciliation, the ministry of reconciliation. Father, we love you. We thank you for loving us. We thank you for the privilege of studying thy Word. We thank you for the truth that is contained therein.",
      "context": "...o, how that many fear death, and one of the truths of being reconciled is the truth that we find in Hebrews 2 and verse number 15, where the Bible says, and deliver them who through fear of death were all thei...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2699",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}