{
  "reference": "Hebrews 10",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2375.4600219726562,
      "text": "Savior living in the impact that that ought to have on us as the children of God listen our God rules and reigns he's still on his throne amen we have a message to tell just as the writer of Hebrews says to these believers and of course being preserved for all of these years in the canon of Scripture we have an high priest what should I think about this truth that is given in these first five verses of course I mentioned already by way of introduction that as we finish chapter number eight next week we'll deal with the new covenant that is revealed in verses 6 through 13 really going back to Jeremiah we'll get into all of that next week as we finish chapter number eight but we understand that just has as it has been the case through the book of Hebrews, we find that the the author of Hebrews will share some truth and then further discuss and expound on that truth in a following chapter. In these two truths that are presented in the first few verses of chapter number eight, that our high priest ministers in a better place and that our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've picked some of those verses to",
      "context": "...t our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've picked some of thos...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2375",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2440.0600624084473,
      "text": "that our high priest ministers in a better place and that our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've picked some of those verses to share with you this morning. We'll dig into them entirely as we move through the book of Hebrews, but I want you to go to 1st John chapter 2 as we conclude this morning. In 1st John chapter number 2, the book of 1st John is written to believers. The book of 1st John is dealing with the fellowship that we have with Christ, and what a joy to know that we can have fellowship with our God. Why? Because of what Jesus did in reconciling, right? He's the mediator. He is the one that reconciles, and we come to the book of 1st John and we see this truth with regard to fellowship and so on and so forth, and as we think about the truth of Hebrews chapter number 5 that we have in high priest that ministers in a better place, that presented a better offering, I come to chapter number 2 of 1st John and I look at the first two verses and the Bible says this, My little children, these things write I unto you, that ye sin not. Now, we're",
      "context": "...t our high priest presented a better offering, we find that they're expounded upon in Hebrews 9 and Hebrews 10, and we'll enjoy studying those chapters. What great truth is given to us. I've picked some of thos...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2440",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 865.2599792480469,
      "text": "Testament sacrificial system. And the writer of Hebrews is saying, but Christ is so much better. Look at what He offers. Look at what you have in Christ that you could never have in that Old Testament sacrificial system because if it would have allowed you to be made perfect, you would have stopped bringing those offerings. But you never were able to stop bringing the offerings because it never could make you perfect. Now, we understand that God Himself is the one that ordained that Old Testament sacrificial system. And He is the one that ordained it so that it would be a type, a picture of what Jesus would accomplish on the cross of Calvary. The real thing is always better than what we see in looking at the passage. And you think about what He says at the beginning of verse number one in Hebrews 10, the law having a shadow of good things to come. You think about a shadow. It's not the real thing. It's not the very image. And what a great way that the writer presents this truth to us. And so now as He's going and making this application, He says, now brethren, we understand that because we now have access into the holiest because Jesus has provided that access, now we understand that we do have a high priest, the great high priest, our Lord Jesus Christ, and He is superior. Notice how we should respond.",
      "context": "...in looking at the passage. And you think about what He says at the beginning of verse number one in Hebrews 10, the law having a shadow of good things to come. You think about a shadow. It's not the real thing....",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=865",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1163.260009765625,
      "text": "would deal with, and understand again as these Jewish believers would be receiving this particular book and understanding the familiar aspect that they would have with all that took place on that day of atonement. We're familiar as you would think about the tabernacle itself. And that's the greatest similarity to what God is giving us here in the book of Hebrews. And you'd understand that after that brazen altar is what? It's the laver. It's the place where they would wash. It's interesting there's no dimensions that are provided. In John chapter number 13, we find that Jesus as He would wash the disciples' feet, that it's a picture of that importance of being cleansed for service. And we can be reminded here in verse number 22 about our response that we're to draw near. And we can understand that we are able to draw near. Our hearts have been sprinkled from an evil conscience and our bodies washed with pure water. We understand also, actually, as we finished up the last section last week, that we have remission. Amen? You understand this morning that this truth of Hebrews 10 that we're dealing with this morning, that this is a truth that is given to a believer to draw near. See, the lost person doesn't have access to God the same way that you have access to God. He must first come to the cross. Amen? He must first trust Jesus Christ as his personal Savior,",
      "context": "...ast section last week, that we have remission. Amen? You understand this morning that this truth of Hebrews 10 that we're dealing with this morning, that this is a truth that is given to a believer to draw near...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1163",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1229.379961013794,
      "text": "that this is a truth that is given to a believer to draw near. See, the lost person doesn't have access to God the same way that you have access to God. He must first come to the cross. Amen? He must first trust Jesus Christ as his personal Savior, and once he trusts Jesus Christ as his personal Savior, he now has this access that we're speaking of this morning. Why? Because we've been justified. We have been made righteous, declared righteous. We understand the righteousness of God has been imputed upon us, and we have remission. What a blessing. And so we can draw near. We can draw near. We find that in Hebrews 4, I mentioned I read verses 14 and 15 already, how wonderful the connection is here between Hebrews 10 and verse 22 and Hebrews 4 and verse 16. We read verses 14 and 15 a moment ago dealing with the fact that we have a great high priest. And what was the impact of that recognition of that truth? It was this in verse 16, Let us therefore come boldly unto the throne of grace, that we may obtain mercy and find grace to help in time of need. I'm so thankful that we can go boldly to the throne of grace. That we can go in full assurance, understanding that we are the children of God. Isn't that wonderful? Remember the story of the prodigal son?",
      "context": "...ebrews 4, I mentioned I read verses 14 and 15 already, how wonderful the connection is here between Hebrews 10 and verse 22 and Hebrews 4 and verse 16. We read verses 14 and 15 a moment ago dealing with the fac...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1229",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1304.7799606323242,
      "text": "may obtain mercy and find grace to help in time of need. I'm so thankful that we can go boldly to the throne of grace. That we can go in full assurance, understanding that we are the children of God. Isn't that wonderful? Remember the story of the prodigal son? He went out and he wasted all of his living. Right? He was eaten in the slop. He had nothing. He'd wasted everything. Why did he go home? Yes, he was at the end of himself, but he had an opportunity. He had a relationship. And we understand this morning that as we look at the truth here of Hebrews 10, and we see how these marvelous truths have been presented, we now find the application for us as the people of God, as the children of God. Remember, having therefore brethren. He's writing to the believers. He's giving them this admonition, this encouragement. Let us draw near. We understand that Peter will deal with the truth of the priesthood of the believer. And we as Baptist people, if we were to go through the list of Baptist distinctives, we find that first and foremost is that we would say that the Bible is the sole authority for faith and practice, but then we would get down to the fact of the priesthood of the believer. And what a joy to know that we can enter into His presence, that we can draw near with that full assurance of faith.",
      "context": "...rtunity. He had a relationship. And we understand this morning that as we look at the truth here of Hebrews 10, and we see how these marvelous truths have been presented, we now find the application for us as t...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1304",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1670.5599670410156,
      "text": "Abraham, and then he deals with how this should impact us. Notice in verse 17 wherein God willing more abundantly to show unto the heirs of promise the immutability of his counsel confirmed it by an oath. We find in verse number 18 and 19 that by two immutable things in which it was impossible for God to lie, we might have a strong consolation who have fled for refuge to lay hold upon the hope set before us, which hope we have as an anchor of the soul, both sure and steadfast, and which entereth into that within the veil. Hebrews 10 as we're looking here, and we find that he's saying to these believers, let us hold fast the profession of our faith without wavering, why? Because he is faithful that promised. It's not a situation in which we have to say, I wonder if God's going to do what he said he's going to do. I'm so thankful that we never have to have that thought. We can rest assured that God will do what he said he will do. Now admittedly, it might not be in your timeframe or in my timeframe, amen? Sometimes we think that we would like for God to work on our timeline, but God's working on his timeline. And by the way, his timeline is perfect, amen? Mine's not, neither is yours. So we find that the application is given. Number one, let us draw near.",
      "context": "...ve as an anchor of the soul, both sure and steadfast, and which entereth into that within the veil. Hebrews 10 as we're looking here, and we find that he's saying to these believers, let us hold fast the profes...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1670",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 2349.3799438476562,
      "text": "some is there are some that were forsaking the assembling says this but exhorting one another that phrase we find in verse 24 that were to consider one another and to provoke into love and good works now in verse number 25 we find that he says exhorting one another the idea of coming alongside someone the idea of encouraging and strengthening by consolation that we're coming alongside what a wonderful truth that we have the opportunity not only to consider one another to provoke one another but we find here to exhort one another through the assembling of ourselves together we have the opportunity to exhort one another I know that Hebrews 10 in verse number 25 has been a verse that has been used often in 2020 it's a verse that we've seen people use so frequently across the land of America as we've dealt with this pandemic and the inability of churches to be able to meet so on and so forth can I tell you that that God's design is for the church to meet. It's God's plan. We find here that the idea of what was taking place and what's going on, he's giving these believers this understanding that you assemble together. You know, there's something special about church. And we understand that church is not the building. We understand that. We often refer to, we're going to church, right? We use that terminology. Oh yeah,",
      "context": "...ough the assembling of ourselves together we have the opportunity to exhort one another I know that Hebrews 10 in verse number 25 has been a verse that has been used often in 2020 it's a verse that we've seen p...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=2349",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}