{
  "reference": "Hebrews 7",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2147.020050048828,
      "text": "was the payment that was necessary and we find the Bible tells us as we read that passage of Scripture in Hebrews 9 in verse number 12 that what did that what did that sinless precious blood get eternal redemption for us Peter says that we're not redeemed with corruptible things he speaks about gold and silver he says no we're not redeemed with those things we're redeemed with the precious blood of Christ and so we think about this better offering how that Jesus Christ God in flesh that he presented himself that he offered himself but then he rose victoriously conquering sin death and the grave we find that he continueth ever in Hebrews 7 in verse number 24 the Bible says but this man speaking again of Jesus because he continueth ever hath an unchangeable priesthood see what happened the priest in the Old Testament the Aaronic priesthood man they died right part of the whole study as you look as the instruction is given to Moses and then to Joshua we see that it's an implement it in the life and ministry of Joshua with the cities of refuge they had to stay there until the death of the high priest and then they could leave our high priest the Lord Jesus Christ he continueth ever why because he conquered sin death and the grave we find that Paul would make this declaration in the passage of Scripture that we often refer",
      "context": "...but then he rose victoriously conquering sin death and the grave we find that he continueth ever in Hebrews 7 in verse number 24 the Bible says but this man speaking again of Jesus because he continueth ever h...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2147",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1574.8399963378906,
      "text": "morning, from this thought in Colossians 2, that I am complete in Him, in Christ. What a joy. What a blessing. This morning, if you say, I'm not complete. I've never trusted Jesus Christ as my personal Savior. I'm incomplete. Yes, we've been made body, soul, and spirit, but I've never been born again. I'm dead in my trespasses and sins. Can I tell you this morning that Jesus saves. We sing about it. We proclaim the message. In fact, as we preached and taught through the book of Hebrews, we're mindful of that truth in Hebrews 7, in verse number 25, where the Bible says, wherefore He is able also to save them to the uttermost that come unto God by Him, seeing He ever liveth to make intercession for them. He is the Savior of the world. We sang this morning, what a wonderful Savior, and He is. The songwriter said, He's a wonderful Savior to me. It's another song in our hymnal that we sing. He's a wonderful Savior to me, and as we think about the truth and the thought of these two great hymns of the faith, the reality is that I can say from a personal perspective that He, Jesus, is a wonderful Savior, and that He is my Savior. He's a wonderful Savior to me. This morning, if you can't say that, if you don't have that peace and that",
      "context": "...age. In fact, as we preached and taught through the book of Hebrews, we're mindful of that truth in Hebrews 7, in verse number 25, where the Bible says, wherefore He is able also to save them to the uttermost ...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1574",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}