{
  "reference": "Hebrews 11",
  "occurrences": [
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 320.0,
      "text": "speaks of the world, we understand that he speaks of creation as the world. That's not what he's speaking about here in 1 John chapter number 2. When he speaks of the world, there are times in which he speaks about the people. For God so loved the world, right? When he talks about in 1 John 2, in verse number 2, and he is the propitiation for our sins and not for ours only, but also for the sins of the whole world. He's talking about the people. That's not what he's speaking about in 1 John 2 and verse number 15 when he says, love not the world. He's not talking about the creation. He's not talking about the people. He's talking about the world system. And the Bible tells us that the God of this world, the little g, the God of this world is Satan himself, and he's speaking about this world system in which we live. As believers, we must acknowledge that this world is not my home. Aren't you thankful for that? That this world system and the way in which it operates and the way in which it's controlled, that this is not my home, that this is not all there is for us. That's a blessing. My citizenship is in heaven. Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims. I'm not home, but I'm heading home. Isn't that a blessing?",
      "context": "...is is not all there is for us. That's a blessing. My citizenship is in heaven. Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims. I'm not home, but I'm heading home. Isn'...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=320",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 387.0,
      "text": "is not my home, that this is not all there is for us. That's a blessing. My citizenship is in heaven. Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims. I'm not home, but I'm heading home. Isn't that a blessing? And so this morning as we look at this portion of Scripture in 1 John 2 in verses 15 through 17, I've simply titled the message this morning, love not the world. I want you to notice with me as we begin this morning the progression of worldliness, the progression of worldliness. We find here that he says, love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him in verse number 15. As we think about this progression of worldliness, we find that this term, speaking about believers and their interaction with the world, is used throughout a number of portions of Scripture. We'll review several of those this morning as we consider this progression of worldliness. But at the onset of the message this morning, I want us to be mindful of this wonderful truth that God gives us in the book of Ephesians, and I hope that it will help us as we begin here in Ephesians 2 to help develop and understand this progression and how we combat it. Notice in Ephesians chapter number 2,",
      "context": "...is is not all there is for us. That's a blessing. My citizenship is in heaven. Just like he said in Hebrews 11 and verse number 13, we are strangers and we are pilgrims. I'm not home, but I'm heading home. Isn'...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=387",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 149.5800018310547,
      "text": "11, the content that is provided for us are those that have lived by faith, those that have gone before us, those that have ran their race, those that have left an example that we can follow. We find that there's a challenge, and then chapter 11 provides this content of all of these Old Testament saints that faithfully fulfilled that which God had called them to do. We find the Bible concluded in verse number 39 of Hebrews 11, and these all having obtained a good report through faith, received not the promise. And what a blessing to have the content of Hebrews chapter number 11. Many have referred to that passage as being the great hall of faith chapter. And what a blessing to read through and to be reminded of those various accounts from the Old Testament that would encourage us and would challenge us. We find that as we enter into the first few verses here of Hebrews chapter number 12, that really there is a call that is extended to every believer in these opening verses, and that call is this, run the race. Run the race. We find that the challenge was given to go forward by faith, the content of those that have faithfully run their race, and then this call for us as God's people. You begin to see that here, the terminology, the word us is used four times in verse number one. And so not only",
      "context": "...y fulfilled that which God had called them to do. We find the Bible concluded in verse number 39 of Hebrews 11, and these all having obtained a good report through faith, received not the promise. And what a bl...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=149",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1104.4999694824219,
      "text": "that the enemy makes it look so good and so appealing, and we find that the writer of Hebrews is saying, listen, there's some things that we need to set aside. If we're going to run this race, if we're going to do what God has called us to do, if we're going to be fit for the race, we've got to lay aside every weight. We've got to lay aside the sin which doth so easily beset us. We're mindful of what Jesus said in John 17 as He's nearing the time in which He would go to the cross of Calvary. And we find that He's praying. And there as He's praying, He says, I pray not, beginning in verse 15 of John 17, I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil. You understand that we live in an evil world. By the way, it's not hard for us to be able to conclude that statement this morning. We live in an evil world. There's sin all around us. We find that the Lord Jesus Christ as He's praying, He says that thou shouldest keep them from the evil. Notice verse 16. They are not of the world even as I am not of the world. We've been mentioning that from Hebrews 11. I'm a pilgrim. I'm a stranger. This world is not my home. I'm just a passing through. And what a blessing.",
      "context": "... verse 16. They are not of the world even as I am not of the world. We've been mentioning that from Hebrews 11. I'm a pilgrim. I'm a stranger. This world is not my home. I'm just a passing through. And what a b...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1104",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1167.5399780273438,
      "text": "keep them from the evil. Notice verse 16. They are not of the world even as I am not of the world. We've been mentioning that from Hebrews 11. I'm a pilgrim. I'm a stranger. This world is not my home. I'm just a passing through. And what a blessing. I'm not home, but I'm going home. Verse 17, sanctify them through thy truth, thy Word is truth. Oh, how we need to be in the Word of God. We live in an evil world. Sin abounds. It's all around us. And oh, how we need to be in the Word of God regularly. I said to someone recently, and I did not mean it to sound harsh or unkind, but the reality is that a proverb a day is just not enough. We need all of the Word of God. We need to get into the Bible and allow the Bible to get into us. A man of yesteryear made the statement, I thought it was such a profound truth. He said that thumbprints in the Bible are more important than footprints on the moon. I like it. People want to talk about great accomplishments and what have you. Oh, that we just get into the Word of God. Sanctify them through thy truth. Thy Word is truth. Notice as we conclude verse number one, he says this, not only that we let us lay aside",
      "context": "... verse 16. They are not of the world even as I am not of the world. We've been mentioning that from Hebrews 11. I'm a pilgrim. I'm a stranger. This world is not my home. I'm just a passing through. And what a b...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1167",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1324.2399826049805,
      "text": "difficulty, I don't think that Paul knew all of the circumstances and all of the things that he was dealing with, but God did, amen? And as God knew what it was that Archippus was dealing with, God gave the charge to Archippus to fulfill it, to finish the ministry. So we see, number one, a charge to Archippus. Number two, this morning notice a cloud of witnesses. These are words that we find in Hebrews chapter number 12, of course we know that it's in Hebrews 11, where we read of the great hall of faith chapter, and we read of all of those Old Testament heroes of the faith, as we refer to them as, but we find that in chapter 12 of the book of Hebrews, in verse number 1, it says, Wherefore, seeing we also are compassed about, with so great a cloud of witnesses. This morning I do not believe that the number of servants of the Lord that have fulfilled their ministry is known to any of us. For there are many servants of the Lord that we do not know. That there are no history books written on them, there are no biographies or autobiographies that you can go and look up and read of these heroes of the faith, they're unnamed servants of the Lord. But they're servants of the Lord nonetheless. And they finished their ministry, though they may have been in some obscure place, though",
      "context": "...itnesses. These are words that we find in Hebrews chapter number 12, of course we know that it's in Hebrews 11, where we read of the great hall of faith chapter, and we read of all of those Old Testament heroes...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1324",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1387.8199768066406,
      "text": "them, there are no biographies or autobiographies that you can go and look up and read of these heroes of the faith, they're unnamed servants of the Lord. But they're servants of the Lord nonetheless. And they finished their ministry, though they may have been in some obscure place, though they may not have had the level of prominence of others that we know so well, that we've read their books and we've understood the ministries that they've had, they finished their course. And we have this great cloud of witnesses, it's interesting, even as you would look at Hebrews 11, and there are many that are listed by name, and we see that as God would list them by name, He then speaks of the fact that the time would not give them to speak of all these others, but the reality is that we could add a whole lot of folks to the list that we know. But the number of servants that have fulfilled their ministry is really unknown to us. This morning we have biblical record, in fact we have historical record, that would help us to understand that there are many that have fulfilled their course, that have fulfilled their ministry. I want to give you just a few examples from the New Testament here this morning. In Acts chapter number 12, in verse number 25, go over to the book of Acts, we'll look",
      "context": "...heir course. And we have this great cloud of witnesses, it's interesting, even as you would look at Hebrews 11, and there are many that are listed by name, and we see that as God would list them by name, He the...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1387",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}