{
  "reference": "Hebrews 1",
  "occurrences": [
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 960.1999816894531,
      "text": "worshipped him, saying, Lord help me. He is worthy of our worship. We ought to worship the Lord. We seek to worship him even here this morning. We've worshipped him through our singing and through our giving, and now as we open up the Scriptures, we seek to exalt and magnify our wonderful Savior and to worship him, understanding that he is worthy of worship. I believe that as Mark would tell us in the end of chapter, or the end of verse number 25 in his account, when it says that she heard of him and came and fell at his feet. It doesn't use the terminology that she worshipped, but we find that she did indeed worship the Lord, and in that position of falling to her feet, we find that many throughout the Scriptures, when they would worship, they would be fallen at the feet of the Lord. I want you to understand, even as we were preaching through the book of Hebrews, that Jesus is God, and that's why he accepts worship. We had spoken about the fact that Christ is superior than the angels, and we spent time in Hebrews 1 and 2 dealing with and developing and proving that truth from the Word of God, and understanding the distinction between angels and the Lord Jesus Christ, and we made one of those points that the angels worship, but that Jesus himself is worshipped. Why? Because",
      "context": "...worship. We had spoken about the fact that Christ is superior than the angels, and we spent time in Hebrews 1 and 2 dealing with and developing and proving that truth from the Word of God, and understanding th...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=960",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1028.7599792480469,
      "text": "spent time in Hebrews 1 and 2 dealing with and developing and proving that truth from the Word of God, and understanding the distinction between angels and the Lord Jesus Christ, and we made one of those points that the angels worship, but that Jesus himself is worshipped. Why? Because he's God. If he were not God, he would not have permitted this woman to worship him. No doubt. The angel didn't let John worship him. The angel said, no, no, no. Worship God. John the Baptist was quick to say, I'm not he, right? They wanted to know, are you the one? No, I'm not. We find that she recognized, number one, that Jesus is the Christ, number two, that he is worthy of worship, number three, I believe that she recognized that he has all power. He has all power. Indeed, he is the Lord God omnipotent. He says at the end of chapter Matthew, in chapter number 28, after his ascension, yeah, after his resurrection and before his ascension, we find that he made this declaration as he was giving the disciples the great commission, all power is given unto me in heaven and in earth. I believe that this desperate mother that had this interaction with the Lord Jesus Christ, I believe that she recognized at least these three things. Number one, that he is the Christ. This morning, have you recognized that? Not just for the mothers,",
      "context": "spent time in Hebrews 1 and 2 dealing with and developing and proving that truth from the Word of God, and understanding th...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1028",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}