{
  "reference": "Isaiah 9",
  "occurrences": [
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1810.0800170898438,
      "text": "of Judah. And so we find that here, no doubt there's a view. I mentioned already the purpose, the process and the prophetic view. There's a view here. here in verses 8-12 that goes all the way through the Millennial Kingdom of Christ. All the way back in Genesis 49. I don't think Jacob fully understood all that he was saying. We understand that here as we have the whole canon of Scripture and we're able to compare Scripture with Scripture and we can see the far-reaching view of these statements made by Jacob, these blessings if you will. We find that he says in verse number 10, the scepter shall not depart from Judah, nor a lawgiver from between his feet. Notice this, until Shiloh come. It's kind of interesting because here in the text of Scripture in Genesis 49, Shiloh in verse number 11, excuse me, in verse number 10 is not a place, it's a person. A person. You know Shiloh is very interesting, I mentioned this to Ronnie this afternoon, Shiloh has the same root Hebrew word, the Hebrew root word for Shiloh is the same as shalom or peace. Now Jesus is the Prince of Peace, right? We see that of course in Isaiah 9 and verse number 6 and we find here that indeed the Lord Jesus Christ is in view of being that one that will one day come, he is going to rule and reign for a thousand years, amen?",
      "context": "...h is the same as shalom or peace. Now Jesus is the Prince of Peace, right? We see that of course in Isaiah 9 and verse number 6 and we find here that indeed the Lord Jesus Christ is in view of being that one ...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1810",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1890.52001953125,
      "text": "Prince of Peace, right? We see that of course in Isaiah 9 and verse number 6 and we find here that indeed the Lord Jesus Christ is in view of being that one that will one day come, he is going to rule and reign for a thousand years, amen? I said this morning, it's worth repeating this evening, God's plan is going to come to pass. Thy will be done. Listen there is going to be a rapture. There is, there will be seven years of tribulation. There will be a millennial reign of Christ and there will be eternity, hallelujah. I'm thankful for that. We stood and talked to a man yesterday, Tim was with me, I had both Joseph and Tim, we took turns knocking doors yesterday so that we didn't show up with three of us at one door, we just kind of rotated and we're there and one man says, I don't believe anything, I don't believe any of that. You're entitled to believe what you want to believe. Everyone believes something and if you want to be your own authority, that's up to you but one day you're going to find out the truth, amen? And here we have in view, look at the beautiful picture of peace and plenty that is painted for us in verses 11 and 12 which really will not be fully known until the millennial reign of Christ.",
      "context": "Prince of Peace, right? We see that of course in Isaiah 9 and verse number 6 and we find here that indeed the Lord Jesus Christ is in view of being that one ...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1890",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "3e1Tf17WpHs",
      "timestamp": 925.6600036621094,
      "text": "what our duty is, to preach Jesus. Amen? To lift him up, to preach Christ, to exalt our Savior. He's a wonderful Savior, and we find here that Philip is going to begin at that same scripture, and he's going to show this eunuch how that Jesus was the promised Messiah, and that Jesus, that he came to this earth, that he was born of a virgin, that he is the very Son of God. You think about the prophecies of Isaiah 7 and the prophecy of Isaiah 9. I'm not sure how much of the book of Isaiah Philip used. Again, we don't have the entirety of the message, but I'm sure that as he's preaching Jesus to this eunuch, that he's using the Word of God, and even as the scriptures would later tell us of the Apostle Paul, that Paul would go into those synagogues, and what would he do? He would preach to them that this Jesus whom I preach unto you is Christ, that he is the Messiah, he is the promised one, he is God in flesh. We find he's preaching Jesus. What a blessing. It's ours still today, 2,000 years later, it's still our call to preach Jesus, to preach Jesus, to lift him up. See, why? Because there's some people that don't know. There's some people that say, how can I? Except some man should guide me. We find",
      "context": "...gin, that he is the very Son of God. You think about the prophecies of Isaiah 7 and the prophecy of Isaiah 9. I'm not sure how much of the book of Isaiah Philip used. Again, we don't have the entirety of the ...",
      "sermon_title": "Sermon 3e1Tf17WpHs",
      "url": "https://www.youtube.com/watch?v=3e1Tf17WpHs&t=925",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}