{
  "reference": "Isaiah 29",
  "occurrences": [
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 2145.1199340820312,
      "text": "and I delight not in the blood of bullocks or of lambs or of he goats. When you come to appear before me, who hath required this at your hand to tread my courts? Bring no more, notice what it says, vain oblations, incenses and abomination unto me, the new moons and Sabbaths, the calling of assemblies I cannot away with. It is iniquity, even the solemn meeting, your new moons and your appointed feasts my soul hateth. They are a trouble unto me, I am weary to bear them. And when you spread forth your hands, I will hide mine eyes from you, yea, when you make many prayers, I will not hear. Your hands are full of blood, wash you, make you clean, put away the evil of your doings from before mine eyes, cease to do evil. Understand that as we look at this passage of scripture, that they were bringing offerings, they were, where did they get the idea of bringing offerings? Well, they were doing what God had commanded them to do back in Leviticus. But you know what was missing? Their heart. Their heart. God says, why are you bringing me these things? Notice in Isaiah chapter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse",
      "context": "...tice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=2145",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 2203.719940185547,
      "text": "missing? Their heart. Their heart. God says, why are you bringing me these things? Notice in Isaiah chapter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse that would be quoted later in the Gospels, the Bible says this in verse 13, wherefore the Lord said, forasmuch as this people draw near me with their mouth and with their lips do honor me, but notice, but have removed their heart far from me. And their fear toward me is taught by the precept of men. God says with their mouth, they draw near me with their mouth, and with their lips they do honor me. But there's a problem because their heart, their heart has been removed. In Jeremiah chapter 4 and verse number 4, notice what the prophet says with regard to the subject of our heart tonight. In verse number 3, I'll read with it. In Jeremiah chapter 4 and verse number 3, it says, for thus saith the Lord to the men of Judah and Jerusalem, break up your fallow ground and sow not among thorns, circumcise yourselves to the Lord. Notice what he says, and take away the foreskins of your heart, ye men of Judah and inhabitants of Jerusalem, lest my fury come forth like fire and burn that none can quench it because of the evil of your doings.",
      "context": "...tice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse that would be quoted later in the Gospels, the Bible says this in verse 13, w...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=2203",
      "channel": "Unknown",
      "publish_date": 20241202
    }
  ]
}