{
  "reference": "James 1",
  "occurrences": [
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 534.1799926757812,
      "text": "faithful But God is faithful who will not suffer you to be tempted above that you're able But will with the temptation also make a way to escape that ye may be able to bear it So we understand that we have an enemy we understand the reality of temptation And we understand that our God is faithful and will provide as I like to call it an escape route According to verse number 13 of first Corinthians 10 We also understand according to James chapter number 1 that our God does not tempt us to sin in James chapter Number 1 is specifically in verses 13 through 15 We find that this truth is being given to us with regard to temptation to sin or to do evil And in verse number 13 of James 1 the Bible says let no man say when he is tempted I am tempted of God for God cannot be tempted with evil neither tempteth He any man but every man is tempted when he is drawn away of his own lust and enticed then when lust hath conceived it bringeth forth sin and sin when it is finished bringeth forth death so we understand The the truth of temptation and we understand that we have an enemy We think about this model that is given to us in Luke chapter number 11 and really the significance of this last statement",
      "context": "...truth is being given to us with regard to temptation to sin or to do evil And in verse number 13 of James 1 the Bible says let no man say when he is tempted I am tempted of God for God cannot be tempted with...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=534",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 674.7600021362305,
      "text": "think about these truths and consider the progression this morning of worldliness by way of really getting into this passage in 1 John, notice the Bible says this in James 4 and verse number 4, ye adulterers and adulteresses, know ye not that the friendship of the world is enmity with God, whosoever therefore will be a friend of the world is the enemy of God. You say, pastor, that's strong language, that's Bible. When he says ye adulterers and adulteresses, I immediately, my mind races back to the book of Hosea, to the prophets of Israel when they were prophesying and they were preaching and proclaiming that they, the nation had left and they followed after idols and they were guilty of this spiritual adultery. We find here that God says that we're not to have friendship with the world because friendship with the world is enmity with God. And he says, whosoever therefore will be a friend of the world is the enemy of God. I don't want to be God's enemy, amen? And so it begins with this friendship and we find that the Bible tells us, look back a few passages or a few pages in James 1 and verse number 27, notice what he says here, pure religion and undefiled before God and the Father is this, to visit the fatherless and widows in their affliction, notice what he says, and to keep himself unspotted from the world.",
      "context": "...ith this friendship and we find that the Bible tells us, look back a few passages or a few pages in James 1 and verse number 27, notice what he says here, pure religion and undefiled before God and the Fathe...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=674",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 751.0200042724609,
      "text": "few passages or a few pages in James 1 and verse number 27, notice what he says here, pure religion and undefiled before God and the Father is this, to visit the fatherless and widows in their affliction, notice what he says, and to keep himself unspotted from the world. You know what happens when I begin to be a friend of the world? I begin to be spotted by the world. So I have no friendship with the world so that I can keep myself unspotted from the world, James 1 and verse number 27, and we find that we then come to 1 John 2 where we see that the Bible says, love not the world, neither the things that are in the world. See that love doesn't happen overnight. It's not something that just immediately takes place. There's this progression of worldliness and the reality is that the enemy wants you to be worldly, the enemy wants me to be worldly so that we could be at odds with God so that we can be ineffective in the purpose in which God has left us here. God has left us here to be different. We're not to be like the world. We're not to love the world. He tells us, love not the world. Do you remember Demas? The Bible tells us of Demas, that he hath forsaken me, what does it say? Having loved this present world.",
      "context": "few passages or a few pages in James 1 and verse number 27, notice what he says here, pure religion and undefiled before God and the Fathe...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=751",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}