{
  "reference": "Jeremiah 10",
  "occurrences": [
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 0.0,
      "text": "Looking at the names of God, the title of the message, Thy Name is Great, and that was part one. And now this evening, Thy Name is Great, part two. And Brother Jim, sorry I did not give you a note card with that, but it is Thy Name is Great, part two. We'll be looking here at Proverbs 18 and verse number 10 as a springboard again this evening. You'll remember that as we started this study of theology that we began in Jeremiah chapter number 10, and we've used verse number 6 in Jeremiah 10 as really an outline type of a verse for this passage of scripture where the Bible says, For as much as there is none like unto thee, O Lord, thou art great, and thy name is great in might. And so we've had the opportunity as we've studied theology to look at a number of God's attributes and to rejoice in His moral attributes and His natural attributes, and what a joy to have the privilege of knowing the God of the universe and that He has given us His word to reveal Himself to us. As we began looking at the names of God, we've made the note of understanding that God would use a number of names in the Old Testament to call Himself, and as He would use those names, He would be communicating with His people various aspects of His character.",
      "context": "...his study of theology that we began in Jeremiah chapter number 10, and we've used verse number 6 in Jeremiah 10 as really an outline type of a verse for this passage of scripture where the Bible says, For as muc...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 1627.9800109863281,
      "text": "as I can comprehend God to be, He's far superior to the what I can even begin to comprehend. His greatness is unsearchable. That's what the Word of God says. Now David declares, I know the Lord is great. And then he also says, but the Lord's greatness is unsearchable. There's no contradiction there. It's just that our finite minds cannot fully comprehend the infinite God. And so what He has done is He has revealed Himself to us, and one of the means by which He is used is the names. And as He has given Himself these names, He's revealing to His people various aspects of His character and His ability, His attributes. Why? So that we'd be encouraged, so that it would help us in this journey of life as we are mindful of who our God is. There's none like Him. As we go back and kind of finish up this study with the truth of Jeremiah 10, I want to remind you again, and we started here, we've used the verse often throughout the study, but I want to remind you of this verse as we close in Jeremiah 10 and verse number 6, when Jeremiah declares, For as much as there is none like unto Thee, O Lord. There's no one like Him. No one like Him. All the false religions of the world, all that they try to serve, there's",
      "context": "...our God is. There's none like Him. As we go back and kind of finish up this study with the truth of Jeremiah 10, I want to remind you again, and we started here, we've used the verse often throughout the study, ...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=1627",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 1701.6199951171875,
      "text": "this verse as we close in Jeremiah 10 and verse number 6, when Jeremiah declares, For as much as there is none like unto Thee, O Lord. There's no one like Him. No one like Him. All the false religions of the world, all that they try to serve, there's no one like the Lord God Almighty, Jehovah God. It says, Thou art great, and He is. Oh, He's a good God, and we often speak about the Lord is good, and we should, for the Bible says that He is good. But He's great. His greatness, as I mentioned a moment ago, is unsearchable. The Bible says in Psalm 48, Great is the Lord, and greatly to be praised. And then we have here at the end of verse number 6, And thy name is great in might. Let me remind you, as I said in one of our previous lessons, we think about how great our God is. We study theology. We want to have as our textbook, if you will, for theology, the Word of God, the Bible, the revelation of God to man. We find that as we begin to study theology and understand who God is, as He's revealed Himself, that yes, we stand in awe of Him, and yes, we say that He is great, but we must be mindful of the fact that the Bible says, For this God is our God forever and ever. He will be our guide",
      "context": "this verse as we close in Jeremiah 10 and verse number 6, when Jeremiah declares, For as much as there is none like unto Thee, O Lord. Th...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=1701",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}