{
  "reference": "Jeremiah 17",
  "occurrences": [
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 566.239990234375,
      "text": "mention a few. And there are many references to the heart. It's been defined as the seat of the affections and passions, the seat of the understanding, the seat of the will. You'll be mindful that it was God in Genesis chapter number 6, you don't need to turn there, but He's speaking to Noah and talking about the judgment that would come with regard to the wickedness God saw in verse number 5 of Genesis 6, that the wickedness of man was great in the earth and that every imagination of the thoughts of his heart was only evil continually. We think about this warning in Deuteronomy 11 and really we couple it with what Jeremiah proclaims in Jeremiah 17 in verse number 9 when he says, The heart is deceitful above all things, and desperately wicked. Who can know it? The answer is given in v. 10 of Jeremiah 17. I, the Lord, search the heart. I try the rains, even to give every man according to his ways and according to the fruit of his doing. But in the idea this evening that your heart be not deceived, we recognize that God is telling His people and telling us through preservation that the heart is deceitful above all things, and desperately wicked. Who can know it? He says that your heart be not deceived. It's interesting back in Deuteronomy 11 in v. 16 when He says that your heart be not deceived,",
      "context": "... think about this warning in Deuteronomy 11 and really we couple it with what Jeremiah proclaims in Jeremiah 17 in verse number 9 when he says, The heart is deceitful above all things, and desperately wicked. Wh...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=566",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 871.2599792480469,
      "text": "and 20, I will not have time to read those verses, but it's very similar to the text of Scripture that I preached on Sunday morning from Deuteronomy chapter number six. The importance of the commands of the Lord and His statutes and His judgments. And we find that here, the word of God is to have a prominent place in our lives. And when God's word has that prominent place in our lives, that is really the key that we would not have, that our hearts would not be deceived. As I think about the warning that is given here, I'm mindful of Jeremiah once again. Turn over to Jeremiah 44, if you will. We referenced already in Jeremiah 17 the way in which the Bible tells us that the heart is deceitful above all things. And Jeremiah 44, you'll find that in this passage of Scripture, there's some dialogue that takes place. And I just want to read a few verses of Scripture to you to help you see the deception of these people. God says this in verse number three, because of their wickedness which they have committed to provoke Me to anger in that they went to burn incense and to serve other gods whom they knew not, neither they, ye, nor your fathers. Howbeit, I sent unto you all My servants, the prophets, rising early, and sending them, saying, O, do not this abominable thing that I hate. Isn't God so gracious in longsuffering?",
      "context": "...I'm mindful of Jeremiah once again. Turn over to Jeremiah 44, if you will. We referenced already in Jeremiah 17 the way in which the Bible tells us that the heart is deceitful above all things. And Jeremiah 44, ...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=871",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}