{
  "reference": "Jeremiah 29",
  "occurrences": [
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 2277.2599487304688,
      "text": "sow not among thorns, circumcise yourselves to the Lord. Notice what he says, and take away the foreskins of your heart, ye men of Judah and inhabitants of Jerusalem, lest my fury come forth like fire and burn that none can quench it because of the evil of your doings. Again in chapter 29, Jeremiah 29 and verse 13, the Bible says this with regard to this truth with regard to our hearts. In Jeremiah 29 and verse 13, you shall seek me and find me, notice when you shall search for me with what, all your heart. You know, God doesn't want half-hearted Christianity, He doesn't want us to have a divided heart. He wants us to have a heart for Him. He wants us to love Him with all of our heart. This evening as I consider the thought from Revelation chapter 2, I just couldn't get away from it. Because I believe tonight that every single one of us, let him that thinketh he stand take heed lest he fall, that's Bible, right, that's what it says. Every one of us tonight have an enemy. And I hope tonight that we could each stand and say, I love God with all my heart. But I understand just as Peter stood and said, Lord, I'll never deny you, that we have an enemy and he's relentless and he's ruthless. And he wants to, he wants to divide your heart and my heart.",
      "context": "...like fire and burn that none can quench it because of the evil of your doings. Again in chapter 29, Jeremiah 29 and verse 13, the Bible says this with regard to this truth with regard to our hearts. In Jeremiah ...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=2277",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "x_cP5nnwVQU",
      "timestamp": 1808.44003200531,
      "text": "day. The Assyrian captivity is what's captured here. God was faithful to deliver the message. He used prophets and he used seers, but the The problem was that they would not hear. It wasn't that the message wasn't made known. It wasn't that they didn't know what God was saying. It was that they chose not to obey it. Notice in the book of Jeremiah, if you will quickly, Jeremiah chapter 29. In Jeremiah chapter 29, this evening, we see in verse number 19, of course, Jeremiah is now prophesying. Assyria has already taken Israel captive. You gotta fast forward a hundred years, a hundred, more than a hundred years, really, and 115 years or so, and you're on the eve of the Babylonian captivity, and Jeremiah's prophesying. He can see they've laid siege against the city, and you can understand that this indictment is coming. And in Jeremiah 29, I want you to notice the Bible says this in verse number 19. It says, because they have not hearkened to my word, saith the Lord, which I sent unto them by my servants, the prophets, rising up early and sending them, but ye would not hear, saith the Lord. So then notice verse 20, though. Hear ye therefore the word of the Lord, all ye of the captivity whom I have sent from Jerusalem to Babylon. And so God wants his people to hear. He wants us to listen up.",
      "context": "... they've laid siege against the city, and you can understand that this indictment is coming. And in Jeremiah 29, I want you to notice the Bible says this in verse number 19. It says, because they have not hearke...",
      "sermon_title": "\"We Ought To Listen Up - Part 1\" Hebrews 2:1-4",
      "url": "https://www.youtube.com/watch?v=x_cP5nnwVQU&t=1808",
      "channel": "Unknown",
      "publish_date": 20241015
    }
  ]
}