{
  "reference": "Jeremiah 49",
  "occurrences": [
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2207.6600036621094,
      "text": "how that God was angry with Solomon, why? Because of his evil, where he built these places of worship for these false gods of these wives that he married and all that was taking place. And we find that he also was burning incense and sacrificed one of their gods. And the Bible then tells us in verse 14 of 1 Kings 11, and the Lord stirred up an adversary unto Solomon, hey, dad, the Edomite. Hey, dad, the Edomite. He was the king's seed in Edom. The days of Amaziah, king of Judah, there's conflict, there are disputes with the Edomites. But I want you to think about the judgment upon the Edomites. I won't take time to look at any of the references. We're near the end this evening. But turn to the book of Jeremiah, if you will. Read two verses from the book of Jeremiah and Ezekiel and I encourage you to read the small book of Obadiah. And the book of Obadiah completely deals with Edom, the sons of Esau. Specifically goes back to Numbers 20. To the event that we read of in Numbers 20 where they said we're gonna pass through. He said, no, you're not. If you read the book of Obadiah, just a short book, you'll see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly,",
      "context": "...see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly,",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2207",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2274.040008544922,
      "text": "pass through. He said, no, you're not. If you read the book of Obadiah, just a short book, you'll see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly, but notice in Jeremiah 49, really beginning in verse number seven, it says concerning Edom, thus saith the Lord of hosts. I'm not gonna read all of it for sake of time. But we find that these are prophecies that are given against Edom. And we see specifically throughout this portion of the book of Jeremiah, the number of different places that are receiving these prophecies concerning against these particular people groups. And so concerning Edom, thus saith the Lord of hosts. And then skip down, if you will, in verse number 17, the Bible says also Edom shall be a desolation. Everyone that goeth by it shall be astonished and shall hiss at all the plagues thereof. The Bible says very similarly in the book of Ezekiel, look over, if you will, Ezekiel 25. In Ezekiel 25, in verses 12 through 14, we read this judgment that is given again in this portion of the book of Ezekiel, a number of different nations are being prophesied against. And in this particular text, it's against Edom. Beginning in verse number 12, the Bible says, thus saith the Lord God, because that Edom hath dealt against the house of Judah",
      "context": "...see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly, but notice in Jeremiah 49, re...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2274",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}