{
  "reference": "Jeremiah 37",
  "occurrences": [
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 0.0,
      "text": "this evening, Jeremiah chapter number 38. And really, as we look at this passage of Scripture this evening, I'll be looking at portions of Jeremiah 37, 38, 39, and 40. And so hold your fingers there in that section of Scripture, and we'll be kind of bouncing back and forth. And as we look at this particular text, I'm trusting that the Lord will enable us tonight to be encouraged from that which we read of with regard to the life of Jeremiah. As we have now completed almost 10 months in 2020, we know that there have been many that have made commentary with regard to 2020. And as we think about the days in which we're living, many have expressed this thought, is that we are living in uncertain times. However, as we would think about the fact that we're living in 2020 and that our God is omniscient and He's eternal, though from man's perspective we may face some level of uncertainty, the reality is that God knows all about it. God is never surprised by anything that happens. He knows the end from the beginning. And so as we begin to think about that truth and we think about the way in which people have used various verbiage to describe 2020, and no doubt it's been varied at times, it's been quite accurate from man's perspective. And I'm thankful that it's not only our perspective that matters. I'm thankful that we can understand",
      "context": "...8. And really, as we look at this passage of Scripture this evening, I'll be looking at portions of Jeremiah 37, 38, 39, and 40. And so hold your fingers there in that section of Scripture, and we'll be kind of ...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 380.32000732421875,
      "text": "time in which many in those that he was preaching to, they forsook the commandment of the Lord. They did not hearken to the Word of God. We find that Jeremiah is prophesying in such a day and he's ministering in such a day. If we're to take notes this evening, first I would like you to take note of the coming judgment. It helps me to understand the times in which Jeremiah is ministering, is prophesying, to understand and to take note of the coming judgment. I'll just look at some verses here in the text in which we're looking at this evening, but look in chapter 37 if you will. In verse number 6 of Jeremiah 37, the Bible says this, then came the word of the Lord unto the prophet Jeremiah saying, thus saith the Lord, the God of Israel, thus shall ye say to the king of Judah. Now, pause with me just for a moment at that phrase in verse number 7, for we find that the king of Judah at this particular time is Zedekiah. And we see that in verse number 1 of Jeremiah 37, and king Zedekiah, the son of Josiah reigned. And it tells us in verse number 2, but neither he nor his servants nor the people of the land did hearken unto the words of the Lord which he spake by the prophet Jeremiah. And so we find that from the king to the servants",
      "context": "...xt in which we're looking at this evening, but look in chapter 37 if you will. In verse number 6 of Jeremiah 37, the Bible says this, then came the word of the Lord unto the prophet Jeremiah saying, thus saith t...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=380",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 448.32000732421875,
      "text": "son of Josiah reigned. And it tells us in verse number 2, but neither he nor his servants nor the people of the land did hearken unto the words of the Lord which he spake by the prophet Jeremiah. And so we find that from the king to the servants to the people, they did not hearken unto the words of the Lord which he spake by the prophet Jeremiah. And so Jeremiah 37 tells us that they're not listening, they're not hearkening, but yet we find that in verse number 3, they come to Jeremiah and they say, pray now unto the Lord our God for us. And the word of the Lord comes unto Jeremiah, as we mentioned in verse number 6, and God tells Jeremiah, thus shall you say to the king of Judah. Now this is the same king that has not hearkened. This is the same king that's not following that which God has already revealed through his prophet and through the message. And it says, thus shall you say to the king of Judah that sent you unto me to inquire of me. Behold, Pharaoh's army, which has come forth to help you, shall return to Egypt into their own land. And the Chaldeans shall come again and fight against this city and take it and burn it with fire. Thus saith the Lord, deceive not yourselves, saying, the Chaldeans shall",
      "context": "...ple, they did not hearken unto the words of the Lord which he spake by the prophet Jeremiah. And so Jeremiah 37 tells us that they're not listening, they're not hearkening, but yet we find that in verse number 3...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=448",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}