{
  "reference": "John 2",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 363.8399963378906,
      "text": "is built It was in the heart of David to do so God said no You're not permitted to do it, but your son will be responsible for building a temple We understand that David prepared greatly and all of the things that he did to have all of the Materials prepared and ready for Solomon and what a glorious occasion It was when the nation of Israel under the leadership of Solomon completed the temple And then of course they had worship there at the temple that temple would be destroyed We understand that they come back if you study and read the books of Ezra and Nehemiah and when that That remnant returned after the Babylonian captivity. What did they do? Not only did they repair the wall, but they restored Sacrifice there at the temple when we see those things taking place that temple as well was destroyed. We see there's a new temple That's here during the time of Jesus and during this time in which the book of Hebrews is written Remember it was Jesus back You don't need to turn there but in the book of John When he was speaking about the fact that he would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up",
      "context": "...e would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=363",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 425.67999267578125,
      "text": "book of John When he was speaking about the fact that he would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up Then said the Jews forty and six years was this temple in building and wilt thou rear it up in three days? But he Jesus spake of the temple of his body We spent a number of weeks a few years ago on Wednesday evening Studying all of the details with regard to the tabernacle and as we studied the tabernacle We understood that the tabernacle was a picture It was a type and how that every detail within the tabernacle in some way is pointing to Jesus Christ We'll deal with some of those things as we go through here in Hebrews 8 and then again in Hebrews 9 as some of those things Are dealt with but we rejoice in the fact that as we come to this passage of Scripture You notice in verse number 1 of chapter 8. It's where I've adopted the title this morning He says we have such and high priest I've simply titled we have and high priest see the reality is that these people the Jewish believers They understood what it was to have a priest and they understood the responsibility of the priest",
      "context": "...e would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up Then said the Jews forty and six y...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=425",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 1985.8199920654297,
      "text": "that we are secure in the hand of God. My sheep hear my voice, and I know them, and I give unto them eternal life, and they shall never perish. Those are precious words that Jesus spoke that John would have heard with his own ears. And Peter would say this in 1st Peter 1 and verse number 5, that we are kept by the power of God. So Jesus says, and John and Peter both here, that we're secure in his hand, and Peter says that we're kept by the power of God, and John speaks about being born of God and that protection that we have that God gives us, and I am so thankful for the protection of God. It says in verse 18, we know that whosoever is born of God sinneth not. Now we've dealt with this in previous messages, but it's important to note once again that the verb tense of the particular word is important and gives us clarity. In previous messages in chapter 2 and 3, we dealt with this in 1st John 2 and 3, but the verb here, when it talks about sinneth not, is conjugated in the present tense. I'm not trying to be too difficult here, but really what it indicates is ongoing action. So it doesn't mean that you'll never sin, it means that you're not going to have that habitual sin in your life.",
      "context": "... important and gives us clarity. In previous messages in chapter 2 and 3, we dealt with this in 1st John 2 and 3, but the verb here, when it talks about sinneth not, is conjugated in the present tense. I'm ...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=1985",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 0.0,
      "text": "Online and happy birthday to brother John and he is not 40. Amen. I don't know exactly his age, but he is not 40 I can guarantee you that happy birthday, brother John 2nd Chronicles chapter number 20 2nd Chronicles chapter number 20 in your Bible this morning as you know throughout the year Here in 2020 our theme has been looking unto Jesus We systematically studied through the book of Hebrews and as we studied through the book of Hebrews Of course, as you know as you've been with us, we finished up last Sunday and what a joy To that it was for me I hope it was a joy for you to study through the book of Hebrews and to be encouraged to be challenged to be strengthened And as we study the Word of God We know that the Bible tells us that faith come of my hearing and hearing by the Word of the Lord of the Word of God and I'm so thankful that through studying the Word of God that our faith is increased and we serve a wonderful Savior Amen, and I know I've shared this before with you that several in the places in which we go we have to wear masks and all that sort of thing and so I purchased a couple of masks that have Some some some sayings on them. One of them says Jesus loves you",
      "context": "Online and happy birthday to brother John and he is not 40. Amen. I don't know exactly his age, but he is not 40 I can guarantee you that happy birthday, brother John 2nd Chronicles chapter number 20 2nd Chronicles chapter number 20 in your Bible this morning as you know throughout the year Here in 2020 our theme has been looking unto Jesus We systematically studied through the book of Hebrews and as we studied through the book of Hebrews Of course, as you know as you've been with us, we finished up last Sunday and what a joy To that it was for me I hope it was a joy for you to study through the book of Hebrews and to be encouraged to be challenged to be strengthened And as we study the Word of God We know that the Bible tells us that faith come of my hearing and hearing by the Word of the Lord of the Word of God and I'm so thankful that through studying the Word of God that our faith is increased and we serve a wonderful Savior Amen, and I know I've shared this before with you that several in the places in which we go we have to wear masks and all that sort of thing and so I purchased a couple of masks that have Some some some sayings on them. One of them says Jesus loves you",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}