{
  "reference": "John 16",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2907.2200622558594,
      "text": "that has been offered by the Lord Jesus Christ, and it's the gift of God which is eternal life through Jesus Christ our Lord. Don't leave here this morning, don't tune off from live stream without knowing for sure that heaven is your home. Because our high priest offered a better, he presented a better offering when he offered himself. Let's pray. Father, we love you this morning, we thank you for loving us, we thank you for thy Word and for the truth contained therein. We thank you that we have an high priest, Jesus Christ, the Son of God. We thank you that he entered into the heavens, the true tabernacle. We thank you that he made an offering that was far superior to any offering that was made by any priest when he offered himself, the just for the unjust. We're so thankful for the precious blood of Christ, we're thankful that he was buried in a borrowed tomb and rose in victory on the third day. Father, I pray you'd help us to, those of us that are saved, been born again, help us to live with that understanding that we serve a risen Savior. Father, I pray that if there's one that's not sure of heaven, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's",
      "context": "...en, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2907",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2992.3800659179688,
      "text": "serve a risen Savior. Father, I pray that if there's one that's not sure of heaven, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's righteousness, and of judgment to come. I pray that not one person would leave this place, not that one person would... Log off of Livestream without knowing for sure that heaven is their home. Thank you for being our wonderful Savior. Indeed, we echo the words of the songwriter, hallelujah, what a Savior. I pray that you'd move in our midst, that you'd have your will and way. We'll thank you for it. In Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed, no one's looking around. It is our practice to have a time of invitation at the end of each of our sermons.",
      "context": "...en, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's righteousness, and of judgment t...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2992",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2486.739990234375,
      "text": "the fact that not only has He provided Himself, but then He's provided truth. If He did not provide and preserve this book, how would we know truth? How would we even know that Jesus came? But we have this record. We have this book because He gave us truth. We find that He's provided that to us. We find that He provides understanding. Did you see what it said there in 1 John 5 and verse 20? It says, and hath given us an understanding. I'm so thankful that He's provided this understanding, and we understand this morning that this understanding comes through the Holy Spirit. He says in John 16 and verse number 13 that He, the Holy Spirit, He is the Spirit of truth, and He will guide us into all truth. And we ought to be so thankful. You say, how do you understand these things? The Holy Spirit of God gives me understanding. It's not that I'm smarter than somebody else. It's not that you're smarter than somebody else. It's not that we're, no, no, it's God that gives us understanding. By the way, that keeps us humble. Amen? Keeps us humble. We find here that He's provided Himself. He's provided truth. He's provided us with understanding. I think about this in verse number 20. Again, it says this, and we know that the Son of God has come and hath given us an understanding.",
      "context": "...g, and we understand this morning that this understanding comes through the Holy Spirit. He says in John 16 and verse number 13 that He, the Holy Spirit, He is the Spirit of truth, and He will guide us into ...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2486",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 0.0,
      "text": "John, we'll be in John chapter number 16, John chapter number 16 this morning. I'll read the verse of scripture that we'll be using for our message this morning. We'll be referencing a number of different passages of scripture as well, so have your fingers ready this morning, John chapter number 16. I love the gospel of John, and obviously I love the Bible. All of it is good, it's profitable, and we're thankful for it. But there's something about the gospel of John for me personally, specifically, I thoroughly enjoy reading through the gospel of John. I just read it again last week and just thoroughly was blessed and encouraged. John 16, in verse number 33, notice what the Bible says. These things I have spoken unto you, that in me you might have peace. In the world you shall have tribulation, but be of good cheer, I have overcome the world. Jesus gives these words to the disciples and what precious words they are. I've titled the message from this verse of scripture, be of good cheer. John chapter number 12 records for us the triumphal entry of the Lord Jesus Christ as he makes his way into Jerusalem. And we understand that even as that event is given to us and the record is provided in John chapter number 12, that it was 500 years earlier that Zachariah prophesied of this very event taking place. And as Jesus would make his triumphal entry into Jerusalem",
      "context": "... the gospel of John. I just read it again last week and just thoroughly was blessed and encouraged. John 16, in verse number 33, notice what the Bible says. These things I have spoken unto you, that in me yo...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 166.55999755859375,
      "text": "entry of the Lord Jesus Christ, over the next few days, we find that several things occur. We find that in John chapter 13, God provides us with the record of Jesus washing the feet of the disciples. And of course, there's a great truth in that passage of scripture that we can understand the truth of being a servant, the humility and what joy that is, the great lesson that we learn of Peter and his objection and the instruction that's given. But after that portion of scripture in John 13, we find that Jesus to conclude the 13th chapter, chapter 14, 15 and 16, we find that in these pages of God's word that Jesus is spending these times, this period of time alone with his disciples. And as he's there alone with his disciples, we find that it is in this intimate setting that Jesus is preparing his disciples for that which will transpire in the days ahead. Not only immediately, but we find that even in their life and ministry and for us today, the truth of preparation is still found within these words that Jesus spoke. We find that really John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a concluding verse. It closes out all that Jesus taught his disciples, all of the instruction, all that he had communicated to them during that special time.",
      "context": "...y, the truth of preparation is still found within these words that Jesus spoke. We find that really John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=166",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 246.16000366210938,
      "text": "John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a concluding verse. It closes out all that Jesus taught his disciples, all of the instruction, all that he had communicated to them during that special time. We find that Jesus in the gospel of John regularly refers to his hour. And he speaks about in John chapter number two that his hour is not yet come, but we find that as immediately following our text of scripture this morning, that when you come to John 17 and verse number one, that Jesus says, father, the hour is come. What is he referring to? Well, he's going to the cross of Calvary. He's going to pay for the sin of mankind. He's going to fulfill his singular purpose of coming to this earth and that's to save sinners. He had to go to the cross of Calvary. We understand that he was buried and he rose conquering sin, death and the grave. The things that would transpire in these days ahead were going to be events that were going to cause the disciples to have many emotional responses. There were several things that they were going to have to deal with, not only during the crucifixion, the arrest and the trial and the crucifixion, the resurrection and then following thereafter. We find that as they would begin their ministry, as you study the book of Acts,",
      "context": "John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=246",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 454.20001220703125,
      "text": "them written. Isn't that a blessing? You ever forget something that somebody told you audibly? You ever forget something that you've read? Sure you have. Well, we have the blessing of being able to go back to the precious Bible and being able to read these words that Jesus spoke. If you're taking notes with me this morning, notice number one, something to embrace. As we look at John 16 and verse number 33, I find that there's something for us to embrace, something for the disciples to embrace, but this morning for each of us as the people of God here in 2024, there is something for us to embrace. Notice the way that the verse begins. These things I have spoken unto you. These things I have spoken unto you. What is it that we're to embrace? We're to embrace the word of God. We're to embrace the scriptures. We're to embrace that which God has given to us. And we find contextually as Jesus is here, literally with his disciples, leading up to the time in which he would go to the cruel cross and pay for the sin of mankind, that he's literally speaking these words. It says, these things I have spoken unto you. They are to embrace these spoken words. But I would say to you this morning that as we have the written word of God that we understand that all scripture is given by inspiration of God, that's God breathe.",
      "context": "...If you're taking notes with me this morning, notice number one, something to embrace. As we look at John 16 and verse number 33, I find that there's something for us to embrace, something for the disciples t...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=454",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 988.780029296875,
      "text": "of my biggest issues. I shouldn't say biggest because I had so many of them, but one of my issues with 2020 and COVID and all the lockdowns and all the things they try to do. Listen, as God's people, we have the responsibility of fulfilling the one another commands. And how can we do that if we're not together? A church is a called out assembly. It's what it is. We find here this morning that Jesus, knowing what would take place, he says, I'm commanding you that you love one another. You're going to need each other. John 16 and verse number 1, these things have I spoken unto you that you should not be offended. Notice where he says in verse 2, they shall put you out of the synagogues. And then he says, if you are of the world, the world will hate you, but because you're not of the world, I have chosen you out of the world. Therefore, the world hateth you. Listen, sometimes we walk around as Christians and say, why does the world hate me? Listen, if the world hates you, it's a good thing. If the world loves you, I'd be concerned. I'm being honest. If the world loves you, I'd be concerned. If the world hates you, I'd be concerned. I'm being honest. If the world loves you, I would be concerned. We often talk about separation, come out from among them and be separate,",
      "context": "...take place, he says, I'm commanding you that you love one another. You're going to need each other. John 16 and verse number 1, these things have I spoken unto you that you should not be offended. Notice whe...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=988",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1053.9000244140625,
      "text": "world loves you, I'd be concerned. I'm being honest. If the world loves you, I'd be concerned. If the world hates you, I'd be concerned. I'm being honest. If the world loves you, I would be concerned. We often talk about separation, come out from among them and be separate, but can I tell you this morning that if we live godly lives, they're going to separate from us. We don't even really have to separate from them. They're going to just separate from us. Why? Because men love darkness rather than light. And so we find that Jesus says, listen, I'm speaking these, there are some things that are going to happen, and I'm speaking these things unto you. I'm trying to give you the instruction that you need. Look in verse number four of John 16, but these things have I told you that when the time shall come, you may remember that I told you of them. And these things I said not unto you at the beginning because I was with you. And so we find that Jesus says, I'm telling you these things because I know what's going to happen. And I'm preparing you. I'm providing for you that which you need. And when the time comes, you're going to remember that I told you of them. What a joy to know that our God loves us so much that he's given us the truth that we need. There's something to embrace.",
      "context": "...things unto you. I'm trying to give you the instruction that you need. Look in verse number four of John 16, but these things have I told you that when the time shall come, you may remember that I told you o...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1053",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1115.9000244140625,
      "text": "preparing you. I'm providing for you that which you need. And when the time comes, you're going to remember that I told you of them. What a joy to know that our God loves us so much that he's given us the truth that we need. There's something to embrace. We find in verse seven of John 16, Jesus says, nevertheless, I tell you the truth. I tell you, he's speaking to them. It is expedient for you that I go away. See, they really didn't want him to go away. And I understand why. But Jesus says it's necessary. It's appropriate. It's expedient for you that I go away. It's absolutely necessary for if I go not away, the comforter will not come unto you. But if I depart, I will send him unto you. And Jesus concludes once again in chapter 16 and verse number 33, these things I have spoken unto you. Listen, Jesus was deliberate with what he said to his disciples. It is imperative this morning that these disciples would have understood the importance of the message that was being given. But I would say for each of us this morning, it's imperative that we understand that God's Word is profitable. That God has given us exactly what we need, and there is something to embrace. That we embrace the truth of God's Word. That we hold it dear. That we seek the face of God through his precious Word.",
      "context": "... that he's given us the truth that we need. There's something to embrace. We find in verse seven of John 16, Jesus says, nevertheless, I tell you the truth. I tell you, he's speaking to them. It is expedient...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1115",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1188.9000244140625,
      "text": "morning, it's imperative that we understand that God's Word is profitable. That God has given us exactly what we need, and there is something to embrace. That we embrace the truth of God's Word. That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bible says this in John 16 and verse 33. these things I have spoken unto you.\" Notice, number one, when we think about this expectation that in me, you might have peace. I'm so thankful that he is the prince of peace. I'm so thankful that he is a peace, according to what Paul said, that passeth all understanding. I'm thankful that even in the text of this dialogue that Jesus has with his disciples, and of course we have the division of chapters and verses, but really he's just giving in this intimate setting all of this instruction that we have divided into chapters. He's providing this instruction to his disciples. And notice back in John 14 and verse 27, notice what Jesus says with regard to peace. He says, listen, there's something to embrace. I've spoken these things I have spoken unto you, but there's something to expect. He says, listen, in me, you might have peace. Notice in John 14 and verse number 27, Jesus says this, peace I leave with you.",
      "context": "...That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bi...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1188",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1343.5600280761719,
      "text": "looking for it in all the wrong places for Jesus is the prince of peace. And he offers peace. He says, my peace give I unto thee. Listen, I'm so thankful this morning that God's peace can rule in our hearts. That's what Paul says to the believers in Colossae. Let the peace of God rule in your hearts. There's all kinds of things that are going to try to take place of that peace of God. The turmoil, the trouble, the tribulation, the difficulties, but he says that we're to let the peace of God rule in our hearts. That we understand that Jesus, as he's instructing these disciples and he tells them these important truths, he says, listen, not only is there something to embrace, not only am I speaking these things to you, but there's something to expect. And number one, you have to understand that in me, you might have peace. In me, in the Lord Jesus Christ. But notice what he says in John 16. He says, in me, you might have peace, but he follows it up and says this, in the world, you shall have tribulation. We know a little bit about that, don't we? He says, in me, what a great contrast. In me, you might have peace. In the world, you shall have tribulation. We have a world full of tribulation, trouble, trial. The disciples were going to face tribulation. The disciples were gonna face persecution.",
      "context": "...stand that in me, you might have peace. In me, in the Lord Jesus Christ. But notice what he says in John 16. He says, in me, you might have peace, but he follows it up and says this, in the world, you shall ...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1343",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1425.0000305175781,
      "text": "a little bit about that, don't we? He says, in me, what a great contrast. In me, you might have peace. In the world, you shall have tribulation. We have a world full of tribulation, trouble, trial. The disciples were going to face tribulation. The disciples were gonna face persecution. They were gonna deal with difficulties and adversity. And Jesus lets them know that even though in the world they're gonna have tribulation, that in him, they can have peace. This is a great truth that is given to us in John 16 in verse number 33, that yes, we understand that in that world, there's going to be tribulation and we see it, we experience it, we understand this morning the way that the world operates. But I understand this morning that though all of the enemy is raging and all the wickedness that is taking place and all the tribulation that is around me, that we can still have peace. Why? Because Jesus said, in me, you might have peace. He said in Hebrews 13, I will never leave thee nor forsake thee. We find that in Acts chapter 12, it's an interesting passage of scripture in which God provides for us an account of what's taking place with the persecution and Herod and all that he's doing and killing James and intending to kill Peter and putting him in prison and the church is praying and all that is taking place.",
      "context": "...na have tribulation, that in him, they can have peace. This is a great truth that is given to us in John 16 in verse number 33, that yes, we understand that in that world, there's going to be tribulation and...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1425",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1938.300048828125,
      "text": "given to us. We need to embrace them because in Him, we have peace. We know these things. Listen, Jesus has revealed to us just as He did to His disciples here in this portion of Scripture, in these pages of Scripture, He revealed to them the things that were going to happen, and He's preparing them, and He's given to us truth that as we embrace it, that we can expect, look, there's going to be tribulation, but He said in Him there's peace. And what joy that is to every child of God. I find in John 16 and verse 33, there's something to embrace, there's something to expect, but I find there's someone to exalt. In John 16 and verse 33, there's someone to exalt. He says, in the world you shall have tribulation, but be of good cheer. Why? I have overcome the world. Isn't that exciting? Listen, there's someone to exalt. We serve the King of kings and Lord of lords. We understand this morning that because of who He is, because of the fact that He says I have overcome the world, because of His victory, that we can be of good cheer, that we do not need to walk through this life, we don't have to say, woe is me, and dragging our lip on the ground and saying I'm so overwhelmed and I have all these problems and all these difficulties. No, Jesus said you're going to have persecution.",
      "context": "...ribulation, but He said in Him there's peace. And what joy that is to every child of God. I find in John 16 and verse 33, there's something to embrace, there's something to expect, but I find there's someone...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1938",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}