{
  "reference": "John 13",
  "occurrences": [
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 599.97998046875,
      "text": "we find as we look at this truth of be patient toward all men that it's we're not going to be patient Toward all men in our own power own strength and your flesh and in my flesh We must be filled with the Spirit of God. We must walk in the Spirit. We find that the Bible tells us, we begin to understand here where it says, love, joy, peace, long-suffering, and we think about the truth of charity or love. You know what the Bible says in 1 Corinthians 13 about love or charity? It says this, charity suffereth long. You know what that word is? It's the same word that's translated long-suffering. Same word. Charity in 1 Corinthians 13 and verse number 4 is described this way, it suffereth long. You know we're instructed to love one another. John 13 records it this way, if you would turn there in John 13. The Bible says this, Jesus of course as we know is going to provide this command after he'd washed the feet of the disciples and then of course he's explaining to them about his soon going to the cross of Calvary and all the things that are going to take place and he says this in verse number 34 of John chapter 13, he says a new commandment I give unto you. What is this? That you love one another as I have",
      "context": "...e number 4 is described this way, it suffereth long. You know we're instructed to love one another. John 13 records it this way, if you would turn there in John 13. The Bible says this, Jesus of course as we...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=599",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1809.5799369812012,
      "text": "love. Unto love. 1 Corinthians 13 deals with the subject matter of charity, and how important that subject matter is. matter is we understand the Lord Jesus Christ in John chapter 13 before he gave that great promise that we so often refer to in the first several verses of chapter 14 but after he'd washed the disciples feet and we find that he comes and he's speaking to them and at the end of chapter number 13 he says this beginning in verse number 31 of John 13 therefore when he was gone out Jesus said now is the Son of Man glorified and God is glorified in him verse 32 if God be glorified in him God shall also glorify him in himself and shall straightway glorify him little children yet a little while I am with you you shall seek me and as I said unto the Jews whither I go you cannot come to come so now I say to you notice this in verse 34 and 35 a new commandment I give unto you that you love one another as I have loved you that you also love one another by this by what our loved one for another by this shall all men know that you're my disciples if you have love one to another what a great subject matter and what a great truth it's not so much that we're to love our",
      "context": "...s speaking to them and at the end of chapter number 13 he says this beginning in verse number 31 of John 13 therefore when he was gone out Jesus said now is the Son of Man glorified and God is glorified in h...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1809",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 166.55999755859375,
      "text": "entry of the Lord Jesus Christ, over the next few days, we find that several things occur. We find that in John chapter 13, God provides us with the record of Jesus washing the feet of the disciples. And of course, there's a great truth in that passage of scripture that we can understand the truth of being a servant, the humility and what joy that is, the great lesson that we learn of Peter and his objection and the instruction that's given. But after that portion of scripture in John 13, we find that Jesus to conclude the 13th chapter, chapter 14, 15 and 16, we find that in these pages of God's word that Jesus is spending these times, this period of time alone with his disciples. And as he's there alone with his disciples, we find that it is in this intimate setting that Jesus is preparing his disciples for that which will transpire in the days ahead. Not only immediately, but we find that even in their life and ministry and for us today, the truth of preparation is still found within these words that Jesus spoke. We find that really John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a concluding verse. It closes out all that Jesus taught his disciples, all of the instruction, all that he had communicated to them during that special time.",
      "context": "...of Peter and his objection and the instruction that's given. But after that portion of scripture in John 13, we find that Jesus to conclude the 13th chapter, chapter 14, 15 and 16, we find that in these page...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=166",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1130.7400512695312,
      "text": "different about us and the psalmist, and we understand some of the inspirational Holy Spirit of God, but for far too many of us, we fail in this area of transparency. And even being transparent with the Lord, there are times in which we deal with difficulties in our lives. We might not be very transparent about what's going on, but we see the psalmist in this time of trouble, and he's going through, and he's asking these questions, and he's just struggling with what's going on, but then notice in verse number 10, I'm thankful he doesn't continue down that path that says, and I said, this is my infirmity, but I will remember the years of the right hand of the Most High. I will remember the works of the Lord. Surely, I will remember thy wonders of old. I will meditate also of all thy work and talk of all thy doings. Thy way, O God, is in the sanctuary. Who is so great a God as our God? Thou art the God that doest wonders. Thou hast declared thy strength among the people. I mentioned last Sunday as we talked about God's love, and in John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that cycle that I talked about last Sunday morning with regard to reminding ourselves that God loves us, and then resting in His love, and then rejoicing for His love.",
      "context": "...clared thy strength among the people. I mentioned last Sunday as we talked about God's love, and in John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1130",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1198.0400390625,
      "text": "John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that cycle that I talked about last Sunday morning with regard to reminding ourselves that God loves us, and then resting in His love, and then rejoicing for His love. I'm so thankful that as we go through that process. that I said that we need to remind ourselves of God's love for us. Why? Because there are times in which the accuser, the brethren, would like to whisper to you and whisper to me that God has forgotten us and God's not loving us and God's mercies are dried up, as the psalmist says here in Psalm 77. But no, we remind ourselves that no, God does love me. No, God is merciful. And we find that here in this passage of scripture in Numbers 14 that Moses has recalled what God has previously revealed. It's so important for us to be students of God's word. You cannot recall what you do not know. You just can't. We understand we speak about God's word and we talk about revelation, all scripture is given by inspiration of God, and we understand that God was speaking through His men. Holy men of God spake as they were moved by the Holy Ghost. But you understand that the canon of scripture is closed. God's given us this book and He's told us to be students of this book.",
      "context": "John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1198",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}