{
  "reference": "John 8",
  "occurrences": [
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1059.239990234375,
      "text": "the devil sinneth from the beginning. You'll remember that Jesus said this during His earthly ministry as He's ministering there, and He mentions about those that, of course, the religious leaders of the day, and He speaks to them about their father, the devil. And He speaks this in John 8 and verse number 44, the year of your father, the devil, and the lust of your father you will do. He was a murderer from the beginning and a boat not in the truth. Why? Because there is no truth in Him. When He speaketh a lie, He speaketh of His own, for He is a liar and the father of it in John 8 and verse 44. So we see that John, He makes the statement, He speaks of sin, but I want you to notice very quickly that not only He doesn't stay there. He then speaks, number two, of our Savior. We have a wonderful Savior. And we consider this morning as we look at the text of Scripture what was accomplished on that cruel cross, what was accomplished at Calvary because of sin. We understand that it was sin that sent our Savior there, but we notice as we look at this text of Scripture that John quickly moves on and He begins to speak of our Savior, and we find in verse number five He reveals to us as He's speaking of our Savior that He was manifest, that He came",
      "context": "...ious leaders of the day, and He speaks to them about their father, the devil. And He speaks this in John 8 and verse number 44, the year of your father, the devil, and the lust of your father you will do. H...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1059",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1937.260009765625,
      "text": "inheritance obtained a more excellent name than they. And here as we come to the end of verse number 2 of Hebrews 12, it says, and has sat down at the right hand of the throne of God. I'm so thankful that one day He's going to come again. Amen? I mean, the Bible tells us that the trumpet of the Lord shall sound, and we understand that as we sing songs about the return of Christ, we understand that right now He's seated at the right hand of the throne of God, but one day, He's going to come back. I'm so thankful for that truth of the word of God. We find the example that is given to us, let me say this, as we've mentioned already that throughout His earthly ministry, the earthly ministry of the Lord Jesus Christ, that He was focused on His purpose. You understand in John 8 and verse number 29, He says this, I do always those things that please Him. We mentioned already from John 17 and verses 15 through 17 about the fact that we're in the world but not of the world, but we find that Jesus, as He's praying, as He begins that prayer, He says, Father, the hour has come, glorify Thy Son that Thy Son also may glorify Thee, and just a few more verses as we really think about the transition to",
      "context": "...he earthly ministry of the Lord Jesus Christ, that He was focused on His purpose. You understand in John 8 and verse number 29, He says this, I do always those things that please Him. We mentioned already f...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1937",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 1671.3400268554688,
      "text": "to another. Lie not one to another. We know what it is to lie. Children know what it is to lie. There's some children down in the nursery that yet can't do a whole lot of things, but they know how to lie. Right? It's part of the old man. The devil is a liar and the father of it. John 8, verse 44. The ninth commandment, bear ye not false witness. Right? Stop lying. You know what's interesting about lying? For some reason in our culture today, in our society today, there's not really been a premium set on truth. And lying is just something that has just become so common in our society. You know the reality is that there are times in which you're hearing something, you're listening to something, and as you're listening and hearing it, you expect that you're being lied to. You know you're being lied to. Right? We hear it all the time. Brother Mark hears it, I'm sure. He doesn't pull as many people over as he used to, but I'm sure. You know, how many of you ever got pulled over and the police officer said, do you know why I pulled you over? You say, I have no idea. But you knew exactly why you got pulled over. Right? I remember somebody saying this when they got pulled over and they were asked, do you know why I pulled you over? And they said, well,",
      "context": "...ut they know how to lie. Right? It's part of the old man. The devil is a liar and the father of it. John 8, verse 44. The ninth commandment, bear ye not false witness. Right? Stop lying. You know what's int...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=1671",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}