{
  "reference": "John 19",
  "occurrences": [
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2063.4400024414062,
      "text": "focused during the race. This morning, if I could submit to you that number three, we need to finish the race. We need to finish the race. You know, how you finish matters. Unfortunately, there are those that you can read of that started well that did not finish well. I hope that we would have the prayer that the Apostle Paul had as he spoke to the Ephesian elders in Acts chapter number 20, and he said this to them, he said that I might finish my course with joy. Look at a few things about the Apostle Paul at the end of the message this morning. When we begin to think about the call that's been given to us of running the race and we find that we need to be fit for the race, we need to be focused for the race, we need to finish the race. Jesus finished, as we mentioned already in John 17 and verse number four. He said, I've glorified thee, I finished. We find that in John 19 and verse number 30, he cried out on the cross of Calvary before he gave up the ghost. He said, it is finished. Notice as we look at the text of Scripture in Hebrews chapter number 12, notice verse number three. The Bible says for consider him. The word consider is an interesting word. It means to think over, to ponder, to muse upon, and we begin to think if there were",
      "context": "...already in John 17 and verse number four. He said, I've glorified thee, I finished. We find that in John 19 and verse number 30, he cried out on the cross of Calvary before he gave up the ghost. He said, it ...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2063",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1913.5799560546875,
      "text": "being eternal, He knew that He was going to finish this work and He says I have finished the work. I have finished. Aren't you thankful that He finished? He didn't just live a sinless life and just heal a bunch of people and perform miracles and then just say, well, I'm not going to do that part. No, if you look back in Hebrews 12 for the joy that was set before Him He endured the cross, despising the shame. Why? Because He understood that was the purpose. It was for Me that He died on that cross. We find that it's in John 19 in verse 30 that Jesus lifts up His head and as it says, it is finished. And He bowed His head and gave up the ghost. We've been told in John 10 that He's the Good Shepherd and that the Good Shepherd lays down His life for the sheep. And Jesus did just that. And just before He bowed His head and gave up the ghost, He said, it is finished. This morning, we have great examples. There's a cloud of witnesses. Archipus is receiving this charge, but we make application for us this morning. We see it. There's a cloud of witnesses. There are many people that we could look to and we could say, they finished their course. They fulfilled their ministry. They did what God called them to do. But I want you to understand that in Hebrews 12,",
      "context": "... He understood that was the purpose. It was for Me that He died on that cross. We find that it's in John 19 in verse 30 that Jesus lifts up His head and as it says, it is finished. And He bowed His head and ...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1913",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}