{
  "reference": "John 18",
  "occurrences": [
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2465.4399795532227,
      "text": "by stones, amen? So therefore He had to escape in this manner. By the way, that happened on more than one occasion. Notice in John chapter number 10. It's interesting, this is the same passage in which they said, tell us plainly, and He said, I told you and you believe not. I read the entirety of the passage at the end of verse number, at the end there at verse number 30, He says, I and My Father are one. That's a pretty simple claim, is it not? Jesus said, I and My Father are one. Notice the response again in verse 31, then the Jews took up stones again to stone Him. At this time Jesus said unto them, many good works have I showed you from My Father, for which of these works do you stone Me? Notice what they said. The Jews answered Him saying, for a good work we stone thee not, but for blasphemy, and because that thou, being a man, makest thyself God. That's pretty plain, is it not? Jesus said, I and My Father are one. John 18, John 18, this is in the garden, the arrest in the garden. In John chapter number 18, Judas knew the place, according to verse number 2, he knew the place, why? For Jesus oft times resorted thither with His disciples. Notice in verse number 4, Jesus therefore knowing all things that should come",
      "context": "...ing a man, makest thyself God. That's pretty plain, is it not? Jesus said, I and My Father are one. John 18, John 18, this is in the garden, the arrest in the garden. In John chapter number 18, Judas knew th...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2465",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2596.959976196289,
      "text": "choppy, if I could use that terminology. And so they used, in order to distinguish the words that were not going to be found in the Hebrew or the Greek or the Aramaic, they used italicized words. Now, they didn't do that in 1611 because of the bold and so on and so forth, but it was very distinct as to the typeset that they used, and then eventually in our Bibles today, you'll see the italicized words. Why do I make that clear to you? Because notice what happens in verse number 5. When they, He said, Whom seek ye? In verse number 4, and they say, Jesus of Nazareth. Notice His response. If you take out the italicized, what does He say? I am. I am. What did God say to Moses? Moses says, Who should I tell whom sent me? And God said, I am that I am. Right? Now, what happens when Jesus says, these people come into the garden to arrest Him, and Jesus says, I am. And notice what it says. As soon as they, in verse 6, and as soon then as He had said unto them, I am, they went backward and fell to the ground. In Mark chapter number 14, chronologically it's next after John 18, the arrest in the garden, in Mark 14, Jesus is standing before the high priest Caiaphas. And as He's standing there before the high priest, He's being questioned,",
      "context": "...ey went backward and fell to the ground. In Mark chapter number 14, chronologically it's next after John 18, the arrest in the garden, in Mark 14, Jesus is standing before the high priest Caiaphas. And as He...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2596",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2676.519989013672,
      "text": "them, I am, they went backward and fell to the ground. In Mark chapter number 14, chronologically it's next after John 18, the arrest in the garden, in Mark 14, Jesus is standing before the high priest Caiaphas. And as He's standing there before the high priest, He's being questioned, and in verse number 61 of Mark 14, it says this. Mark 14 and verse 61, speaking of Jesus that He held His peace and answered nothing, again the high priest asked Him and said unto Him, Art thou the Christ, the Son of the Blessed? That's a pretty straight question. Jesus said, I am. I am. And ye shall see the Son of Man, that title that was referenced, sitting on the right hand of power and coming in the clouds of heaven. Can you imagine? And notice the response. Then the high priest rent his clothes and saith, What need we any further witnesses? Ye have heard the blasphemy. What think ye? And they all condemned Him to be guilty of death. And some began to spit on Him and to cover His face and to buffet Him and to say unto Him, Prophesy. And the servants did strike Him with the palms of their hands. Can I tell you from verse number 65 that Jesus knew the exact names of the people that hit Him when they did? And wouldn't it have been something if Jesus started calling out their",
      "context": "...ey went backward and fell to the ground. In Mark chapter number 14, chronologically it's next after John 18, the arrest in the garden, in Mark 14, Jesus is standing before the high priest Caiaphas. And as He...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2676",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}