{
  "reference": "Joshua 7",
  "occurrences": [
    {
      "sermon_id": "5gWVxtcarvc",
      "timestamp": 1748.4600219726562,
      "text": "I say when Israel turneth their backs before their enemies? For the Canaanites and all the inhabitants of the land shall hear of it and shall environ us, surround us, and cut off our name from the earth. And what wilt thou do unto thy great name? And the Lord said unto Joshua, Get thee up. Wherefore liest thou thus upon thy face? Israel hath sinned. And this is where God is exposing to Joshua, the leader, the sin. And notice what he says, They have also transgressed my covenant, which I commanded them, for they have even taken of the accursed thing and have also stolen and dissembled also, and they have put it even among their own stuff. Therefore, verse number 12, therefore, this is the consequence. Therefore, the children of Israel could not stand before their enemies. At Ai, 36 men lost their lives a few verses earlier. And he said they could not stand against their enemies. Why? Because they were accursed. And then notice what God says at the end of verse number 12. Neither will I be with you anymore. Lord, except ye destroy the accursed from among you.\" That truth of Joshua 7 and verse number 12 is powerful, and it ought to be impactful. God says, I'm exposing this sin, and you better deal with it. And if you don't, I'm not going to be with you anymore. So what do they do? Joshua takes heed. Does he not?",
      "context": "...her will I be with you anymore. Lord, except ye destroy the accursed from among you.\" That truth of Joshua 7 and verse number 12 is powerful, and it ought to be impactful. God says, I'm exposing this sin, and...",
      "sermon_title": "\"Unto The Church In Sardis\" - Revelation 3:1-6",
      "url": "https://www.youtube.com/watch?v=5gWVxtcarvc&t=1748",
      "channel": "Unknown",
      "publish_date": 20250217
    },
    {
      "sermon_id": "5gWVxtcarvc",
      "timestamp": 1833.3000679016113,
      "text": "of Joshua 7 and verse number 12 is powerful, and it ought to be impactful. God says, I'm exposing this sin, and you better deal with it. And if you don't, I'm not going to be with you anymore. So what do they do? Joshua takes heed. Does he not? Joshua recognizes the importance of what God reveals, and Joshua says, we're going to deal with this thing, and all the people come together, and they come by tribe and by family, and we find that eventually Achan is found out, and Achan is destroyed. You say, well, that's harsh. That's what God commanded. And then they had victory. Then they had victory. We find in Revelation chapter 3 that God exposes to this church their true condition. We'll look in a few weeks at the church of the Laodiceans, as it's called in chapter 3 and verse 14, the church of the people, and we'll read how they say what they think they are, but then God says what they really are. Here for the church in Sardis, God says, here's your real condition, and here's the counsel. Here's your repent. He exposed it, and he expected that there would be a response. We find the condition, the counsel, note the consequences, often we think about consequences, we think about them strictly in a negative sense, but I want to look at it both from",
      "context": "of Joshua 7 and verse number 12 is powerful, and it ought to be impactful. God says, I'm exposing this sin, and...",
      "sermon_title": "\"Unto The Church In Sardis\" - Revelation 3:1-6",
      "url": "https://www.youtube.com/watch?v=5gWVxtcarvc&t=1833",
      "channel": "Unknown",
      "publish_date": 20250217
    },
    {
      "sermon_id": "giwhcbMIrNo",
      "timestamp": 2483.759925842285,
      "text": "experienced some victory. You know what happens in your life when you experience victory? All of a sudden you think, I can be victorious. And I forget the fact that it was God who made me victorious. I forget the source. And I violate the strategy. And I suffer defeat. If you look through the Scripture, some of the most difficult days for God's people were on the heels of victory. On the heels of victory. Why is that so? Because it's when we become most self-dependent. Look at what we were able to see done. I mean, look at this. This is awesome. And we start thinking, we did this. And then we enter the next one and we find out real fast. Defeat. See Joshua 7 is an important reminder for us. Judges chapter 7, the life of Gideon, we're familiar with again, two passages that we're familiar with. I just want to remind you of what the Lord says to Gideon in Judges chapter number 7. In verse number 2, the Bible says, and the Lord said unto Gideon, the people that are with thee are too many for me to give the Midianites into their hands. Why? Why was it too many? Lest Israel vaunt themselves against me, saying, Mine own hand hath saved me. You know what a danger is for us? We think we did it. Forget the source.",
      "context": "... start thinking, we did this. And then we enter the next one and we find out real fast. Defeat. See Joshua 7 is an important reminder for us. Judges chapter 7, the life of Gideon, we're familiar with again, t...",
      "sermon_title": "\"Victory In Jesus\"  II Corinthians 2:12-17",
      "url": "https://www.youtube.com/watch?v=giwhcbMIrNo&t=2483",
      "channel": "Unknown",
      "publish_date": 20250203
    },
    {
      "sermon_id": "9KxM021cU1c",
      "timestamp": 2246.4599609375,
      "text": "send everybody. Just let a small contingency go and we'll be able to handle it. But what happened? They got defeated. 36 men lost their lives at Ai. You read it in Joshua chapter 7. 36 people lost their lives. Joshua's beside himself. I mean, Joshua's prostrating on the ground, crying out to the Lord, what's going on? And he says, get up. There's sin in the camp. There's sin in the camp. You know what he says? You've got to deal with it. And I'm going to tell you, Joshua chapter 7 has strong language. Here's what God says. I'm going to just summarize it. We don't have time to run over there. But you go back and you read Joshua 7. Here's what God says in summary. If you don't deal with the sin in the camp, I'm not going to be with you anymore That's how serious God is about it. Our God is a holy God. Our God is a holy God. And we find here that this church of Ephesus, that they're being commended for their labor, for their service, for their work. And they're also being commended for the fact that they're separated and they're doctrinally sound. He says, thou canst not bear them which are evil. Notice as it continues in verse number 2. Thou hast tried them which say they are apostles and are not, and hast found them liars. You know, there's some people today",
      "context": "... I'm going to just summarize it. We don't have time to run over there. But you go back and you read Joshua 7. Here's what God says in summary. If you don't deal with the sin in the camp, I'm not going to be w...",
      "sermon_title": "\"To The Church Of Ephesus - Part 1\" Revelation 2:1-7",
      "url": "https://www.youtube.com/watch?v=9KxM021cU1c&t=2246",
      "channel": "Unknown",
      "publish_date": 20241111
    }
  ]
}