{
  "reference": "Judges 6",
  "occurrences": [
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 2400.3800048828125,
      "text": "verse number 25, there was so much spoil that they couldn't carry it away. There weren't enough of them to carry away the spoil. Furthermore, it took them three days. It says that, and they were three days in gathering of the spoil, it was so much. Sometimes God will bring you to a dilemma, a difficulty. that's just absolutely 100% beyond anything you could even imagine doing. Why? Because that's when God gets the glory. That's when God gets the glory. We understand that in the life of Gideon. We speak about it often. God says to Gideon, nope, if I give you the victory with that many people, you guys are gonna say you got the victory. So I need to bring it down. Just tell them if they don't want to fight, go home. And a bunch of them went home. You understand they were already outnumbered before the army was decreased in size. Vastly outnumbered. God says if they don't, if they want to go home, they don't want to fight, let them go home. Why'd all those rascals go home? Because they knew they were outnumbered. We're going home. And then God said it's still too many. Here's what I want you to do. And we know the account. We know what, Judges 6 through 8, read the chapters. And you can see all that God does. But what God is doing is saying,",
      "context": "... God said it's still too many. Here's what I want you to do. And we know the account. We know what, Judges 6 through 8, read the chapters. And you can see all that God does. But what God is doing is saying,",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=2400",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 2464.4600257873535,
      "text": "were outnumbered. We're going home. And then God said it's still too many. Here's what I want you to do. And we know the account. We know what, Judges 6 through 8, read the chapters. And you can see all that God does. But what God is doing is saying, listen, God works in these moments of impossibility so that he would be glorified. So that it's not explained as, well, that was the the wisdom and might of the King Jehoshaphat. He set this great plan in order, and he did this, and he did that, and let's lift up King Jehoshaphat. No, no, no. King Jehoshaphat said to the people, I don't know what to do. He said that to God. But the people were there. Oh, but the leader, the king, is supposed to make it make it so everybody thinks he knows what he's gonna do. Sometimes the leader doesn't know what he's gonna do. And a good leader depends upon God. Because you understand that even though someone's a leader, it doesn't make them have infinite knowledge as God does. We're still human beings. And we find here that Jehoshaphat, he's not gonna receive any glory for this victory. The people of Judah aren't gonna have any any kind of glory for this victory. They didn't do anything. Nothing. They just simply went and collected the spoils. When they arrived, they were all dead. God had worked on their behalf. Notice with me,",
      "context": "... God said it's still too many. Here's what I want you to do. And we know the account. We know what, Judges 6 through 8, read the chapters. And you can see all that God does. But what God is doing is saying, l...",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=2464",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}