{
  "reference": "Judges 18",
  "occurrences": [
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 1244.640007019043,
      "text": "Dan where it says in verse 17, Dan shall be a serpent by the way, but notice what it says, an adder in the path that biteth the horse heels so that his rider shall fall backward. Now that doesn't sound very positive, does it? And we think about a serpent and we think about an adder and we see that it says here that it biteth the horse heels, but this is so that his rider shall fall backward. When we think about Dan, it's interesting because Dan as a tribe, if you will, they were the ones that introduced idol worship to the nation. Turn over, if you will, to Judges 18. In Judges chapter 18, in truth, we could read the entirety of the chapter this evening and see all that takes place and how Dan unfortunately introduced the idol worship to the nation. We will not have time to read all of it this evening. You're familiar with the fact that throughout the book of Judges, the Bible says that there was no king in Israel and the people, well, they did that which was right in their own eyes or their own sight. But I want you to notice down, if you will, in Judges 18 in verse number 30, the Bible says, and the children of Dan set up the graven image. And Jonathan, the son of Gershom, the son of Manasseh, he and his sons were",
      "context": "...you will, they were the ones that introduced idol worship to the nation. Turn over, if you will, to Judges 18. In Judges chapter 18, in truth, we could read the entirety of the chapter this evening and see all...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=1244",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 1309.360008239746,
      "text": "eyes or their own sight. But I want you to notice down, if you will, in Judges 18 in verse number 30, the Bible says, and the children of Dan set up the graven image. And Jonathan, the son of Gershom, the son of Manasseh, he and his sons were priests to the tribe of Dan until the day of the captivity of the land. And they set them up Micah's graven image, which he made all the time that the house of God was in Shiloh. When I think about the phrase there in verse 17, when Jacob says, a serpent, by the way, an adder in the path, and he talks about biting the horse heels and the rider falling backward, I think about the responsibility of Dan as a tribe, introducing idol worship into the nation of Israel and the adverse impact that it had on the nation. If you were to think about Israel as a nation, no doubt, as you have studied the Old Testament, you would find that over and over again, not only Israel, but Judah as well, they were guilty regularly of idolatry, idol worship. We find it here in Judges 18, but I want you to also look over, if you will, at 1 Kings 12. In 1 Kings 12, we begin to read of an important time in Israel's history. We find that Israel up to this point in 1 Kings 12, they've had three kings, Saul, David, and Solomon.",
      "context": "eyes or their own sight. But I want you to notice down, if you will, in Judges 18 in verse number 30, the Bible says, and the children of Dan set up the graven image. And Jonathan, ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=1309",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 1847.3600311279297,
      "text": "had made in Bethel the fifteenth day of the eighth month, even in the month which he had devised of his own heart, and ordained a feast unto the children of Israel. And he offered upon the altar, and burnt incense.\" Tragic. Tragic. We begin to think about what happens here and we see the two places, one in Bethel, one in Dan. I stood in the place where the altar was set up in Dan. They have excavated it, they know where it is, and literally a couple of years ago when we were in Israel, we stood there. We stood in that place. It's just sad. But I think about what happened back in the history as we read in Judges 18, where it's Dan that introduced that idol worship and they were given to idolatry. So now when Jeroboam is going to set up these two idols, it just simply makes sense that one of them will be in Dan. They're already okay with idol worship. We find that as the scriptures tell us there in Genesis chapter 49 with regard to Dan and with regard specifically to the serpent and the adder, \"...and biteth the horse heel so that his rider shall fall backward.\" Isn't that a sad situation, a sad commentary when you read what we just read in 1 Kings chapter 12 and how they would set up a place and they would make offerings and",
      "context": "...ood in that place. It's just sad. But I think about what happened back in the history as we read in Judges 18, where it's Dan that introduced that idol worship and they were given to idolatry. So now when Jero...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=1847",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}