{
  "reference": "Judges 1",
  "occurrences": [
    {
      "sermon_id": "4vUlrsA0Z_s",
      "timestamp": 1461.1199951171875,
      "text": "lot for the inheritance of the children of Joseph, Ephraim, specifically dealing with the tribe of Ephraim, the Ephraimites. It says this in verse number 10, and they drave not out the Canaanites that dwelt in Gezer. Notice, but the Canaanites dwell among the Ephraimites unto this day, and what does it say? And serve under tribute. And serve under tribute. What did he say? A servant of servants. Chapter 17, notice in verse number 12, the Bible says here, speaking of the half-tribe of Manasseh, yet the children of Manasseh could not drive out the inhabitants of those cities, but the Canaanites would dwell in that land. Yet it came to pass when the children of Israel were waxen strong that they put the Canaanites to tribute, but did not utterly drive them out. We find that the descendants of Ham, specifically being the father of Canaan and dealing with this prophecy, he says, cursed be Canaan a servant of servants shall he be unto his brethren, and we see exactly that coming to pass in the book of Joshua. In fact, if you turn to the book of Judges in the first chapter, notice what God records for us here. Again, recording some of what we just read in Joshua 16 and 17, notice how the writer notes it here in Judges 1. Judges chapter number 1, beginning in verse number 27, it says, neither did Manasseh",
      "context": "...in, recording some of what we just read in Joshua 16 and 17, notice how the writer notes it here in Judges 1. Judges chapter number 1, beginning in verse number 27, it says, neither did Manasseh",
      "sermon_title": "Sermon 4vUlrsA0Z_s",
      "url": "https://www.youtube.com/watch?v=4vUlrsA0Z_s&t=1461",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "4vUlrsA0Z_s",
      "timestamp": 1536.4400024414062,
      "text": "of Judges in the first chapter, notice what God records for us here. Again, recording some of what we just read in Joshua 16 and 17, notice how the writer notes it here in Judges 1. Judges chapter number 1, beginning in verse number 27, it says, neither did Manasseh drive out the inhabitants of Bethshean and her towns, nor Panach and her towns, nor the inhabitants of Dor and her towns, nor the inhabitants of Iblim and her towns, nor the inhabitants of Megiddo and her towns, but the Canaanites would dwell in that land. Verse 28, and it came to pass when Israel was strong that they put the Canaanites to tribute, but did not, and did not, excuse me, utterly drive them out. Neither did Ephraim drive out the Canaanites that dwelt in Gizir, but the Canaanites dwelt in Gizir among them. Neither did Zebulun drive out the inhabitants of Kitron, nor the inhabitants of Nahalal, but the Canaanites dwell among them and became tributaries. Neither did Asher drive out the inhabitants of Akot, nor the inhabitants of Zidon, nor of Elab, nor of Exib, nor of Helba, nor of Aphic, nor of Reho, but the Asherites dwelt among the Canaanites, the inhabitants of the land, for they did not drive them out. Neither did Naphtali drive out the inhabitants of Beth Shemesh, nor the inhabitants of Beth Anath, but it says he dwelt among the Canaanites, the inhabitants of the",
      "context": "...in, recording some of what we just read in Joshua 16 and 17, notice how the writer notes it here in Judges 1. Judges chapter number 1, beginning in verse number 27, it says, neither did Manasseh drive out the...",
      "sermon_title": "Sermon 4vUlrsA0Z_s",
      "url": "https://www.youtube.com/watch?v=4vUlrsA0Z_s&t=1536",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}