{
  "reference": "Luke 1",
  "occurrences": [
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 1008.9800109863281,
      "text": "needs to be a clear sound from our lives individually and from our church corporately that our God is great and that we are seeking to magnify, to exalt Him in all that we say and do. Notice the resolve of the psalmist. We notice also the resolve of Mary. Turn to the book of Luke, if you will. In the first chapter of the book of Luke, I want you to notice, we will not take time to read the entirety of what Mary says in verses 46 down through verse number 56. I want you to see beginning in verse number 46 what Mary says. In Luke 1 in verse number 46, Mary said, my soul doth magnify the Lord and my spirit hath rejoiced in God my Savior. Notice what she says in verse number 49. For He that is mighty hath done to me great things and holy is His name. Wow. See, she said in verse number 48 that He hath regarded the lowest state of His handmaiden, but He that is mighty hath done to me great things and holy is His name. You know our God is holy. And you know He is great. And He has done for us great things. And we ought to say, as Mary said in Luke 1 in verse 46, my soul doth magnify the Lord. Amen. Mary didn't, this was not her doing in carrying the Lord Jesus Christ.",
      "context": "... 46 down through verse number 56. I want you to see beginning in verse number 46 what Mary says. In Luke 1 in verse number 46, Mary said, my soul doth magnify the Lord and my spirit hath rejoiced in God my ...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=1008",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 1104.2400207519531,
      "text": "is holy. And you know He is great. And He has done for us great things. And we ought to say, as Mary said in Luke 1 in verse 46, my soul doth magnify the Lord. Amen. Mary didn't, this was not her doing in carrying the Lord Jesus Christ. The one that she would carry, God's Son, we find that it was, she's with child of the Holy Ghost. Amen. And she understands how that He that is mighty hath done great things. He hath beheld and regarded the lowest state of His handmaiden. And I'm gonna magnify the Lord. Wow. He's done great things for us. Notice what John the Baptist says. We do not see necessarily the word magnify, but in John chapter number three, we're familiar with the verse of Scripture. And it's very interesting because if you would take time to look at what's happening in the Gospel of John, and of course in the first chapter, you find that John the Baptist is there on the scene. Of course, it begins by speaking about the deity of the Lord Jesus Christ. And you begin to read about John the Baptist and the record and the following that John the Baptist had. But then you find that as John is there and he says, as he sees the Lord Jesus Christ, behold the Lamb of God, which taketh away the sin of the world. And you go through, you begin to see how that Jesus",
      "context": "...And you know He is great. And He has done for us great things. And we ought to say, as Mary said in Luke 1 in verse 46, my soul doth magnify the Lord. Amen. Mary didn't, this was not her doing in carrying t...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=1104",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}