{
  "reference": "Luke 10",
  "occurrences": [
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1308.2799987792969,
      "text": "away. Amen? See, we've got to keep that eternal perspective. Sometimes in the midst of the trial, we have that temporal perspective, and we're so focused on the season that we're not focused on the eternal, on the fadeth not away. And here, these believers that are facing this great persecution and all this difficulty, these trials that they're going through, Peter says to them, listen, if you're going to rejoice and if you're going to greatly rejoice through these trials, I believe that one of the truths that he shares here that will enable these believers, that will enable you and I this morning to rejoice through trials, is that we must remember our position in Christ. I'm a child of the King. Remember what Jesus said in Luke chapter number 10? These fellows come back and they're rejoicing because the spirits are in subject to them, and they're coming back and they're rejoicing over these things. And we find that in Luke chapter number 10 and verse 17, the Bible says that the 70 returned, they returned with joy. And they're talking about what happened and what transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoice not that the spirits are subject unto you, but rather rejoice because your names are written in heaven. We sing",
      "context": "...alking about what happened and what transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoic...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1308",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1375.6399993896484,
      "text": "transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoice not that the spirits are subject unto you, but rather rejoice because your names are written in heaven. We sing that song, there's a new name written down in glory. And it's mine. Oh yes, it's mine. And we sing that song and it reminds us of the day that we trusted the Lord Jesus Christ as our personal Savior. And Jesus says to these 70 that returned, they came back with joy. And Jesus says, listen, don't rejoice because the spirits are made subject to you. Rather rejoice because your names are written in heaven. I'm so thankful that on, for me, August 31st, 1997, my name was written down in that book. I was born again. I was saved by the grace of God. And my position in Christ allows me to rejoice through the trials. Number two, we can rejoice through trials because of God's great power. I'm thankful for my position in Christ and I'm thankful that I serve the omnipotent God. I think about the power of God here in verse number five, continuing really with the thought of our position in Christ and the inheritance that we have. He says, who are kept by the power of God through faith unto salvation, ready to be revealed in the last time. This morning",
      "context": "transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoic...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1375",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}