{
  "reference": "Luke 11",
  "occurrences": [
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 204.5399932861328,
      "text": "soul and how important it is that we would forgive one another that we would love one another and That we would not allow bitterness to grab root in our hearts in our lives We understand that not only would we be mindful of these things that I've mentioned briefly But it would also cause us to develop an attitude of reverence and submission When we go to God in prayer and we follow the framework that is provided for us here and we use this model It will help us to have That attitude of reverence and that attitude of submission and I believe those are necessary Attitudes when we go to God in prayer we find that as we would conclude this evening this particular Model prayer and look at the last phrase of verse number four We would note this evening that really it finishes with a twofold request that of direction and deliverance notice Verse number four of Luke 11. The Bible says and forgive us our sins For we also forgive everyone that is indebted to us and lead us not into temptation But deliver us from evil the title if you're taking notes this evening direction and Deliverance direction and deliverance as we note this twofold request that completes verse number four We are mindful of the fact that this is not a general request for direction and deliverance",
      "context": "...ly it finishes with a twofold request that of direction and deliverance notice Verse number four of Luke 11. The Bible says and forgive us our sins For we also forgive everyone that is indebted to us and lea...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=204",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1444.280029296875,
      "text": "would have met the butler or the baker. Right? And if he didn't meet the butler, perhaps it would not have been possible for Pharaoh, when he had a dream, to say, hey, who's going to interpret? You know? And so we begin to look at how God is God. But as we look at the subject matter which we're dealing with this evening, you find that Joseph responds properly to this temptation. The temptation came on one particular day, and then it came day by day, day by day, and she kept saying, lie with me, lie with me, and then she tries to seize the opportunity when there's no one else around, and Joseph got himself out of the situation. There's a little kid's song, Put On Your Running Shoes, and the thought of fleeing from temptation, fleeing from youthful lust, and we see that as Paul would say that truth to Timothy. And this evening, when we think about the model prayer as it ends here in Luke 11, in verse number 4, and we've looked at all of these phrases, and we've studied through this, and we come to this last section when it says, lead us not into temptation, but deliver us from evil. And we think about God's direction and God's deliverance, not generally speaking, but specifically with regard to temptation and to evil. And again, as I mentioned a moment ago, if we would follow the framework of this model",
      "context": "...ay that truth to Timothy. And this evening, when we think about the model prayer as it ends here in Luke 11, in verse number 4, and we've looked at all of these phrases, and we've studied through this, and w...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1444",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}