{
  "reference": "Luke 19",
  "occurrences": [
    {
      "sermon_id": "V5wHGLUSkdE",
      "timestamp": 88.36000061035156,
      "text": "we look and study the Word of God, especially as we read through the gospel accounts here, we find that God gives us the opportunity to be introduced to a number of people. There are times in which we are introduced to folks that had just brief passing interactions with the Lord Jesus Christ, and there are times in which we find that some of the characters that were introduced to throughout the gospel records, they had multiple interactions, prolonged interactions with the Lord Jesus Christ, and we find that as we would go to these texts of scripture, that there are times in which we will find some of these characters that are more well-known than others. Of course, when we think about Zacchaeus and this particular text of scripture, again, he's a Bible character that is known by many, and I think mostly because of the song that is sung about him and about his life, and we find here in Luke 19, I want to read the first couple of verses, we'll get into the study this evening. The Bible says this, \"...and Jesus entered and passed through Jericho.\" And it says this in verse number two, \"...and behold, there was a man named Zacchaeus, which was the chief among the publicans, and he was rich.\" Look at verse number 10, skip down if you will. The Bible says in verse number 10, \"...for the Son of Man,\" speaking of",
      "context": "...d I think mostly because of the song that is sung about him and about his life, and we find here in Luke 19, I want to read the first couple of verses, we'll get into the study this evening. The Bible says t...",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE&t=88",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "V5wHGLUSkdE",
      "timestamp": 862.7399597167969,
      "text": "seeking and maybe they have position in possession but I find this evening and we speak about it often that no one and no thing will satisfy like Jesus. Nothing will. The enemy tries to convince the unregenerate man that they can satisfy their longings through a whole host of things but they're left wanting and when I look at this passage of Scripture and I think about what this man Zacchaeus desired and you say look at all of the things that he had. Yeah but he didn't have Jesus. He didn't have remember this morning I was speaking about a whole host of things actually and one of the things that I mentioned in the message this morning was about the peace and the joy that we have through Jesus and that that joy no man can steal from you. No man can take your joy. The Bible tells us about a peace that passeth all understanding. In this man Zacchaeus though he had position though he had possession he's wanting and he desires to see Jesus who he was. As we look at the passage of Scripture and we think just for a moment of Zacchaeus in these first four verses of Luke 19 as he's introduced to us in the Word of God and we find how he's described and what he desires I wonder this evening how many people you come into contact with how many people I come into contact with",
      "context": "... the passage of Scripture and we think just for a moment of Zacchaeus in these first four verses of Luke 19 as he's introduced to us in the Word of God and we find how he's described and what he desires I wo...",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE&t=862",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "V5wHGLUSkdE",
      "timestamp": 931.8599853515625,
      "text": "of Zacchaeus in these first four verses of Luke 19 as he's introduced to us in the Word of God and we find how he's described and what he desires I wonder this evening how many people you come into contact with how many people I come into contact with that would fit this description of being wanting. Now they might not know that it's Jesus that they're missing. You understand that. Zacchaeus no doubt had heard about Jesus. That's why he desired to see him who he was and this evening there might be some people in your sphere of influence that don't know that what they're missing is Jesus but God's allowed you to be in their sphere of influence so that as you magnify and glorify the Lord Jesus Christ in your life that they realize that the position and the possession that they have leaves them wanting and they want what you have. They want Jesus. They want to know more about this Jesus. So you understand this evening don't we think about the responsibility that has been given to us as the children of God as being ambassadors representatives of being those that would go out and sow the seed of the gospel that we have this response. Listen we're not salesmen. We're not trying to just build some kind of numbers in some type of following. No. We're trying to tell people about the Lord Jesus Christ that has done",
      "context": "of Zacchaeus in these first four verses of Luke 19 as he's introduced to us in the Word of God and we find how he's described and what he desires I wo...",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE&t=931",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "V5wHGLUSkdE",
      "timestamp": 1703.8399658203125,
      "text": "given Him a name which is above every name, that in the name of Jesus, every knee should bow, things in heaven and things in earth and every tongue should confess that Jesus Christ is Lord. To the glory of God the Father. You know what Zacchaeus is doing here? He's recognizing that Jesus is Lord. He's recognizing that He is the Messiah. That He is God in flesh. We mention this when we study and read about the passage of Scripture with the conversion of Saul and Saul says, who art thou Lord? And the Lord said, I am Jesus whom thou persecutest. It is hard for thee to kick against the pricks. And then Saul at this time, he responds and he says, Lord, what wilt thou have me to do? And here Zacchaeus in Luke 19 and verse 8, he said, behold, Lord, the half of my goods I give to the poor, and if I have taken anything from any man by false accusation, I restore him fourfold. I want you to understand that in verse 8, the actions that Zacchaeus takes, the things that he says he's going to do, that's not what brought him salvation. That's the result of his salvation. That is the outworking of his changed life. The power of the Gospel to transform a life. Listen, when you trusted Christ as your Savior, there were some things that changed. There were some things that you started to do",
      "context": "...ul at this time, he responds and he says, Lord, what wilt thou have me to do? And here Zacchaeus in Luke 19 and verse 8, he said, behold, Lord, the half of my goods I give to the poor, and if I have taken an...",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE&t=1703",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}