{
  "reference": "Luke 18",
  "occurrences": [
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 486.1000061035156,
      "text": "and open the door up while you're at 25,000 feet. That's not a good idea. And so in case of emergency, that's not how prayer is detailed in the word of God. It's sad that there are times in which it's tragedy or emergency that must enter into our lives to really bring us to our knees. But the reality is that we ought to have such a pattern of prayer in our lives that when that trial and that difficulty come, it's just natural response. It's not a last resort. It's a first response. It's a let's pray about this. Let's seek the face of God. Let's engage in intercessory prayer. And let me say this, as we look at these three particular areas of the Christian life this evening and make some commitments, the reality is that I understand I'm not suggesting in any one of these areas that we're not doing it. So please understand, I'm not suggesting that. I'm just suggesting that we ought to evaluate it and say, let's make a commitment to the Lord. Think about these verses, Luke 18, dealing with prayer. I want you to look at a few verses of Scripture with me. And Luke chapter number 18 and verse number one, in Luke 18 and verse number one, the Bible says, and he spake a parable unto them to this end. Notice what he said, that men ought always to pray and not to faint.",
      "context": "...hat we ought to evaluate it and say, let's make a commitment to the Lord. Think about these verses, Luke 18, dealing with prayer. I want you to look at a few verses of Scripture with me. And Luke chapter num...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=486",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 563.5399780273438,
      "text": "a few verses of Scripture with me. And Luke chapter number 18 and verse number one, in Luke 18 and verse number one, the Bible says, and he spake a parable unto them to this end. Notice what he said, that men ought always to pray and not to faint. On Wednesday evening for about a month or maybe six weeks this year, this past year in 2021, I did a mini series on prayer, teach us to pray. And I said this repeatedly through that message or through that series of messages that of all of the things that the disciples could have asked the Lord Jesus Christ to teach them to do, the only thing that we have recorded in the word of God is that they said, teach us to pray. Teach us to pray. Let me say this, prayer is tough. Prayer is hard work. Distractions abound. The enemy doesn't want us to pray. Have you found in your life that prayer is difficult? Have you found in your life that prayer is spiritual battle? It seems as if, as those that are moms of children, as soon as you think you have that time that you have to be able to go and pray, something happens. Those that no longer have little kids, there's something else that comes up. There's a phone call, there's a text message, there's a notification. I think that technology is wonderful, but sometimes it's such a hindrance.",
      "context": "a few verses of Scripture with me. And Luke chapter number 18 and verse number one, in Luke 18 and verse number one, the Bible says, and he spake a parable unto them to this end. Notice what he ...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=563",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}