{
  "reference": "Mark 10",
  "occurrences": [
    {
      "sermon_id": "WWASD9CXEro",
      "timestamp": 1416.6199951171875,
      "text": "people coming the other way are the ones that have a green light, and he waits and he looks and he just goes, just absolutely blows the red light, because why? He can't, he's, he's privileged. It's unbelievable. People got a problem with pride. Seriously. But Jesus says whosoever will be great among you shall be your minister. Notice in verse 44, and whosoever of you will be the chiefest shall be servant of all. You ever meet those kind of people that want the preeminence? They want to, they want all the recognition, they want to be looked at, they want to have the chiefest of seats, they want all of that. And Jesus says, listen, whoever here is going to be chiefest shall be servant of all. It reminds me of diatrophies in the book of 3 John. The Bible says that he loveth to have the preeminence. In verse 45, notice the humility of Jesus, because we are mentioning that Jesus walked humbly. Notice in verse 45, for even the Son of Man came not to be ministered unto, but to minister, to give his life a ransom for many. Aren't you thankful for that? He came not to be ministered unto, but he came to minister. And oh, how he ministered. Notice in John 13, if you will, we see this declaration in Mark 10, but notice in John 13, I mean, this is",
      "context": "... to minister. And oh, how he ministered. Notice in John 13, if you will, we see this declaration in Mark 10, but notice in John 13, I mean, this is",
      "sermon_title": "Sermon WWASD9CXEro",
      "url": "https://www.youtube.com/watch?v=WWASD9CXEro&t=1416",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WWASD9CXEro",
      "timestamp": 1483.9800109863281,
      "text": "life a ransom for many. Aren't you thankful for that? He came not to be ministered unto, but he came to minister. And oh, how he ministered. Notice in John 13, if you will, we see this declaration in Mark 10, but notice in John 13, I mean, this is the passage in which Jesus is washing the feet of the disciples. I mean, it is the lowest of low tasks to wash the feet. It was the, I mean, it was so low, I'm told, as I study and read and those that have studied with many years of looking at the culture and what have you, that you weren't even permitted to force a servant to do this task. It was so low. And the Bible says in John 13, beginning in verse number 4, he riseth from supper and laid aside his garments and took a towel and girded himself. After that, he poureth water into a base and began to wash the disciples' feet, and to wipe them with the towel wherewith he was girded. Can you imagine? God in flesh, the Lord Jesus Christ. I mean, I think, I hope, that some of us would probably respond the way that Peter did. Jesus, you're my master. You're my Lord. You're going to wash my feet? Verse 6, then cometh he to Simon Peter, and Peter saith unto him, Lord,",
      "context": "... to minister. And oh, how he ministered. Notice in John 13, if you will, we see this declaration in Mark 10, but notice in John 13, I mean, this is the passage in which Jesus is washing the feet of the disci...",
      "sermon_title": "Sermon WWASD9CXEro",
      "url": "https://www.youtube.com/watch?v=WWASD9CXEro&t=1483",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}