{
  "reference": "Mark 16",
  "occurrences": [
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 697.7599792480469,
      "text": "servant of the Lord. In fact, the phrase reminds me of the instruction that the angel gave on the morning of the resurrection. You remember that it was Peter that denied the Lord Jesus Christ on three occasions and we find that after that, he went out and wept bitterly and we find that on the morning of the resurrection, the angel, as they make the statement to those that were there, in Mark 16 verse number 17 says, tell his disciples and Peter. I like that. And here, we find that Paul, under the inspiration of the Holy Spirit of God, says and say to Archippus. There is a charge that is being given to this individual, this servant of the Lord. Many believe that Archippus had been discouraged as a result of the ministry and possibly had even quit the ministry. We read of this person, Archippus, we read of him in Philemon too and it appears from that portion of Scripture in verse number two of the book of Philemon, it appears that he was probably one of the pastors and he had grown discouraged and it seems as you would look at history and those that have written of history and these particular individuals that it would seem that he had been discouraged as a result of the ministry and possibly had even quit. Now, in light of that understanding, in light of those circumstances, we understand why God, through the inspiration of the Holy Spirit,",
      "context": "...the morning of the resurrection, the angel, as they make the statement to those that were there, in Mark 16 verse number 17 says, tell his disciples and Peter. I like that. And here, we find that Paul, under...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=697",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "timestamp": 1554.9800415039062,
      "text": "that were threatening, that were commanding do not teach or preach in the name of Jesus, Peter and John and the disciples and those that were gathered together, they understood that they had been commissioned to preach the gospel and that the gospel is the power of God unto salvation. And so when they pray, when they make their requests, listen, they respond by prayer. They understand that God is the creator and that he is their helper and they recognize this great truth and they say, God, would you give us boldness in the midst of this adversity? Isn't that commendable? Exemplary. In the midst of this time of threats, God, we need boldness. It says in verse 30, by stretching forth thine hand to heal and that signs and wonders may be done by the name of thy holy child, Jesus. We've been studying the book of Acts in our adult Sunday school class or the family Sunday school class, excuse me. We'd studied the miracles of Christ for a lengthy period of time through the gospels. As we came to a conclusion of that particular study, we dealt with the fact of what Mark 16 and verse 20 says, that they went forth and preached everywhere, the Lord working with them and confirming the word with signs of following, amen. Here they're praying in that same understanding that God would grant them boldness.",
      "context": "...gh the gospels. As we came to a conclusion of that particular study, we dealt with the fact of what Mark 16 and verse 20 says, that they went forth and preached everywhere, the Lord working with them and con...",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg&t=1554",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "timestamp": 1637.3000183105469,
      "text": "that particular study, we dealt with the fact of what Mark 16 and verse 20 says, that they went forth and preached everywhere, the Lord working with them and confirming the word with signs of following, amen. Here they're praying in that same understanding that God would grant them boldness. You know, God is able to give you boldness in the midst of adversity, in the midst of opposition, in the midst of all that's taking place in our lives and our world. As we look at the disciples here in Acts chapter 4 and we see their response to those that were opposing the message, you know there are people that are opposing the message still today. You understand that. There are all sorts of things that are going on in our world today. It seems like there's not a day that goes by in which you're not finding or hearing about how there's someone in power, some place of authority where they're trying to silence the people of God. We need boldness to preach the gospel. See because the Lord has come to save people. And as we understand that salvation is only through the Lord Jesus Christ, there's only one way to be saved. As I mentioned a few moments ago, we understand that what they must hear is the gospel of Jesus Christ. The Bible says, for whosoever shall call upon the name of the Lord shall be saved.",
      "context": "that particular study, we dealt with the fact of what Mark 16 and verse 20 says, that they went forth and preached everywhere, the Lord working with them and con...",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg&t=1637",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}