{
  "reference": "Mark 8",
  "occurrences": [
    {
      "sermon_id": "9aMxxX-X0kc",
      "timestamp": 541.5,
      "text": "me, but Christ. Remember what John the Baptist said, He must increase and I must decrease. Truly, John the Baptist had a great following, John the Baptist had a great position, John the Baptist had a race to run and he's the forerunner of Christ and he's the one that would say, behold the Lamb of God which taketh away the sin of the world, and he had that responsibility, there's a great number of people that followed him, he had many disciples, but when Jesus came on the scene, when he pointed to Jesus, the one who would be the Lamb that would take away the sin of the world, he said, I'm not even worthy to unloose this shoe latchet. He says, as those religious leaders come to him and they begin to tell him about those that were following Jesus, that's the context in John chapter 3, he says, He must increase, but I must decrease. And see, we're living that life for Christ, we're, we're taking and following the pattern that Jesus spoke of, turn over to Mark chapter number 8 if you will, and notice what Jesus says in Mark chapter number 8. Even as I mentioned Mark 8, some of you already have an idea of the passage that we're looking to as Jesus would call the people unto Himself, and we find at the end of the chapter, Mark",
      "context": "...pter number 8 if you will, and notice what Jesus says in Mark chapter number 8. Even as I mentioned Mark 8, some of you already have an idea of the passage that we're looking to as Jesus would call the peop...",
      "sermon_title": "Sermon 9aMxxX-X0kc",
      "url": "https://www.youtube.com/watch?v=9aMxxX-X0kc&t=541",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9aMxxX-X0kc",
      "timestamp": 602.2999877929688,
      "text": "you will, and notice what Jesus says in Mark chapter number 8. Even as I mentioned Mark 8, some of you already have an idea of the passage that we're looking to as Jesus would call the people unto Himself, and we find at the end of the chapter, Mark chapter in verse 34, this great truth is given to us with regard to the crucified life, living for Jesus. The Bible says in verse number 34, and when he, Jesus, had called the people unto him with his disciples also, he said unto them, notice this, whosoever will come after me, let him deny himself and take up his cross and follow me. For whosoever will save his life shall lose it, but whosoever shall lose his life for my sake and the gospels the same shall save it. For what shall it profit a man if he shall gain the whole world and lose his own soul? What shall a man give in exchange for his soul? Whosoever therefore shall be ashamed of me and of my words in this adulterous and sinful generation, of him also shall the Son of Man be ashamed when he cometh in the glory of his Father with the holy angels. We can look at this text of Scripture from really two applications. Number one, if we talk about a lost man, what shall it profit a man if he gain the whole world and lose his own soul?",
      "context": "you will, and notice what Jesus says in Mark chapter number 8. Even as I mentioned Mark 8, some of you already have an idea of the passage that we're looking to as Jesus would call the peop...",
      "sermon_title": "Sermon 9aMxxX-X0kc",
      "url": "https://www.youtube.com/watch?v=9aMxxX-X0kc&t=602",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9aMxxX-X0kc",
      "timestamp": 776.1399841308594,
      "text": "seat of Christ in our last message here in 2 Corinthians chapter number 5. So the Lord gives us this great pattern here in Mark chapter number 8 in verse 34, He gives us the, the progression, if you will. So often we talk about the importance of following Jesus. In fact, we sing songs about following Jesus, I will follow, follow on, all of these songs that we sing and we understand the importance of following Jesus. I have decided to follow Jesus. No turning back, no turning back. Is that not what the songwriter said? Is that not the song that we sing with children and VBS and so on and so forth? But listen, as adult people, as senior saints, we ought to still be singing, I have decided to follow Jesus. Amen? It's not just for the children's church. It's not just for the vacation Bible school kids. It's for us as well. I've decided to follow Jesus. After all that He's done for me, oh, that I would live for Him. And we find that there are oftentimes people talking about following Jesus. Listen, if you don't follow the prescribed pattern that's set forth in Mark 8 in verse 34, you're going to struggle following Jesus because here's the reality is that you must first deny myself. If you try following Jesus but you've never died to self, you're divided and you're going to struggle. It's going to be a battle every single day. Why?",
      "context": "...lking about following Jesus. Listen, if you don't follow the prescribed pattern that's set forth in Mark 8 in verse 34, you're going to struggle following Jesus because here's the reality is that you must f...",
      "sermon_title": "Sermon 9aMxxX-X0kc",
      "url": "https://www.youtube.com/watch?v=9aMxxX-X0kc&t=776",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9aMxxX-X0kc",
      "timestamp": 849.2199859619141,
      "text": "Mark 8 in verse 34, you're going to struggle following Jesus because here's the reality is that you must first deny myself. If you try following Jesus but you've never died to self, you're divided and you're going to struggle. It's going to be a battle every single day. Why? Because you've not died to self. And so guess what self wants? Self wants what self wants. Amen? Self doesn't want to suffer. Self wants convenience. Self wants comfort. Am I right? And so we must deny ourselves. Paul said it this way, I am crucified with Christ. He said it this way, I die daily. I've denied myself. Not I, but Christ. Not I, but Christ. We find that he says not only that we're to deny ourselves, but number two, he says that we're to take up his cross. Wow. The cross represents for us many things, but we find that the cross represents first death. I'm thankful that my Lord and Savior died upon that cross. This morning we have a cross in our baptistry. Every time you come in here, you see that cross, but you'll notice that Jesus isn't on that cross. Why? Because he's suffering sin, death, and the grave. Hallelujah. I serve a risen Savior. He's not on the cross anymore. At Christmas time, you'll see these little portrayals of Jesus in a manger at Bethlehem. Listen, he's not there anymore either. Hallelujah. I'm thankful for the truth of the incarnation.",
      "context": "Mark 8 in verse 34, you're going to struggle following Jesus because here's the reality is that you must f...",
      "sermon_title": "Sermon 9aMxxX-X0kc",
      "url": "https://www.youtube.com/watch?v=9aMxxX-X0kc&t=849",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}