{
  "reference": "Matthew 21",
  "occurrences": [
    {
      "sermon_id": "9JjoBDbN7Ms",
      "timestamp": 1821.4599800109863,
      "text": "that I mentioned earlier, how that he says praying always, he then specifically says, and pray for me. He asked the believers in Thessalonica this way. He says, brethren, pray for us. He tells the believers in the church in Colossae to pray for him and to pray for them that the doors would be opened, that he would speak with boldness the way that he's supposed to speak. No wonder in 1 Timothy 2, in verse number eight, he says, I will therefore that men pray everywhere, lifting up holy hands without wrath and doubting. Paul understood the importance of prayer. What a great example for us this morning. When we evaluate our lives personally, personally, what place does prayer have in my life? Number two, and I'll be done with this this morning, when I evaluate prayer and when I ask the question, the place of prayer in our lives, yes, personally, but number two, corporately, corporately. I mentioned this two, three weeks ago now, the first Sunday that we started praying before our service, we start with a song and then we have a season of prayer. I believe God's pleased with that, by the way. It encourages my heart to hear the voices of people praying. How sweet that must be in the ears of God, amen? Jesus said this in Matthew 21 in verse number 13, and this is the verse that I said that Sunday morning",
      "context": "...r the voices of people praying. How sweet that must be in the ears of God, amen? Jesus said this in Matthew 21 in verse number 13, and this is the verse that I said that Sunday morning",
      "sermon_title": "Sermon 9JjoBDbN7Ms",
      "url": "https://www.youtube.com/watch?v=9JjoBDbN7Ms&t=1821",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9JjoBDbN7Ms",
      "timestamp": 1893.0599822998047,
      "text": "God's pleased with that, by the way. It encourages my heart to hear the voices of people praying. How sweet that must be in the ears of God, amen? Jesus said this in Matthew 21 in verse number 13, and this is the verse that I said that Sunday morning that we first changed the order of our services and made this emphasis on prayer corporately. He said, by house shall be called the house of prayer. And just in case we weren't clear as to what house he was speaking of, we find that in 1 Timothy chapter three in verse number 15, that the word of God plainly teaches that the house of God is the church of the living God, amen? Amen? So he wasn't specifically just speaking about the temple, his house. This is God's house. You know that the Lord Jesus Christ is the head of the church? Someone was asking me recently about the church polity in a Baptist church. And the church polity in a Baptist church differs from church polity in some other churches. I began to explain some things, and I said first and foremost, the Lord Jesus Christ is the head of the church, amen? I'm thankful for that. It's his church. And he said, my house shall be a house of prayer. Should be a house of prayer. I want you to think about the example when we think about the place of prayer in our lives,",
      "context": "...r the voices of people praying. How sweet that must be in the ears of God, amen? Jesus said this in Matthew 21 in verse number 13, and this is the verse that I said that Sunday morning that we first changed the...",
      "sermon_title": "Sermon 9JjoBDbN7Ms",
      "url": "https://www.youtube.com/watch?v=9JjoBDbN7Ms&t=1893",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}