{
  "reference": "Matthew 9",
  "occurrences": [
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 732.4799957275391,
      "text": "We find the record of creation all throughout the Scriptures, and we find that He is the Creator. He is the Creator. He is the sustainer. In Hebrews 1 and verse number 3, the Bible tells us this great truth with regard to not only the creative work of God that He is the Creator, but understanding that He upholds all things, that He is the sustainer of all things. The Bible says this in Hebrews 1 and verse number 3, who being the brightness of His glory and the express image of His Person and upholding all things by the Word of His power, when He had by Himself purged our sins, sat down on the right hand of the Majesty on high, and what great truth is given to us in verse number 3, not only that of creation and the sustaining work of God, but that of redemption as well is given to us at the end of verse number 3. But we find that He is the sustainer. Why is it that we have the laws that we have in nature? It's because our God sustains all things. Without Him, you remove Him and it falls apart, but you find that He upholds all things by the Word of His power. Phenomenal. He's precious. He's Alpha and Omega. He's Almighty. He's Creator. He is the sustainer. Notice He is compassionate. I love the fact that you find throughout the Word of God and in Matthew 9,",
      "context": "...tainer. Notice He is compassionate. I love the fact that you find throughout the Word of God and in Matthew 9,",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=732",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 803.4400024414062,
      "text": "apart, but you find that He upholds all things by the Word of His power. Phenomenal. He's precious. He's Alpha and Omega. He's Almighty. He's Creator. He is the sustainer. Notice He is compassionate. I love the fact that you find throughout the Word of God and in Matthew 9, we'll look there at this portion of Scripture, but you find the compassion of Christ. You find that our God is compassionate. And here in Matthew 9, the Bible tells us that there was a multitude and Jesus saw the multitudes in verse number 36 and it tells us that He was moved with compassion on them. Why? Because they fainted and were scattered abroad as sheep having no shepherd. He was moved with compassion. We mentioned this morning in our Sunday school hours, we're studying the miracles of Christ that we were able to witness the compassion of Christ and the power of Christ. I'm thankful here that as you note here that He's moved with compassion, you find this referenced in other portions of Scripture as well that He is compassionate. He is gracious. Faith sang about God's grace this morning. We understand that many of us, even as we sang at the conclusion of our service last Sunday morning, amazing grace, that we are very thankful for the grace of God. In our text of Scripture in 1 Peter 2, in verse number 3, we read it just a moment ago, and the Bible says this",
      "context": "...tainer. Notice He is compassionate. I love the fact that you find throughout the Word of God and in Matthew 9, we'll look there at this portion of Scripture, but you find the compassion of Christ. You find tha...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=803",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}