{
  "reference": "Matthew 16",
  "occurrences": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 2323.1400146484375,
      "text": "They came to this place where they're cast down in their own eyes. They're defeated. We did everything we could do. I mean, it was a full court press. We pulled out all the stops, all the tricks. We hired people and we tried to deceive and we did everything. And the work was finished. The work was finished. Let me share with you this morning a few promises from the Word of God for us as the people of God. Go to the book of Matthew, if you will. In Matthew chapter number 16. You believe the Bible this morning? Every word, amen? Every word of God is pure. So thankful for the Word of God. We sing, we didn't sing it this morning, but we sing standing on the promises, amen? Peter says they're exceeding great and precious promises. Paul says that we can be confident in the promises of God. In Him, they're yay, amen? Listen, what God says, He will do. Notice Matthew 16. It's right in the midst of the portion in which Jesus asked the disciples, whom do men say that I, the Son of Man am? Then He says, but whom say ye that I am? See, because the answer that they say that you're John the Baptist, you're one of the prophets, Jeremiah, Isaiah, someone else, that wasn't the right answer. So Jesus says, whom say ye that I am? And Peter stands up in boldness and declares,",
      "context": "...fident in the promises of God. In Him, they're yay, amen? Listen, what God says, He will do. Notice Matthew 16. It's right in the midst of the portion in which Jesus asked the disciples, whom do men say that I,...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=2323",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2254.480010986328,
      "text": "would shed his precious blood for you and for me and for all of mankind, and we find that Jesus, he suffered those things. He endured the contradiction of sinners. By the way, shall I say this, turn over to the book of Matthew, if you will, in chapter 16. I want you to notice here in Matthew chapter number 16, Jesus is speaking often as we begin to think about this passage, our mind will race to the truth, the promise that is given in verse number 18, when Jesus said, I will build my church and the gates of hell shall not prevail against it, and what great promise that is. Just prior to Jesus making that promise, he says to the disciples, he says, whom do men say that I am? They give an answer. Some say that you're John the Baptist, some say that you're one of the prophets, and so on and so forth, and then Jesus says, but whom say ye that I am? Peter stands up with great boldness and answers absolutely appropriately. He says, thou art the Christ, the son of the living God. We find that Jesus would then, as he gives that promise that we mentioned a moment ago about the church and him building the church, notice in verse 21 of Matthew 16, notice the Bible says this, from that time forth began Jesus to show unto his disciples, what is he going to show them?",
      "context": "... that we mentioned a moment ago about the church and him building the church, notice in verse 21 of Matthew 16, notice the Bible says this, from that time forth began Jesus to show unto his disciples, what is h...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2254",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2320.1199951171875,
      "text": "then, as he gives that promise that we mentioned a moment ago about the church and him building the church, notice in verse 21 of Matthew 16, notice the Bible says this, from that time forth began Jesus to show unto his disciples, what is he going to show them? How that he, what does it say, must go unto Jerusalem and suffer many things of the elders and chief priests and scribes, notice, and be killed and be raised again the third day. Jesus understood his purpose. Remember, we spoke about the focus in our previous point. He understood the purpose. He understood the reason that he came to this sin-cursed world was to redeem mankind, and he begins at that time to share and to instruct his disciples with regard to those things that would shortly come to pass. We find that Peter, he took him, and notice in verse 22 it says, and he began to rebuke him. Can you imagine? Peter says this, be it far from thee, Lord, this shall not be unto thee. Now from a human perspective, I kind of can understand why Peter had this perspective. Peter loved the Lord Jesus Christ. Peter had walked with the Lord Jesus Christ. Peter had left all that he had. He left his fishing business, and he followed Jesus, and Jesus said, follow me and I will make you fishers of men, and now Jesus is telling Peter that he's going to go and suffer",
      "context": "... that we mentioned a moment ago about the church and him building the church, notice in verse 21 of Matthew 16, notice the Bible says this, from that time forth began Jesus to show unto his disciples, what is h...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2320",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 705.1599807739258,
      "text": "the enemy, the adversaries as they're noted in v. 11, that they say, here's what we're going to do. They're not even going to know what happened. They shall not know, neither see, till we come in the midst among them and slay them and cause the work to cease. You see the progression in this plan as it's really revealed to us. And I know we've skipped around because we're going to go back and catch those verses that we skipped, but you notice the plan of the enemy that it begins with some mockery. It begins with seeking to just simply discourage you from ever getting off the starting block, so to speak. And then we find that they say we're going to go and fight against them. And we find that they want to hinder the work. And then we find that really ultimately their goal is to cause the work to cease. The enemy's not satisfied with simply hindering the work. They want it to cease. I'm thankful for the promises of God. I'm thankful for Matthew 16 when Jesus said, I will build my church and the gates of hell shall not prevail against it. I'm thankful for biblical promises that we have with regard to the work of God, the work of Christ and how we can prevail. But we must be mindful that the enemy, that there are many adversaries and the enemy has a plan in his plan. Remember what Peter said.",
      "context": "...y hindering the work. They want it to cease. I'm thankful for the promises of God. I'm thankful for Matthew 16 when Jesus said, I will build my church and the gates of hell shall not prevail against it. I'm tha...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=705",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}