{
  "reference": "Matthew 7",
  "occurrences": [
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 2377.3799438476562,
      "text": "their occasional obedience, their occasional righteousness, that that makes them a child of God. In like way, or in the same way, it does not mean that the believer, the child of God, that has the occasional sin is not saved. It's the process of sanctification. It's the truth that God has given to us. Really, Jesus said it this way, and we're familiar with this truth in Matthew 7 and verse number 20, when He said, wherefore, by their fruits ye shall know them. Ye shall know them. Listen, if you're a child of God this morning, if you've been born again, the Lord has put a desire in you to please Him. To have seen Him is to love Him. To love Him is to want to please Him. And to please Him, there's no room for sin. Right? Again, I'm not saying, and neither is John, the Word of God is not saying that we're never going to sin because we understand that we're going to sin. And if we do, we have an advocate with the Father, Jesus Christ the righteous. If we confess our sins, He is faithful and just to forgive us and to cleanse us from all unrighteousness. And so He's not suggesting that we're never going to sin. He's simply saying, it's not going to be a pattern in your life. It's not going to be habitual, continual. It's not going to be that you're",
      "context": "...uth that God has given to us. Really, Jesus said it this way, and we're familiar with this truth in Matthew 7 and verse number 20, when He said, wherefore, by their fruits ye shall know them. Ye shall know the...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=2377",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1839.4399642944336,
      "text": "do what only You can do? See, we don't want just an outward form of compliance. We want a heart that is conformed to the image of Christ. A life that is seeking to serve the Lord Jesus Christ. I remember hearing that story, and I doubt that it's true, though some have said the story as if it were true. Maybe it is. I don't know. But there's a story about a little girl that was told to have a seat, and she wouldn't have a seat. And defiant, she's not going to sit down. She's not going to sit down. And through a struggle that ensued, we find that eventually, the parent was victorious and the child finally sat down. And then said, I'm sitting on the outside, but on the inside, I'm standing up. That's not what we're looking for. We're not just looking for a matter of conformance. We're looking for a changed heart. And only Jesus can change a heart. Only Jesus could cause this devil that had vexed this girl. This girl was demon-possessed, and because Jesus is God, He could cause that devil to be departed. He's the only one. We find what she recognized. Number two, what she requested. Notice finally with me this morning what she received. Look at Matthew. Actually, turn to Mark. I want to look at what Mark says in Matthew 7, verses 29 and 30. Notice the Bible says this in Mark 7, verse 29,",
      "context": "...ing what she received. Look at Matthew. Actually, turn to Mark. I want to look at what Mark says in Matthew 7, verses 29 and 30. Notice the Bible says this in Mark 7, verse 29,",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1839",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1924.199966430664,
      "text": "find what she recognized. Number two, what she requested. Notice finally with me this morning what she received. Look at Matthew. Actually, turn to Mark. I want to look at what Mark says in Matthew 7, verses 29 and 30. Notice the Bible says this in Mark 7, verse 29, \"...and He said unto her, for this saying, go thy way.\" Notice this phrase. The devil is gone out of thy daughter. You know what she received? She received a promise of deliverance. She received the Word of God. She received the promise from God in flesh. And she had this interaction with the Lord Jesus Christ. This is an account that actually happened during his life in ministry. He went to this place to tire and sight in, and this desperate mother heard of Him and sought Him and fell at His feet, and she recognized who He was and what power He possessed and that He was worthy of worship. And she said, Lord, help me. And the situation is known that her daughter is grievously vexed with a devil, and we find that Jesus says, for this thy saying, go thy way. The devil is gone out of thy daughter. Isn't that a blessed truth? I mean, can you imagine? Put yourself within the context of this account. Can you imagine the level of desperation of this mother? It's hard for us to fathom, but beyond any human comprehension of what she was dealing with",
      "context": "...ing what she received. Look at Matthew. Actually, turn to Mark. I want to look at what Mark says in Matthew 7, verses 29 and 30. Notice the Bible says this in Mark 7, verse 29, \"...and He said unto her, for th...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1924",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}