{
  "reference": "Matthew 1",
  "occurrences": [
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 2550.020050048828,
      "text": "drama of redemption, and we find how God, no doubt He could have given us all of the history of any of the other descendants that He chose to give us because He knows everything, but in His plan, in His plan of redemption, the Messianic line, the birth of Christ, we find that the shift of Scripture, the focus now shifts from that of Abraham to Isaac specifically. Just a few verses given to us with regard to the descendants of Ishmael and the death of Ishmael, and then you begin to read about Isaac, you begin to read about his life, and then you begin to read about his sons, and you begin to read about Israel as a nation and the twelve tribes, the twelve sons, and you see the focus. And Matthew 1 says this, and we'll close with this text of Scripture as we think about the truth that God has given us with regard to the shift of Scripture and understanding that Isaac is the distinct heir. We find that the Bible tells us this in Matthew 1. Matthew 1, beginning in verse number 1, the book of the generation of Jesus Christ, the son of David, the son of Abraham. Abraham begat Isaac. Is that what it says in verse number 2? And Isaac begat Jacob, and Jacob begat Judas and his brethren. We're not gonna go down through all of the text of Scripture here, but we",
      "context": "...to read about Israel as a nation and the twelve tribes, the twelve sons, and you see the focus. And Matthew 1 says this, and we'll close with this text of Scripture as we think about the truth that God has giv...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=2550",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Ap8WkGwQMm4",
      "timestamp": 1643.4200134277344,
      "text": "Lord hath made known unto us. And so they had been entrusted with this message, with this truth with regard to the birth of Messiah. The Bible says that when they had seen it, notice verse 17, they made known abroad the saying which was told them concerning this child. What is it that they made known? For unto you is born this day in the city of David a Savior, which is Christ the Lord. You know what they proclaimed? The Messiah has been born. Christ has been born. That's the message that they proclaimed, no doubt. Because it says here that they made abroad the saying which was told them concerning this child. Now you understand as we compare Scripture with Scripture, begin to think about the names of Christ and the significance of the birth of Christ. You'll go back, hold your place there in Luke 2, go back to Matthew 1 if you will, as we understand the significance these men would have been familiar with the Old Testament. We think about the announcement of the peace that had been given there in Luke 2 when they were singing and praising God on earth, peace, goodwill toward men. Remember Isaiah prophesied that his name shall be the Prince of Peace was one of the names that was given. But here in Matthew 1 in verse 18, the Bible says now the birth of Jesus Christ was on this wise.",
      "context": "...he significance of the birth of Christ. You'll go back, hold your place there in Luke 2, go back to Matthew 1 if you will, as we understand the significance these men would have been familiar with the Old Test...",
      "sermon_title": "Sermon Ap8WkGwQMm4",
      "url": "https://www.youtube.com/watch?v=Ap8WkGwQMm4&t=1643",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Ap8WkGwQMm4",
      "timestamp": 1710.0600280761719,
      "text": "and praising God on earth, peace, goodwill toward men. Remember Isaiah prophesied that his name shall be the Prince of Peace was one of the names that was given. But here in Matthew 1 in verse 18, the Bible says now the birth of Jesus Christ was on this wise. When as his mother Mary was espoused to Joseph before they came together, she was found with child of the Holy Ghost. Then Joseph, her husband being a just man and not willing to make her a public example was minded to put her away privily. But while he thought on these things, behold, the angel of the Lord appeared unto him in a dream saying, Joseph, thou son of David, fear not to take unto thee Mary thy wife for that which is conceived in hers of the Holy Ghost and she shall bring forth a son and thou shall call his name Jesus. Why? For he shall save his people from their sins. Verse 22, now all this was done that it might be fulfilled which was spoken to the Lord by the prophet saying, behold, a virgin shall be with child and shall bring forth a son and they shall call his name Emmanuel which being interpreted is God with us. Then Joseph being raised from sleep did as the angel of the Lord had bidden him and took unto him his wife and knew her not till she had brought forth",
      "context": "...phesied that his name shall be the Prince of Peace was one of the names that was given. But here in Matthew 1 in verse 18, the Bible says now the birth of Jesus Christ was on this wise. When as his mother Mary...",
      "sermon_title": "Sermon Ap8WkGwQMm4",
      "url": "https://www.youtube.com/watch?v=Ap8WkGwQMm4&t=1710",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}