{
  "reference": "Matthew 4",
  "occurrences": [
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2584.980026245117,
      "text": "a passion for souls dear Lord. A passion to reach the lost. What a wonderful hymn that is. And I just wonder this morning what is it that we are passionate about? What is it that if someone were to be asked, maybe a co-worker, maybe a friend, a neighbor, maybe a family member, what is so-and-so passionate about? What would they say? Would souls even be on the list anywhere as to what we're passionate about? Give me a passion for souls. I am not ashamed of the gospel of Christ for it is the power of God unto salvation to everyone that believeth to the Jew first and also to the Greek. As we draw closer to the Lord I believe that he will develop in us a passion for souls as we draw closer to him. See because as we draw closer to our Lord, as we walk with him as we're supposed to, we find that we'll begin to love what he loves. Amen? Listen, before I was saved I didn't love the Bible. Before I was saved I didn't love church. Before I was saved I didn't love the brethren. Before I was saved I wouldn't give my money to a church or to missions. But as we get saved and then as we walk with the Lord and as we draw closer to him we begin to love what he loves. Jesus said this in Matthew 4, follow me and I will",
      "context": "... walk with the Lord and as we draw closer to him we begin to love what he loves. Jesus said this in Matthew 4, follow me and I will",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2584",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2663.740020751953,
      "text": "saved I wouldn't give my money to a church or to missions. But as we get saved and then as we walk with the Lord and as we draw closer to him we begin to love what he loves. Jesus said this in Matthew 4, follow me and I will make you fishers of men. They were fishers of fish. I am not a fisherman. I've never been accused of being one. In fact, Joseph, I think it was their basketball team, maybe it was a class, I can't remember where he was, he was the only kid that his dad had not taken him fishing. I felt bad. I felt horrible. I don't even have a fishing rod. I just, I don't know. I need to go to one of those stocked ponds, you know what I mean? Where it's just easy. But the reality is that these guys were fishers of fish. It's what they did. And Jesus said follow me and I will make you fishers of men. The closer we get to the Lord the more we're gonna love what he loves. And God so loved the world that he gave his only begotten Son. Aren't you thankful for that love? The Bible says that he commended his love toward us and that while we were yet sinners Christ died for us. We've been the recipients but now we've been entrusted with something. And my",
      "context": "... walk with the Lord and as we draw closer to him we begin to love what he loves. Jesus said this in Matthew 4, follow me and I will make you fishers of men. They were fishers of fish. I am not a fisherman. I'v...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2663",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}