{
  "reference": "Matthew 12",
  "occurrences": [
    {
      "sermon_id": "54WCk41oLBM",
      "timestamp": 2055.7999877929688,
      "text": "cast him forth into the sea and the sea ceased from a raging. Then the men feared the Lord exceedingly and offered a sacrifice unto the Lord and made vows. Now I don't know about you, but I see something wonderful in verse 16. They offered sacrifice unto the Lord. Well, listen, when I see they did that, it causes me to be reminded of the fact that there's only one sacrifice that's saved from sin and that's the blood sacrifice of Jesus Christ and the cross of Calvary. So they made sacrifice to the Lord and made vows. You know what I think? I think these men got saved right here. I think they put their faith and trust in Jonah's God in spite of him. And to me, that's an amazing thing. And so they made vows. Verse 17. Now the Lord had prepared a great fish to swallow up Jonah. And of course, the New Testament says whale. And the Lord had prepared a great fish to swallow up Jonah. And Jonah was in the belly of the fish three days and three nights. We know that's a messianic statement. Matthew 12, 40 says this. As Jonah was in the belly of the fish or the whale three days and three nights, so is the son of man the heart of the earth. We know that's a messianic statement in scripture there, but nonetheless, there's something practically seen to this.",
      "context": "...nah was in the belly of the fish three days and three nights. We know that's a messianic statement. Matthew 12, 40 says this. As Jonah was in the belly of the fish or the whale three days and three nights, so i...",
      "sermon_title": "Sermon 54WCk41oLBM",
      "url": "https://www.youtube.com/watch?v=54WCk41oLBM&t=2055",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "54WCk41oLBM",
      "timestamp": 2109.3800048828125,
      "text": "Matthew 12, 40 says this. As Jonah was in the belly of the fish or the whale three days and three nights, so is the son of man the heart of the earth. We know that's a messianic statement in scripture there, but nonetheless, there's something practically seen to this. He's in the belly of this fish for three days and three nights. Now, you know, you stop and think about that and you say, well, that's just absolutely a biological impossibility for anybody to survive in the belly of a fish or a whale. But the hand of God was upon him in spite of himself. I mean, that's an interesting thing that he was able to survive three days and three nights in the belly of this fish. First chapter two, verse one. Then Jonah prayed unto the Lord his God out of the fish's belly. And he said, I cried by reason of mine affliction unto the Lord and he heard me out of the belly of hell, Sheol, and of course that can reference the grave as well, cried I and thou heardest my voice. For thou hast cast me into the deep and the midst of the seas and the floods come past me about and all the billows and thy waves passed over me. Then I said, I'm cast out of thy sight yet I will look again toward the holy temple. Verse five says, the waters can pass me about",
      "context": "Matthew 12, 40 says this. As Jonah was in the belly of the fish or the whale three days and three nights, so i...",
      "sermon_title": "Sermon 54WCk41oLBM",
      "url": "https://www.youtube.com/watch?v=54WCk41oLBM&t=2109",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 297.260009765625,
      "text": "precious. He's precious. The word precious is an interesting word. It carries with it the idea of that honor which one has by reason of rank and state of office which he holds. By using the definition of this word that is translated precious here in our text of Scripture, of the honor which one has by reason of rank, he is King of kings and Lord of lords, amen? He is God, it says this, and state of office which he holds. And you could name all sorts of things about our Lord this morning, but indeed, if there is a word that sums up so beautifully our Savior, it is this word, He is precious. He's precious. And this morning, we find that as we think about the Lord Jesus Christ and His name is so wonderful, and definitely we agree, as the songwriter said, His name, Jesus, it is the sweetest name I know. I'm mindful this morning of the times in which Jesus, during His earthly ministry, He interacted with those religious leaders of the day. In John 8, they were contending with Jesus, and they say in verse 53, art thou greater than our father Abraham? They had no idea. Amen? In just a little while, He would say, before Abraham was, I am! He is God. He is precious. We find that in Matthew 12, that Jesus declares, behold, a greater than Solomon is here. Now you think about the place of Abraham",
      "context": "... a little while, He would say, before Abraham was, I am! He is God. He is precious. We find that in Matthew 12, that Jesus declares, behold, a greater than Solomon is here. Now you think about the place of Abra...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=297",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 376.6600036621094,
      "text": "father Abraham? They had no idea. Amen? In just a little while, He would say, before Abraham was, I am! He is God. He is precious. We find that in Matthew 12, that Jesus declares, behold, a greater than Solomon is here. Now you think about the place of Abraham in the mind of a Jewish individual. You think of the place of Solomon and Solomon's temple and all of the beauty and all of the things that would be wrapped up in the mind, and Jesus says, behold, a greater than Solomon is here. Jesus asked His disciples, as it's recorded in Matthew 16, whom do men say that I, the Son of Man am? And Peter says, well, some say that you're one of the prophets. Elijah. John the Baptist. And Jesus says, but whom say ye that I am? And Peter stands with great confidence, and he says, thou art the Christ, the Son of the living God. Man, we serve a great God. He is precious. This morning, we're gonna look at two thoughts. This evening, we're gonna deal with a final thought. So I hope you come back this evening so you get part two of the message. But part one here this morning, He is precious, part one. I want you to be thankful this morning for His person, for who He is. So often in our lives, we get wrapped up in being thankful and having gratitude in what someone does for us.",
      "context": "... a little while, He would say, before Abraham was, I am! He is God. He is precious. We find that in Matthew 12, that Jesus declares, behold, a greater than Solomon is here. Now you think about the place of Abra...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=376",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}