{
  "reference": "Matthew 28",
  "occurrences": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 1938.7000274658203,
      "text": "doesn't seem that it was extremely long that they were there in the burning, fiery furnace. But they spent more time in that burning, fiery furnace than you did. Or than I have. And it was because they were willing to stand. That they went in that burning, fiery furnace. And the reality is that as we look at this, and we think about the communion that they enjoyed, we find that the psalmist says that in Thy presence is fullness of joy. Jeremiah, of course, he's prophesying on the eve of captivity. And in fact, Jeremiah's prophesying when the Babylonians have besieged the city and he sees them all around. He understands what's going to happen. But God gives word after word to Jeremiah. And in here, in Jeremiah 42 and v. 11, the Bible says, be not afraid of the King of Babylon, of whom you are afraid. Be not afraid of Him, saith the Lord, for I am with you to save you and to deliver you from His hand. Jeremiah 42 and v. 11. Don't be afraid of Him. The One you're afraid of, don't be afraid of Him. Why? Because I'm with you. I'm with you. Man, they had some communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I am with you always.",
      "context": "... communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=1938",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2017.2200317382812,
      "text": "with you. Man, they had some communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I am with you always. Hebrews 13 and v. 5, a precious promise of the Word of God. He will never leave thee nor forsake thee. When we understand the truth of v. 6, He is my Helper. Therefore, who or what am I going to fear? The psalmist said in Psalm 121, I will lift up mine eyes unto the hills. From whence cometh my help? My help cometh from the Lord which made heaven and earth. He is my Helper. He's your Helper. And here, these men, they find themselves in the fiery furnace, they find themselves enjoying some communion with God. Can I tell you this morning that if you're going to stand and if I'm going to stand, we may face some consequences. But can I tell you, God will be with you. God will be with you. And you'll have seasons of communion that are sweeter than you've ever enjoyed any time before. I think about Paul and Silas when they were in prison. They were cast into the prison fast, locked away. But man, they were singing, were they not? Singing to God, they were having communion with God. See, this morning,",
      "context": "... communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2017",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 1917.3600006103516,
      "text": "The Great Commission. That we're to go into all the world and preach the Gospel to every creature. But the Bible tells us that we're to see Him saved and see Him baptized and then see Him discipled. That we would teach them all things whatsoever I have commanded you. That's what Jesus said in Matthew 28. And as we would consider the importance of discipleship and teaching, that people, the people of God would be grounded and settled and rooted and built up. Then notice verse 8. Paul says, beware. Now it's interesting to me, whenever you see a warning label on some product that you purchase, a sign on some road that you're traveling, on some gate that you're seeking to enter, there will be warning signs. Beware of dogs is a sign that you may see as you would enter into someone's gate. You ought to take heed to that warning. Beware. Danger ahead. As you're driving, there's a curve, there's a this, whatever it might be. Out west, beware of falling rocks. Many places you can drive out west and rocks will just fall onto the highway. You need to be careful. In the pages of Scripture, God gives us some warnings. Could I tell you this morning that it's important that we take heed to the warnings that God gives us in His Word? And here's where we find really the impact of this truth. He says, beware, lest any man spoil you",
      "context": "...led. That we would teach them all things whatsoever I have commanded you. That's what Jesus said in Matthew 28. And as we would consider the importance of discipleship and teaching, that people, the people of G...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=1917",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}