{
  "reference": "Micah 6",
  "occurrences": [
    {
      "sermon_id": "8OgJllM8BSQ",
      "timestamp": 164.55999755859375,
      "text": "have a proper understanding of spiritual gifts, I believe that what would be promoted in our lives is humility, not pride. But we find that a careful study of the book of 1 Corinthians, the church at Corinth, we find that we are reminded as to why this particular admonition is given within the context of spiritual gifts. We find that the church in Corinth, they had many problems, of course much as a result of their carnality and the divisions and what have you, but there was a situation there in Corinth where they were, look at the spiritual gift that I have and I'm better than you are because of the spiritual gift that I have versus the spiritual gift that you have. And they had an understanding that was not appropriate with regard to spiritual gifts, but we find here that Paul is giving this instruction in Romans chapter 12, again just a brief text through verse number 8 with regard to spiritual gifts. He says that we are not to think of him, this charge to every man, not to think of himself more highly than he ought to think. It reminds me of Micah 6 and verse number 8 where the Bible says, he hath showed thee, O man, what is good and what doth the Lord require of thee, but to do justly and to love mercy and to walk humbly with",
      "context": "...s charge to every man, not to think of himself more highly than he ought to think. It reminds me of Micah 6 and verse number 8 where the Bible says, he hath showed thee, O man, what is good and what doth the...",
      "sermon_title": "\"We Ought To Walk Humbly\" Romans 12:3",
      "url": "https://www.youtube.com/watch?v=8OgJllM8BSQ&t=164",
      "channel": "Unknown",
      "publish_date": 20240922
    },
    {
      "sermon_id": "8OgJllM8BSQ",
      "timestamp": 225.9199981689453,
      "text": "highly than he ought to think. It reminds me of Micah 6 and verse number 8 where the Bible says, he hath showed thee, O man, what is good and what doth the Lord require of thee, but to do justly and to love mercy and to walk humbly with thy God. And we begin to look at this text of Scripture this evening and this thought of walking in humility and the importance of it, and I believe that in order for us to walk in humility, there are two things that we must acknowledge. If you're taking notes this evening, the first two thoughts for you are those things that we must acknowledge before we will really walk in humility. And the first one is we must acknowledge the desire of our own flesh. We must acknowledge the desire of our own flesh. What do I mean by that? Well, your flesh desires glory. Your flesh desires attention. My flesh, we understand humanity, we understand the human nature, and the reality is that we find throughout the Scriptures many examples. We do not have time here on a Wednesday evening to really do an in-depth study of all the examples that God gives us, but we find that it is a natural tendency of mankind to desire recognition, glory, to have that desire. In fact, Paul says in 2 Corinthians chapter 12, and we're going to look at that passage in just a moment,",
      "context": "highly than he ought to think. It reminds me of Micah 6 and verse number 8 where the Bible says, he hath showed thee, O man, what is good and what doth the...",
      "sermon_title": "\"We Ought To Walk Humbly\" Romans 12:3",
      "url": "https://www.youtube.com/watch?v=8OgJllM8BSQ&t=225",
      "channel": "Unknown",
      "publish_date": 20240922
    }
  ]
}