{
  "reference": "Nehemiah 4",
  "occurrences": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 1648.5400390625,
      "text": "is nothing more than sorrow of heart. What is it that you request? And before he answered the king, it says that he prayed to God. What a great truth. Nehemiah's a man of prayer. Not only there, notice in chapter number 4. Chapter number 3 deals with the work being assigned and all of the people that were there, and chapter number 4, again, the work being attacked and all that's going on. Notice in verse number 8 of Nehemiah 4, the Bible says, and conspired all of them together to come and to fight against Jerusalem and to hinder it. Nevertheless, verse number 9 of Nehemiah 4, we made our prayer unto our God and set a watch against them day and night because of them. What's the response? Pray. He's a man of prayer. In our chapter, in Nehemiah chapter number 6, the chapter in which we're studying this morning, we find that in verse number 9, the last phrase of the verse says, Now therefore, O God, strengthen my hands. I mean, that's a short prayer, is it not? But he was a man that communed with the Lord. He was a man of prayer. And so when he's facing this situation and they're trying to weaken their hands, they're trying to discourage them and cause them to be feared so that the work would be hindered, we find that Nehemiah prays, Strengthen my hands. In verse number 14, we find that he",
      "context": "...apter number 4, again, the work being attacked and all that's going on. Notice in verse number 8 of Nehemiah 4, the Bible says, and conspired all of them together to come and to fight against Jerusalem and to h...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=1648",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 778.4999847412109,
      "text": "go back and read it in chapter number three and the work that's assigned and all the parts of the wall and what have you. But we find that the work is being attacked in the fourth chapter. They persevere through this. They're praying and seeking the face of God. But we find that as we look in Nehemiah 4, notice in verse number seven, it says, but it came to pass that when Sanballat and Tobiah and the Arabians and the Ammonites and the Ashtodites heard that the walls of Jerusalem were made up and that the breaches began to be stopped, then they were very rough and conspired all of them together to come and to fight against Jerusalem and to hinder it. Now, this enemy that's going to fight, you think about all of those that were named in verse number seven. This is a large host that's going to come against the work of God. The Bible says in verse number nine, nevertheless, we made our prayer unto our God and set a watch against them day and night because of them. And then I want you to notice what Judah says in verse number 10. And Judah said, the strength of the bearers of burdens is decayed. And there is much rubbish so that we are not able to build the wall. We find, as we begin to look at that word, when they make the statement about the strength",
      "context": "...persevere through this. They're praying and seeking the face of God. But we find that as we look in Nehemiah 4, notice in verse number seven, it says, but it came to pass that when Sanballat and Tobiah and the ...",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=778",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 843.6799774169922,
      "text": "number two, the prayer of God's people. What a great response to the enemy. To go to God in prayer. Sometimes I feel as if in many of our lives, throughout the history, I guess maybe, of our churches, sometimes we have not fully acknowledged the true power of prayer. And we find here that the Bible says in verse number four, after the mockery that we read of in the first three verses of Nehemiah 4, the Bible says, Hear, O our God, for we are despised. And turn their reproach upon their own head and give them for a prey in the land of captivity. I like how they prayed. I like how they responded to that which the enemy was saying and how the enemy was angry, of course, and mocking. We find that they pray to God and they say turn their reproach upon their own heads. Give them for a prey in the land of captivity. Notice in verse number nine, after the enemy conspired all of them together, according to what we read in verse number eight, we find that in verse number nine, the Bible says, Nevertheless, we made our prayer unto our God and set a watch against them day and night because of them. We find that they were steadfast in prayer. They understood the importance of seeking the face of God and understanding what God is capable of doing. We understand the many prayer promises",
      "context": "...the Bible says in verse number four, after the mockery that we read of in the first three verses of Nehemiah 4, the Bible says, Hear, O our God, for we are despised. And turn their reproach upon their own head ...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=843",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}