{
  "reference": "Philippians 2",
  "occurrences": [
    {
      "sermon_id": "V5wHGLUSkdE",
      "timestamp": 1620.8799743652344,
      "text": "what I do. I fast and I do this and I tithe and so on and so forth. And we find here that these that are gathered there, this group of people, they murmured and they said of Jesus, the Son of God, that He is gone to be guessed with a man that is a sinner. It's too bad that they did not recognize their own condition. It's too bad that they didn't show up on the streets of Jericho with the same desire that Zacchaeus had. Amen? The Bible says that Zacchaeus stood. I don't know if that means that he fell and had to stand up. I don't know. I don't want to read into it. I'm just saying the Bible says that he stood and said unto the Lord, Behold, Lord... Now, I want you to understand this manner in which Zacchaeus refers to the Lord Jesus Christ. He calls Him Lord. We find that as we have mentioned and we've dealt with in previous studies throughout the years of ministry here, the Bible tells us in the book of Philippians that God hath highly exalted Him speaking of Jesus in Philippians 2 and verse 9, given Him a name which is above every name, that in the name of Jesus, every knee should bow, things in heaven and things in earth and every tongue should confess that Jesus Christ is Lord. To the glory of God the Father. You know what Zacchaeus is doing here?",
      "context": "...the Bible tells us in the book of Philippians that God hath highly exalted Him speaking of Jesus in Philippians 2 and verse 9, given Him a name which is above every name, that in the name of Jesus, every knee shou...",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE&t=1620",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 795.47998046875,
      "text": "words, the names, of Christ that he did in the manner in which he did? We find that he's there in the synagogue, and Jesus, the name of Jesus, that name gives us the understanding that Jehovah is salvation, that God incarnate. These individuals, many of them, of course, they would have had a knowledge of the person Jesus. They would have known this historical figure, this one who we're reading about his life and ministry in these gospel accounts here this morning, and they would have had a certain awareness and knowledge of Jesus, but notice he says, this Jesus whom I preach unto you is Christ. The name Christ means the Anointed One, the Messiah, the Son of God. And so what was Paul doing there in Thessalonica is he was connecting the points, and he says in the Old Testament there were some prophecies with regard to the Messiah. This one Jesus that you're aware of, that you know, the one who lived a sinless perfect life, the one who went to the cross of Calvary, he was buried and he rose in victory, he, that Jesus, he is the Christ. He's the Messiah. He's the fulfillment. We find in Philippians chapter number 2 in verses 9 through 11 that the Bible gives us a wonderful truth with regard to the name of Jesus. The Bible says there in Philippians 2 in verse 9 that the name",
      "context": "...that the Bible gives us a wonderful truth with regard to the name of Jesus. The Bible says there in Philippians 2 in verse 9 that the name",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=795",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 870.3199768066406,
      "text": "he is the Christ. He's the Messiah. He's the fulfillment. We find in Philippians chapter number 2 in verses 9 through 11 that the Bible gives us a wonderful truth with regard to the name of Jesus. The Bible says there in Philippians 2 in verse 9 that the name of Jesus every knee, every knee should bow of things in heaven, things in earth, and things under the earth, and that every tongue, every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. Remember when the Apostle Paul, his name was Saul at the time of his conversion in Acts chapter 9, who art thou Lord? And then he says, Lord what wilt thou have me to do? We find for this desperate mother in this interaction between her and the Lord Jesus Christ, we find what she recognized first, that that Jesus is the Christ, that he is the Messiah. Notice next that she recognized that he was worthy of worship. She recognized that he was worthy of worship. Back in the account that Matthew gives us in chapter 15 in verse number 25, the Bible says, Then came she, notice, and worshipped him, saying, Lord help me. He is worthy of our worship. We ought to worship the Lord. We seek to worship him even here this morning. We've worshipped him through our singing and through our giving, and now as we open up the Scriptures, we seek to exalt and",
      "context": "...that the Bible gives us a wonderful truth with regard to the name of Jesus. The Bible says there in Philippians 2 in verse 9 that the name of Jesus every knee, every knee should bow of things in heaven, things in ...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=870",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}