{
  "reference": "Philippians 1",
  "occurrences": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 2766.3800048828125,
      "text": "times. They gave, they were a precious group of people to Paul. Paul says they're a precious group of people to him, prayed for them. I mean, the beginning of chapter number 1 of the book of Philippians is just powerful to see the relationship that they had, the love. And notice what Paul says to these believers in Philippians 1 and verse number 6, being confident. Don't you like that word? That's a good word. Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ, being confident. Listen, this morning, as we look at Nehemiah chapter number 6, and it happened 2,500 years ago, just about, and you think about the events and the situation that Nehemiah dealt with, do you see that things have changed somewhat, but the basics of the spiritual warfare that we deal with, it remains the same, 2,500 years. Oh, we have different technology now, thankfully we have some modern conveniences now, right? But the enemy, still working today in the same way that he was 2,500 years ago, and he wants to deceive you, and he wants to deceive me, and one thing that he uses is fear, fear. When we look at these promises of God that we've looked at in the New Testament, and we are mindful that over and over that God says to his people, fear not, be not afraid.",
      "context": "...ul to see the relationship that they had, the love. And notice what Paul says to these believers in Philippians 1 and verse number 6, being confident. Don't you like that word? That's a good word. Being confident ...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=2766",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1609.8800354003906,
      "text": "particular time in my life, I wasn't saved. I didn't know about that imagery. But I think about the truth of God's Word that He is the potter and I am the clay. Listen, He's doing something in my life. He's working in my life. He's working in your life. And listen, sometimes we don't like the surgical procedures that He uses in our life as He's working on us and He's removing some things and He's doing some things. We say, this doesn't feel good, but God's working in our lives. And He's developing us and He's causing us to grow. It's exciting. He's working. Notice in Philippians 1, in verse number six, the Bible says this. I believe, Brother Tony, you often mention this verse of scripture. I think you hold it dear in your heart. I've heard him use it very often over the years. But notice what the Bible says here in this verse of scripture, being confident. I like having confidence, don't you? Being confident of this very thing, that He which hath begun a good work in you. Who is that? That's God. We're His workmanship created in Christ Jesus. We're confident of this very thing, that He which hath begun a good work in you will perform it until the day of Jesus Christ. I'm so thankful that He's doing the work. Listen, He knows how to do the work that He's seeking to accomplish in our lives. He knows what He's doing.",
      "context": "...r lives. And He's developing us and He's causing us to grow. It's exciting. He's working. Notice in Philippians 1, in verse number six, the Bible says this. I believe, Brother Tony, you often mention this verse of...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1609",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1854.0799980163574,
      "text": "he says, based upon my understanding of the miracle of reconciliation, I'm not going to live for myself. I'm not going to live to meet my own desires and to follow my own agenda. No, I'm going to live for Christ because He died for me and He rose again. And my life, Lord, is Yours to control for me to live is Christ and to die is gain is what he says in the book of Philippians 1 and v. 21. And we find here that he understood the miracle, but he also understood the ministry. He understood that he had been entrusted with the ministry of reconciliation this morning. If you've been redeemed, if you've been reconciled to God, you're part of the us. The ministry of reconciliation. It says, \"...and hath given to us the ministry of reconciliation.\" We need to take this truth of the ministry of reconciliation, we need to take it personally. We need to understand that we personally are to be engaged in what he's dealing with here, this ministry of reconciliation. Notice in v. 19, to wit, he says this, as he's dealing with this truth of the ministry of reconciliation, he says that God was in Christ reconciling the world unto Himself, not imputing their trespasses unto them. See, the sin and the iniquity was poured upon Christ at His death on the cross. And it says here at the end of v. 19, \"...and hath committed...\" There's that word again.",
      "context": "...ord, is Yours to control for me to live is Christ and to die is gain is what he says in the book of Philippians 1 and v. 21. And we find here that he understood the miracle, but he also understood the ministry. He...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1854",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2384.1599731445312,
      "text": "is before us, and many of you know that 2 Corinthians 5 and verse number 15 is my life verse, where the Bible says, and that He died for all, that they which live should not henceforth live unto themselves. But unto Him which died for them and rose again. And we find that the Apostle Paul, as we would look at this passage of Scripture, I believe that the truths that we find in this passage that Paul was sharing of the miracle of reconciliation and the ministry of reconciliation, that these two truths result Paul did, in the Apostle Paul saying, I'm living for Christ. As I've quoted already, Philippians 1 and verse 21, for me to live is Christ, and to die is gain. See, I believe, as we trace the steps of Paul, that you see Paul recognized the miracle of reconciliation. He never got over the fact that he was reconciled to God. And he understood what salvation was as he grew, and he understood this truth of, yes, being redeemed and being justified, but being reconciled to God. That I was at enmity with God because of my sin, but now that relationship has been restored. I've been reconciled. It's a miracle. But not only did he recognize the miracle of reconciliation, I believe that Paul embraced the ministry of reconciliation. Why do we say that? Traces steps. Everywhere he goes, he's preaching Christ.",
      "context": "... truths result Paul did, in the Apostle Paul saying, I'm living for Christ. As I've quoted already, Philippians 1 and verse 21, for me to live is Christ, and to die is gain. See, I believe, as we trace the steps o...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2384",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}