{
  "reference": "Philippians 4",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1770.52001953125,
      "text": "He's working in us, how we learn more of who He is and what He's able to do, what a joy. Say, thank you, Lord. Thank you, Lord, for your work in my life. Let me say this, number nine, He provides for us. I'm so thankful for His provision. This evening, I'm not simply speaking of any sort of monetary provision, though we could understand that to be the case. But I want you to notice back in Ephesians 1, if you will, and I want you to see what the Word of God says here with regard to the provision in which my mind is thinking of this evening. We'll mention briefly Philippians 4 as He speaks about that monetary blessing. But notice here in Ephesians 1, the Bible says this in verse number three. Ephesians 1 and verse number three. Blessed be the God and Father of our Lord Jesus Christ, notice this, who hath blessed us with all spiritual blessings in heavenly places in Christ. And you think about the provision, the spiritual provision. You think about this. You couple that verse with 2 Peter 1 and verse number 3, and we read that just a few moments ago by way of introduction, but in 2 Peter 1 and verse number 3, the Bible says this, according as His divine power, notice what it says, hath given unto us all things that pertain unto life and godliness through the knowledge of Him",
      "context": "...re with regard to the provision in which my mind is thinking of this evening. We'll mention briefly Philippians 4 as He speaks about that monetary blessing. But notice here in Ephesians 1, the Bible says this in v...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1770",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1842.7600173950195,
      "text": "read that just a few moments ago by way of introduction, but in 2 Peter 1 and verse number 3, the Bible says this, according as His divine power, notice what it says, hath given unto us all things that pertain unto life and godliness through the knowledge of Him that hath called us to glory and virtue. I'm thankful for the provision of God, the spiritual provision. I'm thankful that God has provided us with the Word of God. I'm thankful that God has given us the Spirit of God who is our divine teacher. I'm thankful that God in His wisdom has blessed us with spiritual teachers and instructors, and He's equipped the church with pastors and teachers. Why? Because that's the way that God is providing for us spiritually. What a joy! What a blessing! In Philippians 4, we notice here in this portion of Scripture that Paul is communicating with these believers, and he's rejoicing in the goodness of God and the provision of God and how God used this church at Philippi to help in His time of need. He says this in v. 15, Now ye Philippians know also that in the beginning of the Gospel when I departed from Macedonia, no church communed it with me as concerning giving and receiving, but ye only. He's commending them for that. He says, for even in Thessalonica, ye sent once and again unto my necessity. They were mindful of the opportunity",
      "context": "...y? Because that's the way that God is providing for us spiritually. What a joy! What a blessing! In Philippians 4, we notice here in this portion of Scripture that Paul is communicating with these believers, and h...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1842",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 70.0,
      "text": "and this earth, and I believe the enemy wants us to quit and just turn back and not live for the Lord, but we understand this morning, even as we'll look at this message and then look at the message this evening, that all of us have personally experienced trials. And you might say this morning, Pastor, you have no idea, I'm in the midst of a trial right now, and I understand, a preacher of yesteryear said you're either in the midst of one, you've just come out of one, or there's one on the horizon, and for many we can say that's pretty true with regard to trials in our lives. We may not always respond properly in the midst of a trial. I'm sure that if you were to evaluate your life, if I were to evaluate my life, there are times in the midst of a trial that we do not respond appropriately, we do not respond biblically. We find, however, that God has given us in His Word the instruction that we are to rejoice always, not just to rejoice when things go well, when things are the way that we desire for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 and verse 24, this is the day the Lord hath",
      "context": "...ire for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 ...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=70",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 128.16000366210938,
      "text": "for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 and verse 24, this is the day the Lord hath made, we will rejoice and be glad in it. And it's a determination, it's being purposed in the fact that we're going to rejoice no matter what comes our way in that particular day, we're going to rejoice in the Lord. And we have to be intentional about it, we have to be purposed in it, and we find that God will bless. Not only have we been given instruction with regard to rejoicing through trials, but we find that as we study through the pages of this precious book that we can read the record that God has given us of many who have rejoiced in the midst of great trials. Their behavior in the midst of trials was appropriate and I would say was exemplary as we have the opportunity to be able to study those portions of Scripture. I know in my life that I will face more trials. The reality this morning is that I know in your life that you will face more trials. We will face trials collectively, corporately as a church, and we understand that we will face trials. The question really this morning is not, will I face a trial?",
      "context": "for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 ...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=128",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}