{
  "reference": "Proverbs 23",
  "occurrences": [
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 962.52001953125,
      "text": "my words, keep my commandments, and live. In fact, if you were to study the life of Solomon prior to the situation with all that took place with all of his wives and concubines and all of the idolatry that is recorded, you find that He walked with the Lord. You know, if you look at the first 20 years of the reign of Solomon as the King of Israel, and you look at the building of His own house, and then the building of the temple, and you see all that's taking place, you find in those passages of Scripture, what did Solomon ask for when the Lord appeared to him? Wisdom. Give me understanding that I might lead your people. I mean, you look at some amazing things and the influence of David and his life in his early years, and I'm thankful for that, but I want you to notice what Solomon says in Proverbs 23 and verse number 26. We'll get back to chapter number four here in just a moment, but I want you to see what is said here, and it's so powerful, and it's so important for us to understand, and it goes right along with what I mentioned in Deuteronomy chapter number six, the instruction that Moses gave to the fathers. Listen, you have to know the truth. You have to live the truth, and then you propagate the truth. You deliver the truth.",
      "context": "...s life in his early years, and I'm thankful for that, but I want you to notice what Solomon says in Proverbs 23 and verse number 26. We'll get back to chapter number four here in just a moment, but I want you to...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=962",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 1023.0800170898438,
      "text": "important for us to understand, and it goes right along with what I mentioned in Deuteronomy chapter number six, the instruction that Moses gave to the fathers. Listen, you have to know the truth. You have to live the truth, and then you propagate the truth. You deliver the truth. If you miss B, you have a hard time with C. If you're not living the truth, you have a hard time teaching the truth. Many times we'll be viewed as being hypocritical. Amen? Why? Because you're telling me to do something that you aren't doing yourself. We find in Proverbs 23 and verse number 26, the wise man says, my son, give me thine heart, but notice the rest of the verse, and let thine eyes observe my ways. I wonder how many times I've read that verse of Scripture, and I've wondered this truth I don't need to request of or grant permission to anybody to observe my ways. What do I mean by that? My ways are being observed anyway. My children in particular, they're observing my ways, and it must be that the message of my life is in line with the message of my lips. When I think about this truth spiritually, it causes me to rejoice greatly. If I could adopt the words of Brother Hummel, he said, I hear, I feel a preaching, a shout coming on, right? And the reality is that we have the written Word of God,",
      "context": "...al. Amen? Why? Because you're telling me to do something that you aren't doing yourself. We find in Proverbs 23 and verse number 26, the wise man says, my son, give me thine heart, but notice the rest of the ver...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=1023",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}