{
  "reference": "Proverbs 18",
  "occurrences": [
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 0.0,
      "text": "Looking at the names of God, the title of the message, Thy Name is Great, and that was part one. And now this evening, Thy Name is Great, part two. And Brother Jim, sorry I did not give you a note card with that, but it is Thy Name is Great, part two. We'll be looking here at Proverbs 18 and verse number 10 as a springboard again this evening. You'll remember that as we started this study of theology that we began in Jeremiah chapter number 10, and we've used verse number 6 in Jeremiah 10 as really an outline type of a verse for this passage of scripture where the Bible says, For as much as there is none like unto thee, O Lord, thou art great, and thy name is great in might. And so we've had the opportunity as we've studied theology to look at a number of God's attributes and to rejoice in His moral attributes and His natural attributes, and what a joy to have the privilege of knowing the God of the universe and that He has given us His word to reveal Himself to us. As we began looking at the names of God, we've made the note of understanding that God would use a number of names in the Old Testament to call Himself, and as He would use those names, He would be communicating with His people various aspects of His character.",
      "context": "...not give you a note card with that, but it is Thy Name is Great, part two. We'll be looking here at Proverbs 18 and verse number 10 as a springboard again this evening. You'll remember that as we started this st...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 85.31999969482422,
      "text": "us. As we began looking at the names of God, we've made the note of understanding that God would use a number of names in the Old Testament to call Himself, and as He would use those names, He would be communicating with His people various aspects of His character. And He would, of course, through the use of these names, He would highlight certain aspects of His character, of His attributes, and what a blessing it was for the people of God in the Old Testament as they would receive the truth as God would reveal Himself to them by these names and how it encouraged them and impacted them. And I said this last week, that as we today study the names of God, and we're looking at ten of them, we did five last week and we'll do five this evening, but as we look at these names of God that we have the opportunity just in like manner as those Old Testament saints to be encouraged as we are reminded of who our God is and how He has revealed Himself in Proverbs 18 and verse number 10, the Bible says, the name of the Lord is a strong tower, the righteous runneth into it and is safe. The psalmist said in Psalm 148 and verse number 13, let them praise the name of the Lord, for His name alone is excellent, His glory is above the earth and heaven.",
      "context": "...ent saints to be encouraged as we are reminded of who our God is and how He has revealed Himself in Proverbs 18 and verse number 10, the Bible says, the name of the Lord is a strong tower, the righteous runneth ...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=85",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}