{
  "reference": "Proverbs 29",
  "occurrences": [
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 234.3000030517578,
      "text": "with their interest in having a King. They desired to be like all the other people. They were so distinct and so unique that God was their King. They had a theocracy, but yet they wanted what the other nations of the world had. We find that Samuel was disappointed, that Samuel struggled greatly with that. But we find that in that rejection of the nation of Israel, rejecting God and changing the truth of a theocracy into a monarchy, that human history from that point forward has really plunged into the situation of having humans rule us or lead us from a government perspective. Now here's what I'm thankful for. God knew that. If you study the book of Deuteronomy, well before the people ever asked for a King, God gave instruction to Kings. Why would he give instruction to Kings if it wasn't his plan that there be Kings? Because he knew that man would not follow his plan and because he's the omniscient eternal God, he provided them with instruction and for that we can rejoice. But from that point in human history, we find that man has been ruled by humanity. Humanity has been ruled by humanity. Sometimes there have been good rulers. Sometimes there's been ruthless rulers. But consider this thought from Proverbs 29 in verse number two. When the righteous are in authority, notice what the Bible says, the people rejoice. But when the wicked beareth rule, the people mourn.",
      "context": "...there have been good rulers. Sometimes there's been ruthless rulers. But consider this thought from Proverbs 29 in verse number two. When the righteous are in authority, notice what the Bible says, the people re...",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=234",
      "channel": "Unknown",
      "publish_date": 20241027
    },
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 314.9800109863281,
      "text": "has been ruled by humanity. Sometimes there have been good rulers. Sometimes there's been ruthless rulers. But consider this thought from Proverbs 29 in verse number two. When the righteous are in authority, notice what the Bible says, the people rejoice. But when the wicked beareth rule, the people mourn. There's a contrast in this verse of Scripture between the righteous that are in authority versus the wicked that beareth rule. And we find that the contrast between the leadership has a profound impact on those that are being ruled. The Bible says that when the righteous are in authority, the people rejoice. But when the wicked beareth rule, that the people mourn. Understand some foundational truth as we consider the thought this morning, as we go through this thought this morning with regard to our role in understanding biblical truth. One day, Jesus will come back and set up his millennial kingdom. He'll literally rule and reign for a thousand years. He'll rule with a rod of iron. We as the people of God will have the privilege of being able to rule with him and to experience that truth. And we find that Revelation 20 verses one through six gives in a very condensed passage that truth. We can find references to the millennium all throughout the pages of Scripture. In fact, the Old Testament prophets speak much about the millennial kingdom of the Lord Jesus Christ. Until that time, however, we are governed by human rulers.",
      "context": "...there have been good rulers. Sometimes there's been ruthless rulers. But consider this thought from Proverbs 29 in verse number two. When the righteous are in authority, notice what the Bible says, the people re...",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=314",
      "channel": "Unknown",
      "publish_date": 20241027
    }
  ]
}