{
  "reference": "Proverbs 13",
  "occurrences": [
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 1914.300033569336,
      "text": "know, I get asked all the time, how can you memorize Scripture? And my consistent answer is W-O-R-K. It takes work to memorize the Word of God. It really does. And the older you get, or the more you try to memorize, the more work it takes. Just takes work. Sometimes we forget that, but he says, get wisdom, get understanding, labor for it, work for it. Notice what he says back in Proverbs 4, in verse number 13, take fast hold of instruction. I mean, does your mind, when you read these words, does it not give you some pictures, some images of what we're to do? Take fast hold of this instruction. He says this, notice, let her not go. Can I tell you that if you found truth in the Word of God, you better not let it go for anything. I don't care who comes down the road. I don't care what they try to teach. If you have the truth of the Word of God, you better hold on to it. Don't compromise on it. Don't change. No, no, let's search the Scriptures, let's understand what the Word of God says. And we find, he says, take fast hold here of instruction. Let her not go. Keep her, for she is thy life. In Proverbs 13, in verse number 1, the Bible says, a wise son heareth his father's instruction.",
      "context": "...ind, he says, take fast hold here of instruction. Let her not go. Keep her, for she is thy life. In Proverbs 13, in verse number 1, the Bible says, a wise son heareth his father's instruction.",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=1914",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 1986.9000396728516,
      "text": "search the Scriptures, let's understand what the Word of God says. And we find, he says, take fast hold here of instruction. Let her not go. Keep her, for she is thy life. In Proverbs 13, in verse number 1, the Bible says, a wise son heareth his father's instruction. But I want you to think about that truth and couple it with chapter 28, in verse number 7, whoso keepeth the law is a wise son. So now listen, if you look at Proverbs 13, in verse number 1, it says a wise son heareth his father's instruction. So we get some information about a wise son. What does he do? He hears the instruction. But we understand some more information about a wise son in Proverbs 28, in verse number 7, whoso keepeth the law is a wise son. So it's not just hearing, it's keeping, it's doing. We think about the application for us this morning. We see the truth that God's given us good doctrine. He's given us the written Word of God. He's given us the living Word of God. And how is it that we respond? Are we hearing the instruction? Are we understanding that this book is profitable? That I need the content of this book every day of my life? I don't just need the Bible when I have a problem. In fact, if we get a regular routine of getting into the Word of God,",
      "context": "...ind, he says, take fast hold here of instruction. Let her not go. Keep her, for she is thy life. In Proverbs 13, in verse number 1, the Bible says, a wise son heareth his father's instruction. But I want you to ...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=1986",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}