{
  "reference": "Proverbs 14",
  "occurrences": [
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 468.29998779296875,
      "text": "says this, righteousness exalteth a nation. Why is that? Because the truth that we just looked at in Psalm 11 and verse 7, the righteous Lord loveth righteousness. And so therefore, righteousness exalteth a nation. Why? Because God loves righteousness, because He is righteous. And the righteous Lord loveth righteousness. And when we understand this evening this truth of Proverbs 14 and verse 34, that righteousness exalteth a nation, sometimes we're led to think and have the idea that this means that it will have some monetary type of blessing. And that's really not the fullness of what's being dealt with here. Though it may be that there are some temporal blessings that are enjoyed and experienced by a righteous people, the reality is that we have the favor of God upon us. The Bible says that righteousness exalteth a nation. But notice the last part of Proverbs 14 and verse 34, but sin is a reproach to any people. God is righteous, sin brings reproach. The Bible says in Psalm 9 and verse number 17, this with regard to the subject of sin bringing reproach, it says, the wicked shall be turned into hell and all the nations that forget God. You say, well, that's strong language. That's the Bible. The Bible is strong. The Bible does confront. The Bible, you know, people talk about wanting to be politically correct. The reality is that I'd rather be biblically correct. Amen?",
      "context": "...ous. And the righteous Lord loveth righteousness. And when we understand this evening this truth of Proverbs 14 and verse 34, that righteousness exalteth a nation, sometimes we're led to think and have the idea ...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=468",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 620.9399738311768,
      "text": "evil. Listen, the reality is I understand that Isaiah is prophesying at the time in which he's prophesying, and I understand the content of his prophecies in his ministry, but the reality this evening is that truth from the Bible is applicable to nations in general and to people groups. And we find that truth in Proverbs 14 in verse 34, that righteousness exalted the nation, but sin is a reproach to any people. And we find here that the people of God, they were calling evil good and good evil. Do we not see it even in our own society? They call evil good and good evil. I wanna remind you of a couple of New Testament principles that are really based upon Old Testament record, and turn to the book of 2 Peter, if you will. In 2 Peter chapter number two, Peter is giving some instruction to these believers that are dealing with all sorts of adversity and difficulty, in fact, in chapter number two, he's dealing specifically with the false teachers, and he says this, that if there were false prophets then, you can be assured that there will be false teachers now. And we know it to be so. We can study the Old Testament, and we can read about the false prophets, and we can see about how there were many that would desire to hear the message from the false prophets. They wanted their ears tickled,",
      "context": "... from the Bible is applicable to nations in general and to people groups. And we find that truth in Proverbs 14 in verse 34, that righteousness exalted the nation, but sin is a reproach to any people. And we fin...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=620",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}