{
  "reference": "Proverbs 31",
  "occurrences": [
    {
      "sermon_id": "FZYKQS7fq1w",
      "timestamp": 602.0599975585938,
      "text": "The servant brings him to his mother, and she, the Bible says, that he, that son, was there with his mother and sat on her knees till noon. Maybe some of you here this morning, you can remember as a child receiving the care on the knees. of your mother. And the reality is that God many times, and I know this morning that this is not, the statements that I'll make this morning are not necessarily statements that are applicable in every case, and I understand that. But many times God has equipped mothers to have that caring heart and to demonstrate that care, and we see it here in this Shunammite woman. Not only do we see that she was caring, but number two, I note that she was generous. She was generous. You know, in our text of scripture, we see some evidence of this, but on the bulletin this morning, the Bible says who can find a virtuous woman for her price is far above rubies from Proverbs 31 and verse number 10. The only woman called virtuous throughout all of the scripture is actually Ruth. You find it in the book of Ruth. But you'll find here that as we look through Proverbs 31 with regard to generosity that is described in that text of scripture, that you'll see in 2 Kings chapter number 4 a lady that was generous.",
      "context": "...n this morning, the Bible says who can find a virtuous woman for her price is far above rubies from Proverbs 31 and verse number 10. The only woman called virtuous throughout all of the scripture is actually Rut...",
      "sermon_title": "Sermon FZYKQS7fq1w",
      "url": "https://www.youtube.com/watch?v=FZYKQS7fq1w&t=602",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "FZYKQS7fq1w",
      "timestamp": 663.5199966430664,
      "text": "the scripture is actually Ruth. You find it in the book of Ruth. But you'll find here that as we look through Proverbs 31 with regard to generosity that is described in that text of scripture, that you'll see in 2 Kings chapter number 4 a lady that was generous. The Bible tells us, we've noted already in verse number 8 with regard to the provision for the man of God, that she constrained him to eat bread. The Bible says, so it was that as oft as he passed by, he turned in thither to eat bread. Now we find that the Bible tells us that he passed that way regularly, and so this was not just a one-time occurrence. This was a regular occurrence, and she constrained him. She was generous with her resources, constrained him to eat bread, and as oft as he passed by, he turned in thither to eat bread. Her generosity does not stop there. We find that as we've read in verses 9 and 10, that she has this perception. She's a spiritual lady. She has this perception, and she says to her husband, this is a holy man of God. And she has this understanding of who the prophet of God is, Elisha, and notice what she makes this request in verse number 10, let us make a little chamber. We find that really the idea of a prophet's chamber, we refer to that still to this very",
      "context": "...ure is actually Ruth. You find it in the book of Ruth. But you'll find here that as we look through Proverbs 31 with regard to generosity that is described in that text of scripture, that you'll see in 2 Kings c...",
      "sermon_title": "Sermon FZYKQS7fq1w",
      "url": "https://www.youtube.com/watch?v=FZYKQS7fq1w&t=663",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}