{
  "reference": "Proverbs 30",
  "occurrences": [
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1788.0,
      "text": "that the Holy Spirit of God who lives within me, the Holy Spirit of God, if you've been saved this morning that lives within you, that he will guide you into all truth and that he will help you to be in that place where you're equipped, where you're complete and throughly furnished unto all good works. We mentioned on Wednesday evening, as we've studied through Psalm 37, a couple of different references where the psalmist says, do good. We ask the question this way, how do you know what's good? Who determines good? God alone. The only one who is good, He's the one that determines what is good. And we find this morning that the Bible is profitable, the Bible equips. But the truth of inspiration, we talked about the process of inspiration, the product of inspiration, and we think about the truth that it's profitable, that it equips us. But I want you to consider this morning that the truth of inspiration results in several things. Number one, it results in this, that this book, the Bible, is pure. It's pure. In Proverbs 30 and verse number 5, it's a precious verse that deals with the fact that the Bible is pure and also deals with the truth that we mentioned about verbal plenary inspiration. The Bible says this in Proverbs 30 and verse number 5, every word of God is pure. He is a shield unto them that put their trust in Him.",
      "context": "...n several things. Number one, it results in this, that this book, the Bible, is pure. It's pure. In Proverbs 30 and verse number 5, it's a precious verse that deals with the fact that the Bible is pure and also ...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1788",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1865.4400024414062,
      "text": "with the fact that the Bible is pure and also deals with the truth that we mentioned about verbal plenary inspiration. The Bible says this in Proverbs 30 and verse number 5, every word of God is pure. He is a shield unto them that put their trust in Him. The psalmist says this in Psalm 119 and verse number 140, thy word is very pure, therefore thy servant loveth it. Whew, man, it's a pure book. Everything that is contained within the pages of this Bible from Genesis 1-1 through Revelation 22-21, it is absolutely pure in everything that is contained therein. And we look at the Bible and we understand that the Bible says that all Scripture is given by inspiration of God. And because it is the word of God, it's pure. There are some that say they don't agree with what God's word is. So then they have difficulty with what God's word says because they don't agree with what God's word is. We talk about the word of God being pure, the Bible being pure. It is pure in all that it records. The record that is provided is reliable. It is trustworthy. How do we know what happened? We dealt with Hezekiah a couple of weeks ago. How do we know what Sennacherib and Rabshakeh really said? How do we know if it's true? How do we know if Hezekiah didn't just make something up, if Isaiah was just making something up?",
      "context": "...lso deals with the truth that we mentioned about verbal plenary inspiration. The Bible says this in Proverbs 30 and verse number 5, every word of God is pure. He is a shield unto them that put their trust in Him...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1865",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}