{
  "reference": "Proverbs 22",
  "occurrences": [
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 2255.780059814453,
      "text": "a Bible. He gave you a preacher here this morning to preach the Bible, but he's not gonna make you receive it. There's a difference between hearing and receiving. You ever had somebody, are you hearing me? Are you listening to me? They make a distinction between hearing and listening. You ever have somebody, you're giving them instruction, maybe a little child, and they're hearing. It's not that they're deaf. They can hear you. They're just not listening to you. Hearing and receiving. He says, hear, O my son, and receive my sayings. The years of thy life shall be many. I have taught thee in the way of wisdom. I have led thee in right paths. I wonder this morning if we could say that I have taught thee in the way of wisdom. I have led thee in right paths. I hope that we could. Whether you have children or not, to the people that you're influencing, I wonder could we make that statement, could we say that this morning, that I have fulfilled my responsibility. I have given the truth. I have no control over how you receive it or what you do with it, but I do have a responsibility to give it. Proverbs 22, a familiar verse of Scripture, in verse number six, the Bible says this. I believe it's one of my dad's favorite verses of Scripture. The Bible says in verse number six of Proverbs 22,",
      "context": "... control over how you receive it or what you do with it, but I do have a responsibility to give it. Proverbs 22, a familiar verse of Scripture, in verse number six, the Bible says this. I believe it's one of my ...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=2255",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 2326.5400390625,
      "text": "what you do with it, but I do have a responsibility to give it. Proverbs 22, a familiar verse of Scripture, in verse number six, the Bible says this. I believe it's one of my dad's favorite verses of Scripture. The Bible says in verse number six of Proverbs 22, train up a child in the way he should go. When he is old, he will not depart from it. Can I tell you this morning, there's this philosophy that's seeking to influence our culture that says something like this, just let your kids figure it out. Can I tell you that God said train them? He didn't give you this hands-off approach of, look, they're gonna just figure out life on their own. No, you've been given a God-given responsibility to train them. Can I tell you that training requires more than telling? Telling them is not training them. Training them takes work, takes commitment, dedication. It takes sweat, blood, tears to train someone. Here in the text, train up a child, notice, in the way he should go. Teaching them the ways of the Lord, teaching them what thus saith the Lord, teaching them what pleases God and what displeases God. By the way, what you do not know, you cannot teach. What you do not know, No, you cannot teach. If someone came in here and said, Pastor, can you teach me? And they named some language. I don't know any other language.",
      "context": "what you do with it, but I do have a responsibility to give it. Proverbs 22, a familiar verse of Scripture, in verse number six, the Bible says this. I believe it's one of my ...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=2326",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 2488.8000411987305,
      "text": "chapter number six, the verse of scripture that's there on your bulletin this morning that we quoted by way of introduction, and ye fathers, provoke not your children to wrath, but bring them up in the nurture and admonition of the Lord. This admonition, this command to bring them up. Listen, your kids, the young people in our church, they need direction. Can I tell you this morning, there is a world out there that is standing by waiting to give your kids all kinds of direction. And I would submit to you that most of that direction that they want to give your children is in direct opposition to the instruction that's given in this precious book. But they're waiting to do it. Oh, there are people online that are waiting to instruct your children. There are people that are ready, they're ready to give false teaching, false instruction, false worldviews. Wouldn't have a biblical worldview. Bring them up in the nurture and admonition of the Lord, the involvement that is required. There's a great connection between Proverbs 22 in verse six and Ephesians six and verse number four. As we look at the passage of scripture this morning from Judges, and we look in the chapter and the situation there between Manoah and his wife and receiving this announcement in Judges 13 with regard to the fact that though they had no children, that they would soon have a child. There's a recognition on the part of Manoah",
      "context": "...re and admonition of the Lord, the involvement that is required. There's a great connection between Proverbs 22 in verse six and Ephesians six and verse number four. As we look at the passage of scripture this m...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=2488",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}