{
  "reference": "Revelation 4",
  "occurrences": [
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 2395.2200317382812,
      "text": "house of God is the pillar and ground of truth. Amen? If I ever say we're gonna have a Super Bowl thing, just fire me. I mean, seriously. The reality is that when we approach a holy God, we approach him on his terms, and we approach him his way. He is a thrice holy God. He is to be reverenced. He's to be honored and to be glorified. He's to be worshiped. I don't know if you've ever heard somebody say, when I see God, you're not going to do anything but fall on your face. I want to know who...no, no, no, no, no, no. Change your thinking. You're going to simply fall on His face, in His presence, and He's worthy. Revelation 4, notice in verse number 10, the 4 and 20 elders represented of the church fall down before Him that sat on the throne and worship Him that liveth forever and ever. And cast their crowns before the throne, saying, Thou art worthy, O Lord, to receive glory and honor and power, for Thou hast created all things, and for Thy pleasure they are and were created. Chapter 5, and I saw in the right hand of Him that sat on the throne a book written within and on the back side, sealed with seven seals. And I saw a strong angel proclaiming with a loud voice, Who is worthy to open the book and to loose the seals thereof?",
      "context": "...o. Change your thinking. You're going to simply fall on His face, in His presence, and He's worthy. Revelation 4, notice in verse number 10, the 4 and 20 elders represented of the church fall down before Him that...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=2395",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 2809.5800170898438,
      "text": "someone join this morning. God, we're thankful. We've had baptism this year. We've had salvation this year. Lord, we just thank you for what you're doing and how you're working and we give you all the honor and all the glory for it's due unto your name. You are worthy. God we thank you for what you will do. We know that you have a plan. You've revealed much of your plan to us, though we don't know the timing for several things, we know you have a plan and God we look forward to one day being in your presence, worshipping you. We read that text of scripture in Revelation 4 and 5 and how our heart longs to be in your presence, to worship you, to see you face to face. God I pray that until that time you would help us to worship you in spirit and in truth here in our lives with the days that you give us, to worship you in our own personal daily lives, to worship you corporately and collectively. Lord, there'd be a generation that would come behind us that would see that our God is real and that he is worthy of worship and that he is the one that determines how we approach him. I pray God that you'd move and work as only you can and we'll give you the honor and glory for it. For it's in Christ's name we pray. Would you stand with me?",
      "context": "... look forward to one day being in your presence, worshipping you. We read that text of scripture in Revelation 4 and 5 and how our heart longs to be in your presence, to worship you, to see you face to face. God ...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=2809",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}