{
  "reference": "Revelation 3",
  "occurrences": [
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 231.0399932861328,
      "text": "thy salvation say continually, let God be magnified. Now we understand in verse number one that the psalmist is praying for deliverance. And oftentimes in the Old Testament, when you read the word salvation, it's speaking of deliverance in this particular setting, in this particular psalm. It's deliverance from those that are mentioned in verse number two, that sought the soul of David, that sought to hurt David, and he's praying for deliverance, make haste, O God, to deliver me. And as God would deliver, and we find that David gives testimony of God delivering him on a number of occasions, he says, let them, and let such as love thy salvation, say continually, let God be magnified. Notice what he says in verse five, but I am poor and needy. Do you recognize that you're poor and needy? Honestly. You know, sometimes if we're not careful, we get that Laodicean attitude. I'm increased with goods and have need of nothing. Right, that's what it says in Revelation 3. But notice what the psalmist says, I am poor and needy. Without thee, I can do nothing. Paul said, I know that in me that is in my flesh is full of no good thing. He says this, I know that I am what I am by the grace of God. And here, the psalmist says, I am poor and needy. Notice, he says again, this urgency that we read in verse number one, make haste unto me, O God.",
      "context": "...aodicean attitude. I'm increased with goods and have need of nothing. Right, that's what it says in Revelation 3. But notice what the psalmist says, I am poor and needy. Without thee, I can do nothing. Paul said,...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=231",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7-Svueb0C4s",
      "timestamp": 1215.5999755859375,
      "text": "provider. We need to praise Him accordingly. And again, for many of us, I know I've said years, I've said this over the years, and it's been a while probably since I've said it, but most of us do not have to pray for our daily bread. We really don't. Because God's blessed us. But when we understand the framework by which God has given us here, we pray for God's continued provision for our families, for our lives, for one another. And then we praise Him for His provision. Every day of my life, I pray and I thank God for a number of things. But as I think about God being my shepherd, I thank Him for His provision, His protection, and His presence. Every day. And I try to instruct and instill in our children, God has provided for us. We have a good God. And as we think about the framework of this passage of scripture, such a simple thought, but I hope that it would impact our perspective, that we'd be more aware of and recognize that God is our provider, and that we would praise Him accordingly. It's so easy to take things for granted. It's so easy to just be comfortable, increased with goods, as the church of the Laodiceans in Revelation 3. We have a good God. Prayer for provision. Let's pray. Father, we love You. We thank You so much for loving us.",
      "context": "...nted. It's so easy to just be comfortable, increased with goods, as the church of the Laodiceans in Revelation 3. We have a good God. Prayer for provision. Let's pray. Father, we love You. We thank You so much fo...",
      "sermon_title": "Sermon 7-Svueb0C4s",
      "url": "https://www.youtube.com/watch?v=7-Svueb0C4s&t=1215",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7-Svueb0C4s",
      "timestamp": 1288.4000244140625,
      "text": "accordingly. It's so easy to take things for granted. It's so easy to just be comfortable, increased with goods, as the church of the Laodiceans in Revelation 3. We have a good God. Prayer for provision. Let's pray. Father, we love You. We thank You so much for loving us. We do thank You for Your provision. We thank You for just, Lord, as we look at our lives and see Your hand. God, we just want to thank You this evening and praise You. Lord, we know that there are brothers and sisters in other parts of this nation, other parts of the world, that do not have the same level of provision that we may enjoy and experience. God, we rejoice in how You take care of them as well. The testimony of David in Psalm 37 and verse 25. Father, I pray this evening that You would help us to be mindful, regularly mindful, of the truth that You are our provider and that we would praise You accordingly. We do pray that You'd bless our time of prayer. We thank You for the privilege. I pray that You would move mightily and we'll thank You for it. In Christ's name we pray. Amen.",
      "context": "...nted. It's so easy to just be comfortable, increased with goods, as the church of the Laodiceans in Revelation 3. We have a good God. Prayer for provision. Let's pray. Father, we love You. We thank You so much fo...",
      "sermon_title": "Sermon 7-Svueb0C4s",
      "url": "https://www.youtube.com/watch?v=7-Svueb0C4s&t=1288",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "kZ4u2Ljc7cU",
      "timestamp": 1262.1999969482422,
      "text": "dispute with with the devil and he did not bring against him a railing accusation but simply said the Lord rebuke thee oh what great lesson for us from that example in the book of Jude I want you to think of the Church of the Laodiceans turn to the book of Revelation if you will and this will be the last example that we look at of the destruction and the deception of pride and then I'm going to give you some verses with regard to the remedy how is it that we can ensure that we do not become deceived by the pride of our own heart we'll look at some verses here in just a moment but look in Revelation 3 we look at the Church of the Laodiceans it's very interesting if you couple this verse with where we started in the book of Obadiah and I mentioned as we look there at the at the book of Obadiah in that third verse how that they said this they said who shall excuse me in his heart who shall bring me down to the ground notice what is said in Revelation 3 because thou sayest who says this is the Church of the Laodiceans correct contextually you understand the the letter to the Church of the Laodiceans begins in verse number 14 and God is speaking to the church and it says because thou sayest the Church of the Laodiceans the the members of that",
      "context": "... deceived by the pride of our own heart we'll look at some verses here in just a moment but look in Revelation 3 we look at the Church of the Laodiceans it's very interesting if you couple this verse with where w...",
      "sermon_title": "Sermon kZ4u2Ljc7cU",
      "url": "https://www.youtube.com/watch?v=kZ4u2Ljc7cU&t=1262",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}