{
  "reference": "Revelation 20",
  "occurrences": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 2007.8600006103516,
      "text": "throughout my day to be able to identify, to recognize the enemy and to see how the enemy would like to hinder the work that You're doing in and through me. We learn how to resist. Number three this morning, I believe that we need to learn how to rejoice in the work of the Lord. We notice verses 15 and 16. I would say this as we would look at these verses. Thinking about the truth of rejoicing, I am so thankful for the truth that greater is He that is in you than he that is in the world. We are on the winning side. Have you read the book of Revelation? We win! Amen? You say, it's not looking so good. Look to Jesus. Don't worry about all this craziness. They're trying to hinder you. They're trying to stop you. They're trying to hinder the work of God. Say, listen, we're on the winning side. We win! Jesus is the victor. Amen? Satan is already defeated. He already knows his demise. Revelation 20 and verse 10, that old serpent, he's cast in the lake of fire and he will suffer and be tormented day and night forever and ever. Amen? Curtis Hudson used to sing often. I never had the privilege of meeting or being in a meeting with Dr. Curtis Hudson. In fact, he went home to be with the Lord when I was just a little infant. But I read many things about him",
      "context": "...ng side. We win! Jesus is the victor. Amen? Satan is already defeated. He already knows his demise. Revelation 20 and verse 10, that old serpent, he's cast in the lake of fire and he will suffer and be tormented d...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=2007",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 2217.9400024414062,
      "text": "that the second death has no power over you. The reality is that we've said many times over the years to be born once is to die twice, but to be born twice is to die but once. We understand that there's a physical birth and there's a physical death. There is a spiritual birth and there is a spiritual death. The Bible speaks of all of those things. And if you're born just once, you only have a physical birth, then you'll die twice. You'll die a physical death and you'll die a spiritual death. However, we can rejoice greatly this evening that because He promised to save us and all that we mentioned that He does as we walk with Him and the work that He does through us, that we know that He said the second death has no power over us because I've been born physically and I've been born spiritually. And I'm only gonna ever die a physical death. Notice in Revelation 20, in verse number six, the Bible says, blessed and holy is he that hath part in the first resurrection. On such, the second death hath no power. Aren't you thankful for that? The Bible tells us at the end of this chapter in Revelation 20, verses 11 through 15, it gives us the picture, the event of that great white throne judgment where death and hell are cast into like a fire. This is the second death,",
      "context": "... physically and I've been born spiritually. And I'm only gonna ever die a physical death. Notice in Revelation 20, in verse number six, the Bible says, blessed and holy is he that hath part in the first resurrecti...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=2217",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 2288.9400024414062,
      "text": "Aren't you thankful for that? The Bible tells us at the end of this chapter in Revelation 20, verses 11 through 15, it gives us the picture, the event of that great white throne judgment where death and hell are cast into like a fire. This is the second death, according to verse number 14 of Revelation 20. But those of us that have been born again, those of us that have placed our faith and trust in Jesus Christ, remember what Jesus said to Nicodemus in John chapter number three, He comes to Jesus by night. He says, I know, we know that you're a teacher sent from God and Jesus said, except you be born again, you cannot see the kingdom of God. Marvel not that I said unto thee, you must be born again. How is it that I could be born again, right? Nicodemus is an understanding. And we understand that the second birth, being born again is salvation. It's that moment that we trust Christ as our savior. I have a birthday and it's my physical birthday and I'm mindful of that date, July 15th, the day in which I entered into this world physically. But of really greater significance in my mind is the date August 31st, because that's when I was born again. It was 17 years later, but I'm thankful for that date when I was born again. And we understand this evening all of those things",
      "context": "Aren't you thankful for that? The Bible tells us at the end of this chapter in Revelation 20, verses 11 through 15, it gives us the picture, the event of that great white throne judgment where...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=2288",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 2565.4400482177734,
      "text": "glorified body yet but He's promised that He's going to give us one and I'm so thankful for that wonderful promise. Let me close with these two thoughts this evening. Number 14, if you're taking notes, He's promised that we will reign with Him, that we'll reign with Him. I purposefully did not read all of Revelation 20 in verse number 6 but if you draw your attention back to that verse of Scripture when it speaks about the fact that the second death hath no power over us and how we can rejoice in that truth, verse 6 concludes by saying this, but they, those that are blessed and holy because they're part of the first resurrection, those of us that have trust that Jesus Christ is our personal Savior, they shall be priests of God and of Christ and shall reign with Him a thousand years. That's wonderful. I mean, I don't know all that we're gonna do but it doesn't really matter. We're gonna reign with Him. He's promised us this. Listen, our future is bright. Amen? I mean, think about all that we mentioned from salvation. He saved us but then all that He's doing in and through us and how He's working and He's empowered us and sin has no dominion over us and all those things that we've mentioned and then to understand that He's coming back for us. He's gonna give us this glorified",
      "context": "...promised that we will reign with Him, that we'll reign with Him. I purposefully did not read all of Revelation 20 in verse number 6 but if you draw your attention back to that verse of Scripture when it speaks abo...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=2565",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 2433.060064315796,
      "text": "by works of righteousness which we have done, but according to His mercy.\" He saved us. \"...by the washing of regeneration and renewing of the Holy Ghost, but God who is rich in mercy.\" He's rich in mercy. This morning I'm thankful that someone told me that God was merciful. I see in the passage of Scripture this morning in Numbers 14 how Moses recalls this and he stands as an intercessor between the people and God. This morning, I want to see people saved. You know, it grieves my heart to be very transparent with you this morning. It grieves my heart when I hear Christian people say and desire for God's judgment upon lost people. I hear it and it grieves my heart. Why? Because I've read Revelation 20. And when you read Revelation 20, you read about that second death, to be cast in a lake of fire. You can't wish that on anybody. As a child of God and as a recipient of God's mercy, it ought never cross our lips. God judged those people. I've always said God saved those people. God, just as you've been merciful to me, would you be merciful to them? Listen, I can't pray for them to be saved, but God's called us to go give them a message. And it grieves my heart that there are believers that have that opinion of certain peoples around the world, whether they're of a different religion or whatever the case might be.",
      "context": "...sire for God's judgment upon lost people. I hear it and it grieves my heart. Why? Because I've read Revelation 20. And when you read Revelation 20, you read about that second death, to be cast in a lake of fire. Y...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=2433",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2152.480010986328,
      "text": "Corinthians 5, really Paul's dealing with a completely different subject. That of the judgment seat of Christ or the bema seat of Christ. And we find that he makes an interesting statement in verse 11 of that text of Scripture that I believe is pertinent to our study this morning with regard to the ministry of reconciliation. He says, knowing therefore the terror of the Lord, we persuade men. We persuade men, but we remain manifest unto God and I trust also remain manifest in your conscience. And I think about this truth there of 2 Corinthians 5 in verse 11 that we have an understanding, we know therefore the terror of the Lord, that we persuade men. Have you ever read Revelation 20? You read in verses 11-15 of the great white throne judgment. It will happen. Listen, it's a sad thing that people are dying from this COVID-19. We find that we're praying and we're asking God to work and to have doctors with wisdom with regard to how to treat patients and all of those things. And you think about all of the efforts that are going forth in order to preserve, to save life, and we're applauding them and we're thankful for their efforts and their attempts, but we understand that there is, as of the point of end to man, wants to die. But after this, the judgment. You know that every day globally, 150,000 people die. Every day, globally. That's about the number",
      "context": "...n understanding, we know therefore the terror of the Lord, that we persuade men. Have you ever read Revelation 20? You read in verses 11-15 of the great white throne judgment. It will happen. Listen, it's a sad th...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2152",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}