{
  "reference": "Romans 10",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 671.3200302124023,
      "text": "And if you want to know God, you need to know the Bible. And I'm thankful that God has preserved it for us, and He's promised that it will work, the power of His Word. He said that His Word is quick and powerful and sharper than a two-edged sword. He said that His Word was profitable. All Scripture is given by inspiration of God, and it's profitable, it works, and I'm so thankful this evening for that truth. As we consider the foundation of these promises that we'll look at quickly this evening, I want you to understand that each promise that we look to this evening is found in this book, and thus the foundation of understanding the preservation and the power of God's Word. He promises this. He promises to save us. He promises to save us. I'm going to begin, as I mentioned, kind of the logic of these promises of really beginning at salvation. What a great song that we sang tonight, when heaven came down and glory filled my soul, in understanding salvation and the day in which we trust that Christ is our Savior. Romans 10 and verse number 13 is a verse of Scripture that many of us have committed to memory, for whosoever shall call upon the name of the Lord shall be saved. That's a promise, isn't it? And what a joy. I don't know the number of people that I've told over the years that verse of Scripture",
      "context": "...filled my soul, in understanding salvation and the day in which we trust that Christ is our Savior. Romans 10 and verse number 13 is a verse of Scripture that many of us have committed to memory, for whosoever...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=671",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "timestamp": 1698.3000183105469,
      "text": "is only through the Lord Jesus Christ, there's only one way to be saved. As I mentioned a few moments ago, we understand that what they must hear is the gospel of Jesus Christ. The Bible says, for whosoever shall call upon the name of the Lord shall be saved. That's a wonderful promise of God's word in Romans 10 and verse 13. But the Bible continues and says, how then shall they call on him in whom they have not believed? They're not going to call on him if they don't believe him. And then it says, how shall they believe in him whom they've not heard? How shall they hear without a preacher? That's what the Bible says. How shall they preach except they be sent as it is written, how beautiful are the feet of them that preach the gospel of peace and bring glad tidings of good things, but they've not all obeyed the gospel for Isaiah saith, Lord, who hath believed our report? So then faith cometh by hearing and hearing by the word of God. If you take that passage of scripture in Romans 10 and verse 13 through 17, we understand the great importance that is before us of being able to preach the word of God with boldness, to preach the gospel. The world in which we're living, they need to be saved. The answer is Jesus.",
      "context": "...er shall call upon the name of the Lord shall be saved. That's a wonderful promise of God's word in Romans 10 and verse 13. But the Bible continues and says, how then shall they call on him in whom they have n...",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg&t=1698",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "timestamp": 1763.9400024414062,
      "text": "passage of scripture in Romans 10 and verse 13 through 17, we understand the great importance that is before us of being able to preach the word of God with boldness, to preach the gospel. The world in which we're living, they need to be saved. The answer is Jesus. But in order for them to be saved, they need to have some of us that have some boldness. That boldness needs to come from the Lord Jesus Christ. Listen, I'm not going to be bold in my own power. I'm not, neither are you. We have the power of the Holy Spirit of God. We notice how they responded. How do we respond in times of great adversity? Do we remember that God is the creator, that He's our helper? To respond in faith, believing that He is able. What is our request? request. The request of the disciples is not to eliminate the opposition. Sometimes we think that'd be great, but the request of the disciples is to empower His people, that we may speak Thy word. How with boldness. Notice, finally this morning, what they received. In verse 31, we read the response to the prayer that was prayed by these that were gathered together. And the Bible tells us when they had prayed, the place was shaken where they were assembled together. It tells us that they were filled with the Holy Ghost. And",
      "context": "passage of scripture in Romans 10 and verse 13 through 17, we understand the great importance that is before us of being able to prea...",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg&t=1763",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}