{
  "reference": "Romans 5",
  "occurrences": [
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 2338.3599853515625,
      "text": "would face, that we understand this morning our place and our position in Christ. That we'd understand there's nothing else that I need. That I find my acceptance in Him, in Christ. That I find and understand this morning that I am complete in Him. It gives me a peace that passeth all understanding. It gives me a rest that is almost beyond description. This morning, as we think about the subject of peace, we understand that there's only one way to make peace with God. According to Romans 5, in verse 1, therefore being justified by faith, we have peace with God through our Lord Jesus Christ. It's good for us to have peace with God, but there's only one way to have peace with God is through the Lord Jesus Christ. Salvation. And these believers are being encouraged. Ye are complete in Him. Oh, you've made peace with God and now you have the peace of God that passeth all understanding. This morning, this year, in 2021, as we are reminded throughout the year, complete in Him, complete in Christ, as we sing the theme song... complete in thee, that we'd understand that our identity and our acceptance is in Christ. Many times in life people seek to describe themselves, to identify themselves, and I wonder as the people of God, you know the best way for us to understand our identity first and foremost is that we are children of God.",
      "context": "... the subject of peace, we understand that there's only one way to make peace with God. According to Romans 5, in verse 1, therefore being justified by faith, we have peace with God through our Lord Jesus Chri...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=2338",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 787.3999938964844,
      "text": "number 3 The Bible says in verse number 35 the father loveth the Son and hath given all things into his hand He that believeth on the Son hath everlasting life And he that believeth not the Son shall not see life, but the wrath of God abideth on him Paul says this that one died for all that's the Lord Jesus Christ his substitutionary death Then we're all dead and that he died for all that they which live Should not henceforth live unto themselves, but unto him which died for them and rose again We find the miracle of reconciliation. See there's a problem The problem is sin notice what Paul says in Romans chapter number 5 That sin causes us to be at enmity with God and if we find that we're dead in our sins and our trespasses in Romans chapter number 5 a wonderful passage of Scripture dealing with Justification we find that the only way to be justified To have peace with God is through our Lord Jesus Christ. It tells us that in Romans 5 in verse number 1 Therefore being justified by faith. We have peace with God through our Lord Jesus Christ Notice verse number 8 it says this but God commendeth his love toward us and that while we were yet sinners Christ died for us much more than being now Justified how by his blood we shall be saved from wrath through him for if when we were enemies",
      "context": "...ly way to be justified To have peace with God is through our Lord Jesus Christ. It tells us that in Romans 5 in verse number 1 Therefore being justified by faith. We have peace with God through our Lord Jesus...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=787",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 869.1000061035156,
      "text": "Christ Notice verse number 8 it says this but God commendeth his love toward us and that while we were yet sinners Christ died for us much more than being now Justified how by his blood we shall be saved from wrath through him for if when we were enemies We were reconciled to God by the death of his Son much more being Reconciled we shall be saved by his life and not only so but we also joy in God through our Lord Jesus Christ by whom we have now received The atonement this is a miracle the miracle of reconciliation see the problem was sin The fact that we were born sinners We find that in verse number 12 of the same passage of Scripture that's before us in Romans 5 The Bible says wherefore as by one man sin entered into the world We find that Paul is giving Reference back to the event that is recorded in Genesis chapter number 3 when sin entered into the world in the Garden of Eden with Adam and Eve Taking of that forbidden fruit and the Bible says and death by sin And so death passed upon all men for that all have sinned the miracle of reconciliation It starts with a problem the problem is sin, but then we see the provision the provision is that substitutionary death of our Lord and Savior Jesus Christ on the cross of Calvary",
      "context": "...e born sinners We find that in verse number 12 of the same passage of Scripture that's before us in Romans 5 The Bible says wherefore as by one man sin entered into the world We find that Paul is giving Refer...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=869",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}