{
  "reference": "Romans 1",
  "occurrences": [
    {
      "sermon_id": "zo6IdkJY-nY",
      "timestamp": 434.0799865722656,
      "text": "I want you to go back to the book of Romans, if you will, and look in Romans in chapter number one. And as the Apostle Paul is addressing these believers in Rome, we find that he again would give them this encouraging word with regard to the subject of intercessory prayer. As we look at these first set of verses, we will understand, when we consider the example of intercessory prayer, we'll understand how Paul is praying for others. Notice in verse number nine of Romans 1, the Bible says, well, let's look at verse number eight. First, I thank my God through Jesus Christ for you all, that your faith is spoken of throughout the whole world. For God is my witness, whom I serve with my spirit in the gospel of his Son, that without ceasing I make mention of you always in my prayers. Now, if you were one of these believers in Rome and you receive this letter that the Apostle Paul has sent, the word of God, as we understand that this book is inspired, and you receive this letter and you receive this word, and Paul says that without ceasing I make mention of you always in my prayers. Paul's praying for these believers in Rome. Turn to the book of Ephesians, if you will. Ephesians chapter number one. And I want you to note, really, there's a couple of passages in the book of Ephesians that we could look",
      "context": "...ntercessory prayer, we'll understand how Paul is praying for others. Notice in verse number nine of Romans 1, the Bible says, well, let's look at verse number eight. First, I thank my God through Jesus Christ...",
      "sermon_title": "Sermon zo6IdkJY-nY",
      "url": "https://www.youtube.com/watch?v=zo6IdkJY-nY&t=434",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 2228.1399536132812,
      "text": "want to help God on how he can answer my prayers. I'm being transparent with you this morning. And by the way, I think it's important that each of us would be transparent with God. Because we need to get a grasp of this simple phrase, Thy will be done. And how critical it is in seeing your prayers and my prayers answered. Thy will be done. It recognizes that his way, his will is superior, but it reveals submission. How submitted are we to God? How much do we resist God's will? God has a plan for the ages, by the way. You understand that. Amen? Right now, God's plan specifically is with the church. We're in what would often be referred to as the church age. You tracking? God has a plan. God has a will. You know what God's plan and God's will is for the church age? That the gospel of the Lord Jesus Christ will be preached to the entire earth. That's God's plan and God's will. In a summary statement. Amen? And God tells us in his word that the gospel... Paul says, I am not ashamed. We heard the kids last week on Sunday morning do such a wonderful job of quoting the verse in Romans 1.16. For I am not ashamed of the gospel of Christ. Why? For it is the power of God unto salvation to everyone that believeth. To the Jew first and also to the Greek. See, because why?",
      "context": "...amed. We heard the kids last week on Sunday morning do such a wonderful job of quoting the verse in Romans 1.16. For I am not ashamed of the gospel of Christ. Why? For it is the power of God unto salvation to...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=2228",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 2310.1399536132812,
      "text": "Sunday morning do such a wonderful job of quoting the verse in Romans 1.16. For I am not ashamed of the gospel of Christ. Why? For it is the power of God unto salvation to everyone that believeth. To the Jew first and also to the Greek. See, because why? Well, because God's plan for the church age is that all people will be saved. That we proclaim the gospel to all the world. Why do we support missionaries? Why do we send an offering so that Brother Cottle and his wife can go to Africa to go on a missions trip this summer? Because we are given the task in this era to preach the gospel to every creature. God has a plan. The church age is going to end one day. The trumpet of the Lord shall sound. Aren't you looking forward to that? The dead in Christ? Going to be raised. Then we which are alive and remain, I hope I'm one of those. So be caught up to meet the Lord in the air. So shall we ever be with the Lord. Amen? Hallelujah. The rapture. There's going to be a tribulation. You know what God's doing in the tribulation? He's dealing with Israel again. He's dealing with Israel. Because it's God's plan. It's God's plan. You're not going to change God's plan. It doesn't make any sense to resist God's plan. Because God's plan is going to come to pass.",
      "context": "Sunday morning do such a wonderful job of quoting the verse in Romans 1.16. For I am not ashamed of the gospel of Christ. Why? For it is the power of God unto salvation to...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=2310",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 220.0,
      "text": "through the journeys the missionary journeys as we'd often refer to them as in the book of Acts and you'll find how that the missionaries would arrive to a particular city a particular region you see how that the gospel preached change lives and the power of the gospel those That the cities that would be changed and transformed and just the the way in which the Lord would work mightily I believe for us this morning that each and every one of us that we could stand If we've been saved and we can stand and declare the power of the gospel in our own very lives How he changed us what he's done in and through us as we look at Romans 1 in Verses 14 through 16 this morning. We really are reading the heart of the Apostle Paul as he's beginning to write to these believers in Rome and he shares with them some important truth and I mentioned that our theme for our conference this year will begin on Saturday with the Dinner and then Sunday Monday Tuesday Wednesday the theme of our conference is from Romans 1 16 I am NOT ashamed. I am NOT ashamed of the gospel Why because Paul understood what the gospel is he understood that the gospel is powerful and as we look at this Passage of Scripture. It is a familiar passage of Scripture",
      "context": "...f the gospel in our own very lives How he changed us what he's done in and through us as we look at Romans 1 in Verses 14 through 16 this morning. We really are reading the heart of the Apostle Paul as he's b...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=220",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 281.79998779296875,
      "text": "of our conference is from Romans 1 16 I am NOT ashamed. I am NOT ashamed of the gospel Why because Paul understood what the gospel is he understood that the gospel is powerful and as we look at this Passage of Scripture. It is a familiar passage of Scripture I want to make three observations this morning and I trust that as we consider these Aspects of the life and ministry of the Apostle Paul that this morning we would be challenged Through these verses notice in verse 14 Paul says this I am debtor both to the Greeks and to the barbarians Both to the wise and to the unwise So as much as in me is I am ready to preach the gospel to you that are at Rome also For I'm not ashamed of the gospel of Christ for it is the power of God unto salvation to everyone that believeth to the Jew first and also to the Greek as We look at this passage of Scripture. I'd like for you to consider first of all The perspective of the Apostle Paul as we look at verse number 14 We begin to see his perspective and as we would consider his perspective We would understand that the phrase and we'll use one phrase from each verse as we look through our message this morning We would see that his perspective is summarized in these three words in first number 14. I am",
      "context": "of our conference is from Romans 1 16 I am NOT ashamed. I am NOT ashamed of the gospel Why because Paul understood what the gospel is ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=281",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 827.3800201416016,
      "text": "privilege, but we have this treasure, the Gospel of Jesus Christ. Paul, in between the two verses that we've read here in 2 Corinthians 4 and verse three and verse number seven, we find that he mentions about the work of the enemy to keep blinded the minds of those that have not received the Gospel of Jesus Christ. And we understand that the enemy is alive and active and he's working. This morning, as Paul says here in verse number five, we preach not ourselves, but Christ Jesus the Lord and ourselves your servants for Jesus's sake. We don't preach ourselves. I often say to individuals as I have the privilege of sharing the Gospel with them, I'm not asking you to come to our church. I'm not asking you to give to our church. I'm not asking you to do any. I'm just trying to share with you the truth of what Jesus Christ did for you because one day you're going to die. Are you ready? Are you ready? See, I am dead hurt. Notice what he says in 1 Thessalonians 2. We'll move on to verse number 15 in Romans 1 here, but look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica",
      "context": "... See, I am dead hurt. Notice what he says in 1 Thessalonians 2. We'll move on to verse number 15 in Romans 1 here, but look at what he says here in 1 Thessalonians 2. I made the statement by way of introducti...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=827",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 1393.5400390625,
      "text": "our distinction is that the Bible the Word of God is the sole authority for faith and practice. It's something that we just kind of some traditions that we just follow like in a in a wrong manner but we're seeking to follow the Word of God. What sayeth the Lord? And if we're going to give truth if we're going to be ready to give the gospel as Paul says in Romans 1 and verse number 15 we we have to have some preparation. How is it that I'm going to give the gospel? What answer am I going to give to someone when that opportunity presents itself? I'm mindful of Ezra in the Old Testament in Ezra 7 and verse number 10 if you want to jot that reference down but Ezra says in that passage of Scripture that he prepared his heart to seek the law of the Lord and to do it and to teach in Israel statutes and judgments. What a powerful verse of Scripture. Ezra he says that he he was prepared as we would see that he understood that he sought the law of the Lord to do it and then to teach in Israel statutes and judgments the time of his preparation preceded the opportunity that was afforded him. We find that if you were to read throughout Ezra 7 that's verse number 10 if you read the remainder of chapter 7 and really get into chapter number 8 you see",
      "context": "...ord? And if we're going to give truth if we're going to be ready to give the gospel as Paul says in Romans 1 and verse number 15 we we have to have some preparation. How is it that I'm going to give the gospe...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=1393",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 1589.1400451660156,
      "text": "that? I told you the story about the man at the bank when I said I was absolutely wonderful he says you're lying nobody's wonderful huh I said you ain't met mr. Don yet because he's been in the hospital bed and he's absolutely wonderful amen but he told me I was lying that's what he told me I promise you I was in Wells Fargo right over here on Germantown he said you're lying nobody's wonderful I said well I'm going to heaven man I am wonderful and then he got all kinds of sideways he's like are you dying I don't think so but one day I'm going to amen and so are you what I'm suggesting to you this morning is that I'm not perfect at it there are more times when I fail than I'm doing what I'm supposed to do but that were mindful that were purposed and understanding I am indebted I have been given the gospel of Jesus Christ it's changed my life and now I have been entrusted with I better be ready to give it notice in verse number 16 back in Romans 1 we consider the perspective of the Apostle Paul we consider the preparation of the Apostle Paul and now I want you to consider the passion of the Apostle Paul in Romans 1 in verse 16 he says for I am not ashamed of the gospel of Christ for it is the power of",
      "context": "...e and now I have been entrusted with I better be ready to give it notice in verse number 16 back in Romans 1 we consider the perspective of the Apostle Paul we consider the preparation of the Apostle Paul and...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=1589",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 1668.7000427246094,
      "text": "perspective of the Apostle Paul we consider the preparation of the Apostle Paul and now I want you to consider the passion of the Apostle Paul in Romans 1 in verse 16 he says for I am not ashamed of the gospel of Christ for it is the power of God unto salvation to everyone that believeth to the Jew first and also to the Greek perhaps this morning you've not yet recognized this but I would submit to you and I believe it to be the case that we're currently living in a society in which they want you to be ashamed of believing the gospel they don't want you to go talking about what you believe they want you to be ashamed of the gospel of Jesus Christ that's the society that we're currently living in but Paul says I'm not ashamed I am not ashamed as you study the New Testament you'll find that Paul had a passion to reach people with the gospel of Jesus Christ he understood what was at stake and he personally embraced the responsibility we use the the phrases in verse 14 I am debtor in verse 15 I am ready here I am not ashamed Paul as he would speak about in this very book the book of Romans when he would speak about his brethren other Jewish individuals he would speak about the way in which he had heaviness and continual sorrow in",
      "context": "...e preparation of the Apostle Paul and now I want you to consider the passion of the Apostle Paul in Romans 1 in verse 16 he says for I am not ashamed of the gospel of Christ for it is the power of God unto sa...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=1668",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2501.860023498535,
      "text": "that was profitable unto you but have showed you and have taught you publicly and from house to house testifying both to the Jews and also to the Greeks repentance toward God and faith toward our Lord Jesus Christ. Skip down in verse number 31 if you will. Therefore watch and remember that by the space of three years I ceased not to warn everyone of everyone night and day with tears. Paul says I kept back nothing that was profitable unto you. He says that he was testifying both to the Jews and also to the Greeks repentance toward God and faith toward our Lord Jesus Christ. He says that he did it with tears. He had a level of passion to just reach someone with the gospel. And I believe this morning as we think about this portion of scripture a familiar passage Romans 1 14 through 16. We notice these statements and we are able to consider the perspective and the preparation and the passion. I wonder this morning do we have a passion to reach people with the gospel? The songwriter said we sing the song give me a passion for souls dear Lord. A passion to reach the lost. What a wonderful hymn that is. And I just wonder this morning what is it that we are passionate about? What is it that if someone were to be asked, maybe a co-worker, maybe a friend, a neighbor,",
      "context": "...e gospel. And I believe this morning as we think about this portion of scripture a familiar passage Romans 1 14 through 16. We notice these statements and we are able to consider the perspective and the prepa...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2501",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}