{
  "reference": "Romans 14",
  "occurrences": [
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 986.1799926757812,
      "text": "he says this, proving what is acceptable unto the Lord. In Ephesians 5, in verse 10. This morning, the Word of God must be the standard. It absolutely must be the standard. So we understand how. It must be honest. It must be thorough. We understand that there's a standard, and for us this morning as the people of God, that standard is the Word of God. By the way, I'm thankful that God's Word hasn't changed. I'm thankful that we're not looking for a revision. For an updated version. I'm thankful that God is eternal, and He has given us a book that is applicable and relevant today. So many people that say, oh, it's so old. Yeah, but the author is eternal. Amen? What a joy. It's the Word of God that's the standard. This morning we ask ourselves, why? Why do I go through this? Why do you think we should go through a process of examining ourselves? Why do we have to have this discipline? Can I say to you very simply that Paul says in Romans 14 and verse number 12, so that every one of us shall give account of himself to God. What does a steward do? He's responsible for the things that have been entrusted to him, but he also is called to give an account regularly. Or at least he should be. We're stewards. And this morning, in Romans 14 and verse number 12, as Paul is referencing,",
      "context": "...g ourselves? Why do we have to have this discipline? Can I say to you very simply that Paul says in Romans 14 and verse number 12, so that every one of us shall give account of himself to God. What does a stew...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=986",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 1061.4199829101562,
      "text": "to God. What does a steward do? He's responsible for the things that have been entrusted to him, but he also is called to give an account regularly. Or at least he should be. We're stewards. And this morning, in Romans 14 and verse number 12, as Paul is referencing, and there are a number of chapters and a number of references to the fact that we will give an account and stand before the Lord, but I understand how Paul says it in this particular text, so then every one of us, if you're a believer this morning, if you've trusted the Lord Jesus Christ, you can rejoice in the fact that the second death has no power over you. You can rejoice this morning that you will not stand at the great white throne judgment and what blessed truth that is. However, as a child of God, we will give an account and we give that account of himself to God. Wow. I hope this morning you see the seriousness of the subject matter. You understand this morning that you're not giving an account for someone else. I preached a message two Wednesday nights ago. Search me, oh God. Why? Because I'm not gonna stand and give an account for someone else. I'm standing and giving an account for myself. Now as a pastor, I will give an account. I'm told as one of my responsibilities in Hebrews that I watch for your souls.",
      "context": "...called to give an account regularly. Or at least he should be. We're stewards. And this morning, in Romans 14 and verse number 12, as Paul is referencing, and there are a number of chapters and a number of ref...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=1061",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}