{
  "reference": "Titus 2",
  "occurrences": [
    {
      "sermon_id": "EOBB4xsyduY",
      "timestamp": 0.0,
      "text": "And as you're turning to Psalm 150, I will read for you the verse from the book of Titus that we have gotten to in our study through the book of Titus, Titus 2 and verse number 1. When Paul tells Titus, but speak thou the things which become sound doctrine, and we've taken this purposed detour to deal with the subject matter of doctrine. And some have asked, how long is it going to be? The message I'm seeking to give you this evening, I could take seven weeks to deliver this message. And so I'm trying to make it through the doctrinal part, but I don't want to rush too much because doctrine is important. And we're living in a time in which, as Paul told Timothy in 2 Timothy chapter number 4, that there will be a time when they will not endure sound doctrine. And so doctrine is important. And so this evening, we will continue with our study on the doctrine of theology. And we started this section of our study on theology in the book of Jeremiah, Jeremiah chapter number 10, we used as our first lesson. And verse number 6 says this, for as much as there is none like unto thee, O Lord, thou art great and thy name is great in might. We looked at that verse as being sort of our template outline, if you will, for the study of theology.",
      "context": "...you the verse from the book of Titus that we have gotten to in our study through the book of Titus, Titus 2 and verse number 1. When Paul tells Titus, but speak thou the things which become sound doctrine, a...",
      "sermon_title": "Sermon EOBB4xsyduY",
      "url": "https://www.youtube.com/watch?v=EOBB4xsyduY&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "vrOSuRckXw0",
      "timestamp": 718.3999862670898,
      "text": "And look at the third psalm if you will. And we'll look at the third verse of this particular psalm. Of course, it's the psalm of David. We use that passage in 2 Samuel 22. And we'll see a number of references here throughout the psalms where David is repeating this wonderful truth of the Word of God. It says this in Psalm 3 and verse 3, \"...but Thou, O Lord, art a shield for me, my glory and the lifter up of mine head.\" Turn over to chapter 18 if you will. Look at verse 2. I want to look at verse 1 along with it. In verse 1, it says this, \"...I will love Thee, O Lord, my strength. The Lord is my rock, my fortress, and my deliverer, my God, my strength, and whom I will trust, my buckler, and the horn of my salvation, and my high tower.\" Now, let me submit to you this evening that when you understand these things about who God is, we mentioned we started our series on Wednesday evening. We returned to the study of the book of Titus and we picked up with the sound doctrine aspect of what's being dealt with there in Titus 2 in verse 1. And we dealt with bibliology and on Wednesday evening, we started the section dealing with theology and understanding who God is. When you understand who He is, it really changes your life. And we find that because the psalmist understood",
      "context": "...e book of Titus and we picked up with the sound doctrine aspect of what's being dealt with there in Titus 2 in verse 1. And we dealt with bibliology and on Wednesday evening, we started the section dealing w...",
      "sermon_title": "Sermon vrOSuRckXw0",
      "url": "https://www.youtube.com/watch?v=vrOSuRckXw0&t=718",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "vrOSuRckXw0",
      "timestamp": 790.5999755859375,
      "text": "being dealt with there in Titus 2 in verse 1. And we dealt with bibliology and on Wednesday evening, we started the section dealing with theology and understanding who God is. When you understand who He is, it really changes your life. And we find that because the psalmist understood the Lord is my rock, and he goes through and lists all of the things that God is to him, notice the response. Notice the result of understanding who God is. I will call upon the Lord. You're going to call upon Him because you understand who He is. You're going to call upon Him because you understand what He can do. And we find the psalmist says, who is worthy to be praised, so shall I be saved from my enemies. Look down and look at v. 30. The Bible says this, ask for God, His way is perfect. Very similar to what we just read in 2 Samuel 22 and v. 31. The Word of the Lord is tried. He is a buckler to all those that trust in Him. Psalm 28 and v. 7. The Lord is my strength and my shield. My heart trusted in Him and I am helped. Therefore, my heart greatly rejoiceth and with my song will I praise Him. Psalm 33 and v. 20. Our soul waiteth for the Lord. He is our help and our shield. I'm so thankful. There are many other references that we could look at this evening.",
      "context": "being dealt with there in Titus 2 in verse 1. And we dealt with bibliology and on Wednesday evening, we started the section dealing w...",
      "sermon_title": "Sermon vrOSuRckXw0",
      "url": "https://www.youtube.com/watch?v=vrOSuRckXw0&t=790",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}