{
  "book": "Luke",
  "sermons": [
    {
      "sermon_id": "2mDKhmk687Y",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Luke 24",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 1287.1800384521484,
          "context": "...cross of Calvary, He paid, He was our substitute, and then He rose from the dead. Acts 1 as well as Luke 24 record for us the ascension of Jesus Christ, and the Bible tells us in verse 2 that He is a ministe..."
        }
      ]
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Luke 10",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 1308.2799987792969,
          "context": "...alking about what happened and what transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoic..."
        },
        {
          "reference": "Luke 10",
          "sermon_id": "qwt_XuUQD9E",
          "timestamp": 1375.6399993896484,
          "context": "transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoic..."
        }
      ]
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Luke 11",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 204.5399932861328,
          "context": "...ly it finishes with a twofold request that of direction and deliverance notice Verse number four of Luke 11. The Bible says and forgive us our sins For we also forgive everyone that is indebted to us and lea..."
        },
        {
          "reference": "Luke 11",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 1444.280029296875,
          "context": "...ay that truth to Timothy. And this evening, when we think about the model prayer as it ends here in Luke 11, in verse number 4, and we've looked at all of these phrases, and we've studied through this, and w..."
        },
        {
          "reference": "Luke 4",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 335.94000244140625,
          "context": "...ist while he was in the wilderness and we understand that the Bible tells us in verse number one of Luke 4 and Jesus being full of the Holy Ghost returned from Jordan and was led by the Spirit into the wild..."
        },
        {
          "reference": "Luke 4",
          "sermon_id": "nS3pAoxKMb4",
          "timestamp": 1248.8000259399414,
          "context": "...dn't just leave. He tempted him a second time, and then a third time. And I read verse number 12 of Luke 4, particularly this evening, because the Bible says that he departed for a season, and we find that ..."
        }
      ]
    },
    {
      "sermon_id": "V5wHGLUSkdE",
      "sermon_title": "Sermon V5wHGLUSkdE",
      "url": "https://www.youtube.com/watch?v=V5wHGLUSkdE",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Luke 19",
          "sermon_id": "V5wHGLUSkdE",
          "timestamp": 88.36000061035156,
          "context": "...d I think mostly because of the song that is sung about him and about his life, and we find here in Luke 19, I want to read the first couple of verses, we'll get into the study this evening. The Bible says t..."
        },
        {
          "reference": "Luke 19",
          "sermon_id": "V5wHGLUSkdE",
          "timestamp": 862.7399597167969,
          "context": "... the passage of Scripture and we think just for a moment of Zacchaeus in these first four verses of Luke 19 as he's introduced to us in the Word of God and we find how he's described and what he desires I wo..."
        },
        {
          "reference": "Luke 19",
          "sermon_id": "V5wHGLUSkdE",
          "timestamp": 931.8599853515625,
          "context": "of Zacchaeus in these first four verses of Luke 19 as he's introduced to us in the Word of God and we find how he's described and what he desires I wo..."
        },
        {
          "reference": "Luke 19",
          "sermon_id": "V5wHGLUSkdE",
          "timestamp": 1703.8399658203125,
          "context": "...ul at this time, he responds and he says, Lord, what wilt thou have me to do? And here Zacchaeus in Luke 19 and verse 8, he said, behold, Lord, the half of my goods I give to the poor, and if I have taken an..."
        }
      ]
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Luke 2",
          "sermon_id": "d8tHudo0_3I",
          "timestamp": 415.79998779296875,
          "context": "...ys I bring unto you what shall be to all people this wonderful Proclamation that was given there in Luke 2 was not to just be given to the shepherds and held by the shepherds But they were to go and proclai..."
        }
      ]
    },
    {
      "sermon_id": "ovhq5P2teKg",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Luke 9",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 1343.7400207519531,
          "context": "... of Luke, if you will. In chapter number 9, I want to read this passage of Scripture to you here in Luke 9, because this did not take place that long before the text of Scripture in which we're reading this..."
        }
      ]
    }
  ]
}