{
  "reference": "1 Chronicles 29",
  "occurrences": [
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 2588.259979248047,
      "text": "And he was committed to giving to God. And here's what Letourneau said. He said, when I think about giving to God, your perspective has to be this. It's not how much of my money I give to God, but it's how much of God's money I keep for myself. That's a different way to think about it. I like that. By the way, Letourneau was famously known for giving 90% to God and keeping 10% for himself. I'm not suggesting anyone do that. You better pray about it, amen? You start doing that and you can't pay your electric bill and you're gonna call me, amen? But the reality is that, man, that's what a great perspective. It's not how much of my money I give God, but how much of God's money I keep for myself. Why? Because I'm recognizing that God, He gives me all of this. He's been so good to me. I want you to think about this in 1 Chronicles 29, and we'll finish here. The life of David near the end of his life. And I don't have time to look at all of this that the hour's gone, I need to wrap up the message, but I want you to see here in 1 Chronicles 29, perhaps you'd like to go back and read it later this evening, this week, make a note to read this passage. It's just fabulous, the response of David and the people",
      "context": "...izing that God, He gives me all of this. He's been so good to me. I want you to think about this in 1 Chronicles 29, and we'll finish here. The life of David near the end of his life. And I don't have time to look a...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=2588",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 2650.3399810791016,
      "text": "gone, I need to wrap up the message, but I want you to see here in 1 Chronicles 29, perhaps you'd like to go back and read it later this evening, this week, make a note to read this passage. It's just fabulous, the response of David and the people with the ability to give to the work of God. David is giving to a work that he'd never see fulfilled. He'd never see the temple completed. He'd never worship God in the temple, but yet he's giving and he's preparing and he's offering willingly. And I want you to see that they're rejoicing greatly because of the opportunity to give. In fact, it says in verse number nine, then the people rejoiced, why? For that they offered willingly, because with perfect heart, they offered willingly to the Lord. And David the king also rejoiced, how? With great joy. Why could they rejoice at the giving? Why could they rejoice in the manner in which they did? Well, it's because of their perspective. Notice in verse number 14, it says, but who am I and what is my people that we should be able to offer so willingly after this sort? For all things come of thee and of thine own have we given thee. Man, we change our perspective and it really changes our entire outlook, does it not? And here, Jacob, a man who is known for, as we've studied his life, he's known for me and myself",
      "context": "gone, I need to wrap up the message, but I want you to see here in 1 Chronicles 29, perhaps you'd like to go back and read it later this evening, this week, make a note to read this ...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=2650",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 1345.2799987792969,
      "text": "in their hand. Amen? Listen, we ought to be thankful for that this morning. We ought to be thankful that He is King of kings and Lord of lords, that He is the great I Am. Let me say this, He is victorious. He never loses. Never. He is victorious. Satan thought he defeated Him, did he not? Pilate and all the Romans, the Jews, gave all the instruction with making that grave as sure, as secure as they could. Didn't matter what they did at that grave. As we sing on Easter morn, up from the grave He arose. Amen? He is victorious. Notice back in the Old Testament, if you will, 1 Chronicles 29, I love the way that this particular portion of Scripture is the wording here. And what a joy when you think about the greatness and the power of our God. And in 1 Chronicles 29, in verse number 11, just a powerful verse of Scripture, perhaps a verse that you'd like to commit to memory and to be encouraged by the truth contained therein. The Bible says in 1 Chronicles 29, in verse number 11, Thine, O Lord, is the greatness and the power and the glory and the victory and the majesty for all that is in the heaven and in the earth is Thine. Thine is the kingdom, O Lord, and Thou art exalted as head above all. Isn't that a powerful verse of Scripture?",
      "context": "... up from the grave He arose. Amen? He is victorious. Notice back in the Old Testament, if you will, 1 Chronicles 29, I love the way that this particular portion of Scripture is the wording here. And what a joy when ...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=1345",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}