{
  "reference": "1 Corinthians 15",
  "occurrences": [
    {
      "sermon_id": "G38C0Tuh6UA",
      "timestamp": 2388.9799194335938,
      "text": "shall. Certainty. Certainty. Shall raise up us also by Jesus and shall present us with you. Man, it's a beautiful picture that God gives us in one verse of scripture. And we know, listen, this truth is that death has no power over us. If we've been saved by the grace of God, we will, listen, Christ is the first fruits, 1 Corinthians 15, we will rise again. And what a joy that is. And he says that he'll present us. I want you to think just for a moment. of the truth of the church. The individual believers make up the church, but the church is known as the body of Christ, but also the bride of Christ. And who's gonna do, who's gonna present us? You read Ephesians chapter number five, and you begin reading about the church and the relationship between the husbands and wives. And then you find that the Bible talks about how husbands are to love their wives, even as Christ loved the church and gave himself for it in Ephesians chapter number five. And he goes on to say this, that he, Christ, might sanctify and cleanse it, the church, with the washing of water by the blood that he might present it to himself, a glorious church, not having spot or wrinkle or any such thing, but that it should be holy and without blemish. Oh, what a day it's gonna be when we get to heaven. I'm serious.",
      "context": "...ower over us. If we've been saved by the grace of God, we will, listen, Christ is the first fruits, 1 Corinthians 15, we will rise again. And what a joy that is. And he says that he'll present us. I want you to think...",
      "sermon_title": "Sermon G38C0Tuh6UA",
      "url": "https://www.youtube.com/watch?v=G38C0Tuh6UA&t=2388",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 2527.9400024414062,
      "text": "to destroy the work, but they want to hinder the work. They want to do anything they can to hinder the work of God. Romans chapter number 8 and verse number 31, what shall we then say to these things? If God be for us, who can be against us? I want to be on God's side, amen? If God be for us, who can be against us? Notice what he says in verse number 37, nay, in all these things we are more than conquerors through Him that loved us. More than conquerors. I've already said we're on the winning side. What a joy, what a blessing to be victorious, to be conquerors. Listen, for too long now the church has acted as if we have no power. The church has laid down and allowed the enemy to just keep on marching. The church has said we shouldn't get involved with these things, we shouldn't talk about these things, we're going to keep it to ourselves. No, no, we're to go forth and make a difference, amen? We're on the winning side. We go in the power of the Lord God Almighty. And if God be for us, who can be against us? You say, well I have a whole list of people that are against us. Yeah, I do too. But with God, we're a majority, amen? Look at 1 Corinthians 15.",
      "context": "...e list of people that are against us. Yeah, I do too. But with God, we're a majority, amen? Look at 1 Corinthians 15.",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=2527",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 2601.539993286133,
      "text": "go in the power of the Lord God Almighty. And if God be for us, who can be against us? You say, well I have a whole list of people that are against us. Yeah, I do too. But with God, we're a majority, amen? Look at 1 Corinthians 15. We mentioned that one of the ways in which Nehemiah resisted the enemy was that he remained steadfast. We find in 1 Corinthians 15 in verse number 58. Another familiar verse of Scripture. Verse 57 says, but thanks be to God which giveth us the victory through our Lord Jesus Christ. Therefore, my beloved brethren, be ye steadfast, unmovable, always abounding in the work of the Lord. Why? Why? For as much as ye know. Every word of God is for you. He didn't say for as much as you think, for as much as we hope, for as much as you know that your labor is not in vain in the Lord. Listen, when we go in the power of God Almighty and we're going forth into the battlefield and we're giving the truth of the Word of God and we're battling over the souls of men, you can understand that our work is not in vain in the Lord. God is working. God uses His Word. He promises to do so. You say, well I just don't see how God is working. You just remain steadfast. See, sometimes what we know has to supersede what we think.",
      "context": "...e list of people that are against us. Yeah, I do too. But with God, we're a majority, amen? Look at 1 Corinthians 15. We mentioned that one of the ways in which Nehemiah resisted the enemy was that he remained steadf...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=2601",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 2056.540008544922,
      "text": "for that. And I hope that you'd be thankful for that promise. He's promised that He has given us those things. Let me say this. As we think about our Christian life, He has promised that our labor is not in vain. Our labor is not in vain, number 10. You know, there are times in which we can serve and we can get overwhelmed and we can look at the things that we're seeking to accomplish and we can feel as if, is it even working? Is there even any purpose? Is there any progress that's being made? But 1 Corinthians 15 and verse number 58 reminds us that God has promised to us that our labor, our work is not in vain in the Lord. He says this, therefore, my beloved brethren, be steadfast, unmovable, always abounding in the work of the Lord. Why? For as much as you know that your labor is not in vain in the Lord. There are times in which we may think that our labor, it's not working. I've prayed for, I've sought to give the truth and it just seems like it's falling on deaf ears. It feels like there's no progress that's being made. Listen, God tells us our labor's not in vain in the Lord. God blesses and God rewards. And our duty is not the fruit. Our duty is to do the work that He's called us to do. Remember, He told us in this church",
      "context": "... as if, is it even working? Is there even any purpose? Is there any progress that's being made? But 1 Corinthians 15 and verse number 58 reminds us that God has promised to us that our labor, our work is not in vain ...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=2056",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}