{
  "reference": "1 Corinthians 10",
  "occurrences": [
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1661.02001953125,
      "text": "he seeks to tempt us to do evil, to sin, that it might hinder our walk with Thee, adversely impact our testimony for Thee. God, I pray that You'd help us as we see and conclude this model prayer this evening, to be mindful of the work of the enemy. God that You would help us to be aware of and mindful of the promise that You've given us there in 1 Corinthians 10 and verse 13. God that we would actively look for the escape route when that temptation comes, because we've prayed for deliverance, deliver us from evil. We do thank You for the privilege of corporate prayer, and I pray that as we now enter into this time of our service, as we pray one with another, that Lord, You'd be glorified. We'll thank You for all that You'll do, for it's in Christ's name we pray, amen. Does anyone need a prayer bulletin this evening? Anyone need one?",
      "context": "... God that You would help us to be aware of and mindful of the promise that You've given us there in 1 Corinthians 10 and verse 13. God that we would actively look for the escape route when that temptation comes, beca...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1661",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 416.9599914550781,
      "text": "see what happens between Leah and Rachel in those verses of Scripture, and you see how Reuben the firstborn was used and how Jacob comes back and all of the carnality, it's really a sad situation. And here as she names him Issachar, there is recompense or there is reward. We see once again this battle, this conflict between sisters. And we find that in verse number 18 when she calls his name Issachar, she also says this, notice what she says, God hath given me my hire. She's acknowledged God, but she's no longer acknowledging God as being Jehovah. She's acknowledging God as being Elohim or Lord. And we've mentioned this before, we've seen this behavior in the life of Leah in previous text of Scripture, in the life of Rachel, and we find here that as she has this ninth son, that these circumstances that are just wild beyond our imagination, the depth of carnality. But as we see historically in the context of what's happening, we must understand that we too can sink to some pretty low levels of carnality. The Bible tells us in 1 Corinthians 10, let him that thinketh he standeth, take heed lest he fall. You know, it's absolutely imperative that you and I walk in the Spirit so that we do not fulfill the lust of the flesh. After salvation, the Holy Spirit of God indwelled us, isn't that wonderful? And He enables us. We still have a flesh.",
      "context": "... must understand that we too can sink to some pretty low levels of carnality. The Bible tells us in 1 Corinthians 10, let him that thinketh he standeth, take heed lest he fall. You know, it's absolutely imperative th...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=416",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}