{
  "reference": "1 Corinthians 2",
  "occurrences": [
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1403.9199829101562,
      "text": "said this this morning as I was preaching on the subject of prayer. I said it's a wonderful truth to know that God hears and answers prayer. But to know that he hears and answers prayer and not pray, just doesn't make sense. It's of no help. Would you agree? God hears and answers prayer, but I don't pray. Well, that doesn't even make sense. And here the Bible says that the people of God, the children, the rebellious children as they're described here, that they have not asked at my mouth. What if they just would have asked for counsel? What if they just would have sought the face of God? What if they would have desired wisdom and counsel from God instead of from the world? Listen, you understand this evening, the world's not going to give you counsel that's going to align with this book. The world is not going to provide you with counsel that is going to align with what thus saith the Lord. In fact, if you go to the world for counsel, many times their counsel is going to be contrary to what you find in God's Word. Why? For the natural man receiveth not the things of the Spirit of God. For there are foolishness unto him, neither can he know them. Why? Because they are spiritually discerned, 1 Corinthians 2. And we find here that God is sent in this indictment against his people",
      "context": "...re are foolishness unto him, neither can he know them. Why? Because they are spiritually discerned, 1 Corinthians 2. And we find here that God is sent in this indictment against his people",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1403",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1467.9199829101562,
      "text": "God's Word. Why? For the natural man receiveth not the things of the Spirit of God. For there are foolishness unto him, neither can he know them. Why? Because they are spiritually discerned, 1 Corinthians 2. And we find here that God is sent in this indictment against his people because they're taking counsel but not from God. They're running down to Egypt, or walking to go down into Egypt, but have not asked of My mouth. God says ask. And what? Ye shall receive. Is that not a promise? He says ye have not because ye ask not. Right? Is that what He says? Is that Bible? And we find here this evening that He says that you've not asked of My mouth to strengthen themselves. Notice where it says, in the strength of Pharaoh. Now this is amazing to me because I think about the children of Israel. We have the Bible and we can read back and we can understand all that happened with the Exodus and so on and so forth. And I understand the Exodus is after what we've read in Genesis 41 this evening but Isaiah is after the Exodus. So I think it's fair that we could say that the children of Israel were aware of what happened during the Exodus. The children of God during the time of Isaiah's prophecy were aware of the Exodus. They were aware of the plagues.",
      "context": "...re are foolishness unto him, neither can he know them. Why? Because they are spiritually discerned, 1 Corinthians 2. And we find here that God is sent in this indictment against his people because they're taking cou...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1467",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}