{
  "reference": "1 Corinthians 16",
  "occurrences": [
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 0.0,
      "text": "you will, and in the book of Nehemiah, and looking at this portion of Scripture, Nehemiah chapter number 4, and as we get to that passage of Scripture, I want to remind you of something that the Apostle Paul said as he was ministering there to the believers in Corinth. Of course, we understand that God allowed the Apostle Paul to minister in Corinth for an extended period of time, and during that time of ministry, a church was established, and then God would use Paul to write two letters back to this church, instructing them with regard to their walk with the Lord, and of course, with various things within the church, but Paul mentioned this in 1 Corinthians 16, in verse number 9, he said, For a great door and effectual is opened unto me, and then he ends the verse by saying this, And there are many adversaries. There are many adversaries, and this evening, I want to preach a message that I've entitled There Are Many Adversaries, but we're going to look at Nehemiah chapter 4 with that thought of what Paul said in 1 Corinthians chapter number 6. The reality is that for most of us, it is easy to acknowledge that we have an enemy. The Bible declares that we have an enemy, and we understand that the enemy, that we are engaged in spiritual battle, it's not flesh and blood that we wrestle against, but",
      "context": "...alk with the Lord, and of course, with various things within the church, but Paul mentioned this in 1 Corinthians 16, in verse number 9, he said, For a great door and effectual is opened unto me, and then he ends the...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1113.3999633789062,
      "text": "called you to do and understand that God Almighty has called you and God Almighty will sustain you. Don't quit. Don't give up. Fulfill it. Fulfill what? The ministry that you've received in the Lord. Understand that Paul is the human penman that God would use to write these words and to give this charge to Archippus. But understand that Paul understood some things about opposition. Turn to 1 Corinthians 16 if you will. And notice what Paul says here in this portion of Scripture. We'll just look at two examples, but I want you to see what Paul says in 1 Corinthians 16 in verse 9. Paul understood some things about adversity when you read the book of Acts and you read about the missionary journeys, you find that every city in that first missionary journey that he went to, he was run out of town. He was stoned and left for dead. But he didn't quit. Notice what it says in 1 Corinthians 16 in verse 9, for a great door and effectual is opened unto me, and there are many adversaries. I was reading the book of Amos this morning. I was reading the book of Amos and you'll find that even Amos faced opposition. There were some that said of Amos, go somewhere else and prophesy. We don't want to hear that. And we find here this morning that Paul is trying to encourage a brother, a servant of the Lord that's been discouraged,",
      "context": "...this charge to Archippus. But understand that Paul understood some things about opposition. Turn to 1 Corinthians 16 if you will. And notice what Paul says here in this portion of Scripture. We'll just look at two ex...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1113",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}