{
  "reference": "1 Corinthians 4",
  "occurrences": [
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 923.8000183105469,
      "text": "as you study the book of 1 Corinthians, you find that one of the reasons that there's some division and some jealousy and envy within the members of the church at Corinth is because of the subject of spiritual gifts. Some were saying, well, I have this gift and you have that gift and my gift is better than your gift and so on and so forth. And we'll look at a few verses because the apostle Paul is going to deal with that and try to help them. But I want you to notice as we speak about the ability to serve God and how we ought to rejoice that he's given us the ability to serve the Lord, that it is God who has given us the grace. It is God who has given us the ability. He has equipped us. And it says here of the church in Corinth that they come behind in no gift. This church that was full of division and envy was a church that was gifted spiritually. But they allowed those spiritual gifts to cause them to look at each other and say, I'm better than you because of the gift that I have. And they totally missed the purpose for which God gave them the spiritual gifts in the first place. Notice in chapter number 4 of 1 Corinthians verses 6 and 7, notice what the Bible says here. In chapter 4, 1 Corinthians 4 verse 6 and 7,",
      "context": "...in chapter number 4 of 1 Corinthians verses 6 and 7, notice what the Bible says here. In chapter 4, 1 Corinthians 4 verse 6 and 7,",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=923",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cCksVIX-UWU",
      "timestamp": 981.0800170898438,
      "text": "gift that I have. And they totally missed the purpose for which God gave them the spiritual gifts in the first place. Notice in chapter number 4 of 1 Corinthians verses 6 and 7, notice what the Bible says here. In chapter 4, 1 Corinthians 4 verse 6 and 7, the Bible says this, and these things brethren I have in a figure transferred to myself and to Apollos for your sakes that you might learn in us not to think of men above that which is written, that no one of you be puffed up for one against another. He's dealing with the importance of humility. And notice in verse 7 he says, for who maketh thee to differ from another? By the way, aren't you happy everyone's not like you? Amen. I'm happy everyone's not like me. I'm happy everyone's not like you. I'm happy I'm not like you. Amen. But the reality is God's made us different. But then notice when we think about the spiritual gifts, notice in verse number 7, and what hast thou that thou didst not receive? He's going to build upon this as we go through the book of 1 Corinthians, and we'll look at a few more verses. He says, now if thou didst receive it, why dost thou glory as if thou hadst not received it? And we find that he's speaking,",
      "context": "...in chapter number 4 of 1 Corinthians verses 6 and 7, notice what the Bible says here. In chapter 4, 1 Corinthians 4 verse 6 and 7, the Bible says this, and these things brethren I have in a figure transferred to mys...",
      "sermon_title": "Sermon cCksVIX-UWU",
      "url": "https://www.youtube.com/watch?v=cCksVIX-UWU&t=981",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Ap8WkGwQMm4",
      "timestamp": 493.3999938964844,
      "text": "important job, and faithfulness was necessary on their part to do their job. And we find that they were faithful, of course, we understand the word of God speaks much about faithfulness. I'm thankful that God's word teaches us that our God is faithful. He is dependable, he is trustworthy. I find that Paul often will rejoice and thank God for the express purpose that God is faithful. We sing, great is thy faithfulness. We've experienced as individual believers this morning, we have experienced the faithfulness of God. But you know that he expects us as his people to be faithful as well. The Bible says in 1 Corinthians 4 and verse number 2, moreover, it's required in Stuart's that a man be found faithful. I'm mindful of what the wise man said in Proverbs 20 and verse number 6, the latter part of the verse, he says, but a faithful man, who can find? And if you were to read through the book of Proverbs, and perhaps you would do a study on a faithful man and on an unfaithful man, you would find the great truth that God gives us in the importance of faithfulness. When I look at these shepherds, when I'm first introduced to these shepherds in verse number 8, the first thing that I notice, the first thing that I'm met with is the fact that they were faithful. They were faithful.",
      "context": "...ess of God. But you know that he expects us as his people to be faithful as well. The Bible says in 1 Corinthians 4 and verse number 2, moreover, it's required in Stuart's that a man be found faithful. I'm mindful o...",
      "sermon_title": "Sermon Ap8WkGwQMm4",
      "url": "https://www.youtube.com/watch?v=Ap8WkGwQMm4&t=493",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}