{
  "reference": "1 John 5",
  "occurrences": [
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 1147.4199829101562,
      "text": "ask not. Then notice this in verse number three, ye ask and receive not because you ask amiss, that you may consume it upon your lusts. We've often looked at verses two and three of James chapter number four, and we've understood as people have quoted these verses of Scripture that you have not. Why? Well, because you ask not. You have not, according to verse number three, why? And you receive not, why? Because you ask amiss, that you may consume it upon your lust. As I look at the request of Nehemiah here in chapter number six and verse number nine, when he says, oh God, strengthen my hands, I find that this is a request that is appropriate for the hour and for that which he's dealing with. In fact, if you go over to the book of 1 John in chapter number five, and notice what John tells us in this great epistle that we've studied here on Sunday mornings, and notice with me in verses 14 and 15 of the fifth chapter. Notice what John says. Now, John had the privilege of walking with the Lord Jesus Christ. He had the privilege of hearing the Lord speak to him about the importance of prayer and the privilege of prayer in coming. Before. or the throne of God. And John, under the inspiration of the Holy Spirit of God, says this in 1 John 5 and verse number 14,",
      "context": "...fore. or the throne of God. And John, under the inspiration of the Holy Spirit of God, says this in 1 John 5 and verse number 14,",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=1147",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 1208.7599558830261,
      "text": "He had the privilege of hearing the Lord speak to him about the importance of prayer and the privilege of prayer in coming. Before. or the throne of God. And John, under the inspiration of the Holy Spirit of God, says this in 1 John 5 and verse number 14, and this is the confidence that we have in Him. Now, this is a recurring word and thought in the book of 1 John. Having confidence. Being confident that I'm saved. Being confident that I belong to the Lord Jesus Christ and I am His child. And we find here that He speaks of this confidence that we have in Him. Notice what it is. That if we ask anything according to His will, He heareth us. Doesn't stop there. In verse number 15, it says, and if we know that He hear us, whatsoever we ask, we know that we have the petitions that we desired of Him. Was it the will of God for Nehemiah to build the wall? As best we can tell, absolutely. This was a work that God put in His heart. He testifies of that. This was a work that He recognized God's hand was upon Him. He recognized all of those things that we went through, and we find that in the moment of that adversity that continued to grow, and in the weariness that was there amongst the people, we find that He makes this prayer, oh, God, strengthen my hands.",
      "context": "...fore. or the throne of God. And John, under the inspiration of the Holy Spirit of God, says this in 1 John 5 and verse number 14, and this is the confidence that we have in Him. Now, this is a recurring word ...",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=1208",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 1288.6799545288086,
      "text": "hand was upon Him. He recognized all of those things that we went through, and we find that in the moment of that adversity that continued to grow, and in the weariness that was there amongst the people, we find that He makes this prayer, oh, God, strengthen my hands. He asked that the Lord God omnipotent, His God, would give Him strength. We find that as we have the whole canon of Scripture, we look at 1 John 5, and we can say, hey, if God's given me a task, if God's given me something to accomplish, then we can have the confidence that if we ask anything according to His will, that He hears us, and not only that, but we know that if He hears us, that whatsoever we ask, we know that we have the petitions that we desired of Him. Wow. You know, sometimes we may not have the strength for the simple fact that we don't ask for it. You know how many times people don't get help because they don't ask for help? Right? How many times have you heard somebody say, hey, let me know if you need anything, and you knew they were just being nice? You know what I mean, right? They really didn't want you to call them. That's not how God works. He says that He's a very present help in the time of trouble. That's our God. Not only is He able, but He's available.",
      "context": "... His God, would give Him strength. We find that as we have the whole canon of Scripture, we look at 1 John 5, and we can say, hey, if God's given me a task, if God's given me something to accomplish, then we ...",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=1288",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 838.0800170898438,
      "text": "defense attorney. And here's the amazing thing, and I said this months ago as we studied 1 John chapter number 2, that Jesus Christ the righteous, our advocate, our defense attorney, he does not argue our innocence. Why? Because we're guilty. How could he argue our innocence if we're guilty? He doesn't argue our innocence, rather he acknowledges our guilt, but then says this, I've paid for it. Isn't that awesome? Because the Lord, that we have an advocate with the Father, Jesus Christ the righteous. And these are promises that are precious to us as believers, and we ought to understand that and we ought to be encouraged by that. As we go back to 1 John 5 and verse number 16, notice what he says, if any man see his brother sin a sin, which is not unto death. Now I'm going to try to unpackage this for you and help you this morning and help myself as well. He says this, he shall ask, it goes back to praying that we looked at in verses 14 and 15. He shall ask, notice what it says, and he shall give him life for them that sin not unto death. So what's he saying? Well, if we as brothers and sisters in Christ see a brother or sister sinning in error, then we can engage in intercessory prayer for them that their fellowship might be restored. We're praying.",
      "context": "... believers, and we ought to understand that and we ought to be encouraged by that. As we go back to 1 John 5 and verse number 16, notice what he says, if any man see his brother sin a sin, which is not unto d...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=838",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2486.739990234375,
      "text": "the fact that not only has He provided Himself, but then He's provided truth. If He did not provide and preserve this book, how would we know truth? How would we even know that Jesus came? But we have this record. We have this book because He gave us truth. We find that He's provided that to us. We find that He provides understanding. Did you see what it said there in 1 John 5 and verse 20? It says, and hath given us an understanding. I'm so thankful that He's provided this understanding, and we understand this morning that this understanding comes through the Holy Spirit. He says in John 16 and verse number 13 that He, the Holy Spirit, He is the Spirit of truth, and He will guide us into all truth. And we ought to be so thankful. You say, how do you understand these things? The Holy Spirit of God gives me understanding. It's not that I'm smarter than somebody else. It's not that you're smarter than somebody else. It's not that we're, no, no, it's God that gives us understanding. By the way, that keeps us humble. Amen? Keeps us humble. We find here that He's provided Himself. He's provided truth. He's provided us with understanding. I think about this in verse number 20. Again, it says this, and we know that the Son of God has come and hath given us an understanding.",
      "context": "...He's provided that to us. We find that He provides understanding. Did you see what it said there in 1 John 5 and verse 20? It says, and hath given us an understanding. I'm so thankful that He's provided this ...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2486",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2704.739990234375,
      "text": "I preached a message this week at school chapel over at Fairfax Baptist Temple Academy, and I preached from Proverbs 3. In verse 26, the Bible says that the Lord shall be thy confidence. And I said to those young people, I said, how can you make God your confidence? The Lord shall be thy confidence. And I said this, part of the message, it wasn't the entirety of the message, is that the only way God's going to be my confidence, the one that I rely on, the one that I'm trusting, is when I get to know him. And I get to know him through this book. And if the Lord shall be thy confidence, and he's revealed himself to us in the pages of Scripture, and we rejoice this morning because 1 John 5 and verse number 20 tells us that we may know him that is true, and we, notice as it continues, are in him that is true. Think about the truth that we can abide in him. He said in John chapter number 15, abide in me, and I in you. And we can rejoice this morning in the fact that I can abide in him. See, when we close out this book, he ends it this way, even in his son Jesus Christ, this is the true God and eternal life. I'm so thankful this morning that God has given us a record,",
      "context": "...nce, and he's revealed himself to us in the pages of Scripture, and we rejoice this morning because 1 John 5 and verse number 20 tells us that we may know him that is true, and we, notice as it continues, are...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2704",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 494.8999938964844,
      "text": "be done. But each of us have a will. Each of us have a will. We believe this morning that as we understand our will, and you know how strong your will is, and you know how submissive you are to the will of God, but if we're not careful, our will influences our prayer lives more than God's will influences our prayer lives. How can we, how can you, how can I this morning, how can we truly say, not my will, but thine? But thine be done. Because we all have a will, we all have a desire, and this morning we find it tucked within these verses of Scripture, the instruction, thy will be done. As we examine this truth and these four words this morning, this might be one of the most critical aspects of prayer that I've dealt with in the last several weeks. Thy will be done. How do we determine God's will? Well, God's will is revealed to us in His Word. We must be students of the Word. We're to pray according to His will, according to the truth that we receive in 1 John 5, 14, and 15. We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us",
      "context": "...tudents of the Word. We're to pray according to His will, according to the truth that we receive in 1 John 5, 14, and 15. We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=494",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 2682.6200561523438,
      "text": "to be tribulation. In the world, you shall have tribulation, but we need to understand that in Him, we can have peace. And He says, be of good cheer. Isn't that amazing? In the midst of all that's taking place, I mean some of the message that Jesus is giving to His disciples with regard to the hatred that they would face and the persecution that they would face and the tribulation that they would endure, He says, be of good cheer. Be of good cheer. Why? Because I have overcome the world. I have overcome the world. There's someone to exalt. This morning, this week, in our lives, we need to be diligent and purposed in exalting the Lord Jesus Christ, lifting Him up, seeing Him in His rightful place, high, holy and lifted up. Because we serve a great God. We serve the victorious Savior. And thanks be to God, which giveth us the victory. John would say this in 1 John chapter number 5. We sing the song, faith is the victory. You familiar with the song? Well, 1 John 5 and verse 4 says, for whatsoever is born of God overcometh the world, and this is the victory that overcometh the world, even our faith. Who is He that overcometh the world? But He that believeth that Jesus is the Son of God. Faith is the victory. We sing the song, victory in Jesus. Isn't it wonderful? But sometimes we live like we've been conquered.",
      "context": "... 1 John chapter number 5. We sing the song, faith is the victory. You familiar with the song? Well, 1 John 5 and verse 4 says, for whatsoever is born of God overcometh the world, and this is the victory that ...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=2682",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}