{
  "reference": "1 Kings 12",
  "occurrences": [
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 1309.360008239746,
      "text": "eyes or their own sight. But I want you to notice down, if you will, in Judges 18 in verse number 30, the Bible says, and the children of Dan set up the graven image. And Jonathan, the son of Gershom, the son of Manasseh, he and his sons were priests to the tribe of Dan until the day of the captivity of the land. And they set them up Micah's graven image, which he made all the time that the house of God was in Shiloh. When I think about the phrase there in verse 17, when Jacob says, a serpent, by the way, an adder in the path, and he talks about biting the horse heels and the rider falling backward, I think about the responsibility of Dan as a tribe, introducing idol worship into the nation of Israel and the adverse impact that it had on the nation. If you were to think about Israel as a nation, no doubt, as you have studied the Old Testament, you would find that over and over again, not only Israel, but Judah as well, they were guilty regularly of idolatry, idol worship. We find it here in Judges 18, but I want you to also look over, if you will, at 1 Kings 12. In 1 Kings 12, we begin to read of an important time in Israel's history. We find that Israel up to this point in 1 Kings 12, they've had three kings, Saul, David, and Solomon.",
      "context": "...atry, idol worship. We find it here in Judges 18, but I want you to also look over, if you will, at 1 Kings 12. In 1 Kings 12, we begin to read of an important time in Israel's history. We find that Israel up t...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=1309",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 1396.6400146484375,
      "text": "but I want you to also look over, if you will, at 1 Kings 12. In 1 Kings 12, we begin to read of an important time in Israel's history. We find that Israel up to this point in 1 Kings 12, they've had three kings, Saul, David, and Solomon. Under the reign of those three kings, it's a united kingdom, it's Israel. But we find that when we come to 1 Kings 12, the death of Solomon has been recorded, and we find that after the death of Solomon, at the end of chapter 11, that what happens is there's a divided kingdom. We speak about the divided kingdom often will refer to Israel and will refer to Judah. We refer to Israel, we refer to the ten tribes of the north, we refer to Judah, we're speaking about the two tribes of the south. We see that in Israel's history, it was a downward spiral the entire way. There's no time in Israel's history after the divided kingdom that there's any revival, there are no kings that we would say, these are good kings. On the other hand, when you look at Judah, and you look at Judah's history, you'll find that Judah had some good kings. There were some that were better than others, but they had some good kings. And we find that not only did they have good kings, but there were periods of time in Judah's history where they had revival.",
      "context": "but I want you to also look over, if you will, at 1 Kings 12. In 1 Kings 12, we begin to read of an important time in Israel's history. We find that Israel up t...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=1396",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}