{
  "reference": "1 Peter 1",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1005.9600219726562,
      "text": "Savior, that He empowers us and He dwells within us, and we have the power of God Almighty. It's not my own power, it's not your power, it's His power through us, and I'm thankful that He empowers us. What about this? He keeps us. Aren't you thankful for that? You know how miserable it would be if you had to keep your own salvation? Seriously, it'd be miserable. You know why I believe it would be so miserable? This is my opinion. Because you become the authority or the standard. And it would mess with my mind terribly. If I had to wonder, well, wonder what I did today that, man, that was really bad, and I don't know what I have to do to make up, it'd just be a mess. But He promised to keep us. Notice this in John chapter number 10. In John chapter number 10, it's a great passage of Scripture, and we think about the blessedness of being kept by the power of God, as He says in 1 Peter 1 and verse number 5, and I'm so thankful that He keeps us. Here in John 10 and verse number 27, notice what Jesus says, My sheep hear My voice, and I know them, and they follow Me. And I give unto them eternal life. Eternal life. He didn't say I give unto them temporary life. He didn't say I give unto them probationary life. He said I give unto them eternal life.",
      "context": "...e of Scripture, and we think about the blessedness of being kept by the power of God, as He says in 1 Peter 1 and verse number 5, and I'm so thankful that He keeps us. Here in John 10 and verse number 27, noti...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1005",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1078.0400390625,
      "text": "Jesus says, My sheep hear My voice, and I know them, and they follow Me. And I give unto them eternal life. Eternal life. He didn't say I give unto them temporary life. He didn't say I give unto them probationary life. He said I give unto them eternal life. And they shall never perish. Neither shall any man pluck them out of My hand. My Father which gave them Me is greater than all, and no man is able to pluck them out of My Father's hand. I and My Father are one. I'm thankful that He's given us this promise here. We understand that, as we mentioned in Romans 6, that the gift of God is eternal life through Jesus Christ our Lord. Here He says My sheep, they hear My voice, and I know them, they follow Me. And here's what I give them. I give them eternal life. They shall never perish. I'm so thankful, 1 Peter 1 and verse number 5, jot it down in your notes. It tells us that we are kept by the power of God. Listen, I couldn't earn my salvation and neither could you, and I can't keep my salvation and neither can you. Amen? I'm kept by the power of God. These promises, we think about the promise that He said that He would save us, He empowers us, He keeps us. He tells us this, that sin no longer has dominion over us.",
      "context": "...e. And here's what I give them. I give them eternal life. They shall never perish. I'm so thankful, 1 Peter 1 and verse number 5, jot it down in your notes. It tells us that we are kept by the power of God. Li...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1078",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 714.3600234985352,
      "text": "going to hear Paul and Silas regardless of what they said. They were going to hear them if they complained, and they were going to hear them if they rejoiced. You know what? There's some people that hear us. I wonder what they hear. What do they hear from us? When we're going through trials, when we're going through difficulties, what do they hear? What do they learn about our God as we go through trials? As we look at 1 Peter chapter number 1 and look at verse 3 through 9 this morning, get to our text, I believe that as we consider three truths really from this portion of Scripture that I believe this morning will enable us to rejoice through trials. Again, I know that I will face trials. I know that you will face trials. We understand that to be the case. And what is it that God teaches us in His Word that will enable us to rejoice in the midst of trials? The question is not, will I face a trial? The question is, how will I behave through the trial? Notice in verse number 3 of 1 Peter 1, the Bible says, blessed be the God and Father of our Lord Jesus Christ, which according to His abundant mercy hath begotten us again into a lively hope by the resurrection of Jesus Christ from the dead, to an inheritance incorruptible and undefiled, and that fadeth not away, reserved in heaven for you, who",
      "context": "...l I face a trial? The question is, how will I behave through the trial? Notice in verse number 3 of 1 Peter 1, the Bible says, blessed be the God and Father of our Lord Jesus Christ, which according to His abu...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=714",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 972.6000366210938,
      "text": "as we're singing the chorus of that song, when it says are you washed in the blood, I'll say yes I am. Dean hollers out something else when he's leading it, I don't even know half the time what he's saying, but I'm sitting here saying yes I am, amen? I am washed in the blood, and I'm so thankful that my position in Christ is settled. If you're a believer this morning, if you've trusted the Lord Jesus Christ as your personal Savior, you understood that you were a sinner, and that Christ is the only Savior, and that He offers you a gift, and that gift is eternal life through Jesus Christ our Lord, then you have been born again, you have been born of the Spirit, and your position in Christ is settled, and we can rejoice in that. Listen, nobody can take your salvation. I'm thankful for that. The Bible says in John chapter number 10, my sheep hear my voice and I know them and I give unto them eternal life, and they shall never perish, neither shall any man pluck them from my hand, and we see the security of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no trial that I can go through that will alter my position in Christ. That should cause us to rejoice.",
      "context": "...r shall any man pluck them from my hand, and we see the security of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=972",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1038.760009765625,
      "text": "of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no trial that I can go through that will alter my position in Christ. That should cause us to rejoice. You say, but pastor, let me tell you about this trial. I'm just trying to remind you of your position in Christ. I'm trying to help you understand that yes, the trials will vary, and some are going to be harder than others, and more intense, and maybe longer, and whatever it might be, but the reality is that nothing, no trial here on earth can alter your position in Christ. So when I'm going through that trial, I remind myself I'm a child of the King. I belong to the Lord Jesus Christ. My standing is settled, it's sure. I'm heaven-bound. All these other things are just temporary. In fact, look at it with me in verse number three. It says, blessed be the God and Father of our Lord Jesus Christ, notice it says, which according to His abundant mercy, aren't you thankful that our God is merciful? His mercy is everlasting. His mercy is abundant. He is rich in mercy. It says that He hath begotten us again unto a lively hope by the resurrection of Jesus Christ from the dead.",
      "context": "of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1038",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1627.9200134277344,
      "text": "that's my God. When I'm in the midst of the trial, when I'm in the midst of the difficulty and I remind myself of my position in Christ, that I'm saved by the blood of the Lamb, that I'm going to heaven one day, that nothing can alter my position in Christ, it causes me to rejoice. When I recognize and I'm reminded of the great power of my God, that he is the Lord God Omnipotent, that he's able to do exceeding abundantly above all that we ask or think, that's my God. And when I remind myself of that, I can rejoice in the midst of the trial. Number three, we can rejoice through trials because of God's purpose. Because of God's purpose. We see that we rejoice through trials because of my position in Christ. We rejoice through trials because of God's great power. But you and I this morning, we can rejoice through trials because of God's purpose. Let me remind you this morning that God always has purpose. He moves with purpose. And we find that God is a God of purpose and everything that happens in your life and everything that happens in my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Listen, your home is in heaven, you have this inheritance and your position",
      "context": "...g that happens in my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Lis...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1627",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1703.3999938964844,
      "text": "my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Listen, your home is in heaven, you have this inheritance and your position in Christ is settled, but before you get there, you might have this trial for a season. And then notice these words, if need be. If need be. Ye are in heaviness through manifold temptations. As we see this phrase, if need be, in verse number six, it reminds me of God's purpose. It reminds me this morning, and it's important for each of us to understand. Listen, I believe it's imperative that we each understand this morning that God always has a purpose. If need be. Who determines that? Not you and not me. God. If it were up to me, I'd never need be. Amen? And if it were up to you, you probably would never need be either because we just don't really like trials. But God has a purpose. God has a purpose. And there are times in your life and there are times in my life that God allows a trial and we're reminded of our position in Christ, we're reminded of God's power. Those are going to enable us to rejoice, but when we're reminded that God has a purpose in this. This didn't",
      "context": "my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Lis...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1703",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 1848.8399772644043,
      "text": "purpose, we find that it says, if need be, ye are in heaviness through manifold temptations. Notice that the trial of your faith, being much more precious than of gold that perisheth, though it be tried with fire, might be found unto praise and honor and glory at the appearing of Jesus Christ, whom having not seen, ye love, and whom though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory, receiving the end of your faith, even the salvation of your souls. I'll read also in 1 Peter 5, I read these verses a moment ago, but notice in verse 10 and 11 of 1 Peter 5, it says, but the God of all grace who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, establish, strengthen, settle you. To him be glory and dominion forever and ever. Amen. From these two portions of Scripture in 1 Peter 1, verses 6 through 9, and in 1 Peter 5, verses 10 and 11, we really have the opportunity through these two portions of Scripture in 1 Peter to understand two purposes that God has. First and foremost, I believe that God's purpose is to bring honor and glory to himself. That's the primary purpose, is for God to be honored and glorified. And we find that at times God",
      "context": "...e you. To him be glory and dominion forever and ever. Amen. From these two portions of Scripture in 1 Peter 1, verses 6 through 9, and in 1 Peter 5, verses 10 and 11, we really have the opportunity through the...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=1848",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 2496.719955444336,
      "text": "of a great storm, and Jesus then says, peace be still, and the storm is calm. They got to see the power. What manner of man is this that even the winds and the waves obey him? They get to learn some things. Listen, if there was never a storm, they never would have seen that power. If there was never a storm, you would never be able to read the account. I'd never be able to preach or teach the account of Jesus demonstrating his power over the storm. They needed to go through a storm. This morning, God has a purpose. His purpose, first and foremost, is to bring honor and glory to himself. Secondly, it's to develop us spiritually. Notice, it says that the trial of your faith in 1 Peter 1 and verse number seven, being much more precious than of gold that perisheth. That'll put some things in perspective as to what is important and what's the priority. He says, though it be tried with fire, might be found in the praise and honor and glory at the appearing of Jesus Christ. Listen, one day, he's coming back. One day, I'm going to see him. We sang last week, face to face, I shall behold him. One day, I'm going to see my savior. Man, that should encourage every single believer this morning, I'm going to see him. We find, it says that we can have this joy, unspeakable and full of glory",
      "context": "... himself. Secondly, it's to develop us spiritually. Notice, it says that the trial of your faith in 1 Peter 1 and verse number seven, being much more precious than of gold that perisheth. That'll put some thin...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=2496",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 2777.7799682617188,
      "text": "you'll have a trial. The question really for us this morning is how do we respond in the midst of the trial? Can we rejoice through trials? We're commanded to do so. Rejoice in the Lord always, and again I say rejoice. This is the day the Lord hath made. We will rejoice and be glad in it. We can see some people in the pages of scripture, I've just looked at three references this morning, that face great difficulty, and yet they rejoiced. So absolutely we can rejoice through trials. This is not an exhaustive list this morning, but from 1 Peter 1, just three simple thoughts, truths that will enable you, that will enable me to rejoice in the midst of trial. Number one, remember your position in Christ. What a joy to be saved, what a joy. No man, no thing can alter your position in Christ. Remember the power of God in the midst of your trial. Remember God's power. We serve the Lord God omnipotent. He's able to do exceeding abundantly above all that we ask or think. And then finally this morning, remember that God has a purpose. It's never by accident. It's never for naught. It's not just an exercise to, well we got nothing else to do today, so we're just gonna have you do this. It's not busy work, it's not, no, no, no. There's a purpose. First and foremost, that God will be glorified. And secondly, that we'd be developed,",
      "context": "... So absolutely we can rejoice through trials. This is not an exhaustive list this morning, but from 1 Peter 1, just three simple thoughts, truths that will enable you, that will enable me to rejoice in the mid...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=2777",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 2855.3199462890625,
      "text": "for naught. It's not just an exercise to, well we got nothing else to do today, so we're just gonna have you do this. It's not busy work, it's not, no, no, no. There's a purpose. First and foremost, that God will be glorified. And secondly, that we'd be developed, that we'd grow spiritually, that we'd come to that place of spiritual maturity. Trials, rejoicing through trials. Let's pray. Father, we love you. We thank you for loving us. We thank you for the opportunity that you've given us this morning to gather together. We thank you for the word of God. We thank you for the truth. God, I know that I will face trials. I know that each one that sits here this morning will face trials. And God, I pray that you would enable us to rejoice through trials, that these three truths from 1 Peter 1 would just permeate our minds, that we'd be reminded in the midst of trial of our position in Christ, of your great power and of your purpose. Lord, maybe this morning there's some that are just going through trials, difficulties. Lord, I pray that you'd help them this morning. Lord, for one that says, man, I have nothing, no trial right now. God, help them to store this and to be ready to return to it when that trial does come. Lord, that you'd help us to rejoice through trials. There's one that's not sure of heaven,",
      "context": "...s. And God, I pray that you would enable us to rejoice through trials, that these three truths from 1 Peter 1 would just permeate our minds, that we'd be reminded in the midst of trial of our position in Chris...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=2855",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1586.02001953125,
      "text": "begin to consider this prayer of direction or for direction and deliverance, oh, that we would be mindful this evening that we have an enemy, but we have a God who is faithful. He's not going to suffer us, allow us to be tempted above that which we are able. He says that He'll also provide a way to escape. And I think as God's people, we need to be more, and if we'd be praying in this fashion, in this manner, maybe we'd be more actively engaged in looking for the escape route. Because we've been mindful to pray for the direction, lead us not into temptation, deliver us from evil, amen? A prayer for direction and a prayer for deliverance, oh, that God would help us to walk wholly. That we'd be holy in all matter of conversation, according to what He says in 1 Peter 1. Let's pray together. Father, we love You. Thank You for loving us. We know that we have an enemy, and we know that the enemy, even as he tempted the Lord Jesus Christ there in the wilderness, he seeks to tempt us to do evil, to sin, that it might hinder our walk with Thee, adversely impact our testimony for Thee. God, I pray that You'd help us as we see and conclude this model prayer this evening, to be mindful of the work of the enemy.",
      "context": "...lp us to walk wholly. That we'd be holy in all matter of conversation, according to what He says in 1 Peter 1. Let's pray together. Father, we love You. Thank You for loving us. We know that we have an enemy, ...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1586",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 688.2399826049805,
      "text": "references to the love of God, I have often mentioned that God's love can best be described as protective, not as permissive. So many people today want to define the love of God as being permissive. God loves you, do whatever you want to do. God's love is best described as protective. Is there a parent among us this morning that would say that they love their child? Of course. Are you going to let your child do whatever they want to do because you love them? That would be foolish, right? So your love for your children is a protective love, such is the case with God's love. I want you to remember what Peter said in 1 Peter 1, just a few pages over, and then we'll get right into the text of Scripture this morning. See, God is concerned about the behavior of His children. Our behavior matters to God. In 1 Peter 1, in verse 14, the Bible says, As obedient children, not fashioning yourselves according to the former lust and your ignorance, but as He which hath called you is holy, so be ye holy in all manner of conversation, because it is written, Be holy, for I am holy. See, we must understand that there's a balance within the Word of God, and His attributes, His character traits are always in perfect harmony. And we find that it is a popular message still even to this day to preach and",
      "context": "...n is a protective love, such is the case with God's love. I want you to remember what Peter said in 1 Peter 1, just a few pages over, and then we'll get right into the text of Scripture this morning. See, God ...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=688",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1658.7599792480469,
      "text": "To be born once is to die twice, because you'll die a physical death and you die a spiritual death, but to be born twice is to die just once, because you're born of the flesh and you're born of the Spirit, and you'll just die once, a fleshly death. The reality this morning is that as we understand the redemption that was made possible through the work at Christ at Calvary, that which was accomplished for us to be born again, he says here that we're born of God, but then notice this, for his seed remaineth in him, right in the middle of the verse in 1 John 3 and verse number 9, and it reminds us not only when we think about this second birth, the new seed, the new nature. We find that in 1 Peter chapter number 1, just a few pages over, I want you to remember what Peter said with regard to our redemption. In 1 Peter 1, beginning in verse number 18, Peter says this, for as much as you know that you were not redeemed with corruptible things as silver and gold from your vain conversation received by tradition from your fathers. Nope, no silver, no gold could redeem mankind, but, verse 19, with the precious blood of Christ, as of a lamb without blemish and without spot, who verily was foreordained before the foundation",
      "context": "... 1, just a few pages over, I want you to remember what Peter said with regard to our redemption. In 1 Peter 1, beginning in verse number 18, Peter says this, for as much as you know that you were not redeemed ...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1658",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}