{
  "reference": "1 Samuel 25",
  "occurrences": [
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 2054.1400146484375,
      "text": "with Saul. By the way, God was able to deal with Saul, was he not? And Saul did go into battle and did not return from battle. We find that God took care of Saul. Interference between these two events in the life of David is 1 Samuel chapter 25. And in 1 Samuel 25, I believe that God records for us a significant interaction between David and Abigail that helps us with understanding this whole process of not taking matters into our own hands. In Genesis chapter 34, there was a wrong that was committed. There was evil that took place against Dinah. Jacob's sons, the brothers of Dinah, they were grieved and they were full of wrath and they were angry over what had taken place. They were right in their assessment that this thing ought not to be done. But they took matters into their own hands and they made a mess of the situation. We find that David, in 1 Samuel 24, God gives an opportunity when Saul enters into the cave and David says, no, I'm going to resist that. I'm going to trust the Lord. In 1 Samuel chapter 26, God gives another opportunity and Abishai says, let me just smite him once. David says, no, I'm going to trust the Lord. But in 1 Samuel 25, there's a different event that takes place that's not with Saul. See, Saul was the Lord's anointed.",
      "context": "... of Saul. Interference between these two events in the life of David is 1 Samuel chapter 25. And in 1 Samuel 25, I believe that God records for us a significant interaction between David and Abigail that helps u...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=2054",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 2127.6600341796875,
      "text": "Lord. In 1 Samuel chapter 26, God gives another opportunity and Abishai says, let me just smite him once. David says, no, I'm going to trust the Lord. But in 1 Samuel 25, there's a different event that takes place that's not with Saul. See, Saul was the Lord's anointed. David had a certain perspective about not raising his hand against the Lord's anointed. Saul was in the place where God had him at that particular time. But when you look at 1 Samuel chapter number 25, the Bible records for us an interaction between David and Abigail with regard to Nabal and his men. Now Nabal was a fool, says it right in the passage of Scripture. David and his men helped Nabal and did all sorts of things and it was time to be paid. And Nabal says, who's David? I mean, anyone can say they're anyone these days. And David says, the men come back and David says, all right boys, saddle up. We're going to go kill them all. That's what he says. That's what he says. Notice David says in verse number 21 of 1 Samuel 25. Now David had said, surely in vain have I kept all this fellow hath in the wilderness so that nothing was missed of all that pertained unto him. And he hath requited me evil for good. Or do something good and somebody pays you back with evil. David says, this is what happens.",
      "context": "...y and Abishai says, let me just smite him once. David says, no, I'm going to trust the Lord. But in 1 Samuel 25, there's a different event that takes place that's not with Saul. See, Saul was the Lord's anointed...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=2127",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 2492.8000106811523,
      "text": "feast in his house like the feast of a king, and Nabal's heart was merry within him, for he was very drunken. Wherefore, she told him nothing less or more until the morning light. But it came to pass in the morning when the wine was gone out of Nabal and his wife had told him these things, that his heart died within him and he became as a stone. And it came to pass about 10 days after that the Lord smote Nabal that he died. God's able, God's able. Days passed, but God dealt with Nabal. The Bible says in verse 39, And when David heard that Nabal was dead, he said, Blessed be the Lord. Notice what he says, That hath pleaded the cause of my reproach from the hand of Nabal, and hath kept his servant from evil. For the Lord hath returned the wickedness of Nabal upon his own head. David sent and communed with Abigail to take her to him, to wife. I want you to notice that in this portion of Scripture in Genesis, or excuse me, in 1 Samuel 25, sandwiched between these two events where David is dealing with Saul, there's this interaction with Nabal and Abigail. And David is absolutely determined. In chapter 24, he's not gonna raise his hand against the Lord's anointed. He responds properly. But now Nabal, I'm gonna kill him and I'm gonna kill all the men. Taking matters into my own hands.",
      "context": "...o him, to wife. I want you to notice that in this portion of Scripture in Genesis, or excuse me, in 1 Samuel 25, sandwiched between these two events where David is dealing with Saul, there's this interaction wit...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=2492",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 2575.060012817383,
      "text": "with Saul, there's this interaction with Nabal and Abigail. And David is absolutely determined. In chapter 24, he's not gonna raise his hand against the Lord's anointed. He responds properly. But now Nabal, I'm gonna kill him and I'm gonna kill all the men. Taking matters into my own hands. And he says at the end, after all that we've read and after all that we considered from 1 Samuel 25, he says, that he says, Blessed be the Lord that hath pleaded the cause of my reproach from the hand of Nabal and hath kept his servant from evil. You ever take matters into your own hands and find yourself having to enter into the confession closet and ask God to forgive you for how you behaved? Because when you take matters into your own hands, make a mess of things. We're not trusting the Lord. We're not trusting that he's able. Remember, I said this by way of introduction, when we respond, when we react to being wrong in this manner, then it's really demonstrating a lack of trust, that God is not able, that somehow I have to avenge myself, but God says, vengeance is mine, saith the Lord. And in our lives, listen, you're going to be wronged and I'm gonna be wronged. It's gonna happen. It might happen tonight. It might happen this week. Maybe you've been wronged recently. Maybe you can think this evening of a specific time in which you took matters",
      "context": "... own hands. And he says at the end, after all that we've read and after all that we considered from 1 Samuel 25, he says, that he says, Blessed be the Lord that hath pleaded the cause of my reproach from the han...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=2575",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}