{
  "reference": "1 Samuel 17",
  "occurrences": [
    {
      "sermon_id": "M95WZQin3TU",
      "timestamp": 1006.1599731445312,
      "text": "man of war. Was he not? I mean, David was the sweet psalmist of Israel. He could play that harp like no one else, but David was a warrior. Amen? David didn't back down to Goliath. I mean, he's like, let me go. I'll go and fight this uncircumcised Philistine. What are you all afraid of? Is there not a cause? Is that the same David? Is that what you read in 1 Samuel 17? Amen? He's not afraid of a fight. Not afraid to pick up a sword and go. But he's waiting on God. He's not taking matters into his own hands. He's saying, I understand that from him, from God, cometh my salvation. Begin to see the growth of David in his life as you study through his life. And you find that many times that David was obviously with the situation of Nabal. He's like, we're going to go and we're going to kill them all. And Abigail comes and intervenes and helps that situation. But he is ready to go kill them all. They're all going to be killed. And by the way, David could do it with his men. It was going to be accomplished. But you know, later on in his life, the Philistines rise up against him. You know what David does? He prays. God, should I go up against him? What's he doing? He's waiting on God. He's seeking counsel from God. God gives him victory.",
      "context": "... What are you all afraid of? Is there not a cause? Is that the same David? Is that what you read in 1 Samuel 17? Amen? He's not afraid of a fight. Not afraid to pick up a sword and go. But he's waiting on God. H...",
      "sermon_title": "\"Pour Out Your Heart Before Him\"  Psalm 62:1-12",
      "url": "https://www.youtube.com/watch?v=M95WZQin3TU&t=1006",
      "channel": "Unknown",
      "publish_date": 20250414
    },
    {
      "sermon_id": "iMFOWiAni18",
      "timestamp": 2768.5199584960938,
      "text": "hear people say it, right? Judge not. Actually, the Bible teaches us to judge, to judge all things. We're judged with righteous judgment. We're to judge according to the word of God. But you know who you should judge first? Yourself. Before you ever go trying to judge somebody else, you ought to judge yourself. Mote and beam, you remember the account? Do you remember? I don't need to turn there. We're out of time. Amen. You remember the account? Hey, listen. You got a little tiny speck, and you're trying to criticize someone and trying to, while you got a beam, a big old pole in your eye. Right? That's what he teaches. And think about this, 1 Samuel 17, a familiar passage of Scripture, David fighting Goliath. It's amazing. I mean, I'm going to run out of time this morning, but it's okay. Here's what happens in 1 Samuel 17 that's awesome. You know who the only one is that's going to do something for God? Who's the only one? David. Is there not a cause? And guess who criticizes him? Everybody else that's not doing anything. Am I not right? 1 Samuel 17, is that not what happens? You can't do this. You're here. You're here. I know the pride of your heart. The reality is that David, he's going to stand before God, and so are you. Before Saul and Eliab and all the others should be casting judgment at David,",
      "context": "...le you got a beam, a big old pole in your eye. Right? That's what he teaches. And think about this, 1 Samuel 17, a familiar passage of Scripture, David fighting Goliath. It's amazing. I mean, I'm going to run ou...",
      "sermon_title": "\"The Judgment Seat Of Christ\"  II Corinthians 5:10-13",
      "url": "https://www.youtube.com/watch?v=iMFOWiAni18&t=2768",
      "channel": "Unknown",
      "publish_date": 20250316
    }
  ]
}