{
  "reference": "1 Samuel 16",
  "occurrences": [
    {
      "sermon_id": "LgRl3wwGxNo",
      "timestamp": 643.6000099182129,
      "text": "When we note the behavior of the possessor, we must first look at and acknowledge the internal work that God is doing. I'm so thankful that God's doing a work on the inside. Amen? God is working in the lives of His children. And you think about the internal work of the possessor, and the Bible describes it in v. 5 that in Him, in this one that is the possessor, \"...in him, verily, truly, is the love of God perfected.\" Don't think about the work that God is doing on the inside. The reality is that I can't see what God is doing on the inside, and you can't see what God is doing on my inside. There is a truth that is given in 1 Samuel 16 with regard to the choosing of David to be the king of Israel. And first, Eliab stands before Samuel. And remember, he's the firstborn. And Samuel immediately has this thought, surely, he is the one. Right? And God says, no. He's not the one. Don't look on his appearance, or on his countenance. He says that God sees the inward. Man sees the outward, but God sees the inward. Both the inward and the outward are important as we'll look at our message this morning and acknowledge that truth, but I want you to consider first of all that before there's any external, there's an internal work that God is doing. As we trust that the Lord Jesus Christ",
      "context": "... on the inside, and you can't see what God is doing on my inside. There is a truth that is given in 1 Samuel 16 with regard to the choosing of David to be the king of Israel. And first, Eliab stands before Samue...",
      "sermon_title": "Sermon LgRl3wwGxNo",
      "url": "https://www.youtube.com/watch?v=LgRl3wwGxNo&t=643",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgRl3wwGxNo",
      "timestamp": 784.4400024414062,
      "text": "is working. His love, think about the love of God. Nothing can separate us from the love of God. Aren't you thankful for that? We sang this morning in Sunday school a couple of songs, one of them, Jesus Loves Me, This I Know. For the Bible tells me so. Aren't you thankful for the love of God? And His love is perfected in us, and as we think about the love of God, and we think about the work that He's doing in us, and we think about the internal work, we ought to be grateful for that. We ought to rejoice in that. We ought to invite that work to continue to take place. Amen? God, continue to speak to my heart. God, continue to work in my life. God, continue to show me areas in my life where I need to change so that I might be more like You, so that I might please You, so that I might walk in a manner in which is honoring and pleasing in Your sight. God, continue that internal work. We find not only the internal work of the possessor or in the possessor, but I want you to think about the external evidence. As I mentioned, that work that is being done on the inside will eventually be seen on the outside. When you think about David in 1 Samuel 16, you think about David being anointed in that great truth",
      "context": "...t is being done on the inside will eventually be seen on the outside. When you think about David in 1 Samuel 16, you think about David being anointed in that great truth",
      "sermon_title": "Sermon LgRl3wwGxNo",
      "url": "https://www.youtube.com/watch?v=LgRl3wwGxNo&t=784",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgRl3wwGxNo",
      "timestamp": 847.4400024414062,
      "text": "the possessor, but I want you to think about the external evidence. As I mentioned, that work that is being done on the inside will eventually be seen on the outside. When you think about David in 1 Samuel 16, you think about David being anointed in that great truth that God gives to Samuel in 1 Samuel 16 in verse number seven with regard to God seeing the heart, man looking at the outward appearance. You would find this truth that God says to Samuel that man looketh on the outward, but the Lord looketh on the heart. Remember, God had told Samuel and Samuel told Saul that God had selected a man that was after his own heart, but we see the external evidence in the life of David, for there's a servant that comes to Saul just a short time later in 1 Samuel 16 in verse number 18, and here's how he describes David. He describes him as being a son of Jesse the Bethlehemite that is cunning and playing, a mighty valiant man, a man of war and prudent in matters and a comely person, and the Lord is with him. I want you to understand that God saw the heart of David, but this unnamed servant saw the external evidence of the work that God had done in David's heart. As we look at our lives and we look at this passage of scripture in 1 John chapter number two,",
      "context": "...t is being done on the inside will eventually be seen on the outside. When you think about David in 1 Samuel 16, you think about David being anointed in that great truth that God gives to Samuel in 1 Samuel 16 i...",
      "sermon_title": "Sermon LgRl3wwGxNo",
      "url": "https://www.youtube.com/watch?v=LgRl3wwGxNo&t=847",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgRl3wwGxNo",
      "timestamp": 2731.8800048828125,
      "text": "Word many examples of how we can know that we know You, that we are in Christ. This one that is before us this morning, I pray that You'd help us to evaluate our lives. I trust that those that are gathered here this morning are possessors, that, God, You're doing a work internally in each of us, that the evidence is seen on the external. There may be one that the Holy Spirit may have convicted this morning, they're just a professor, there's never actually been a time in which they've been born again. If that would be You this morning, I trust that You would respond to the invitation that the Lord extends, whosoever shall call upon the name of the Lord shall be saved, that You would receive the gift of God, which is eternal life through Jesus Christ our Lord, and no longer would You be just a professor, that You would be a possessor of eternal life. For each one that's here that's accepted the gift of God, that's saved. God, I pray that our lives would be marked by obedience, that our heart attitude would be one of submission and obedience as we come to Your Word. In fact, that we would read Your Word daily with the purpose of obedience. We think of Samuel when he said, \"'Speak, Lord, for Thy servant heareth,' hearing with the purpose of obeying.\" David, the example in 1 Samuel 16, God knew",
      "context": "...'Speak, Lord, for Thy servant heareth,' hearing with the purpose of obeying.\" David, the example in 1 Samuel 16, God knew",
      "sermon_title": "Sermon LgRl3wwGxNo",
      "url": "https://www.youtube.com/watch?v=LgRl3wwGxNo&t=2731",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgRl3wwGxNo",
      "timestamp": 2825.959991455078,
      "text": "and obedience as we come to Your Word. In fact, that we would read Your Word daily with the purpose of obedience. We think of Samuel when he said, \"'Speak, Lord, for Thy servant heareth,' hearing with the purpose of obeying.\" David, the example in 1 Samuel 16, God knew his heart. That unnamed servant of Saul observed the external evidence of what God knew to be done internally. God, I pray that'd be our testimony this morning, that our lives would clearly indicate that we belong to You and that we are a possessor of eternal life. Thank You for the work that You do in us. God, help us to have that desire for You to continue by Your power and with Your help that we would be doers of the Word, that we would keep Your commandments. Would You work in these few moments of invitation? Help us to respond as You've spoken to our hearts, and we'll thank You for it. Would You stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano. As she does, the altar is open. Maybe this morning you want to come and just thank God for the internal work that He's doing in you. Thank Him for salvation. Maybe this morning you want to come and ask Him to continue to reveal to you, to help you to walk in obedience,",
      "context": "...'Speak, Lord, for Thy servant heareth,' hearing with the purpose of obeying.\" David, the example in 1 Samuel 16, God knew his heart. That unnamed servant of Saul observed the external evidence of what God knew t...",
      "sermon_title": "Sermon LgRl3wwGxNo",
      "url": "https://www.youtube.com/watch?v=LgRl3wwGxNo&t=2825",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}