{
  "reference": "1 Thessalonians 1",
  "occurrences": [
    {
      "sermon_id": "iMFOWiAni18",
      "timestamp": 2498.5199584960938,
      "text": "what Paul says after he talks about this truth, this reality that we shall, we must all appear before the judgment seat of Christ. Notice the response in verse number 11. He says, Knowing therefore the terror of the Lord. You know the Bible says in the book of Hebrews it's a fearful thing to fall into the hands of an angry God. Our God, here's what the Bible says, is a consuming fire. That's what the Bible says. Knowing therefore the terror of the Lord. What does he say? How does it motivate him? Well, he says, we persuade men. I believe this is an introductory thought that we'll finish up as we end the fifth chapter where he talks about having this ministry of reconciliation and sharing the gospel. And we see the truth that's given there, but I recognize this morning that the reality is that, he says, knowing therefore the terror of the Lord, we persuade men. Why am I motivated to go and tell people about Jesus? Well, number one, I know that if they die without Christ, they're gonna go to a lake of fire. Number two, I understand that Christ has given me the responsibility, yea, the privilege, to be his spokesperson. He's entrusted us with that responsibility, that privilege. Paul says it this way in 1 Thessalonians 1, 2, excuse me, we've been allowed of God. What a joy. He says in verse number 11, notice,",
      "context": "... spokesperson. He's entrusted us with that responsibility, that privilege. Paul says it this way in 1 Thessalonians 1, 2, excuse me, we've been allowed of God. What a joy. He says in verse number 11, notice,",
      "sermon_title": "\"The Judgment Seat Of Christ\"  II Corinthians 5:10-13",
      "url": "https://www.youtube.com/watch?v=iMFOWiAni18&t=2498",
      "channel": "Unknown",
      "publish_date": 20250316
    },
    {
      "sermon_id": "iMFOWiAni18",
      "timestamp": 2571.5199584960938,
      "text": "understand that Christ has given me the responsibility, yea, the privilege, to be his spokesperson. He's entrusted us with that responsibility, that privilege. Paul says it this way in 1 Thessalonians 1, 2, excuse me, we've been allowed of God. What a joy. He says in verse number 11, notice, but we are made manifest, what does he say? Unto God. Unto God. Why does he say we're made manifest unto God? Well, because he's the one that I'm gonna stand before. He's the one I'm gonna stand before. In all transparency, I'm not gonna stand before you one day and give an account. You're not gonna stand before me and give an account in that sense. But we must all appear before God. If you try to please man, you'll succeed some of the time. But in the moments where you succeed some of the time, you'll disappoint others at the same time. We ought to please God. I preached a message, I mentioned it a few weeks ago. I preached a message a couple of years ago for the audience of one. For the audience of one. I'm living to please God. He says that we are made manifest unto God, and I trust also are made manifest in your consciences, but first and primary is that we're made manifest unto God. Notice in verse number 12, he says, for we commend not ourselves again unto you, but give you occasion to glory on our behalf.",
      "context": "... spokesperson. He's entrusted us with that responsibility, that privilege. Paul says it this way in 1 Thessalonians 1, 2, excuse me, we've been allowed of God. What a joy. He says in verse number 11, notice, but we ar...",
      "sermon_title": "\"The Judgment Seat Of Christ\"  II Corinthians 5:10-13",
      "url": "https://www.youtube.com/watch?v=iMFOWiAni18&t=2571",
      "channel": "Unknown",
      "publish_date": 20250316
    },
    {
      "sermon_id": "2KK1iGdL4p0",
      "timestamp": 2123.1799926757812,
      "text": "to follow the process that God has established of preaching the gospel, people get saved, they get baptized, they join the church, they disciple them, and those people go out and they preach the gospel, and guess what's happening? The church is growing. The church is not only growing numerically, but the church is growing spiritually. And we find that as you look at the church in Thessalonica, we see this numeric growth that would be possible because of their vision and their understanding of preaching the gospel here in 1 Thessalonians 1, but I wanna note for you in 2 Thessalonians 1, the spiritual growth that we see in the church in Thessalonica. I asked the follow-up question by way of introduction, not only should a church grow spiritually, should a church grow, but I asked this, is all growth numeric? The answer is no, there should be numeric growth, but there should be spiritual growth. And by the way, I don't know that we can say one is better than the other, but spiritual growth is vital. It is absolutely imperative that God's people are growing spiritually, and I believe that as they grow spiritually, the byproduct is going to be numeric growth. Because as we're growing spiritually, we're doing what we're supposed to be doing, and therefore the numeric growth comes. Does that make sense? See, if we learn, if we learn to abide in him, if we learn to do, as I'm preaching on Wednesday nights,",
      "context": "...t would be possible because of their vision and their understanding of preaching the gospel here in 1 Thessalonians 1, but I wanna note for you in 2 Thessalonians 1, the spiritual growth that we see in the church in T...",
      "sermon_title": "\"I Will Build My Church\" Matthew 16:18",
      "url": "https://www.youtube.com/watch?v=2KK1iGdL4p0&t=2123",
      "channel": "Unknown",
      "publish_date": 20240722
    }
  ]
}