{
  "reference": "1 Timothy 4",
  "occurrences": [
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 1488.6199951171875,
      "text": "saw that little checklist and I was behind and I knew where I was supposed to be and I got discouraged and I got overwhelmed. And I've tried to encourage people, listen, it's not about the quantity, it's about the quality. If you can only read a chapter a day, then read a chapter a day, but get something from it. In 1 Timothy 4, in verse number 13, the Bible says, till I come, give attendance to reading, to exhortation, to doctrine. No doubt, when he speaks of reading, he's speaking of reading the Word of God. Many books can inform, but only the Bible can transform. A scholar of yesteryear said that of all of the volumes, you remember they used to have encyclopedias that were printed, now it's Wikipedia typically. I think it was a few years ago that, what was it, Britannica, is that the company that did the encyclopedias all those years? For the very first time, they didn't print out a series of encyclopedia, because so many people are using the internet and what have you. But this particular theologian of yesteryear, he said, of all of the books in my library, and he listed a whole host of how many volumes he had, he said, I could put all of those on this side of the table and I could put the Bible over here and the Bible's more valuable. And it really is. It's amazing to me, and I'm not against somebody",
      "context": "...ity. If you can only read a chapter a day, then read a chapter a day, but get something from it. In 1 Timothy 4, in verse number 13, the Bible says, till I come, give attendance to reading, to exhortation, to do...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=1488",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "X0_tae_rdlg",
      "timestamp": 1488.8800048828125,
      "text": "in 1 Timothy chapter 4, is telling Timothy, listen, here's what's going to happen in the last days and there will be some, notice in verse 1, some shall depart from the faith. Some shall depart. But what's the exhortation to Timothy? Continue. What's the exhortation for us this morning? I don't want to be part of the some that shall depart. In fact, if you look at the end of 2 Timothy in the 4th chapter, you find that Paul mentions about Demas, hath forsaken me, having loved this present world, in 2 Timothy 4 in verse number 10. And we find that here as we look to the truth of God's Word and we see that God has provided us with an explanation of what we'll deal with, but the exhortation remains the same. He tells him this in the beginning of 1 Timothy 4, but then skip down, if you will, to the very last verse of 1 Timothy chapter 4 in verse number 16. He says this, take heed unto thyself and unto the doctrine. Notice what he says, continue in them. Continue in them. For in doing this thou shalt both save thyself and them that hear thee. And so we find that Paul continues to give this exhortation. He's consistent in the message that he delivers to Timothy, both in 1 Timothy and again in 2 Timothy, this message of continue. The pressures are great. The opposition is",
      "context": "...f what we'll deal with, but the exhortation remains the same. He tells him this in the beginning of 1 Timothy 4, but then skip down, if you will, to the very last verse of 1 Timothy chapter 4 in verse number 16....",
      "sermon_title": "Sermon X0_tae_rdlg",
      "url": "https://www.youtube.com/watch?v=X0_tae_rdlg&t=1488",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}