{
  "reference": "1 Timothy 3",
  "occurrences": [
    {
      "sermon_id": "hwLKY1FAuwU",
      "timestamp": 986.5400085449219,
      "text": "I'm so thankful for the scripture, for the word of God, for thus saith the Lord. And so what does he say? He says that the, in verse number 17, let the elders that rule well be counted worthy of double honor, especially they who labor in the word and doctrine. For the scripture saith, thou shall not muzzle the ox that treadeth out the corn, and the laborer is worthy of his reward. We find that the pastor, indeed, it's certainly to be noted that the pastor is not to be greedy, a filthy lucre. The Bible gives that as a requirement in 1 Timothy 3. In verse number 3, he again says it in 1 Peter chapter 5, in verse number 2. But we understand this morning that the pastor must be compensated in order to provide for his family. It just is what it is. Now, I'll be honest with you, this is one of the hardest subjects for me to ever preach on. It really is. It's a difficult subject, being the pastor of the church. This is an easy passage to preach from if I'm preaching somewhere else, just to be honest with you, because it's a biblical truth. Why do I say it's a difficult thing? Because people hear what they want to hear. They receive what they want to receive. They think, assume what they want to assume. And so let me be very clear this morning, before I say anything more,",
      "context": "...noted that the pastor is not to be greedy, a filthy lucre. The Bible gives that as a requirement in 1 Timothy 3. In verse number 3, he again says it in 1 Peter chapter 5, in verse number 2. But we understand thi...",
      "sermon_title": "\"Honorable Elders\" I Timothy 5:17-25",
      "url": "https://www.youtube.com/watch?v=hwLKY1FAuwU&t=986",
      "channel": "Unknown",
      "publish_date": 20240623
    },
    {
      "sermon_id": "BER64GTDRQY",
      "timestamp": 144.4199981689453,
      "text": "God. Not everything that's called worship today in 2024 is really worship. There's a lot of things that happen today and all around this globe on a Sunday in the name of quote-unquote religion that is not aligned with worship according to what God has set forth in his word. If you go back to the Old Testament, the children of Israel could not approach God any old way they wanted to approach God. They had to approach God on God's terms, God's way. Amen? And so much so is the case for the local church. God has instructed his church, and we know that there's proper behavior. And what a blessing it is to understand the instruction that God has given. As we come to verse number 16 of chapter number 3, the Bible says this, what a great, powerful verse of Scripture. There is so much in one verse of Scripture that is before us this morning. The Bible says, and without controversy, great is the mystery of godliness. God was manifest in the flesh, justified in the Spirit, seen of angels, preached unto the Gentiles, believed on in the world, received up into glory. Isn't that a powerful verse of Scripture? I mean, we look at this verse of Scripture and we see all that is contained therein. There are some theologians of yesteryear that have the idea, the belief that 1 Timothy 3",
      "context": "... is contained therein. There are some theologians of yesteryear that have the idea, the belief that 1 Timothy 3",
      "sermon_title": "\"Great Is The Mystery Of Godliness\" I Timothy 3:16",
      "url": "https://www.youtube.com/watch?v=BER64GTDRQY&t=144",
      "channel": "Unknown",
      "publish_date": 20240505
    },
    {
      "sermon_id": "BER64GTDRQY",
      "timestamp": 219.77999877929688,
      "text": "Gentiles, believed on in the world, received up into glory. Isn't that a powerful verse of Scripture? I mean, we look at this verse of Scripture and we see all that is contained therein. There are some theologians of yesteryear that have the idea, the belief that 1 Timothy 3 and verse number 16 stood as maybe an anthem or a hymn for the local church, if you will, and it was something that would be readily understood and they would sing it and they would rejoice in the truth that is found in this very just concise verse of Scripture. But how powerful this verse of Scripture is. I notice that the Bible begins, without controversy. I'm so thankful for settled truth. Amen? I'm so thankful that God said He, Jesus, He said, I am the way, the truth, and the life. No man cometh unto the Father but by me. But then He said, sanctify them by thy word. Thy word is truth. What a blessing to have God's word. What a blessing that God inspired His word, all Scripture is given by inspiration of God, but then to understand that God providentially preserved His word so that every generation of believers would have the word of God. What a blessing. See, inspiration without preservation is, it's a great doctrinal truth, but the reality is that we don't have the originals, but I don't need the originals because God promised to preserve His word, and He has.",
      "context": "... is contained therein. There are some theologians of yesteryear that have the idea, the belief that 1 Timothy 3 and verse number 16 stood as maybe an anthem or a hymn for the local church, if you will, and it wa...",
      "sermon_title": "\"Great Is The Mystery Of Godliness\" I Timothy 3:16",
      "url": "https://www.youtube.com/watch?v=BER64GTDRQY&t=219",
      "channel": "Unknown",
      "publish_date": 20240505
    },
    {
      "sermon_id": "BER64GTDRQY",
      "timestamp": 717.9399948120117,
      "text": "of Christ, that He is the God-man. He's a hundred percent God, and a hundred percent man. Some have referred to it as the hyperstatic union, and we understand this morning that as we look at this truth, why did God have to come in the form of a man? Well, so that He could die for the sins of humanity. It was the only way that man could be redeemed. It was predetermined before the foundation of the world, according to Ephesians 1, according to 1 Peter, that Jesus Christ, the Lamb of God, God in flesh, that He would be our substitute on that cross. And we'll get to that in just a few moments in this verse of Scripture in 1 Timothy 3 and verse 16, but we find that it begins with the incarnation, that God was manifest in the flesh. Listen, if He's not man, why is He asleep on the boat? If He's not God, how could He stand and say, peace, be still? He's the God-man, the incarnation. Philippians chapter 2 says it this way. Philippians chapter 2, where Mark was preaching from chapter 3 last Sunday evening, and what a great book this is. I know that we've spoken much about this book. We find that in chapter number 2, beginning in verse number 5, the Bible says, let this mind be in you, which was also in Christ Jesus, who being in the form of God, thought it not",
      "context": "...substitute on that cross. And we'll get to that in just a few moments in this verse of Scripture in 1 Timothy 3 and verse 16, but we find that it begins with the incarnation, that God was manifest in the flesh. ...",
      "sermon_title": "\"Great Is The Mystery Of Godliness\" I Timothy 3:16",
      "url": "https://www.youtube.com/watch?v=BER64GTDRQY&t=717",
      "channel": "Unknown",
      "publish_date": 20240505
    },
    {
      "sermon_id": "BER64GTDRQY",
      "timestamp": 874.3800048828125,
      "text": "of things in heaven, and things in earth, and things under the earth, and that every tongue should confess that Jesus Christ is Lord, the glory of God the Father, hallelujah. Often I've said of that passage of Scripture, it's not a matter of if, it's a matter of when. Every tongue will confess, every knee will bow. When that takes place makes all the difference. If you do it on this side of eternity, man, for all of eternity, you'll be with Jesus in heaven. You'll be with your Savior. But if you do it at the great white throne judgment, you'll be cast in the lake of fire. You will confess. You'll just be in the lake of fire for all of eternity. How sad. You don't have to. You can confess now. Believe that God was manifest in the flesh for you. He is Lord. Back in 1 Timothy 3 and verse 16, number one, we see the incarnation of Christ. Number two, we see the resurrection of Christ. In 1 Timothy 3, 16, and without controversy, great is the mystery of godliness. God was manifest in the flesh, and then notice this, justified in the spirit, seen of angels. This would refer to the resurrection of the Lord Jesus Christ. In Romans chapter one, we won't take the time to read the account in Matthew. Look if you will at Romans chapter number one.",
      "context": "...ve to. You can confess now. Believe that God was manifest in the flesh for you. He is Lord. Back in 1 Timothy 3 and verse 16, number one, we see the incarnation of Christ. Number two, we see the resurrection of ...",
      "sermon_title": "\"Great Is The Mystery Of Godliness\" I Timothy 3:16",
      "url": "https://www.youtube.com/watch?v=BER64GTDRQY&t=874",
      "channel": "Unknown",
      "publish_date": 20240505
    },
    {
      "sermon_id": "BER64GTDRQY",
      "timestamp": 2202.239959716797,
      "text": "alive, quickened. It's amazing, it's an amazing truth. The proclamation of the gospel, the gospel still works. The gospel still works. There are some today that are trying to water it down. There are some today that are trying to come with a new message, trying to be more inclusive and what have you, whatever terms you wanna use. Understand this morning, the gospel still works. And it is only the gospel that works to transform a life that someone could pass from death unto life. It's only through the gospel of the Lord Jesus Christ. Number four, if you're taking notes back in 1 Timothy 3 and verse 16, the Bible says, and without controversy, great is the mystery of godliness. God was manifest in the flesh, his incarnation, justified in the spirit, seen of angels, his resurrection, preached unto the Gentiles, believed on in the world, the proclamation of the gospel. And then it ends with this, received up into glory. Number four this morning, I see the ascension of Christ, the ascension of Christ. Turn over to Acts chapter number one, if you will. Be honest with you, Acts chapter one is the first 11 verses of this passage are just precious verses. I love going and reading these verses and putting my mind, if you will, in that sanctified imagination of being in the presence of Jesus after he'd risen from the dead, after he'd walked on this earth and had given instruction.",
      "context": "... It's only through the gospel of the Lord Jesus Christ. Number four, if you're taking notes back in 1 Timothy 3 and verse 16, the Bible says, and without controversy, great is the mystery of godliness. God was m...",
      "sermon_title": "\"Great Is The Mystery Of Godliness\" I Timothy 3:16",
      "url": "https://www.youtube.com/watch?v=BER64GTDRQY&t=2202",
      "channel": "Unknown",
      "publish_date": 20240505
    },
    {
      "sermon_id": "AZytGOf3GPA",
      "timestamp": 1931.1000671386719,
      "text": "two together, if you will. And I remember going to some churches, and Holly would travel with me, and as we would travel to go to these churches, we would find that there were some churches that didn't have a pastor for two or three years. That's a tragic situation. And unfortunately what happens in a church like that is sometimes 1 Timothy 3 kind of gets set aside because we just want a pastor. Usually they'd be willing to do it. No, God sets forth requirements. He gives us these qualifications, and it's important that we understand that God provides these to us. He says, moreover, notice verse number 7, he must, he uses that word again, have a good report of them which are without. Now that's interesting. Remember, I've talked to you that it's dealing with the private life and the public life. The pastor not only has a good report of those within, but it says, it actually doesn't say that, but it says a good report of them without, lest he fall into reproach and the snare of the devil. The pastor ought not be known in the community as being a bad person, a wicked person. In fact, it's always interesting to me, and I love the passage of Scripture in the book of 1 Samuel where Saul's friend says, there is a man of God in this city, talking of Samuel.",
      "context": "...years. That's a tragic situation. And unfortunately what happens in a church like that is sometimes 1 Timothy 3 kind of gets set aside because we just want a pastor. Usually they'd be willing to do it. No, God s...",
      "sermon_title": "\"Behavior In God's Church - Part 2\" I Timothy 3:1-15",
      "url": "https://www.youtube.com/watch?v=AZytGOf3GPA&t=1931",
      "channel": "Unknown",
      "publish_date": 20240422
    },
    {
      "sermon_id": "AZytGOf3GPA",
      "timestamp": 2066.9400634765625,
      "text": "requirements are. And he says likewise in verse number 8, we segue to the office of a deacon. We see that reference in verse number 10 and also in verse number 13. The Bible says to them that use the office of a deacon in verse number 10, and verse number 13, for they that have used the office of a deacon. I said this in Sunday school this morning, it's important that we understand that here he's speaking about the office of a deacon. The language here makes clear that these qualifications are necessary, not just desired. We've said that of the bishop, the pastor, but it's true also of the deacon. It's important that we note that the word deacon in its most plain form means a servant, a minister. In fact, many times in the New Testament, only here in fact, in 1 Timothy 3, is the Greek word translated deacon. Everywhere else it's translated either minister or servant or something with regard to that kind of idea of ministering, of serving. I said it in Sunday school that every deacon is a servant, is a minister. But not every servant or minister is a deacon. Does that make sense? We're all to be servants of the Lord. We're all to serve Christ. We find that God establishes again as He's giving the order in the church that thou mayest know how thou oughtest to behave thyself.",
      "context": "...n form means a servant, a minister. In fact, many times in the New Testament, only here in fact, in 1 Timothy 3, is the Greek word translated deacon. Everywhere else it's translated either minister or servant or...",
      "sermon_title": "\"Behavior In God's Church - Part 2\" I Timothy 3:1-15",
      "url": "https://www.youtube.com/watch?v=AZytGOf3GPA&t=2066",
      "channel": "Unknown",
      "publish_date": 20240422
    }
  ]
}