{
  "reference": "1 Timothy 2",
  "occurrences": [
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 494.8999938964844,
      "text": "be done. But each of us have a will. Each of us have a will. We believe this morning that as we understand our will, and you know how strong your will is, and you know how submissive you are to the will of God, but if we're not careful, our will influences our prayer lives more than God's will influences our prayer lives. How can we, how can you, how can I this morning, how can we truly say, not my will, but thine? But thine be done. Because we all have a will, we all have a desire, and this morning we find it tucked within these verses of Scripture, the instruction, thy will be done. As we examine this truth and these four words this morning, this might be one of the most critical aspects of prayer that I've dealt with in the last several weeks. Thy will be done. How do we determine God's will? Well, God's will is revealed to us in His Word. We must be students of the Word. We're to pray according to His will, according to the truth that we receive in 1 John 5, 14, and 15. We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us",
      "context": "...h that we receive in 1 John 5, 14, and 15. We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked wi...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=494",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 566.7000122070312,
      "text": "We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked within the instruction of prayer in 1 Timothy 2 is really a parenthetical statement that God gives us and reveals to us what His will is for mankind. How is it that I can align my will with God's will? Because that's really what it boils down to, is how is it that we can align our will with God's will? Take your Bible quickly, if you will. Turn to the book of Psalm, Psalm 37. I believe in Psalm 37, God gives us some really nuggets of truth, some indicators, if you will, for how we, as God's people, can align our will. with His will, because Jesus, in responding to the request of the disciple, Lord, teach us to pray, gave this framework, this pattern for prayer, and within the framework, He says, Thy will be done. In Psalm chapter 37, the Bible says this in verse number 3. I'm going to look at verses 3 through 7. Notice what the Bible says. Trust in the Lord and do good. So shalt thou dwell in the land, and verily thou shalt be fed. Delight thyself also in the Lord, and He shall give thee the desires of thine heart. How many times have you heard verse 4 taken completely out of context?",
      "context": "We find that as even looking at the text of Scripture in 1 Timothy 2, verses 1 through 8, tucked, I preached a message on it, God's will for humanity, because tucked wi...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=566",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}