{
  "reference": "2 Chronicles 24",
  "occurrences": [
    {
      "sermon_id": "R9LB-ChokfQ",
      "timestamp": 138.94000244140625,
      "text": "do. And the reality is that it is an understood thing that instruction is provided with the expectation that it will be followed or applied. Is that valid? We understand it with Simon Says, a little tiny game, but I'm talking now, let's look at the biblical truth of instruction. We can apply it as we will this evening, spiritual instruction, but in any arena in life, if someone is providing instruction, the expectation of the instructor is that that instruction is going to be received and applied. Otherwise they feel like they're wasting their time. And we find that unfortunately far too often biblical instruction has been rejected instead of being received. We find that it's been ignored instead of being implemented. Listen to these verses, if you will, with me, and I'll read two verses from the Old Testament. We're not gonna turn there, but listen, in Psalm 81, in verse number 11, the psalmist says this, God, of course, is giving the indictment against the nation of Israel. He says, but my people, listen to this, would not hearken to my voice, and Israel would none of me. Listen, it wasn't that God didn't give the instruction. It wasn't even that they didn't know the instruction. It was that they would not hearken to my voice. In 2 Chronicles 24, in verse 19, the Bible says this, yet he sent prophets, plural, to them. Now I like, listen, every word of God is pure.",
      "context": "...sn't even that they didn't know the instruction. It was that they would not hearken to my voice. In 2 Chronicles 24, in verse 19, the Bible says this, yet he sent prophets, plural, to them. Now I like, listen, every...",
      "sermon_title": "\"Restoration vs Excommunication\" II Thessalonians 3:14-15",
      "url": "https://www.youtube.com/watch?v=R9LB-ChokfQ&t=138",
      "channel": "Unknown",
      "publish_date": 20240627
    },
    {
      "sermon_id": "R9LB-ChokfQ",
      "timestamp": 221.60000610351562,
      "text": "give the instruction. It wasn't even that they didn't know the instruction. It was that they would not hearken to my voice. In 2 Chronicles 24, in verse 19, the Bible says this, yet he sent prophets, plural, to them. Now I like, listen, every word of God is pure. He didn't just send one prophet to them. He sent prophets to them. And it says to bring them again unto the Lord. Why was God doing that? Why did he send prophets? Well, because he wanted them to be restored. He wanted to, listen, our God is full of grace and mercy, and he is a forgiving God. And so he sends the prophets so that they would preach a message so that they would bring his people again unto the Lord, and they testified against them. That's the prophets. They testified against them, Israel. But it says at the end of the verse, but they would not give ear. They would not give ear. Now those are two sad indictments. We could look at a score of other examples this evening. There are so many references in God's word where God faithfully provided instruction, and yet his people ignored it instead of implementing it. And that's a sad, sad thing. And this evening, as we come to the end of 2 Thessalonians 3, and we look at this portion of scripture, we find that Paul concludes this section of this book,",
      "context": "...sn't even that they didn't know the instruction. It was that they would not hearken to my voice. In 2 Chronicles 24, in verse 19, the Bible says this, yet he sent prophets, plural, to them. Now I like, listen, every...",
      "sermon_title": "\"Restoration vs Excommunication\" II Thessalonians 3:14-15",
      "url": "https://www.youtube.com/watch?v=R9LB-ChokfQ&t=221",
      "channel": "Unknown",
      "publish_date": 20240627
    }
  ]
}