{
  "reference": "2 Chronicles 20",
  "occurrences": [
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 2785.9400329589844,
      "text": "and how God was working. And I would submit to you this morning that as we put ourselves in the position as Jehoshaphat did and the nation of Judah did, they say, we don't know what to do, but our eyes are upon thee. We're looking to you. We're trusting you, God, in this moment of difficulty, in this dilemma that I'm facing. I'm trusting you, and I'm asking you to work in such a way that you alone will be glorified. People are gonna notice, and it's important for us to give glory to God. Don't take this, yeah, well, you know, I figured it out. He didn't figure anything out. Amen? Jehoshaphat didn't know where to go. In fact, God told him when to go and where to go. He didn't leave anything open to Jehoshaphat's own figuring it out. And this morning, as we think about this great passage in 2 Chronicles 20, this event in the life of Jehoshaphat, I hope that we leave with more than just a history lesson. I hope that we leave with saying, our eyes are upon thee. I understand in a group of people, really of any size, there are dilemmas, there are difficulties, there's opposition, there's problems, but our God is able to help. And we must declare, as Jehoshaphat did, our eyes are upon thee. Our eyes are upon thee. I'm looking unto my Savior, understanding who He is, understanding",
      "context": "...pen to Jehoshaphat's own figuring it out. And this morning, as we think about this great passage in 2 Chronicles 20, this event in the life of Jehoshaphat, I hope that we leave with more than just a history lesson. ...",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=2785",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 2928.4200439453125,
      "text": "what I'm doing. My eyes are on you. I'm seeking you. I'm asking you for help. And God is a very present help at the time of trouble. And he says, here's what I want to do for you. Here's how I'm gonna work on your behalf. And he gives us the victory. And then we say, thanks be to God which giveth us the victory through our Lord Jesus Christ. Our eyes are upon thee. Father, we love you this morning. We thank you for loving us. We thank you for the opportunity to be gathered together this morning for the purpose of worship. We thank you for the opportunity to study this passage of Scripture, to be reminded of this historical event during the reign of Jehoshaphat, king of Judah. I believe this morning in my own life that this record of 2 Chronicles 20 is impactful. It's exemplary. The purpose of studying your Word is not to simply have a better grasp or understanding of historical events or timelines, though we gain that understanding. It's that we might be doers of the Word and not hearers only. That we might take the truth and apply it in our lives. And I pray this morning the Holy Spirit of God has moved and worked the lives of your people. No doubt there are dilemmas that we face. I pray that we would respond as Jehoshaphat",
      "context": "... the reign of Jehoshaphat, king of Judah. I believe this morning in my own life that this record of 2 Chronicles 20 is impactful. It's exemplary. The purpose of studying your Word is not to simply have a better gras...",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=2928",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}