{
  "reference": "2 Chronicles 26",
  "occurrences": [
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 2226.3399658203125,
      "text": "going to be preaching from 1 Samuel 15 this evening, but I just want to take one verse and be mindful of what is said by Samuel to Saul. In the midst of his disobedience here in 1 Samuel 15 and verse number 17, notice what Samuel says to him. If you're there, 1 Samuel 15 and verse number 17, Samuel said, When thou wast little in thine own sight, dost thou not make the head of the tribes of Israel, and the Lord anointed the king over Israel? You know what happened to Saul? He wasn't little in his own sight anymore. He thought he knew better than God. Samuel was very clear, I'll mention this this evening, he was very clear in verses 1 and 2 that this was the commandment of the Lord. This was God's instruction to Saul. But Saul disobeyed it. And Samuel says, when you were little in your own sight, oh, that God would help us to remain little in our own sight, that we're nothing. You say, that's not good for my self-esteem, I know. But it's true, we're nothing. It's all because of God's amazing grace. It's all because of Jesus. Jesus, Uzziah, 2 Chronicles 26. You're familiar with these examples, but I want you to see what the Word of God says. It's amazing how God helped King Uzziah. The Bible tells us in verse number 5 that he sought God in the days of Zechariah.",
      "context": "..., we're nothing. It's all because of God's amazing grace. It's all because of Jesus. Jesus, Uzziah, 2 Chronicles 26. You're familiar with these examples, but I want you to see what the Word of God says. It's amazing...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=2226",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 2320.9999389648438,
      "text": "all because of Jesus. Jesus, Uzziah, 2 Chronicles 26. You're familiar with these examples, but I want you to see what the Word of God says. It's amazing how God helped King Uzziah. The Bible tells us in verse number 5 that he sought God in the days of Zechariah. It tells us at the end of verse number 5 that as long as he sought the Lord, God made him to prosper. Man, verse number 5 is so important of a verse, principle of life. We'd seek God, and then as we keep seeking God, God will keep blessing. Listen, there's more danger in times of blessing than in times of want, times of distress and difficulty. Because in times of blessing, if we're not careful, we just get full of ourselves. We become like the church of the Laodiceans, increased with goods and have need of nothing. The Bible tells us in verse number 7, notice the first phrase, and God helped him. Notice in verse number 8, the last phrase, for he strengthened himself exceedingly. Verse number 15, it says, and he made in Jerusalem engines invented by cunning men to be on the towers and upon the bulwarks to shoot arrows and great stones withal. And his name spread far abroad, for he was marvelously helped, but it's a comma. I wish it was a period, but it's a comma, till he was. Strong.",
      "context": "all because of Jesus. Jesus, Uzziah, 2 Chronicles 26. You're familiar with these examples, but I want you to see what the Word of God says. It's amazing...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=2320",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "kZ4u2Ljc7cU",
      "timestamp": 416.0,
      "text": "ground? What are they saying? I'm superior, no one's going to defeat me, no one's going to bring me down. I have this lofty idea, this inordinate self-esteem, this conceit of our superiority, there's no one that's going to bring us down. In fact, if we're mindful of the enemy, and we spoke about the tool that he often goes to in his toolbox there, as is mentioned in Genesis 3, that tool of deception, we find that it was pride that was the sin that was found within the heart of Satan, is it not? Lucifer, he was created, but he was prideful. You can read in the Old Testament account that God gives us with regard to the fall of Satan, the fall of Lucifer, and how he said in his own heart, I will be like the Most High. And you think about the pride and the destruction and the deception even there in the heart of Lucifer with regard to that pride. I've mentioned already that pride is deceitful as we see here in this text of Scripture. We find that pride is destructive. I want to give you an Old Testament example, then we're going to look at some truth within the New Testament that we can apply in our lives. Go back to 2 Chronicles 26, if you will. 2 Chronicles 26 gives us the record of King Uzziah. Now, King Uzziah basically would be described as being a good king.",
      "context": "...'re going to look at some truth within the New Testament that we can apply in our lives. Go back to 2 Chronicles 26, if you will. 2 Chronicles 26 gives us the record of King Uzziah. Now, King Uzziah basically would ...",
      "sermon_title": "Sermon kZ4u2Ljc7cU",
      "url": "https://www.youtube.com/watch?v=kZ4u2Ljc7cU&t=416",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "kZ4u2Ljc7cU",
      "timestamp": 484.0,
      "text": "then we're going to look at some truth within the New Testament that we can apply in our lives. Go back to 2 Chronicles 26, if you will. 2 Chronicles 26 gives us the record of King Uzziah. Now, King Uzziah basically would be described as being a good king. If you were to take all of the kings of Israel, you'd be hard-pressed after the divided kingdom, you'd be hard-pressed to find any that were good. In fact, all of them typically would be labeled in the category of being a bad king. In Judah, we would find that there were several that you would categorize, and some of them would be categorized as being a good king. Some of them were very good kings. Some of them were basically good, and Uzziah would fall in that category. And we find that he was helped by the Lord. We find that he sought the Lord. Notice what the Bible says in verse 4 of 2 Chronicles 26, and he, speaking of Uzziah, did that which was right in the sight of the Lord. Look at verse 5, and he, Uzziah, sought God in the days of Zechariah, who had understanding in the visions of God, and as long as he sought the Lord, God made him to prosper. Oh, there's a very vital principle in that verse of Scripture, the importance of seeking God and having God's favor in our lives. Notice in verse 7, the Bible says,",
      "context": "...'re going to look at some truth within the New Testament that we can apply in our lives. Go back to 2 Chronicles 26, if you will. 2 Chronicles 26 gives us the record of King Uzziah. Now, King Uzziah basically would ...",
      "sermon_title": "Sermon kZ4u2Ljc7cU",
      "url": "https://www.youtube.com/watch?v=kZ4u2Ljc7cU&t=484",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}