{
  "reference": "2 Corinthians 4",
  "occurrences": [
    {
      "sermon_id": "G38C0Tuh6UA",
      "timestamp": 569.760009765625,
      "text": "says in verse number 14 and 15, behold, the third time I am ready to come to you and I will not be burdensome to you for I seek not yours, but you. For the children ought not to lay up for the parents, but the parents for the children. And here's what he says in verse 15, I will very gladly spend and be spent for you, though the more abundantly I love you, the less I be loved. He says to the churches in the region of Galatians, Galatians chapter number four, he asked this question, have I become your enemy because I tell you the truth? See, the Apostle Paul knew what pressures were. He understood the pressures of ministry. He experienced the pressures of ministry. Paul is not speaking here about. something that he read somewhere else from someone else. He's speaking personally about what he experienced and the joy as we look at here, and I wanna make sure that it's packaged together because I said by way of introduction that there were hardships, but there's God's help. And so we look first at the pressures in which the Apostle Paul faced. He says in verse number eight of 2 Corinthians 4, notice he says this, we are troubled. He says this, on every side. We are troubled on every side. To be troubled means to be afflicted. It means to suffer persecution. It means to be pressed hard upon.",
      "context": "...so we look first at the pressures in which the Apostle Paul faced. He says in verse number eight of 2 Corinthians 4, notice he says this, we are troubled. He says this, on every side. We are troubled on every side. ...",
      "sermon_title": "Sermon G38C0Tuh6UA",
      "url": "https://www.youtube.com/watch?v=G38C0Tuh6UA&t=569",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G38C0Tuh6UA",
      "timestamp": 640.839973449707,
      "text": "Paul faced. He says in verse number eight of 2 Corinthians 4, notice he says this, we are troubled. He says this, on every side. We are troubled on every side. To be troubled means to be afflicted. It means to suffer persecution. It means to be pressed hard upon. And the Apostle Paul says that we are troubled on every side. Can you imagine, can you get in your mind this morning a visual, if you will, of what the Apostle Paul is seeking to communicate with regard to the pressures of ministry and understanding this thought of being troubled. He says in verse number eight, and we're just looking at the pressures at this point. We'll look in just a moment at the counter of each of these, but in verse number eight, he says we are perplexed. Ever been perplexed in life? I mean, the idea of being perplexed is to be without resources, to be in straits. It carries with it this idea of not knowing which way to turn. Can I tell you that there are times in which you might be perplexed, and it's not because you don't know the leadership of the Holy Spirit of God. It's because you're concerned about the consequences of the decision that you're going to make. Let me say that again. Being perplexed is not always because you don't know the direction of the Holy Spirit of God. Sometimes you're perplexed ministry-wise.",
      "context": "Paul faced. He says in verse number eight of 2 Corinthians 4, notice he says this, we are troubled. He says this, on every side. We are troubled on every side. ...",
      "sermon_title": "Sermon G38C0Tuh6UA",
      "url": "https://www.youtube.com/watch?v=G38C0Tuh6UA&t=640",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 1760.97998046875,
      "text": "be faithful through the trials. Why? Because I'm trusting my Lord. I'm walking with him day by day. These unfortunate things have happened, these trials, these difficulties, these adversities but I know that God's in control and I know that God has a purpose and I'm going to be faithful. I'm gonna rejoice through these trials and I'm gonna be faithful because I'm gonna see what God is going to do. I mentioned in Proverbs 24 in verse number 10, if thou faint in the day of adversity, thy strength is small. I want you to turn over to the New Testament if you will in 2 Corinthians chapter four as we seek to make some application this evening from this portion of scripture. This truth that we see in Genesis chapter number 40, as we said this morning, we can, it is possible that we can rejoice through trials. It is possible that we can be faithful in the. midst of trials. We look in 2 Corinthians 4. We mention that the strength that's referenced in Proverbs 24 and verse 10 is not a physical strength, but a spiritual strength. And notice what the Bible tells us in 2 Corinthians 4. The Bible says in verse 1, Therefore, seeing we have this ministry, as we have received mercy... Notice the Bible says we faint not. We faint not. If thou faint in the day of adversity,",
      "context": "... rejoice through trials. It is possible that we can be faithful in the. midst of trials. We look in 2 Corinthians 4. We mention that the strength that's referenced in Proverbs 24 and verse 10 is not a physical stren...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=1760",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 1830.9800128936768,
      "text": "but a spiritual strength. And notice what the Bible tells us in 2 Corinthians 4. The Bible says in verse 1, Therefore, seeing we have this ministry, as we have received mercy... Notice the Bible says we faint not. We faint not. If thou faint in the day of adversity, thy strength is small. Paul says, seeing that we have received this ministry, as we have received mercy, we faint not. It's the idea of being faithful through the storm, through the trial, through the difficulty, and we see it outlined for us here in 2 Corinthians 4. Notice in verse 2, We have renounced the hidden things of dishonesty, not walking in craftiness, nor handling the word of God deceitfully, but by manifestation of the truth, commending ourselves to every man's conscience in the sight of God. But if our gospel be hid, it is hid to them that are lost, in whom the God of this world hath blinded the minds of them which believe not, lest the light of the glorious gospel of Christ, who is the image of God, should shine unto them. For we preach not ourselves, but Christ Jesus the Lord, and ourselves your servants for Jesus' sake. For God, who commanded the light to shine out of darkness, hath shined in our hearts to give the light of the knowledge of the glory of God in the face of Jesus Christ.",
      "context": "but a spiritual strength. And notice what the Bible tells us in 2 Corinthians 4. The Bible says in verse 1, Therefore, seeing we have this ministry, as we have received mercy... N...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=1830",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 687.1400146484375,
      "text": "and we've not had the privilege of sharing the Gospel with someone. I wonder if we'd say like Jeremiah that it's just bubbling in me. It's like a fire within me. I just can't wait to give the Gospel to someone, anyone that would listen, because I understand the truth and the power of this wonderful message. And Paul says, woe is unto me if I preach not the Gospel. He said I am debtor. And I just wonder if we can in our minds remember the last time we were able to share the Gospel with someone. I wonder if you can go to that place in your mind and you can say, I remember the last time I was able to share the Gospel with someone, and maybe they trusted Christ, maybe they weren't interested, but you remember that last time you were able to speak of Christ and speak of the good news of the Gospel. Can I tell you this morning, if that memory is way, way, way back somewhere, I hope this morning that we'd have that fire rekindled. And we'd say, man, I just want to find someone to give the Gospel to, because I'm indebted. I am debtor. Notice what he says in 2 Corinthians 4. In 2 Corinthians chapter number 4, Paul says to these same believers in Corinth in the same city, this now second letter that he writes in verse number three of this chapter,",
      "context": "...nt to find someone to give the Gospel to, because I'm indebted. I am debtor. Notice what he says in 2 Corinthians 4. In 2 Corinthians chapter number 4, Paul says to these same believers in Corinth in the same city, ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=687",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 754.3400115966797,
      "text": "give the Gospel to, because I'm indebted. I am debtor. Notice what he says in 2 Corinthians 4. In 2 Corinthians chapter number 4, Paul says to these same believers in Corinth in the same city, this now second letter that he writes in verse number three of this chapter, we find that Paul says this, if our Gospel be hid, it is hid to them that are lost. We obviously understand this morning that those are the people that need the Gospel. Those that are lost. They need it. We're indebted to them. And Paul says if our Gospel be hid, it is hid to them that are lost. Notice what he says in verse number seven, but we have this treasure in earthen vessels that the excellency of the power may be of God and not of us. I notice the way in which he says we have this treasure in earthen vessels. We're but clay. I mean, we're really nothing except for the fact that we've been made in the image of God Almighty and the fact that God Almighty came and died for us so that we could be redeemed and what a wonderful privilege, but we have this treasure, the Gospel of Jesus Christ. Paul, in between the two verses that we've read here in 2 Corinthians 4 and verse three and verse number seven, we find that he mentions about the work of the enemy to keep blinded the minds of those",
      "context": "give the Gospel to, because I'm indebted. I am debtor. Notice what he says in 2 Corinthians 4. In 2 Corinthians chapter number 4, Paul says to these same believers in Corinth in the same city, ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=754",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 827.3800201416016,
      "text": "privilege, but we have this treasure, the Gospel of Jesus Christ. Paul, in between the two verses that we've read here in 2 Corinthians 4 and verse three and verse number seven, we find that he mentions about the work of the enemy to keep blinded the minds of those that have not received the Gospel of Jesus Christ. And we understand that the enemy is alive and active and he's working. This morning, as Paul says here in verse number five, we preach not ourselves, but Christ Jesus the Lord and ourselves your servants for Jesus's sake. We don't preach ourselves. I often say to individuals as I have the privilege of sharing the Gospel with them, I'm not asking you to come to our church. I'm not asking you to give to our church. I'm not asking you to do any. I'm just trying to share with you the truth of what Jesus Christ did for you because one day you're going to die. Are you ready? Are you ready? See, I am dead hurt. Notice what he says in 1 Thessalonians 2. We'll move on to verse number 15 in Romans 1 here, but look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica",
      "context": "... this treasure, the Gospel of Jesus Christ. Paul, in between the two verses that we've read here in 2 Corinthians 4 and verse three and verse number seven, we find that he mentions about the work of the enemy to kee...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=827",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 1825.5599613189697,
      "text": "mention that here in just a moment. But notice the Bible says in verse number 17, continuing in Hebrews 12, for ye know how that afterward, when he would have inherited the blessing, he was rejected, for he found no place of repentance, though he sought it carefully with tears. And here it's speaking of the seeking of Esau for the blessing, he sought the blessing with tears. He didn't seek repentance with tears, he sought the blessing with tears. He was angered with his brother over what had transpired. And we note here as we look at the circumstances in this particular text of Scripture, and we note the behavior of Esau, and we can make application as to how we can operate in the flesh, and how we need to be careful not to mind fleshly things. That we would understand, as Paul says in 2 Corinthians 4, while we look not at these things which are temporal, but at things which are eternal. But I want to focus just for a moment on Jacob back in Genesis chapter number 25, because when we look back at Jacob, and we find that often he speaks about his name closely associated with actually about three different Hebrew words, but a couple of them carry with it the idea of being a deceiver, and Jacob is known for that, and we understand that.",
      "context": "...and how we need to be careful not to mind fleshly things. That we would understand, as Paul says in 2 Corinthians 4, while we look not at these things which are temporal, but at things which are eternal. But I want ...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=1825",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}