{
  "reference": "2 Corinthians 8",
  "occurrences": [
    {
      "sermon_id": "9aMxxX-X0kc",
      "timestamp": 1694.47998046875,
      "text": "694 in our song book. You can turn there if you'd like. And in this song, it is said that the one who wrote this song, that she went into a place and had been struggling with really some of the things she had been taught about salvation and Christianity. And she was struggling and having some doubts in her life is what the story says. And she went in and she saw a picture on the wall that was a depiction of the cross of Calvary. And when she saw that, it had such a deep impact upon her that she sat down and wrote this song. I gave my life for thee. I gave my life for thee, my precious blood I shed, that thou might ransom be and quickened from the dead. I gave, I gave my life for thee. And she asked this question, what has thou given for me? Jesus, as she's writing this, it's Jesus that's saying, I gave my life for thee. And then Jesus saying, what have you given for me? The second verse, my father's house of light, my glory circled throne. I left for earthly night, for wandering sad and alone. He left the glory of heaven. He's God. He's God. You read John 17, our memory verse for the month of March, 2 Corinthians 8, 9. He became poor for us. He left the throne of heaven, the glory that he had.",
      "context": "...the glory of heaven. He's God. He's God. You read John 17, our memory verse for the month of March, 2 Corinthians 8, 9. He became poor for us. He left the throne of heaven, the glory that he had.",
      "sermon_title": "Sermon 9aMxxX-X0kc",
      "url": "https://www.youtube.com/watch?v=9aMxxX-X0kc&t=1694",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9aMxxX-X0kc",
      "timestamp": 1777.6400146484375,
      "text": "for earthly night, for wandering sad and alone. He left the glory of heaven. He's God. He's God. You read John 17, our memory verse for the month of March, 2 Corinthians 8, 9. He became poor for us. He left the throne of heaven, the glory that he had. He said, I left, I left it all for thee. Hast thou left aught for me? I know it's a song. It's not Bible, it's a song. But oh my, what a song it is. The third verse, I suffered much for thee, did he not? Peter speaks of in 1 Peter 5, about being an eyewitness of the sufferings of Christ. I suffered much for thee, more than thy tongue can tell.\" Isn't that an interesting statement that the songwriter writes? We can't fully understand all that Christ suffered for us. The end verse of this 2 Corinthians 5 that we'll look at in a few weeks, He hath made Him to be sin for us. I can't fully comprehend that level of suffering. Of bitterest agony, to rescue thee from hell, I've borne, I've borne it all for thee. What hast thou borne for me? Verse 4, and I have brought to thee, down from my home above, salvation full and free, my pardon and my love. I bring, I bring rich gifts to thee. What hast thou brought to me? What a song, what a song. The songwriter understood something that we're preaching about here this morning.",
      "context": "...the glory of heaven. He's God. He's God. You read John 17, our memory verse for the month of March, 2 Corinthians 8, 9. He became poor for us. He left the throne of heaven, the glory that he had. He said, I left, I ...",
      "sermon_title": "Sermon 9aMxxX-X0kc",
      "url": "https://www.youtube.com/watch?v=9aMxxX-X0kc&t=1777",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WWASD9CXEro",
      "timestamp": 2010.7000274658203,
      "text": "He says, He resisteth the proud, but He gives grace unto the humble. You know, sometimes it's really easy to become prideful. It really is. The best way I have found to keep our feet on the ground and keep a proper perspective is to keep our eyes on Jesus. We keep our eyes on Jesus and it will help us to walk humbly. This evening, we see this truth. We ought to walk as Christ walked. How do I know if I'm walking like Christ? Well, I go to the Gospels, I begin to study. Tonight, two simple thoughts. We'll continue next week. Walk wisely. How are we doing with that? Are we walking in wisdom? Do we have God's wisdom? Are we seeking for God's wisdom? Are we asking for God's wisdom? Do we even acknowledge that we need God's wisdom? Are we walking humbly? Are we walking as God walked? The Bible tells us this in 2 Corinthians. I'm just reminded of the depth of this verse of Scripture. And in 2 Corinthians 8 and verse 9, for you know the grace of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, that you through his poverty might be rich. Wow, what a great truth. This evening, we'll walk humbly. We can't get prideful about, I got the right position. I got the right, no, no, no, don't get prideful. We are blessed to have been given a Bible,",
      "context": "...e tells us this in 2 Corinthians. I'm just reminded of the depth of this verse of Scripture. And in 2 Corinthians 8 and verse 9, for you know the grace of our Lord Jesus Christ, that though he was rich, yet for your...",
      "sermon_title": "Sermon WWASD9CXEro",
      "url": "https://www.youtube.com/watch?v=WWASD9CXEro&t=2010",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}