{
  "reference": "2 Corinthians 6",
  "occurrences": [
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 2034.0199584960938,
      "text": "really that bad because I haven't done all these things, but really when we think about the people of God and we think about all manner of conversation being holy, he's not just concerned about these big areas, he's concerned about every area. Notice with me, not only my speech, but I think about my associations. My associations. Notice what Paul says. Turn to the book of 2 Corinthians, if you will, in chapter number six. It's interesting because really in this same passage of scripture in 2 Corinthians 6, 14 through chapter seven in verse number one, you can see really the entirety of the message that we're preaching this morning with regard to this process. Number one, review. Number two, recognize. Notice what he says in verse number 14 of 2 Corinthians 6. Be ye not unequally yoked together with unbelievers. For what fellowship hath righteousness with unrighteousness? What communion hath light with darkness? What concord hath Christ with Belial? Or what part hath he that believeth with an infidel? These questions are posed this way to help the believer understand there's no union. There's no association that should be made. And he says this in verse 16. What agreement hath the temple of God with idols? For ye are the temple of the living God. As God hath said, I will dwell in them and walk in them and I will be their God and they shall be my people.",
      "context": "...u will, in chapter number six. It's interesting because really in this same passage of scripture in 2 Corinthians 6, 14 through chapter seven in verse number one, you can see really the entirety of the message that ...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=2034",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 2945.719970703125,
      "text": "like that one song, I think I'm going to go back and get it, he's going to have to pay money to buy it again, amen, because he destroyed it. And I'm saying to you that when I look at what happened here in Ephesus, this is a proper response. They said, we don't want to just have the issue identified, we want to resolve it. We don't want to just recognize it, we want to deal with it. I think about what we read in 2 Corinthians 6, we read the latter part of the chapter, but in chapter number 7 and verse number 1, the Bible says this, Paul's instruction to the believers in Corinth was simply this, cleanse yourselves from all filthiness of the flesh and spirit. I'm thankful for the ministry of the Word of God. Paul deals with it in the book of Ephesians, how that we are cleansed. Notice in Ephesians 5 and verse 26, that he might sanctify and cleanse it with the washing of water by the Word. See, I believe that when we resolve the issue, that we also need to put in some protections. We need to make... ourselves accountable. I think of a company that has an audit. The auditor comes in, the auditor reviews, the auditor recognizes some areas that have problems, and the auditor says, hey these things need to be resolved, and by the",
      "context": "...olve it. We don't want to just recognize it, we want to deal with it. I think about what we read in 2 Corinthians 6, we read the latter part of the chapter, but in chapter number 7 and verse number 1, the Bible says...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=2945",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}