{
  "reference": "2 Kings 8",
  "occurrences": [
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2090.02001953125,
      "text": "in the days of David. Now, remember with me the history of Israel. In fact, it tells us, it's a very interesting statement that is given to us, you don't need to turn back there, but in Genesis 36 and verse number 31, it says, and these are the kings that reigned in the land of Edom before there reigned any king over the children of Israel. And you read about all those dukes and those chiefs and what have you there with the Edomites, and even before the kings of Israel, they had what was going on there in that land in Seir with the Edomites, but then as you begin to think about Israel's history and Saul being the first king, well, in the time of Saul, there's a battle with the Edomites. There are disputes that takes place and battles that are recorded. In the days of David, he's the next king of Israel. And we find that during his reign in the times of David, there's disputes that take place. In fact, the Bible tells us in 2 Samuel 8 and verse number 14, that during his reign, because David was mighty, the Lord was with him and the Lord gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's servants.",
      "context": "...gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's serva...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2090",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2146.740020751953,
      "text": "mighty, the Lord was with him and the Lord gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's servants. And again, we see these interactions that are taking place and all of a sudden we begin to connect these dots of what's going on in the days of Solomon. It's a sad thing, but the Bible tells us of Solomon, we know that he had many wives. You know, he had some wives that were the descendants of Edom, Edomites, Moabites, I mean, others, but Edomites were one of them that are specifically listed in 1 Kings 11 and verse number one. We find that in that text of scripture, it says, but King Solomon loved many strange women together with the daughter of Pharaoh, women of the Moabites, Ammonites, Edomites, Zidaneans and Hittites. Again, we see the Edomites referenced. It's interesting that God tells us in this same chapter in 1 Kings 11, it tells us how that God was angry with Solomon, why? Because of his evil, where he built these places of worship for these false gods of these wives that he married and all that was taking place. And we find that he also was burning incense and sacrificed one of their gods.",
      "context": "...gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's serva...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2146",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}