{
  "reference": "2 Kings 14",
  "occurrences": [
    {
      "sermon_id": "kSiYJ1lbpPo",
      "timestamp": 92.0,
      "text": "the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah. So God helps us understand who's reigning in Judah during the time of Hosea's ministry, though his ministry is specifically predominantly to the northern tribes, not to Judah. And then it tells us, and in the days of Jeroboam, the son of Joash, king of Israel. Now, it's important that we understand the history that God provides us in the book of 1 and 2 Kings. Of course, in 1 and 2 Chronicles as well, there are two Jeroboams. This is Jeroboam II. This is not the first Jeroboam, when it first had a divided kingdom of Jeroboam and Rehoboam. But we find this is Jeroboam II, and it's important that we understand that. It tells us that he is the son of Joash. He's the king of Israel. He, Jeroboam II, reigned for 41 years. In 2 Kings, chapter number 14, maybe hold your place here in Hosea and turn over to 2 Kings 14 just for a moment, if you will, by way of introduction, as we get kind of the background, if you will, for what's taking place during the ministry of Hosea. In 2 Kings, chapter 14, in verses 23 through 29, God provides us with the record here of the time in which Jeroboam II is reigning in Israel. Notice the Bible says in 2 Kings 14, in verse 23, In the fifteenth year of Amaziah, the son of Joash, king of Judah,",
      "context": "...d for 41 years. In 2 Kings, chapter number 14, maybe hold your place here in Hosea and turn over to 2 Kings 14 just for a moment, if you will, by way of introduction, as we get kind of the background, if you wi...",
      "sermon_title": "\"The Valley Of Achor\" Hosea 2:14-23",
      "url": "https://www.youtube.com/watch?v=kSiYJ1lbpPo&t=92",
      "channel": "Unknown",
      "publish_date": 20240819
    },
    {
      "sermon_id": "kSiYJ1lbpPo",
      "timestamp": 164.0,
      "text": "Kings, chapter 14, in verses 23 through 29, God provides us with the record here of the time in which Jeroboam II is reigning in Israel. Notice the Bible says in 2 Kings 14, in verse 23, In the fifteenth year of Amaziah, the son of Joash, king of Judah, Jeroboam, the son of Joash, king of Israel, began to reign in Samaria. Samaria is the capital, if you will, of the northern tribes, whereas Jerusalem would be the capital of Judah. And it says that he reigned 40 in one year. So notice in verse 24, And he did that which was evil in the sight of the Lord. By the way, every king of Israel did that which was evil in the sight of the Lord. After the divided kingdom, you have, of course, Saul, David, and Solomon, a united kingdom for 120 years. After that, there's this divided kingdom. There's no good kings in Israel. Zero. We find that in Judah, there are periods of time in which there are good kings. In fact, there are seasons of revival. And because of that, Judah is not taken captive for about 115, 120 years after Israel was taken captive. Israel, of course, taken captive by the Assyrians and Judah by the Babylonians. And we find here that he did evil in the sight of the Lord. Notice it says that he departed not from all the sins of Jeroboam, the son of Nebat, who made Israel to sin.",
      "context": "...th the record here of the time in which Jeroboam II is reigning in Israel. Notice the Bible says in 2 Kings 14, in verse 23, In the fifteenth year of Amaziah, the son of Joash, king of Judah, Jeroboam, the son ...",
      "sermon_title": "\"The Valley Of Achor\" Hosea 2:14-23",
      "url": "https://www.youtube.com/watch?v=kSiYJ1lbpPo&t=164",
      "channel": "Unknown",
      "publish_date": 20240819
    }
  ]
}