{
  "reference": "2 Peter 3",
  "occurrences": [
    {
      "sermon_id": "hMIOkmwPfzg",
      "timestamp": 868.6199951171875,
      "text": "things, that God promises that he will do this. And I'm thankful for that because God has given us the instruction with regard to these promises. In fact, as you read Proverbs chapter number two, there's a whole list of them in that very passage of scripture of if-then promises. But then as we come to the word of God, we find that not only do we come across conditional promises, but we find that the word of God contains unconditional promises. Promises that God has made that have no impact on what we do or do not do with regard to those promises. Can I tell you that we sang about one of those this evening? Coming again, right? Did not Jesus give us a promise that he was going to return? That promise stands as an unconditional promise. God himself has promised. He said, let not your hearts be troubled. You believe in God, believe also in me. In my father's house are many mansions. If it were not so, I would have told you. I go to prepare a place for you. And he said this, if I go and prepare a place for you, I will come again and receive you unto myself that where I am, there ye may be also. We find that the word of God says that Jesus, as we would think about the truth of the promise of his return, that there are some, according to 2 Peter 3,",
      "context": "..., as we would think about the truth of the promise of his return, that there are some, according to 2 Peter 3,",
      "sermon_title": "Sermon hMIOkmwPfzg",
      "url": "https://www.youtube.com/watch?v=hMIOkmwPfzg&t=868",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "hMIOkmwPfzg",
      "timestamp": 929.260009765625,
      "text": "I will come again and receive you unto myself that where I am, there ye may be also. We find that the word of God says that Jesus, as we would think about the truth of the promise of his return, that there are some, according to 2 Peter 3, that mock that very promise that we're speaking of this evening. And they say, where is the promise of his return? And Peter responds and says, the Lord is not slack concerning his promise. As some men count slackness. But his long-suffering to us word, not willing that any should perish, but that all should come to repentance. Listen, God is not slack concerning any of his promises. What he hath promised, he will do. And we ought to rejoice in that. You know, he told us that his word will not return unto him void, that it will accomplish what he has set forth for it to accomplish. He's told us that we're to preach the word, to be instant in season, out of season, reprove, rebuke, exhort, with all long-suffering and doctrine. Why? Because God's promised to use his word. And as we take God at his word, and we take the promises that he's given us, and we claim those promises, we can rejoice this evening that as we look at the increase from the Lord, as we look at what's taken place in the life of Jacob over these years that he spent in this land,",
      "context": "..., as we would think about the truth of the promise of his return, that there are some, according to 2 Peter 3, that mock that very promise that we're speaking of this evening. And they say, where is the promis...",
      "sermon_title": "Sermon hMIOkmwPfzg",
      "url": "https://www.youtube.com/watch?v=hMIOkmwPfzg&t=929",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 1031.239990234375,
      "text": "There was a time in your life that you were not saved. And that time in your life when you were not saved is described here that we all were in this same condition in time past. We're following the lust of our flesh. \"...fulfilling the desires of the flesh and of the mind, for we're by nature the children of wrath even as others.\" But God. But God. \"...who is rich in mercy for His great love wherewith He loved us.\" Aren't you thankful for the mercy of God? He's merciful. Who He is. As we look at these, just a list of things that I've put together to encourage my heart, to trust that it would be an encouragement to your heart as well, that we're mindful this morning, we're thankful for His Person, for who He is. Yes, that I'm a recipient of His grace, and yes, that I'm a recipient of His mercy, but why am I a recipient? Because that's what He is. That's who He is. It's part of His very nature. He's gracious. And He's merciful. We find that He's long-suffering. Aren't you thankful that our God is long-suffering? Often times in our lives, we enjoy the long-suffering of God. 2 Peter 3. There are times, however, when others perhaps may be enjoying the long-suffering of God that we don't seem to understand why God isn't dealing with them. But when God's being long-suffering to us, oh, we're so grateful for His long-suffering.",
      "context": "...nkful that our God is long-suffering? Often times in our lives, we enjoy the long-suffering of God. 2 Peter 3. There are times, however, when others perhaps may be enjoying the long-suffering of God that we do...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=1031",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 1113.8800048828125,
      "text": "lives, we enjoy the long-suffering of God. 2 Peter 3. There are times, however, when others perhaps may be enjoying the long-suffering of God that we don't seem to understand why God isn't dealing with them. But when God's being long-suffering to us, oh, we're so grateful for His long-suffering. I've often said over the years that we ought never mistake the long-suffering of God for His permission. God's never okay with sin. Never. But God is long-suffering to us. He's patient with us. And you begin to think here, the Bible within the context of 2 Peter 3 is speaking of His promise with regard to His coming, but it says, \"...the Lord is not slack concerning His promise, as some men cannot slacken His notice, but is long-suffering to us-ward, not willing that any should perish, but that all should come to repentance.\" I'm thankful that God is long-suffering. We sing a song with the children about God created all things. And He created all things in just six days. You go through all of the various aspects of creation, but then the song deals with, but He's still working on me. And He is! He's still working on us. He's long-suffering to us-ward. He's patient with us. By the way, aren't you thankful that He is long-suffering? He's not becoming any of these things. He is all of these things. He is precious. He's long-suffering to us. I believe, as I mentioned earlier,",
      "context": "lives, we enjoy the long-suffering of God. 2 Peter 3. There are times, however, when others perhaps may be enjoying the long-suffering of God that we do...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=1113",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}