{
  "reference": "2 Timothy 4",
  "occurrences": [
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1706.739990234375,
      "text": "work. They fulfilled what God had called them to do. If you were to take the time to go back to Acts 13 in the first few verses, you see how that God called them and said, separate me, Barnabas and Saul, for the work whereunto I have called them. Does that not sound familiar to the charge that Archippus had received? Listen, take heed to the ministry which thou hast received in the Lord, that thou fulfill it. We find this example that is given to us, of course, we're familiar with Paul in 2 Timothy 4. We won't take the time to turn there this morning, but in 2 Timothy, it's the last letter that Paul would write before he would face a martyr's death. And we find that it was there that he says, I have finished, I have finished, I have finished. What a blessing. He'd kept the faith. He had finished his course. And Paul was confident of what God had called him to do, and he was faithful to fulfill what he had been called to do. So we look at these examples, and the time would not permit us to discuss many others that would be noteworthy and important for us to focus on. I want us to think this morning of this cloud of witnesses, and I want you to think about our greatest example, and that's the Lord Jesus Christ.",
      "context": "...t thou fulfill it. We find this example that is given to us, of course, we're familiar with Paul in 2 Timothy 4. We won't take the time to turn there this morning, but in 2 Timothy, it's the last letter that Pau...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1706",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2200.5799560546875,
      "text": "happen by chance or by accident. I'm convinced of that this morning. We're not just going to skate through life and just come to the place where we say like Paul said, I have fought a good fight. I have finished my course. It's not going to happen by accident. We better plan and we better purpose to fulfill our ministry. Let me give you four practical ways this morning that as we close out the book of Colossians, that as we look at the charge from Archippus that we could also fulfill our ministry. Look in Acts 20 and verse 24 and then we'll give you the four thoughts this morning on how it is that we can fulfill our ministry. I mentioned that it's not going to happen by accident. It's not going to happen by chance. Paul in 2 Timothy 4 gives us that great declaration of finishing, but in Acts 20 before he arrives in Jerusalem when he stops and speaks to the leaders of the church at Ephesus, notice what Paul says in Acts 20 in verse 24, but none of these things move me. Neither count I my life dear unto myself, notice what he says, so that I might finish my course with joy. And the ministry which I have received of the Lord Jesus to testify the gospel of the grace of God. Isn't that so familiar to what we've read at the end of Colossians in the 17th verse",
      "context": "... I mentioned that it's not going to happen by accident. It's not going to happen by chance. Paul in 2 Timothy 4 gives us that great declaration of finishing, but in Acts 20 before he arrives in Jerusalem when he...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2200",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}