{
  "reference": "2 Timothy 2",
  "occurrences": [
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 1623.8999938964844,
      "text": "you sent letters in the mail. Many times, I would read those letters more than one time. Why? Because it was from the girl I loved. And I wanted to read it and reread it, and then after we got married, she found a box of letters I wrote her, and one night, she's like, hey, honey, look what I found. Maybe I should read some of them. I was like, I'm going to bed. I said, what? I'm just teasing. But the reality is that this is God's love letter to us. When my dad was in Desert Storm back in 1990, 1991, they didn't have FaceTime, they didn't have internet that was available for video conferencing and all that sort of thing, and they didn't even have reliable phone service that we could talk. And he was in Desert Storm, I think it was about seven months altogether that he was there, and I don't know exactly how many letters I received from my dad during that time. I think it was just two or three letters. But I remember as a 10-year-old kid, the excitement. I got a letter from my dad. How do we neglect it? But yet, so many do. 2 Timothy 2 and verse 15 tells us to study. Study what? Study the Word of God to show ourselves approved. It tells us, study to show thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the Word of truth.",
      "context": "...ear-old kid, the excitement. I got a letter from my dad. How do we neglect it? But yet, so many do. 2 Timothy 2 and verse 15 tells us to study. Study what? Study the Word of God to show ourselves approved. It te...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=1623",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 1709.5599975585938,
      "text": "But yet, so many do. 2 Timothy 2 and verse 15 tells us to study. Study what? Study the Word of God to show ourselves approved. It tells us, study to show thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the Word of truth. I gotta read it if I'm gonna study it. 1 Peter 2 and verse number two says, as newborn babes desire the sincere milk of the Word, that ye may grow thereby. 2 Timothy 3 and verse 18 says, but grow in grace in the knowledge of our Lord and Savior, Jesus Christ, to whom be glory and honor forever and ever. Amen. This book produces growth in God's people. And so the question this evening with regard to Bible reading is will we make a commitment to God perhaps to read the book of Proverbs each month, perhaps to read the New Testament in one year, perhaps to read the entirety of God's Word in one year, and make that commitment to God? You say, well, I already do that. Good. Continue. Maybe add to it. I change it up year by year. I think it was in 2018. I read the Bible through twice, but I read the book of Psalms every month. It requires that you read five Psalms a day, and you do that, and you get through the whole book of Psalms each month.",
      "context": "But yet, so many do. 2 Timothy 2 and verse 15 tells us to study. Study what? Study the Word of God to show ourselves approved. It te...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=1709",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 2967.2999877929688,
      "text": "I've given you three simple thoughts this morning on how we can please God, but understand the Bible is full of examples of how your behavior and my behavior can please our God, and that we would have this idea, we'd have this perspective that we find in 2 Timothy 2 and verse number 4, that I want to please my master, a good soldier. Not only does he endure hardness, not only does he avoid distraction, but he has as a goal to please his master. This morning as we examine our lives, I hope that we would examine our lives in such a way that we would determine whether our behavior pleases the Lord. Are there adjustments that need to be made? Are there areas in our life where, if we're honest and if we're humble, as the Holy Spirit of God searches and proves, that would say, you know, there's some areas that are not really well. well-pleasing to the Lord, then make the adjustments. There's some things that need to be adjusted. I made this statement on Wednesday evening. It's a silly thing for us to go to the truth of God's word and to be confronted with truth and then to not apply it, to not make adjustments, to not say, you know what, that's something that I need, that's something I need to incorporate in my life. No, we come to the place where we say,",
      "context": "...or can please our God, and that we would have this idea, we'd have this perspective that we find in 2 Timothy 2 and verse number 4, that I want to please my master, a good soldier. Not only does he endure hardne...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=2967",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}