{
  "reference": "2 Timothy 3",
  "occurrences": [
    {
      "sermon_id": "d-1B6rYpHbw",
      "timestamp": 1075.8800354003906,
      "text": "the word of the Lord came unto Jeremiah, the prophet, after that Hananiah the prophet had broken the yoke from off the neck of the prophet Jeremiah, saying, go and tell Hananiah, saying, thus saith the Lord, thou hast broken the yokes of wood, but thou shalt make for them yokes of iron. It's interesting, he said that it would be within the space of two full years, but if you read verse number 16, it says, therefore, thus saith the Lord, behold, I will cast thee from off the face of the earth. This year thou shalt die, because thou hast taught rebellion against the Lord. So Hananiah the prophet died the same year in the seventh month. God dealt with him. It was severe judgment. But I just think about that passage of Scripture and the antics of Hananiah and the way in which he's breaking that yoke. I mean, certainly the people would be excited about hearing something like that. He's saying that he's speaking the word of the Lord, but God says, no, I didn't give him this message. We see that the desire of these antichrists, the desire of these false teachers is to seduce, to deceive. Remember this truth in 2 Timothy 3, in verse number 13, the Bible says, but evil men and seducers shall wax worse and worse, deceiving and being deceived. On Wednesday evenings, several, I don't know, last year in the fall, I preached",
      "context": "...se antichrists, the desire of these false teachers is to seduce, to deceive. Remember this truth in 2 Timothy 3, in verse number 13, the Bible says, but evil men and seducers shall wax worse and worse, deceiving...",
      "sermon_title": "Sermon d-1B6rYpHbw",
      "url": "https://www.youtube.com/watch?v=d-1B6rYpHbw&t=1075",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d-1B6rYpHbw",
      "timestamp": 1143.4400024414062,
      "text": "these false teachers is to seduce, to deceive. Remember this truth in 2 Timothy 3, in verse number 13, the Bible says, but evil men and seducers shall wax worse and worse, deceiving and being deceived. On Wednesday evenings, several, I don't know, last year in the fall, I preached a series for a couple of months on the danger of deception. The way in which we read all throughout the word of God, the warning has been given to us with regard to this age of deception in which we're living. We find that these false teachers that are mentioned here, the exposure of false teaching, he gives a description, he gives their doctrine and then he speaks of their desire. As we move forward this morning, I want you to think not only of the exposure of false teaching, but I want you to consider number two, the enabling of the believer, the enabling of the believer. I'm thankful that there's a great contrast in these verses of Scripture with regard to the behavior of the false teacher, the behavior of the Antichrist, that spirit of Antichrist versus the behavior of the believer. The reality is that in verse number 20, the Bible says, but we, excuse me, but ye have an unction from the Holy One, and ye know it. all things.\" Notice, in verse number 27, it says, \"...but the anointing which ye have received of him abideth in you. And ye",
      "context": "these false teachers is to seduce, to deceive. Remember this truth in 2 Timothy 3, in verse number 13, the Bible says, but evil men and seducers shall wax worse and worse, deceiving...",
      "sermon_title": "Sermon d-1B6rYpHbw",
      "url": "https://www.youtube.com/watch?v=d-1B6rYpHbw&t=1143",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 1604.97998046875,
      "text": "they believe. And listen, say, well, I can believe, you know, we believe certain things that are consistent. Be careful, because sooner or later what's going to happen, you start filling, you continue to fill your mind with those things, it's going to have an impact. It's going to have an influence. You say, well, if I believe this that they said, they were so convincing in what they said over here, and I didn't believe it when I first started. But now all of a sudden I understand where they're coming from. Be careful. We must examine the source. We must know. Listen, what do they believe? If they don't believe in creation, if they don't believe that God is the creator, if they don't believe that He died for all people, if they don't believe that Jesus is the only way to heaven, if they don't believe, we could just keep going through the fundamentals of the faith. Listen, don't fill your mind with it. It ministers questions. It's vain jangling. We find this morning that Paul says to Timothy in the second letter, we're not going to turn there and look at it, but you can reference it in 2 Timothy 3 and verse number 10, Paul makes this statement, but thou has fully known my doctrine, manner of life, purpose, faith, longsuffering, charity, and patience. I like that he says, you have fully known my doctrine and manner of life. You ought to examine the",
      "context": "...thy in the second letter, we're not going to turn there and look at it, but you can reference it in 2 Timothy 3 and verse number 10, Paul makes this statement, but thou has fully known my doctrine, manner of lif...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=1604",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 1675.5599670410156,
      "text": "reference it in 2 Timothy 3 and verse number 10, Paul makes this statement, but thou has fully known my doctrine, manner of life, purpose, faith, longsuffering, charity, and patience. I like that he says, you have fully known my doctrine and manner of life. You ought to examine the source. You know how many people today, when we talk about physical diet, are looking at the labels? I mean, they're examining, they want to know where did this thing come from, what's going on with it, what's the source? Why? Because they want to, I only want to put healthy things in my body. And then they're a Christian and they go and listen to terrible false teaching. You say, what's going on here? You examine the source with regard to the meat that you're going to eat, but you don't even care about the stuff you're listening to? It's dangerous. And Paul gives a warning. He says we have to be selective. When it comes to our spiritual diet, when we ask ourselves how's our diet spiritually speaking, we must be selective. Number two, I took a long time on number one, but we'll get through it. Amen. Number two, you must, you must be scriptural. You must be selective, but you must be scriptural. See, in verse number three of the Bible says, them which believe and know the truth. I've already made mention of the fact that we're thankful for God's truth, for God's Word,",
      "context": "reference it in 2 Timothy 3 and verse number 10, Paul makes this statement, but thou has fully known my doctrine, manner of lif...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=1675",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aCE3YCr6zy8",
      "timestamp": 1709.5599975585938,
      "text": "But yet, so many do. 2 Timothy 2 and verse 15 tells us to study. Study what? Study the Word of God to show ourselves approved. It tells us, study to show thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the Word of truth. I gotta read it if I'm gonna study it. 1 Peter 2 and verse number two says, as newborn babes desire the sincere milk of the Word, that ye may grow thereby. 2 Timothy 3 and verse 18 says, but grow in grace in the knowledge of our Lord and Savior, Jesus Christ, to whom be glory and honor forever and ever. Amen. This book produces growth in God's people. And so the question this evening with regard to Bible reading is will we make a commitment to God perhaps to read the book of Proverbs each month, perhaps to read the New Testament in one year, perhaps to read the entirety of God's Word in one year, and make that commitment to God? You say, well, I already do that. Good. Continue. Maybe add to it. I change it up year by year. I think it was in 2018. I read the Bible through twice, but I read the book of Psalms every month. It requires that you read five Psalms a day, and you do that, and you get through the whole book of Psalms each month.",
      "context": "...se number two says, as newborn babes desire the sincere milk of the Word, that ye may grow thereby. 2 Timothy 3 and verse 18 says, but grow in grace in the knowledge of our Lord and Savior, Jesus Christ, to whom...",
      "sermon_title": "Sermon aCE3YCr6zy8",
      "url": "https://www.youtube.com/watch?v=aCE3YCr6zy8&t=1709",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 438.5400085449219,
      "text": "instruction in righteousness, that the man of God may be perfect, throughly furnished unto all good works. Thus, Paul would give Timothy a charge in the fourth chapter. We know that the chapter divisions were inserted later for our ease of being able to find and reference portions of Scripture. But he gives a charge to begin the fourth chapter, and he says this in verse number two, preach the word. Why? Because of what he just told us the word is. And this morning, as we begin to think about this truth of holding in our hands the precious Bible, someone said this, I thought it was just so perfect how they summarized this truth, referring to the Bible as the word of God is the most complete and impressive acknowledgement of its significance, reminding us that we should regard the Bible as God speaking to man. It's God's word. This message from God to humanity is the most powerful and trustworthy book ever written. God assures us throughout the Bible that these are His very words. I'm thankful this morning that God's given us a Bible. As we think about the greatness of God and how inspiration reveals to us the greatness of God, if you're taking notes, I want you to consider with me the process of inspiration. What is the process of inspiration? The Bible tells us here in verse number 16 of 2 Timothy 3 that all Scripture is given by inspiration of God.",
      "context": "...s of inspiration. What is the process of inspiration? The Bible tells us here in verse number 16 of 2 Timothy 3 that all Scripture is given by inspiration of God.",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=438",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 522.4400024414062,
      "text": "reveals to us the greatness of God, if you're taking notes, I want you to consider with me the process of inspiration. What is the process of inspiration? The Bible tells us here in verse number 16 of 2 Timothy 3 that all Scripture is given by inspiration of God. As we begin to think about this statement of inspiration and how all Scripture has been given in this manner, we would ask ourselves this question, what is the process? How did God do this? And the reality is that He answers that for us in 2 Peter chapter number one. Hold your place here, if you will, in 2 Timothy chapter number three, but turn over to 2 Peter chapter number one. And it's interesting because Peter is the human penman to the book of 2 Peter, containing his name here in the particular epistle. He is the human penman, but remember all Scripture is given by inspiration of God. And as Peter is writing in this particular passage of Scripture, we'll actually visit this passage again in a few weeks and look at this passage in its entirety. But notice what Peter is saying. He talks about the fact that we have a more sure word of prophecy, and he speaks with regard to an experience that he had on the Mount of Transfiguration. If you think back to the ministry of the Lord Jesus Christ, Peter, James, and John had the privilege",
      "context": "...s of inspiration. What is the process of inspiration? The Bible tells us here in verse number 16 of 2 Timothy 3 that all Scripture is given by inspiration of God. As we begin to think about this statement of ins...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=522",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1047.4800109863281,
      "text": "recognize this morning that as we look at this book that we hold in our hands that there are about 40 different human penmen over a span of time of about 1,500 years, three different languages and three different continents, yet we have one perfect book. It's amazing. It's amazing. I'm not sure how many people are in the auditorium this morning, but if we were to just have a topic been given to each of us that we would write a one page, not a certain number of words, but just write one page on a particular subject, I'm sure we'd come up with some contradictions amongst ourselves. Over 1,500 years, 40 different people, three different languages, three different continents and you have one complete perfect book. Why? Because of the author. Because inspiration reveals the greatness of God. That God is able to take the different personalities of the human penmen and he's able to communicate his very word to us. It's amazing. You think about God's greatness being revealed in that manner. This morning as we think about the process of inspiration, I want you to consider with me number two, the product of inspiration. The product of inspiration. Because the Bible is given by inspiration, it is literally the word of God and is therefore profitable. Notice what it says in 2 Timothy 3 and verse number 16. Because the scripture is given by inspiration, and we've looked there just for a moment,",
      "context": "...by inspiration, it is literally the word of God and is therefore profitable. Notice what it says in 2 Timothy 3 and verse number 16. Because the scripture is given by inspiration, and we've looked there just for...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1047",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1123.739990234375,
      "text": "inspiration. The product of inspiration. Because the Bible is given by inspiration, it is literally the word of God and is therefore profitable. Notice what it says in 2 Timothy 3 and verse number 16. Because the scripture is given by inspiration, and we've looked there just for a moment, the process of inspiration, you find that the truth is given to us with regard to the product of inspiration. Because it is God-breathed, because it is the word of God, it is profitable. It is profitable. There are certain things that we look to and we gain a measure of profit from something and we can think about owner's manuals and how-to type of books. And the reality is that if you were to get a particular manual on something, you had a particular product that you were trying to operate and you wanted to operate that thing properly, you would hope to have a manual written about that product by someone who knew something about the product. Make sense? Right? Otherwise, it's probably not going to be really profitable. So I can be very helpful. Hey, would you write a manual on how-to? And you're like, I've never done that before. How am I supposed to write a manual on that? When I worked at Sikorsky in the corporate world for a number of years, we would have standard operating procedures. Many of you in the workplace, you understand standard operating procedures",
      "context": "...by inspiration, it is literally the word of God and is therefore profitable. Notice what it says in 2 Timothy 3 and verse number 16. Because the scripture is given by inspiration, and we've looked there just for...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1123",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1194.4800415039062,
      "text": "how-to? And you're like, I've never done that before. How am I supposed to write a manual on that? When I worked at Sikorsky in the corporate world for a number of years, we would have standard operating procedures. Many of you in the workplace, you understand standard operating procedures and instructions. We'd also have work instructions. And I was regularly tapped and would… within our department to write work instructions. The idea of writing a work instruction at Sikorsky was that someone that was considered to be a subject matter expert in a particular area would write a work instruction that someone that had no knowledge of that particular field or work could take that work instruction and complete the task. That was the objective. That's what we're seeking to do. And I had the privilege during that period of time to author several work instructions, and we'd go through the process, and it was quite enjoyable, actually. We look at this book that we hold in our hands this morning. It is given by inspiration. Therefore, it is God's word, and it is profitable, because God is the creator. He knows everything. He has all wisdom, and he has all power, and so he's given us exactly what we need within the pages of this book. We find that here in 2 Timothy 3 and verse number 16, he specifies in four different areas how God's word is profitable. Notice he says it's profitable for doctrine, for teaching.",
      "context": "...ower, and so he's given us exactly what we need within the pages of this book. We find that here in 2 Timothy 3 and verse number 16, he specifies in four different areas how God's word is profitable. Notice he s...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1194",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1276.3199996948242,
      "text": "has all power, and so he's given us exactly what we need within the pages of this book. We find that here in 2 Timothy 3 and verse number 16, he specifies in four different areas how God's word is profitable. Notice he says it's profitable for doctrine, for teaching. We speak about doctrine. Let me say this. Doctrine matters. Doctrine is important. We find that the book of Titus is written, if you were to read just the first chapter and enter just a couple of verses in the second chapter of the book of Titus, you'll find three or four different references that Paul is making to Titus about sound doctrine. In fact, here, even within the context of this passage of Scripture, he says how the Bible is given by inspiration of God and is profitable for doctrine. He then says this in verse number two. Preach the word of chapter four. Be instant in season, out of season. Reprove, rebuke, exhort. Notice when he says with all longsuffering and doctrine, for the time will come when they will not endure sound doctrine, but instead, after their own lusts, shall they keep to themselves teachers having itching ears. Far too often today, doctrine is set aside as people seek to say, well, let's just have unity. The best way to have unity is to agree on this book. Let me rephrase that. It's not the best way to have unity.",
      "context": "...ower, and so he's given us exactly what we need within the pages of this book. We find that here in 2 Timothy 3 and verse number 16, he specifies in four different areas how God's word is profitable. Notice he s...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1276",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1713.5599975585938,
      "text": "there, or on the back table, about how to song lead. I've never read the book. I'm sure there's some good things in there. But you have to understand that we're talking about song leading, we're talking about in the context of a church, that there are some spiritual truths that need to be understood before you're going to just write about how to lead singing. In the context of pleasing God, in the context of doing things decently and in order, in the context of they that worship him, John 4, must worship him in spirit and in truth. We find that the word of God is profitable. The Bible not only is profitable, the product of inspiration, but notice what the Bible says in 2 Timothy 3 and verse 17. The Bible equips the child of God. He says that it's profitable for these things, for doctrine, for reproof, for correction, for instruction in righteousness. Then notice verse 17, that the man of God may be perfect, throughly furnished unto all good works. The Bible equips the child of God. It equips us. I'm so thankful for the equipping. I'm so thankful that the Holy Spirit of God who lives within me, the Holy Spirit of God, if you've been saved this morning that lives within you, that he will guide you into all truth and that he will help you to be in that place where you're equipped, where you're complete",
      "context": "...le. The Bible not only is profitable, the product of inspiration, but notice what the Bible says in 2 Timothy 3 and verse 17. The Bible equips the child of God. He says that it's profitable for these things, for...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1713",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 2858.3999633789062,
      "text": "Paul says the persecutions that he endured, but out of them all the Lord delivered me. I would encourage you this evening, if not tonight, maybe one day this week, to go back and read Acts 13 and Acts 14 and read about that first missionary journey of the Apostle Paul and read about the things that he suffered, the things that he endured, and how that God delivered him. By the way, for some of us we might not call it deliverance as he did, he was stoned and left for dead, but God raised him up and he went back and preached some more. Notice verse 12 of 2 Timothy 3, It does not tell us that men are going to get better and better, they're going to get worse and worse. Are we not seeing it? Honestly. We look around our country, we look around our world. We can see the evil. We can see, as Isaiah speaks of, where they call evil good and good evil. We see it. We see where they legislate wickedness. It's abounding in our nation. And it's not going to get better and better. Contrary to what some would like for you to believe, contrary to what some would stand and proclaim as they would seek to garner your vote, or whatever it might be, and we find that the Bible tells us that evil men and seducers, they're going to wax worse and worse.",
      "context": "...nd left for dead, but God raised him up and he went back and preached some more. Notice verse 12 of 2 Timothy 3, It does not tell us that men are going to get better and better, they're going to get worse and wo...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=2858",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 3265.47998046875,
      "text": "meeting tonight, they could be imprisoned or worse. Literally because of the people that they share the Gospel with, that if they trust Christ as their Savior, they're disowned by their family. At times, they're beaten. At times, they're put to death because of the culture in which they're in. We have such freedoms and such liberties. And I'm thankful for them. But I fear that for too long, we've taken them for granted. Someone said, I don't know who it was, that sometimes we don't know how much we appreciate something until it's taken away. It might become a whole lot more difficult to be a faithful Christian in my lifetime and in your lifetime. But can I tell you that that's what we've been called to do? We know, listen, Jeremiah knew the coming judgment. I don't know when the Lord's going to come, and neither do you. But we do know that the Bible tells us the characteristics of the last days as we read in 2 Timothy 3. Evil men and seducers, they're going to wax worse and worse. Our society as a whole is becoming more and more anti-God. And by the way, they're not shy about being anti-God. They're not shy at all. Some of the things that I've read in recent days and weeks with regard to some of that which we may face as believers, I don't know if it's true or not.",
      "context": "...r do you. But we do know that the Bible tells us the characteristics of the last days as we read in 2 Timothy 3. Evil men and seducers, they're going to wax worse and worse. Our society as a whole is becoming mo...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=3265",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "X0_tae_rdlg",
      "timestamp": 468.6199951171875,
      "text": "And what a blessing that God has given us the opportunity to know him and then to declare his greatness and then we finished up the calendar year by dealing with the impact that his greatness will have in our lives daily. When I truly understand how great God is, my belief, God is great, will impact my behavior. How I behave reveals what I believe. The way that we pray is going to be impacted by how great we believe God is. And we dealt with a number of things. And so this year in 2024, as we flip the calendar tomorrow, as we have our vision Sunday today and introduce the theme, the idea of continue. And again, I mentioned 2 Timothy 3, 14, you probably, some of you can read it from where you are. Some of you say it's just blurry to me because of the size of the font there. But 2 Timothy 3 and verse number 14, Paul gives this charge to Timothy and he says this, but continue thou in the things which now has learned and has been assured of, knowing of whom thou has learned them. The word continue means to persevere. It means to be steadfast or constant in any course. It carries this idea not to depart. The idea of continue in Acts chapter 14 and verse 22, you don't need to turn there. But in that portion of scripture, Paul has the opportunity to follow up",
      "context": "... have our vision Sunday today and introduce the theme, the idea of continue. And again, I mentioned 2 Timothy 3, 14, you probably, some of you can read it from where you are. Some of you say it's just blurry to ...",
      "sermon_title": "Sermon X0_tae_rdlg",
      "url": "https://www.youtube.com/watch?v=X0_tae_rdlg&t=468",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}