{
  "reference": "Acts 17",
  "occurrences": [
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 721.359977722168,
      "text": "recognizing through the statement and through how she would refer to the Lord Jesus Christ, that he is the Lord, that he is Messiah. We find that the Apostle Paul dealt with this subject as he was preaching, and we often have made reference to the messages that God gives us in the book of Acts. And we find that when the Apostle Paul went to Thessalonica in Acts chapter number 17, the Bible tells us that he first went into the synagogue. This was his manner. This was his typical approach as he went to the cities that God would allow him to minister in. The Bible tells us that when he arrived in Thessalonica that there was a synagogue of the Jews, and Paul, as his manner was in verse 2 of Acts 17, says that he went in unto them and three Sabbath days reasoned with them out of the Scriptures. Notice in verse number 3 of Acts 17, opening and alleging that Christ must needs have suffered and risen again from the dead, and that this Jesus whom I preach unto you is Christ. Why is it that the Apostle Paul used the words, the names, of Christ that he did in the manner in which he did? We find that he's there in the synagogue, and Jesus, the name of Jesus, that name gives us the understanding that Jehovah is salvation, that God incarnate. These individuals, many of them, of course, they",
      "context": "...d in Thessalonica that there was a synagogue of the Jews, and Paul, as his manner was in verse 2 of Acts 17, says that he went in unto them and three Sabbath days reasoned with them out of the Scriptures. No...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=721",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 145.83999633789062,
      "text": "revealed to us the obedience of the disciples and the Work of Christ as we obey God and we do what he's told us to do We see that he blesses beyond measure the first of those statements is made in Acts 5 in verse 28 when those that are Opposing the work of the ministry say this ye have filled Jerusalem with your doctrine that's a good thing, isn't it and We have commanded you not to speak in his name yet. Ye have filled Jerusalem with your doctrine. Oh that it would be said of us here in northern, Virginia That we have filled this community this region of the state this part of our nation with the gospel of Jesus Christ We find that later in Acts 17 When Paul and Silas would arrive to the city of Thessalonica that those in opposition said these That have turned the world upside down Are come hither Also these that have turned the world upside down have come hither also that's Acts 17 in verse number 6 we find that The gospel is powerful we find that as you read through the journeys the missionary journeys as we'd often refer to them as in the book of Acts and you'll find how that the missionaries would arrive to a particular city a particular region you see how that the gospel preached change lives and the power of the gospel those",
      "context": "...s region of the state this part of our nation with the gospel of Jesus Christ We find that later in Acts 17 When Paul and Silas would arrive to the city of Thessalonica that those in opposition said these Th...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=145",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 827.3800201416016,
      "text": "privilege, but we have this treasure, the Gospel of Jesus Christ. Paul, in between the two verses that we've read here in 2 Corinthians 4 and verse three and verse number seven, we find that he mentions about the work of the enemy to keep blinded the minds of those that have not received the Gospel of Jesus Christ. And we understand that the enemy is alive and active and he's working. This morning, as Paul says here in verse number five, we preach not ourselves, but Christ Jesus the Lord and ourselves your servants for Jesus's sake. We don't preach ourselves. I often say to individuals as I have the privilege of sharing the Gospel with them, I'm not asking you to come to our church. I'm not asking you to give to our church. I'm not asking you to do any. I'm just trying to share with you the truth of what Jesus Christ did for you because one day you're going to die. Are you ready? Are you ready? See, I am dead hurt. Notice what he says in 1 Thessalonians 2. We'll move on to verse number 15 in Romans 1 here, but look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica",
      "context": "...ction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=827",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 898.5400085449219,
      "text": "look at what he says here in 1 Thessalonians 2. I made the statement by way of introduction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica and now he's writing this epistle back to these believers. And I want you to notice what he says in 1 Thessalonians 2 in verse number four. And I believe that this will continue to help us understand this perspective of Paul. Notice what he says. But as we were allowed of God, notice what he says, to be put in trust with the gospel. Even so we speak, not as pleasing men, but God which trieth our hearts. I notice a few things here from verse number four of 1 Thessalonians 2. Number one, I understand that it's a privilege. He says we are allowed of God. Isn't it amazing that God would allow us to be his spokespeople, to be his messengers. In 2 Corinthians 5, Paul says that we are ambassadors. And you think about that unique privilege and opportunity that is ours. And here Paul says that we were allowed of God. And then notice that phrase, to be put in trust with the gospel. He says it this way in 1 Thessalonians that we were entrusted to be put in trust with the gospel. In Romans one, I am debtor.",
      "context": "...ction this morning that second statement that's made in the book of Acts that's so impactful was in Acts 17 in verse six when Paul and Silas arrived at the city of Thessalonica and now he's writing this epis...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=898",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2017.9200592041016,
      "text": "die and they're going to go to either heaven or the lake of fire. That's just the reality. And we find that he understood what was at stake. These people aren't going to believe me. These people are going to oppose me. Well, at least I gave them the truth. And I can stand before God and say, I told them, I did what I was commanded to do. Look at Acts 17, if you will, as we think about this passion of Paul. We've noticed his perspective, we've noticed his preparation, and now as we consider this passion of his, we find in Acts 17, this is when they arrive in Thessalonica, according to verse number one, notice in verse two, and Paul, look at these words, as his manner was, went in unto them in three Sabbath days, reasoned with them out of the Scriptures. We find that in verse number two, the Bible tells us as his manner was, this was the manner of Paul. This was his behavior. This is what he did. He comes into a city. He's seeking to preach the gospel, to give the truth, as his manner was. Notice what it says in verse 16. Now you'll understand if we understand kind of what's going on here, the people that had troubled in other cities had now come to Thessalonica, and so they have Paul, they sent him out,",
      "context": "...e truth. And I can stand before God and say, I told them, I did what I was commanded to do. Look at Acts 17, if you will, as we think about this passion of Paul. We've noticed his perspective, we've noticed ...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2017",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2090.2400512695312,
      "text": "gospel, to give the truth, as his manner was. Notice what it says in verse 16. Now you'll understand if we understand kind of what's going on here, the people that had troubled in other cities had now come to Thessalonica, and so they have Paul, they sent him out, and in verse number 16, the Bible says, now while Paul waited for them in Athens, his spirit was stirred in him when he saw the city wholly given to idolatry. We find that Paul, really, if we were to understand what's taking place, and without having time to go through all of it this morning here in Acts 17, that they send Paul out ahead, and they're going to basically get a little R&R, if you will, because of all that has been encountered, and yet we find that when Paul is there, and he's waiting for them, he's at Athens, his spirit was stirred in him. Here's something that I've learned in my own life, and perhaps you can relate to this as well, is that it's possible for us to be stirred up and do nothing about it. It's possible. Oh, that God would stir us, and it would bring forth some action. No matter how small that action is, we've got to start somewhere, amen? Maybe this morning, your prayer, because you can't remember the last time you shared the gospel with an individual, as I mentioned earlier in the message, maybe the prayer this",
      "context": "...nderstand what's taking place, and without having time to go through all of it this morning here in Acts 17, that they send Paul out ahead, and they're going to basically get a little R&R, if you will, becau...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2090",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1273.8200149536133,
      "text": "Christ in the synagogues and he would say that He is the Son of God, that He is the Messiah. You find that this was his manner throughout his ministry, that you would find that he would speak about Jesus and many of those in that day knew who that person Jesus was. They understood his ministry, they were aware of his crucifixion, but he would preach to them and he would say this, specifically I'll reference one of the passages here in Acts 17 in verse number 3, opening and alleging that Christ must needs have suffered and risen again from the dead, and that this Jesus whom I preach unto you is Christ. See, Jesus, He is God incarnate, right? Jehovah is salvation is what the name means. Christ is the Messiah, the Son of God, the Anointed One. And we find that throughout the Scriptures, that as we look at Paul preaching, he says this Jesus is the Christ. Remember when the truth was given to Mary with regard to the announcement of the birth of Christ, it says that you shall call His name Jesus. Why? For He shall save His people from their sins. We find in Daniel 9 that prophecy of Messiah being cut off not for Himself. Notice in Hebrews chapter number 2, we studied this several weeks ago, but I want you to look at two verses of Scripture in the book of Hebrews and see the fulfillment of this",
      "context": "...would preach to them and he would say this, specifically I'll reference one of the passages here in Acts 17 in verse number 3, opening and alleging that Christ must needs have suffered and risen again from t...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1273",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}