{
  "reference": "Acts 13",
  "occurrences": [
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 220.60000610351562,
      "text": "Imprisonment and beatings and all sorts of things that they endured and how they prayed that God would grant them Boldness to speak thy word and how we understand even still today how we need the boldness of the Holy Spirit of God to speak the Word of God in 2016 we finished up the book of Acts We picked up in Acts 13 and went through the end of the book and we taught and had our theme that year. I believe God How important it is and that we would stand as Paul did in Acts 27 and make that declaration I believe God and We see throughout the latter part of the book of Acts the way in which the missionary journeys in the church The gospel went forward. What a blessing in 2017 increase our faith another one of those topical type of studies as we went through the year the calendar year of 2017 really we focused upon those things that God would give us in his word that would be as I often referred to it that year as faith builders and How God would increase our faith the disciples said to the Lord Jesus During his earthly ministry. They said Lord increase our faith and we to Understand that it's important that we live by faith. We understand the Word of God says without faith It is impossible to please him",
      "context": "...Holy Spirit of God to speak the Word of God in 2016 we finished up the book of Acts We picked up in Acts 13 and went through the end of the book and we taught and had our theme that year. I believe God How i...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=220",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1571.0599670410156,
      "text": "fulfilled their ministry. They were given a responsibility at the end of the text of Scripture to provide relief for the brethren that dwelt in Judea. And it tells us in verse 30, which also they did and sent it to the elders by the hands of Barnabas and Saul. They had been given a task, and they fulfilled their ministry in teaching in Antioch, and then they took that offering that had been brought up for the believers in Judea, and they took it. They fulfilled their ministry in Acts 12, in verse 25. Notice in Acts 13, in verse number 25. Just a page or two over, the Bible says, and as John fulfilled his course, he said, whom think ye that I am? I am not he, but behold, there cometh one after me whose shoes of his feet I am not worthy to lose. Who is he speaking of? John the Baptist. Right? John the Baptist. You read in the Gospel of John, and you read about John the Baptist. It was in the third chapter, that great declaration when he says, I must decrease, but he must increase. But John had been given an assignment. He was the forerunner of the Lord Jesus Christ. He was the one that said, behold, the Lamb of God which taketh away the sin of the world. And John the Baptist, it says here in Acts 13, that as John fulfilled his course, he ran his race. He finished.",
      "context": "...ievers in Judea, and they took it. They fulfilled their ministry in Acts 12, in verse 25. Notice in Acts 13, in verse number 25. Just a page or two over, the Bible says, and as John fulfilled his course, he ...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1571",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1641.8999938964844,
      "text": "He was the forerunner of the Lord Jesus Christ. He was the one that said, behold, the Lamb of God which taketh away the sin of the world. And John the Baptist, it says here in Acts 13, that as John fulfilled his course, he ran his race. He finished. He fulfilled his ministry. In Acts 14, in verse number 26, notice this is the end of the first missionary journey. I've often referred to this passage of Scripture at the end of Acts 14 as the first missions conference when the missionaries come back and they report of all that God has done and how God has worked. But you'll see in verse number 26 that the Bible says this, and then sailed to Antioch from whence they had been recommended to the grace of God for the work which they fulfilled. You know that when Paul is used by God to write the book of Galatians, that that book is not written to a single church of Galatia, it is written to the churches in Galatia that are the churches that were established during the first missionary journey. They fulfilled their work. They fulfilled what God had called them to do. If you were to take the time to go back to Acts 13 in the first few verses, you see how that God called them and said, separate me, Barnabas and Saul, for the work whereunto I have called them.",
      "context": "...hold, the Lamb of God which taketh away the sin of the world. And John the Baptist, it says here in Acts 13, that as John fulfilled his course, he ran his race. He finished. He fulfilled his ministry. In Act...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1641",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1706.739990234375,
      "text": "work. They fulfilled what God had called them to do. If you were to take the time to go back to Acts 13 in the first few verses, you see how that God called them and said, separate me, Barnabas and Saul, for the work whereunto I have called them. Does that not sound familiar to the charge that Archippus had received? Listen, take heed to the ministry which thou hast received in the Lord, that thou fulfill it. We find this example that is given to us, of course, we're familiar with Paul in 2 Timothy 4. We won't take the time to turn there this morning, but in 2 Timothy, it's the last letter that Paul would write before he would face a martyr's death. And we find that it was there that he says, I have finished, I have finished, I have finished. What a blessing. He'd kept the faith. He had finished his course. And Paul was confident of what God had called him to do, and he was faithful to fulfill what he had been called to do. So we look at these examples, and the time would not permit us to discuss many others that would be noteworthy and important for us to focus on. I want us to think this morning of this cloud of witnesses, and I want you to think about our greatest example, and that's the Lord Jesus Christ.",
      "context": "work. They fulfilled what God had called them to do. If you were to take the time to go back to Acts 13 in the first few verses, you see how that God called them and said, separate me, Barnabas and Saul,...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1706",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 1252.6200370788574,
      "text": "in Galatians chapter number one. You'll be mindful of the fact that Paul was converted and it's recorded for us in Acts chapter number nine on the road to Damascus. His name was Saul at that time and we find that after the first missionary journey which is recorded for us in Acts 13 through 15. This is in the region of Galatia and he's now writing back to those churches here in this book, but I want you to notice what he says in verses 11 and 12 with regard to this thought of preparation. He says this, but I certify you brethren that the gospel which was preached of me is not after man. For I neither received it of man neither was I taught it but by the revelation of Jesus Christ. Look over if you will skip down to verse number 18 and notice that he says then after three years I went up to Jerusalem to see Peter and abode with him 15 days. During that period of time Paul was going through some preparation. He was being instructed it says by the revelation of Jesus Christ in verse number 12 and there's not a whole lot that we know about that period of time in Paul's life, but we understand that there was this process of preparation. You understand that as he would write to those that he's ministering to over the years and as God would use them to write scripture",
      "context": "...s Saul at that time and we find that after the first missionary journey which is recorded for us in Acts 13 through 15. This is in the region of Galatia and he's now writing back to those churches here in th...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=1252",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}