{
  "reference": "Acts 18",
  "occurrences": [
    {
      "sermon_id": "9KxM021cU1c",
      "timestamp": 201.63999938964844,
      "text": "that ministry began, according to Acts chapter number 18, during Paul's second missionary journey. He came there to Ephesus, but the Bible tells us that he was there just for a very brief period of time, according to Acts chapter 18. It was during that time when he was there that he left Aquila and Priscilla, and then he returned to Jerusalem. But we find that in Acts 18 and verse 21, prior to his departure, the Apostle Paul says that he would return if the Lord allowed. And I'm thankful that the Lord allowed the Apostle Paul to return to the city of Ephesus. And he did, you begin reading in Acts chapter 19, and you begin to see that there, during Paul's third missionary journey, that he came back to Ephesus, and he ministered there for nearly three years. And what a blessing to think about the ministry there in Ephesus. We know some things with regard to the city of Ephesus. It was a commercial, political, and religious center. Of course, the great temple of Diana was there, and the idol worship, and you can read of what happened there in Acts 19 with regard to the ministry there in Ephesus, and what great ministry it was. The Bible would rehearse for us and help us to see in Acts 19 the revival that took place in Ephesus, where people are thoroughly getting right with God, and they're destroying their books,",
      "context": "...was there that he left Aquila and Priscilla, and then he returned to Jerusalem. But we find that in Acts 18 and verse 21, prior to his departure, the Apostle Paul says that he would return if the Lord allowe...",
      "sermon_title": "\"To The Church Of Ephesus - Part 1\" Revelation 2:1-7",
      "url": "https://www.youtube.com/watch?v=9KxM021cU1c&t=201",
      "channel": "Unknown",
      "publish_date": 20241111
    },
    {
      "sermon_id": "BB7NHySh5dQ",
      "timestamp": 211.22000122070312,
      "text": "be ready for what God is going to do in and through those services. Over the last few weeks, we've looked at some things on Sunday night with regard to God has a plan. We studied that, we understood that in the life of Moses. God's plan includes his people, and what a blessing to know that God would use us. In fact, it's often overwhelming to think that God would use us to accomplish his plan on this earth. Last week on Sunday night, we talked about we have a place, and every man must be in his place. You have a place, I have a place, and we need to be in our place. We need to be doing what God has called us to do, and of course this morning, bringing people to Jesus, looking at that passage in Mark chapter number two. I hope to encourage you this evening from Acts 18, we look in this portion of scripture, and God provides us really with the timing right as we enter into the beginning of this portion of scripture with regard to Paul's second missionary journey and his arrival in Corinth. Now the Bible says in verse number one of Acts 18, after these things, now understand that those three words, they convey a large message to us. After these things, well, what are these things? We find that the Bible, and we'll answer that question in just a moment, but it says after these things,",
      "context": "...esus, looking at that passage in Mark chapter number two. I hope to encourage you this evening from Acts 18, we look in this portion of scripture, and God provides us really with the timing right as we enter...",
      "sermon_title": "\"I Have Much People In This City\" Acts 18:1-11",
      "url": "https://www.youtube.com/watch?v=BB7NHySh5dQ&t=211",
      "channel": "Unknown",
      "publish_date": 20240603
    },
    {
      "sermon_id": "BB7NHySh5dQ",
      "timestamp": 274.0400085449219,
      "text": "verse number one of Acts 18, after these things, now understand that those three words, they convey a large message to us. After these things, well, what are these things? We find that the Bible, and we'll answer that question in just a moment, but it says after these things, Paul departed from Athens, notice, and came to Corinth. The Bible tells us in verse number 10, for I am with thee. You remember the promise that God gave to Moses? Certainly, I will be with thee. God says to Paul, for I am with thee, and no man shall set on thee to hurt thee. Notice the statement, for I have much people in this city. I'm gonna preach a message this evening that I've simply entitled from verse number 10, I have much people in this city. As we look at the text of scripture, we find that God provides us with timing, that Paul departs from Athens and he arrives, he came to Corinth. We understand the second missionary journey, it begins at the end of Acts chapter 15. At the end of Acts chapter 15, beginning in verse number 36, and throughout the first several verses of chapter 16, we find that Paul, on this second missionary journey, his desire is to follow up with the churches that were established during the first missionary journey. And we find that as those churches, what a great pattern, by the way, of follow up and the importance",
      "context": "verse number one of Acts 18, after these things, now understand that those three words, they convey a large message to us. Afte...",
      "sermon_title": "\"I Have Much People In This City\" Acts 18:1-11",
      "url": "https://www.youtube.com/watch?v=BB7NHySh5dQ&t=274",
      "channel": "Unknown",
      "publish_date": 20240603
    },
    {
      "sermon_id": "BB7NHySh5dQ",
      "timestamp": 2136.8199768066406,
      "text": "years of tragic events such as that. We have heartfelt sorrow in those types of conditions. But I would submit to you that as spiritually speaking, if we do not focus on the aspect of discipleship, we're failing not only to do what God's commanded us to do, but we're leaving people ill-equipped to do what God has called them to do, to be what God has called them to be. Discipleship is something that takes work, it's something that takes commitment. There must be someone that's willing to do the discipling and someone that's willing to be discipled, someone that has the level of humility that I need to be taught, somebody that understands, as Paul would say to the believers in Thessalonica, that you're lacking in some areas and you need to perfect that which is lacking. And what a joy. Listen, this evening, 20-some years after I've gotten saved by the grace of God, I understand tonight as 27 years ago I got saved, I've been discipled since I got saved. And I'm thankful for that discipleship, that teaching, that training. I'm thankful that someone was willing to invest in me and teach me because I did not know then what I know now. And I would not know now what I know now if someone was not willing to disciple. The work of the ministry is outlined for us here in Acts 18, and I want you to consider",
      "context": "...now now if someone was not willing to disciple. The work of the ministry is outlined for us here in Acts 18, and I want you to consider",
      "sermon_title": "\"I Have Much People In This City\" Acts 18:1-11",
      "url": "https://www.youtube.com/watch?v=BB7NHySh5dQ&t=2136",
      "channel": "Unknown",
      "publish_date": 20240603
    },
    {
      "sermon_id": "BB7NHySh5dQ",
      "timestamp": 2207.6199645996094,
      "text": "me and teach me because I did not know then what I know now. And I would not know now what I know now if someone was not willing to disciple. The work of the ministry is outlined for us here in Acts 18, and I want you to consider as we think about this missions conference and our part in world evangelization, and yes, we want to pick up new missionaries, we want to continue to send missionaries abroad so that they can do in these fields where we're calling them to, or where they're called of God to go, that we're partnering with them. We want to see in the Netherlands a church established where souls are being saved, the Word of God is being preached, and people are being discipled. We want to see that in Spain and all of these other fields, but we must not lose sight of the fact that it has to be done here as well. It has to be done here as well. It starts in Jerusalem, and this, as we make application, this is our Jerusalem. He says both, it's to be all at the same time, and we strategically approach that through supporting missionaries that are going around the globe. And I hope that by the end of the missions conference next week that we'll be able to partner with two brand new missionaries and be able to support them financially and add",
      "context": "...now now if someone was not willing to disciple. The work of the ministry is outlined for us here in Acts 18, and I want you to consider as we think about this missions conference and our part in world evange...",
      "sermon_title": "\"I Have Much People In This City\" Acts 18:1-11",
      "url": "https://www.youtube.com/watch?v=BB7NHySh5dQ&t=2207",
      "channel": "Unknown",
      "publish_date": 20240603
    }
  ]
}