{
  "reference": "Acts 24",
  "occurrences": [
    {
      "sermon_id": "5cqwtLBS4OE",
      "timestamp": 1597.2799987792969,
      "text": "the work that's required in that proving process. And here in 2 Corinthians 5 and verse number 9, he says we labor. Paul, I believe, regularly examined his life. I believe that Paul, as he writes to the church in 1 Corinthians and chapter number 11 about examining ourselves with regard to the Lord's Supper, I think that regularly in Paul's life he examined himself. He desired to know on a regular basis was he living in such a way that was pleasing to God. Turn over here to the book of Acts, in Acts chapter 24, and I want you to see what Paul says here in Acts chapter 24, and in this text of Scripture, he is giving his defense before Felix. We find that Paul, in this section of the book of Acts, he's had the opportunity to stand and to share his testimony and stood before the religious leaders of the community there, the Sanhedrin, if you will. We find that many of those religious leaders were there, and then he's going to be before Felix. We find that he will have opportunity to stand before Festus and Agrippa as well in the next several chapters, and so Paul is having this unique opportunity in this section of the book of Acts to be able to share what Christ did for him with these people. We find that in Acts 24, as Paul is going through the process here of giving his",
      "context": "... of the book of Acts to be able to share what Christ did for him with these people. We find that in Acts 24, as Paul is going through the process here of giving his",
      "sermon_title": "\"Striving To Please My Saviour\"  II Corinthians 5:9",
      "url": "https://www.youtube.com/watch?v=5cqwtLBS4OE&t=1597",
      "channel": "Unknown",
      "publish_date": 20250310
    },
    {
      "sermon_id": "5cqwtLBS4OE",
      "timestamp": 1667.47998046875,
      "text": "the next several chapters, and so Paul is having this unique opportunity in this section of the book of Acts to be able to share what Christ did for him with these people. We find that in Acts 24, as Paul is going through the process here of giving his defense, if you will, before Felix, notice, if you will, in verse number 13, neither can they prove the things whereof they now accuse me. Paul had been accused of some things, and in verse 8 it talks about how they accused him, and he says, in verse 10, I do the more cheerfully answer for myself, and he says they can't prove those things, but then notice what he says. He begins in verse 14, he gives this, he says, I confess. He gives this testimony, if you will, unto Felix and those that would be there, and he says, but this I confess unto thee, that after the way which they call heresy, so worship I the God of my fathers. Notice what he says at the end of verse number 14. Believing, what's it say? All things. Not some things, not most things, not the things that I like or the things that I can kind of fit in, but he says, believing all things which are written in the law and in the prophets. Now what does that refer to? That refers to the Old Testament, the law and the prophets, and so we could talk",
      "context": "... of the book of Acts to be able to share what Christ did for him with these people. We find that in Acts 24, as Paul is going through the process here of giving his defense, if you will, before Felix, notice...",
      "sermon_title": "\"Striving To Please My Saviour\"  II Corinthians 5:9",
      "url": "https://www.youtube.com/watch?v=5cqwtLBS4OE&t=1667",
      "channel": "Unknown",
      "publish_date": 20250310
    },
    {
      "sermon_id": "5cqwtLBS4OE",
      "timestamp": 1805.079988002777,
      "text": "It is a confident expectation. It is having this confidence, he says, and have hope toward God, which they themselves also allow that there shall be a resurrection of the dead. Both of the just and unjust and why is he saying this? Why is he talking about this resurrection? Well, because this motivates his living This is what plays into that desire which leads to that dedication that Paul has and we come to verse number 16 and notice what he says and Herein Do I exercise? myself You know what that word exercise means it means to labor It means to just drive What did we see over in 2nd Corinthians 5 and verse number 9? He says wherefore Wherefore we labor Right. So we find here. He says that I I Exercise myself. What is he exercising himself for in Acts 24 in verse 16? What is he laboring and striving for in this verse of Scripture notice to have always? to have always a conscience void of offense toward God and Toward men. I want you to think about this just for a moment Paul says I'm exercising myself. I'm laboring. I'm striving For what purpose Paul? Why are you exercising Paul? What is this this this effort that is going forth? Why are you dedicated to this because I want to have Always not most times but always a Conscience that is void of offense Toward God",
      "context": "...abor Right. So we find here. He says that I I Exercise myself. What is he exercising himself for in Acts 24 in verse 16? What is he laboring and striving for in this verse of Scripture notice to have always?...",
      "sermon_title": "\"Striving To Please My Saviour\"  II Corinthians 5:9",
      "url": "https://www.youtube.com/watch?v=5cqwtLBS4OE&t=1805",
      "channel": "Unknown",
      "publish_date": 20250310
    },
    {
      "sermon_id": "othOg-hLUps",
      "timestamp": 792.7600250244141,
      "text": "in all good conscience before God until this day. That's a powerful statement that the apostle Paul is able to make as he stands before this religious body and begins to give an account. And he says that, that he's lived in all good conscience before God until this day. But I want you to look forward in chapter 24 and verse number 16 of the book of Acts. And I want you to see how Paul kind of expounds upon this thought with regard to his conscience. And we see it in second Corinthians chapter one. Now Paul is standing before Felix and he's giving a testimony before Felix and in Acts 24 and verse 16, notice what the Bible says. And here in, do I exercise myself? Then notice what he says. To have, what's your Bible say, always. To have always a conscience, notice, void of offense toward God and toward men. He says that he's exercising, he's laboring, he's striving for this purpose to have always, not occasionally, not most of the time, but to always have a conscience that is void of offense. But not only toward God, but notice toward men. Toward men. Well, it's okay that I'm not right with those people because I'm right with God. Paul says that he exercised himself to have always a conscience void of offense toward God and toward men.",
      "context": "...ians chapter one. Now Paul is standing before Felix and he's giving a testimony before Felix and in Acts 24 and verse 16, notice what the Bible says. And here in, do I exercise myself? Then notice what he sa...",
      "sermon_title": "\"When You Are Misunderstood\" II Corinthians 1:12-2:4",
      "url": "https://www.youtube.com/watch?v=othOg-hLUps&t=792",
      "channel": "Unknown",
      "publish_date": 20250112
    }
  ]
}