{
  "reference": "Acts 8",
  "occurrences": [
    {
      "sermon_id": "3e1Tf17WpHs",
      "timestamp": 409.7200012207031,
      "text": "That they're reading in the 53rd chapter of the book of Isaiah and what a great chapter that is And we find here that as this one is sitting there reading the book of Isaiah That the Spirit then says to Philip in verse number 29 go near and join Thyself to this chariot again We see the direction and the instruction of the Lord and we see the obedience of God's servant here in Acts 8 in verse number 30 the Bible says in Philip ran fither to him. I like the expression He did not delay. He did not question. He did not sit there. You know, sometimes we can Is it really something I should do we kind of get into this is the Spirit of God really? Prompting me to do this and so on and so forth and we can perhaps miss an opportunity But the Bible tells us that Philip ran fither to him Notice He heard him read the prophet Isaiah now Can you imagine as you would be obedient to the Spirit of God and Philip arises up? He leaves Samaria He goes to the place where the Lord had instructed them to go and then he sees this chariot and the Spirit of God says yes Go to that chariot join him and as he's going to that place. He's reading He hears the man reading from the book of Isaiah Question number one is",
      "context": "...see the direction and the instruction of the Lord and we see the obedience of God's servant here in Acts 8 in verse number 30 the Bible says in Philip ran fither to him. I like the expression He did not del...",
      "sermon_title": "Sermon 3e1Tf17WpHs",
      "url": "https://www.youtube.com/watch?v=3e1Tf17WpHs&t=409",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6MLW_MPF-wo",
      "timestamp": 222.72000122070312,
      "text": "all knowledge. No, God has all knowledge, and we need to continue to have that teachable spirit, and humility is so necessary. Notice the response. It continues in verse number 31. He says, how can I except some man should guide me? I would say this, as you look at the remainder of verse number 31, it says, and he desired, Philip, that he would come up and sit with him. So, his response reveals humility, but I would say that his invitation reveals desire. His invitation reveals desire. So, it's one thing to have the humility and say, no, I don't understand what I'm reading. He says, how can I except some man should guide me? But the remainder of the 31st verse here in Acts 8 says, he desired, Philip, that he would come up and sit with him. I like that desire. And it reveals, this invitation reveals that desire we mentioned as we looked in our very first lesson of the subject matter of teach me, how the plea of the psalmist when he cries out, teach me, that plea reveals desire. It reveals that I want to learn. I want to be taught. You don't say, teach me to someone if you don't want to learn, right? It reveals a desire to learn something. Again, it's not a use of flattery where the psalmist is just using some cliche of teach me and",
      "context": "...ng. He says, how can I except some man should guide me? But the remainder of the 31st verse here in Acts 8 says, he desired, Philip, that he would come up and sit with him. I like that desire. And it reveal...",
      "sermon_title": "Sermon 6MLW_MPF-wo",
      "url": "https://www.youtube.com/watch?v=6MLW_MPF-wo&t=222",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}