{
  "reference": "Acts 26",
  "occurrences": [
    {
      "sermon_id": "lmbflZLlrso",
      "timestamp": 664.4000244140625,
      "text": "privilege of ministering here in Northern Virginia that literally the world is in our backyard and we see that, we understand that, we see how that the opportunities are before us and truly sharing the gospel, proclaiming the gospel begins by simply taking that step and engaging with an individual. You don't have to cross an ocean, you don't have to get on an airplane or a boat in order to go and proclaim the gospel to someone. Acts 1.8, but you shall receive power after that the Holy Ghost has come upon you and you shall be witnesses unto me both in Jerusalem, Judea, Samaria, the uttermost part of the earth and remember the disciple said this, we are his witnesses. We have it, that portion of Acts 5 is on the wall above our track rack to remind us that we are his witnesses and if we have the truth and I believe we do, listen, if I didn't think it was true, I'd just go do something different, right, but I believe it's true and we have it and therefore we ought to give it. I want you to consider the life of Paul though when we consider the command of Christ, notice if you will over in Acts 26. Notice what he's saying here, he's standing before King Agrippa in this closing section of the book of Acts, we find that Paul has given his testimony before several leaders and here he's standing",
      "context": "...consider the life of Paul though when we consider the command of Christ, notice if you will over in Acts 26. Notice what he's saying here, he's standing before King Agrippa in this closing section of the boo...",
      "sermon_title": "\"We Ought To Proclaim The Gospel\" Ephesians 6:19-20",
      "url": "https://www.youtube.com/watch?v=lmbflZLlrso&t=664",
      "channel": "Unknown",
      "publish_date": 20240922
    },
    {
      "sermon_id": "lmbflZLlrso",
      "timestamp": 729.1200256347656,
      "text": "though when we consider the command of Christ, notice if you will over in Acts 26. Notice what he's saying here, he's standing before King Agrippa in this closing section of the book of Acts, we find that Paul has given his testimony before several leaders and here he's standing before Agrippa and others that are there, Festus is going to tell him that he's crazy, he's mad because he's there in the audience as well, but notice in Acts 26 and verse 15, the Apostle Paul is rehearsing his conversion testimony and his experience of coming to Christ as we read of it in Acts chapter nine and I'm gonna pick it up in verse 15, he says and I said, who art thou Lord? And he said, I am Jesus whom thou persecutest. But then notice verse 16, but rise and stand upon thy feet for I have appeared unto thee for this purpose, to make thee a minister and a witness both of these things which thou hast seen and of those things in the which I will appear unto thee, delivering thee from the people and from the Gentiles unto whom now I send thee to open their eyes and to turn them from darkness to light and from the power of Satan unto God that they may receive forgiveness of sins and inheritance among them, which are sanctified by faith that is in me. Isn't that a great mission that God communicated",
      "context": "though when we consider the command of Christ, notice if you will over in Acts 26. Notice what he's saying here, he's standing before King Agrippa in this closing section of the boo...",
      "sermon_title": "\"We Ought To Proclaim The Gospel\" Ephesians 6:19-20",
      "url": "https://www.youtube.com/watch?v=lmbflZLlrso&t=729",
      "channel": "Unknown",
      "publish_date": 20240922
    },
    {
      "sermon_id": "lmbflZLlrso",
      "timestamp": 796.1200256347656,
      "text": "send thee to open their eyes and to turn them from darkness to light and from the power of Satan unto God that they may receive forgiveness of sins and inheritance among them, which are sanctified by faith that is in me. Isn't that a great mission that God communicated to the Apostle Paul at this time in his life, he saw, he's just converted, he says, who art thou Lord? What wilt thou have me to do? And we find that Jesus gives him this revelation, he tells him that he's gonna send him as a witness of these things. He tells them that as he goes and he preaches, it's going to be so that their eyes, that they could be turned from darkness to light, from the power of Satan unto God, that they may receive forgiveness of sins. This is what we get to do when we proclaim the gospel, this is what we're doing, we're giving somebody the greatest news. I understand that sometimes they don't receive it that way, but Paul understood this, he understood the command of Christ. I want you to notice, I stopped reading in verse 18, but I want you to look at what it says in Acts 26, in verse 19, look at what Paul says, whereupon, O King Agrippa, notice what he says, I was not disobedient unto the heavenly vision. Paul considered this thought and this practice of proclaiming the gospel a matter of obedience,",
      "context": "...ist. I want you to notice, I stopped reading in verse 18, but I want you to look at what it says in Acts 26, in verse 19, look at what Paul says, whereupon, O King Agrippa, notice what he says, I was not dis...",
      "sermon_title": "\"We Ought To Proclaim The Gospel\" Ephesians 6:19-20",
      "url": "https://www.youtube.com/watch?v=lmbflZLlrso&t=796",
      "channel": "Unknown",
      "publish_date": 20240922
    },
    {
      "sermon_id": "lmbflZLlrso",
      "timestamp": 867.280029296875,
      "text": "want you to look at what it says in Acts 26, in verse 19, look at what Paul says, whereupon, O King Agrippa, notice what he says, I was not disobedient unto the heavenly vision. Paul considered this thought and this practice of proclaiming the gospel a matter of obedience, obedience to Christ, and he says to Agrippa, I was not disobedient unto the heavenly vision. He says it this way to the church in Corinth in 1 Corinthians chapter nine, he's speaking to them about the privilege that he has to be involved in the gospel ministry, and he says this in 1 Corinthians nine in verse 16, for though I preach the gospel, I have nothing to glory of, for necessity is laid upon me, yea, woe is unto me if I preach not the gospel. And he says in verse 23, and this I do for the gospel's sake that I might be partaker thereof with you. I think about the apostle Paul and a man that surrendered and yielded to proclaiming the gospel, but yet a man that when he submits a request for prayer to the church at Ephesus, what is it that he requests prayer for? That he would have boldness, that he would open his mouth to speak with boldness as he ought to speak. Wow. He understood the command of Christ. Not only do I believe that the apostle Paul understood the command of Christ,",
      "context": "want you to look at what it says in Acts 26, in verse 19, look at what Paul says, whereupon, O King Agrippa, notice what he says, I was not dis...",
      "sermon_title": "\"We Ought To Proclaim The Gospel\" Ephesians 6:19-20",
      "url": "https://www.youtube.com/watch?v=lmbflZLlrso&t=867",
      "channel": "Unknown",
      "publish_date": 20240922
    }
  ]
}