{
  "reference": "Acts 16",
  "occurrences": [
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 533.0999755859375,
      "text": "It's the cause of Christ. And that ought to cause us to rejoice greatly. It's not a work of just men. It's the cause of Christ. And notice it says, And to him they agreed. They as the religious leaders and him as Gamaliel. And they agreed with his counsel. They agreed with what he says. And it says in verse 40, And when they had called the apostles, and notice these three words and beaten them, and beaten them, the Bible says they commanded that they should not speak in the name of Jesus and let them go. And they departed from the presence of the council. Notice this next phrase, rejoicing that they were counted worthy to suffer shame for his name. You know what they were doing? They were rejoicing through trials. They were beaten, and yet they left rejoicing. They were commanded, and yet the Bible says that they daily in verse 42 and in the temple and every house, they cease not to teach and preach Jesus Christ. The very thing that caused them to be beaten, they said, no, we're going to keep on doing that. Why? Because we are his witnesses. We find that here in Acts chapter 16, another example, we find specifically in Acts 16 that of Paul and Silas. And again, we won't take the time to read the entire context of what's taking place, but we know that in Acts 16, they come to Philippi.",
      "context": "...e are his witnesses. We find that here in Acts chapter 16, another example, we find specifically in Acts 16 that of Paul and Silas. And again, we won't take the time to read the entire context of what's taki...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=533",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 597.9199829101562,
      "text": "his witnesses. We find that here in Acts chapter 16, another example, we find specifically in Acts 16 that of Paul and Silas. And again, we won't take the time to read the entire context of what's taking place, but we know that in Acts 16, they come to Philippi. The work of the Lord is going on. And we know that there was that demon-possessed girl, and we find that Paul gave command, and she… the owners, they were going to lose gain, and so they're very angry, and they cause for Paul and Silas to be imprisoned and to be beaten. The Bible tells us in verse 22, \"...until the multitude rose up together against them, and the magistrates rent off their clothes and commanded to beat them. When they had laid many stripes upon them, they cast them into prison, charging the jailer to keep them safely. Who having received such a charge, thrust them into the inner prison, and made the feet fast in the stocks…\" Notice verse 25, \"...and at midnight Paul and Silas prayed and sang praises unto God, and the prisoners heard them.\" You know, they were still in the midst of their trial. They'd been beaten, they were still in prison, they weren't released yet. We know that they will be miraculously released as we read the text of Scripture, but even as we'll mention tonight in the life of Joseph, we don't always know, or they didn't",
      "context": "his witnesses. We find that here in Acts chapter 16, another example, we find specifically in Acts 16 that of Paul and Silas. And again, we won't take the time to read the entire context of what's taki...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=597",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}