{
  "reference": "Acts 5",
  "occurrences": [
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 1082.0400085449219,
      "text": "way. Verse 17, all unrighteousness is sin, and there is a sin not unto death. And so we try to unpackage this and understand what is a sin unto death, though God does not define this sin, but we find that in his infinite wisdom and in his righteous judgment, that he has made it known to us as his children, that it is possible for the sinning believer to face physical death as a judgment. Not only has he told us this, that there is a sin unto death, by the way, that ought to cause us to be concerned and walk righteously, amen? We find that there are a couple of biblical examples. Turn back to the book of Acts, if you will, we'll look at New Testament examples, turn to Acts chapter number 5, and we look in this passage, I'm not going to read the entirety of it. For your notes, if you want to write down verses 1 through 11, that's the entirety of the portion of Scripture, but I will not take time to read all of the passage this morning. Many of us would be familiar with the account here of Ananias and Sapphira. The Bible tells us in Acts 5 in verse number 1, but a certain man named Ananias with Sapphira, his wife, sold a possession. And notice what they did in verse number 2, kept back part of the price, his wife also",
      "context": ".... Many of us would be familiar with the account here of Ananias and Sapphira. The Bible tells us in Acts 5 in verse number 1, but a certain man named Ananias with Sapphira, his wife, sold a possession. And ...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=1082",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 1143.7999877929688,
      "text": "with the account here of Ananias and Sapphira. The Bible tells us in Acts 5 in verse number 1, but a certain man named Ananias with Sapphira, his wife, sold a possession. And notice what they did in verse number 2, kept back part of the price, his wife also being privy of it, and brought a certain part and laid it at the apostles' feet. Peter said, Ananias, why hath Satan filled thine heart to lie to the Holy Ghost, to keep back part of the price of the land? Because it remained, was it not thine own? And after it was sold, was it not thine own power? Why hast thou conceived this thing in thine heart? Thou hast not lied unto men, but unto God. And Ananias, hearing these words, fell down and gave up the ghost. You know what that means? That means he died. You say, he just lied. I know, that's how we look at it. Just a lie. Everyone lies. You better be careful. Understand the seriousness of sin. And here, the Bible says that he gave up the ghost, but notice the result of it. It says, and great fear came on all them that heard these things. By the way, if this happened in our midst, I think most of us would have great fear as well. It'd be a sobering reality to the importance of righteousness. Amen? Our God is holy.",
      "context": "with the account here of Ananias and Sapphira. The Bible tells us in Acts 5 in verse number 1, but a certain man named Ananias with Sapphira, his wife, sold a possession. And ...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=1143",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 2221.4200134277344,
      "text": "adversity, when we know that we've been falsely accused, when we know that it's been kind of stacked against us so to speak, how can we be faithful? Can we be faithful? Absolutely. We can be faithful. And we must have our inner man renewed day by day. I believe that what Paul is referring here, referring to in this passage of Scripture with the inward man being renewed day by day, is that personal walk with God. That spiritual strength that comes from being with the Lord. I want you to think about two passages. We're going to look at one in the book of Acts and then one in the book of Ephesians as we close this evening. But I want to remind you of Acts chapter number 4. And in this passage of Scripture, we looked at Acts 5 this morning. But in Acts chapter number 4, again, the religious leaders are not happy with all that's taken place and the miracle of the healing of the lame man in chapter number 3 and all of the results of that. And we find that the Bible tells us that they were inquiring, they were questioning, interrogating if you will. Peter stands up and John is there. And we find that Peter begins to speak and he makes that great declaration in Acts 4 in verse 12, neither is there salvation in any other for there's",
      "context": ".... But I want to remind you of Acts chapter number 4. And in this passage of Scripture, we looked at Acts 5 this morning. But in Acts chapter number 4, again, the religious leaders are not happy with all tha...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=2221",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 1855.6600494384766,
      "text": "person at the counter, he's like, but I got a friend, a co-worker that, man, he said he bought it for this much. And they said, well, he's not telling you the truth. Now, I didn't know this guy that well. We were just co-workers. And here's what he said. On my behalf to the worker at Sears, he said, no, no, you don't understand. This guy tells the truth. He came back to work Tuesday morning, told me what happened. I said, I'll give you the receipt if you want it. He said, I don't need the receipt. He just believed me. I would have given him the receipt happily. Why? Because I wasn't lying to him. There was no reason. There was no motivation for me to lie. And so we find that here, as we think about this lying, deliberate falsehoods, a misrepresentation of the truth. Think of this in Proverbs chapter 6. We won't take time to turn there because I want to look at Acts 5. But in Proverbs chapter 6 and verses 16 through 19, God gives us things that are an abomination, things that he hates. And you know that lying falls on that list twice out of seven items. Lying is on the list twice. Listen, God is serious about telling the truth. Amen. He is the way, the truth, and the life. And so how best for us as the people of God to represent God is by speaking truth.",
      "context": "...th. Think of this in Proverbs chapter 6. We won't take time to turn there because I want to look at Acts 5. But in Proverbs chapter 6 and verses 16 through 19, God gives us things that are an abomination, t...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=1855",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "TOJWIvB7SDM",
      "timestamp": 1980.7000579833984,
      "text": "times we think about this particular section of Acts, and we think about all that's taking place, and we think about the moving of God. And, you know, the reality is that God is not working, dealing with sin in this same fashion today. But I wonder if he did, what kind of an effect it would have upon us as the people of God. In Acts 5, the Bible tells us of a particular account. It says this in verse number 1, but a certain man named Ananias with Sapphira, his wife, sold a possession and kept back part of the price. His wife also being privy to it, and brought a certain part and laid it at the apostles' feet. But Peter said, Ananias, why hath Satan filled thine heart to lie to the Holy Ghost and to keep back part of the price of the land? Notice in verse number 4, it says this, whilst it remained, was it not thine own? And after it was sold, was it not in thine own power? So you understand that it was not some requirement that was placed upon Ananias and Sapphira, that number one, they even sell the possession, but number two, after they sold the possession, there was no requirement that they give all to the church. What was it that would motivate them to say we've brought it all? Well, man, they're going to look good, aren't they? It's pride.",
      "context": "...oday. But I wonder if he did, what kind of an effect it would have upon us as the people of God. In Acts 5, the Bible tells us of a particular account. It says this in verse number 1, but a certain man name...",
      "sermon_title": "Sermon TOJWIvB7SDM",
      "url": "https://www.youtube.com/watch?v=TOJWIvB7SDM&t=1980",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 79.12000274658203,
      "text": "and each of the Gospels again in the book of Acts But you'll be mindful of the fact that he the Lord Jesus Christ He said that we have been given this duty this job to preach the gospel to every creature What a unique privilege and responsibility it is we understand that as we read through the book of Acts that we have the Privilege of being able to see the way in which the disciples obeyed the declaration that Jesus gave and how the obedience of the disciples Resulted in the gospel going far and wide and many churches being established You should read through the book of Acts. You'll find that there are two in my Estimation just just amazing statements that are made in the book of Acts from those that opposed the gospel These are not statements that were made by the leaders of the church They're not made by the Apostles or one of the disciples but we find that these are statements that are made by those that were in opposition those that were the adversaries to the gospel going forth and really the statements that are made revealed to us the obedience of the disciples and the Work of Christ as we obey God and we do what he's told us to do We see that he blesses beyond measure the first of those statements is made in Acts 5 in verse 28 when those that are",
      "context": "...t he's told us to do We see that he blesses beyond measure the first of those statements is made in Acts 5 in verse 28 when those that are",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=79",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 145.83999633789062,
      "text": "revealed to us the obedience of the disciples and the Work of Christ as we obey God and we do what he's told us to do We see that he blesses beyond measure the first of those statements is made in Acts 5 in verse 28 when those that are Opposing the work of the ministry say this ye have filled Jerusalem with your doctrine that's a good thing, isn't it and We have commanded you not to speak in his name yet. Ye have filled Jerusalem with your doctrine. Oh that it would be said of us here in northern, Virginia That we have filled this community this region of the state this part of our nation with the gospel of Jesus Christ We find that later in Acts 17 When Paul and Silas would arrive to the city of Thessalonica that those in opposition said these That have turned the world upside down Are come hither Also these that have turned the world upside down have come hither also that's Acts 17 in verse number 6 we find that The gospel is powerful we find that as you read through the journeys the missionary journeys as we'd often refer to them as in the book of Acts and you'll find how that the missionaries would arrive to a particular city a particular region you see how that the gospel preached change lives and the power of the gospel those",
      "context": "...t he's told us to do We see that he blesses beyond measure the first of those statements is made in Acts 5 in verse 28 when those that are Opposing the work of the ministry say this ye have filled Jerusalem...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=145",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}