{
  "reference": "Amos 8",
  "occurrences": [
    {
      "sermon_id": "ZWhiVzLFfxc",
      "timestamp": 0.0,
      "text": "6 this evening, Galatians chapter number 6, as we continue with this series of the danger of deception. And the reality is, it seems as if with each passing day, we are more and more convinced of that truth that I stated at the beginning of this series several weeks ago, that we are living in an age of deception. We find here in Galatians chapter number 6, the portion of Scripture that we'll look at this evening, that once again we see the verse of Scripture begin with that great statement, be not deceived. It's interesting because in the book of Amos, and if you want to turn back to the Old Testament, to the prophets there, and look at the book of Amos, and I want you to consider what is said here with regard to this prophecy that is told to us in Amos chapter number 8. And the Bible tells us here in Amos chapter number 8 that there was going to be a famine and it says this in Amos 8 and verse number 11, it's 11 and 12, Amos says this under the inspiration of God, of course, Behold, the days come, saith the Lord God, that I will send a famine in the land, not a famine of bread, nor a thirst for water. But notice what it says, but of hearing the words of the Lord. And they shall wander from sea to sea, and from the north even to the east.",
      "context": "...ible tells us here in Amos chapter number 8 that there was going to be a famine and it says this in Amos 8 and verse number 11, it's 11 and 12, Amos says this under the inspiration of God, of course, Behold...",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "ZWhiVzLFfxc",
      "timestamp": 219.22000122070312,
      "text": "States of America, there are churches that are standing and proclaiming the truth of God's word. We find that there are fewer and fewer churches, there are a number of churches that have compromised and been influenced by the culture and the society, but I am thankful for scores and scores of churches across this land that are standing faithfully preaching the word of God. The problem is in the hearing. The time will come when they will not endure sound doctrine. There are plenty of people today that are desiring to be entertained. They are not desiring to go and to hear the teaching and preaching of the word of God. They simply want to be entertained. They simply desire to check a box, if you will, that they fulfilled their spiritual obligations or duties, and it really is just no more than a nominal Christianity. It's in name only. We find that oftentimes there are people that desire the product, but they're not willing to endure through the process. And we find that no doubt as we would consider the warnings or the statements that are given and you couple those two truths together from Amos 8 and from 2 Timothy 4, and I believe as you put those two truths together that it leads to disaster. And we find that we're living in a time when we could ask ourselves this question as we",
      "context": "...onsider the warnings or the statements that are given and you couple those two truths together from Amos 8 and from 2 Timothy 4, and I believe as you put those two truths together that it leads to disaster....",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc&t=219",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "ZWhiVzLFfxc",
      "timestamp": 292.6600036621094,
      "text": "are given and you couple those two truths together from Amos 8 and from 2 Timothy 4, and I believe as you put those two truths together that it leads to disaster. And we find that we're living in a time when we could ask ourselves this question as we think about this age of deception in which we're living in and the danger of deception, we could ask ourselves this question, why does it seem so simple to deceive so many? I mean, honestly, we are living in an age of deception. We encounter people every single day that are just deceived. And we could ask ourselves, why is it that it is so simple to deceive so many people? I believe that the answer lies in these two verses or these two passages that we've discussed here by way of introduction, and that is because truth has been rejected. There's a society that we're living in that has denied the existence of absolute truth. They would seem to float the idea or to promote the concept that truth is relative, that there's your truth and there's their truth and there's my truth and so on and so forth, but the fact of the matter is that there is absolute truth and that is found in the Word of God. But when truth is rejected and when error is… when truth is rejected, then deception",
      "context": "are given and you couple those two truths together from Amos 8 and from 2 Timothy 4, and I believe as you put those two truths together that it leads to disaster....",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc&t=292",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}