{
  "reference": "Daniel 3",
  "occurrences": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 147.1199951171875,
      "text": "we find that each generation is going to face such circumstances. The believers that Paul is referencing and ministering to in Ephesus, they had their own set of circumstances that they faced, and they had to stand in the power of God, and they had to be willing to yield themselves to God. They had to be willing to walk in the Spirit so that they would not fulfill the lust of the flesh, and we find that for the passage of Scripture that we're going to look at this morning in Daniel 3, we find that these three Hebrew children that we often are familiar with, Shadrach, Meshach, and Abednego, these fellas, they faced unique circumstances with regard to the pressures of their day, and we find that they were willing to stand. If you've already looked at the bulletin on the back, the title for the message this morning is really a question, and the question is this, are you willing to stand? Am I willing to stand? Again, each generation is going to have its opportunity to face the pressures and the ideologies that exist within that particular society and culture, and the question is whether or not the people of God will stand. We find that as we look at a passage like Daniel 3, we rejoice greatly in understanding what takes place, and we're familiar with the passage of Scripture, and we say, man, this is wonderful, look at how God worked,",
      "context": "...he flesh, and we find that for the passage of Scripture that we're going to look at this morning in Daniel 3, we find that these three Hebrew children that we often are familiar with, Shadrach, Meshach, and A...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=147",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 215.75999450683594,
      "text": "is whether or not the people of God will stand. We find that as we look at a passage like Daniel 3, we rejoice greatly in understanding what takes place, and we're familiar with the passage of Scripture, and we say, man, this is wonderful, look at how God worked, look at what God did, but it's because there were some people of God that stood, that were willing to take a stand no matter what the pressures were, no matter what the consequences were that they would face, they were willing to take a stand, and the question is we look through history, not only biblical history, but we look at modern history and look at the church history through the ages, and you can find individuals and groups of people that stood for truth, and I wonder this morning, I wonder in our generation who among us would be written about that we were willing to stand, that we might encourage a future generation in like fashion as we have been encouraged by those who have gone before us that were willing to take a stand. As we notice in our passage of Scripture here in Daniel 3, let me just read some verses, we'll get into the message. I'm gonna try to look at all 30 verses, and notice in verse number one the Bible says this, Nebuchadnezzar the king made an image of gold whose",
      "context": "is whether or not the people of God will stand. We find that as we look at a passage like Daniel 3, we rejoice greatly in understanding what takes place, and we're familiar with the passage of Scrip...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=215",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 283.3599853515625,
      "text": "we notice in our passage of Scripture here in Daniel 3, let me just read some verses, we'll get into the message. I'm gonna try to look at all 30 verses, and notice in verse number one the Bible says this, Nebuchadnezzar the king made an image of gold whose height was three square cubits and the breadth thereof six cubits. He set it up in the plain of Dura in the province of Babylon. We understand that Nebuchadnezzar is the king of the Babylonian Empire, we understand that he has great power, we find that as you look at the history with regard to this kingdom and you'd understand the power in which this man had when he's going to put up this image of gold, this 90-foot image, and he's going to give some requirements that we'll look at in just a few moments, you understand that he had power to make happen what he said would happen. And as we look at the passage of Scripture and we consider the question, are you willing to stand? I want us to consider a few things. Number one, consider with me the circumstances these men faced. Consider the circumstances they faced. Now admittedly, right from the beginning this morning, we understand that the circumstances that are faced in Daniel 3 are different than the circumstances that you will face, they're different than the circumstances that I will face, they're different than the circumstances",
      "context": "we notice in our passage of Scripture here in Daniel 3, let me just read some verses, we'll get into the message. I'm gonna try to look at all 30 verses, ...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=283",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 346.0,
      "text": "these men faced. Consider the circumstances they faced. Now admittedly, right from the beginning this morning, we understand that the circumstances that are faced in Daniel 3 are different than the circumstances that you will face, they're different than the circumstances that I will face, they're different than the circumstances that Paul faced and the believers in Ephesus faced, but each generation is going to have a set of circumstances, some ideologies that are in opposition to God's Word that we're gonna face. And here in Daniel 3, we find as we've read in verse number one that this golden image is set up and in verse 2 it says then Nebuchadnezzar the king sent to gather together, notice, the princes, the governors, and the captains, the judges, the treasurers, the counselors, the sheriffs, and all the rulers of the provinces to come. For what? They were gonna have this dedication, it says, to come to the dedication of the image which Nebuchadnezzar the king had set up. Then, in response to this edict, if you will, that was made, it says the princes, the governors, and captains, the judges, the treasurers, the counselors, the sheriffs, and all the rulers of the provinces were gathered together under the dedication of the image that Nebuchadnezzar the king had set up. And they stood before the image that Nebuchadnezzar had set up. Then, and Harold cried aloud, to you, notice, it is",
      "context": "...edly, right from the beginning this morning, we understand that the circumstances that are faced in Daniel 3 are different than the circumstances that you will face, they're different than the circumstances t...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=346",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2105.02001953125,
      "text": "that are sweeter than you've ever enjoyed any time before. I think about Paul and Silas when they were in prison. They were cast into the prison fast, locked away. But man, they were singing, were they not? Singing to God, they were having communion with God. See, this morning, I believe that we better prepare to stand. And I believe that as I look at a passage like Daniel 3, that I'm encouraged. This is an encouraging passage of Scripture. It's exciting. To read the account, this isn't some fairy tale. This is God's Word. This happened. And not only does it encourage us, I believe it should challenge us. Because am I willing to stand? Are you willing to stand? I mean, when the stakes are like they were for these three, are we willing to stand? In closing, I want you to consider some consequences of their stand. I want you to consider with me a few things as we look at the remainder of the passage. I want you to, just for a moment, consider how this experience impacted their own lives. Can you imagine? Listen, when you see God work, when you see God do something miraculous, it has an impact in your life. Do you think that these men talked about this experience? I mean, I do. I don't have any Bible to prove it to you. But I see these guys talking about",
      "context": "... morning, I believe that we better prepare to stand. And I believe that as I look at a passage like Daniel 3, that I'm encouraged. This is an encouraging passage of Scripture. It's exciting. To read the accou...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2105",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2758.3600463867188,
      "text": "gonna stand before him. So are you. The question, however, as we think about this event, we think about the title of the message this morning, are you willing to stand? Am I willing to stand? Can I fill you in? It's easy to stand in here. It is. You take a stand in here, man, we cheer you on. Amen! But we got to be willing to stand out there. Out there. In a lost and dying world, they need to see that our God is real. It's not just a theory. You know, they don't think much of our God. They really don't. They curse him. They hold their fist against him. They need to see that our God is real. Do you believe this morning that God is still able to work? I don't know that there's gonna be a burning fiery furnace. Again, the circumstances, the pressures are different for every generation, but we're facing some pressures today, and there's a movement today to cause you and to cause me to bow, to conform, to we can't talk about this, we can't talk about that, we can't go there, we can't go here. And they want a silence. They want us to be ashamed. I've said that a couple of times the last few weeks because of our theme for our missions conference. I am not ashamed. And this morning, are we willing to stand? Are we willing to stand? I'm encouraged by Daniel 3, but",
      "context": "... not ashamed. And this morning, are we willing to stand? Are we willing to stand? I'm encouraged by Daniel 3, but",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2758",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2843.2400512695312,
      "text": "a silence. They want us to be ashamed. I've said that a couple of times the last few weeks because of our theme for our missions conference. I am not ashamed. And this morning, are we willing to stand? Are we willing to stand? I'm encouraged by Daniel 3, but really more than being encouraged, I'm challenged. Because I look at these three guys, they didn't have all that we have. We got the whole book, but they had a real close walk with God that caused them to have some some strength and some resolve spiritually to say, I understand the stakes. I heard the command. Yes, I heard the music, but I'm not gonna bow. It's not gonna do it. Are you willing to stand? Let's pray. Father, we love you. We thank you for loving us. Thank you for your Word. I thank you how that we can go to your Word and be encouraged, and at the same time be challenged. I thank you for the challenge that Paul gives the believers in Ephesus, and how that we can look at this event that happened 2,600 years ago, and see some men that stood. We understand and acknowledge readily this morning that we're facing pressures in our society, in our culture, to bow and to conform to the ideologies. God, I pray that you would help us to walk in",
      "context": "... not ashamed. And this morning, are we willing to stand? Are we willing to stand? I'm encouraged by Daniel 3, but really more than being encouraged, I'm challenged. Because I look at these three guys, they di...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2843",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}