{
  "reference": "Deuteronomy 11",
  "occurrences": [
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 0.0,
      "text": "said, I will never leave thee nor forsake thee, so that we may boldly say, the Lord is my helper, and I will not fear what man shall do unto me. When I know what God says, it enables me to boldly say, the Lord is my helper, I shall not fear what man shall do unto me. That was free tonight, amen? Deuteronomy chapter number 11, and we'll be looking here at the first 17 verses of Deuteronomy 11. Of course, last week, as you know, we started a mini-series that I entitled, The Danger of Deception. I am thoroughly convinced that we are currently living in an age of deception. I believe that as we look around our world, that it is not too difficult for any of us to recognize that we are living in an age of deception. In fact, as we study the Word of God, we find that our God has graciously warned us about the reality of deception. He told us that it was going to be the case. Not only did He warn us about the deception that we would face, but I am very thankful that He has given us the truth of His Word, He has provided us with the remedy for deception. What a blessing to know and to have the Word of God and to know the truth. What a blessing. We will recall that as we began our series last Wednesday evening, that I mentioned to",
      "context": "...e tonight, amen? Deuteronomy chapter number 11, and we'll be looking here at the first 17 verses of Deuteronomy 11. Of course, last week, as you know, we started a mini-series that I entitled, The Danger of Decepti...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 501.760009765625,
      "text": "happened to the children of Israel? Their heart was deceived and they followed idols. It says in verse number 17, and then the Lord's wrath be kindled against you and He shut up the heaven that there be no rain and that the land yield not her fruit and lest ye perish quickly from off the good land which the Lord giveth you. Focus our attention on verse number 16. It's interesting to me as we look at the context of Deuteronomy 11 and we understand the place of the warning. It's in the time of the blessing of God and a time in which God is doing what He said that He would do and He says, take heed to yourselves that your heart be not deceived. The heart we find as we look throughout the Word of God, God's Word says much to us about the heart and we can look at a number of passages. We will not have time this evening to do that, but we find the Bible talks about a hard heart, a proud heart, a pure heart, an understanding heart, just to mention a few. And there are many references to the heart. It's been defined as the seat of the affections and passions, the seat of the understanding, the seat of the will. You'll be mindful that it was God in Genesis chapter number 6, you don't need to turn there,",
      "context": "...th you. Focus our attention on verse number 16. It's interesting to me as we look at the context of Deuteronomy 11 and we understand the place of the warning. It's in the time of the blessing of God and a time in w...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=501",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 566.239990234375,
      "text": "mention a few. And there are many references to the heart. It's been defined as the seat of the affections and passions, the seat of the understanding, the seat of the will. You'll be mindful that it was God in Genesis chapter number 6, you don't need to turn there, but He's speaking to Noah and talking about the judgment that would come with regard to the wickedness God saw in verse number 5 of Genesis 6, that the wickedness of man was great in the earth and that every imagination of the thoughts of his heart was only evil continually. We think about this warning in Deuteronomy 11 and really we couple it with what Jeremiah proclaims in Jeremiah 17 in verse number 9 when he says, The heart is deceitful above all things, and desperately wicked. Who can know it? The answer is given in v. 10 of Jeremiah 17. I, the Lord, search the heart. I try the rains, even to give every man according to his ways and according to the fruit of his doing. But in the idea this evening that your heart be not deceived, we recognize that God is telling His people and telling us through preservation that the heart is deceitful above all things, and desperately wicked. Who can know it? He says that your heart be not deceived. It's interesting back in Deuteronomy 11 in v. 16 when He says that your heart be not deceived,",
      "context": "... imagination of the thoughts of his heart was only evil continually. We think about this warning in Deuteronomy 11 and really we couple it with what Jeremiah proclaims in Jeremiah 17 in verse number 9 when he says,...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=566",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 647.6199836730957,
      "text": "is telling His people and telling us through preservation that the heart is deceitful above all things, and desperately wicked. Who can know it? He says that your heart be not deceived. It's interesting back in Deuteronomy 11 in v. 16 when He says that your heart be not deceived, the Hebrew word there that is translated deceived, it carries with it the idea of being simple, naïve, gullible. But this is the one that hit me the most. Open-minded. Open-minded. Why does it hit me the most? Well, because how often do we hear people today say, you just need to be open-minded? Right? We hear it all the time. We hear people say, oh, you just need to broaden your horizon. You just need to be more open-minded and you need to be more inclusive and so on and so forth. You need to be open-minded. And when they use that phraseology, oftentimes what they'll do is they'll say, you are just narrow-minded. That's the opposite of being open-minded is being narrow-minded. And we've been accused of being narrow-minded. And often I've said I can only be as wide as my Bible is. Amen? And we're going to be as narrow as the Word of God is. Why? As a preacher from yesteryear said, never, or let me put it this way, this is how he said it, where God puts a period, don't put a question mark. What's he saying? Just trust God's Word. It's not necessary.",
      "context": "...perately wicked. Who can know it? He says that your heart be not deceived. It's interesting back in Deuteronomy 11 in v. 16 when He says that your heart be not deceived, the Hebrew word there that is translated dec...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=647",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 803.1399841308594,
      "text": "to be open-minded. You need to consider other ways of thinking. You need to understand and consider other perspectives. Why would I leave the truth for something that's less than truth? It doesn't really make sense, does it? And so if God has given us the truth, and He has, and we hold the Scriptures in our hands, and we have the truth, I don't need to be open-minded to all of the new ideas and all of the ideas that our world would have. No, I need to have the mind of Christ. Amen? Here's what Paul says in the book of Philippians. He says, let this mind be in you, which was also in Christ Jesus, in Philippians 2, in verse number five. And we find it in the book of 1 Corinthians. He talks about that we have the mind of Christ. To know God is to know His word. And we understand that God has given. In fact, throughout the chapter of Deuteronomy 11, as we've read through these first 17 verses, we see that there are many references to the importance of keeping the commandments and following the commandments. In verses 18, 19, and 20, I will not have time to read those verses, but it's very similar to the text of Scripture that I preached on Sunday morning from Deuteronomy chapter number six. The importance of the commands of the Lord and His statutes and His judgments. And we find that here,",
      "context": "...w God is to know His word. And we understand that God has given. In fact, throughout the chapter of Deuteronomy 11, as we've read through these first 17 verses, we see that there are many references to the importan...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=803",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 948.6199951171875,
      "text": "went to burn incense and to serve other gods whom they knew not, neither they, ye, nor your fathers. Howbeit, I sent unto you all My servants, the prophets, rising early, and sending them, saying, O, do not this abominable thing that I hate. Isn't God so gracious in longsuffering? They forsook the Lord. They forgot the Lord. They followed after idols. But God in His grace and His mercy and His longsuffering, He sent prophets, and He sent those prophets faithfully. Jeremiah, one of them. But notice what it says in verse number eight, But they hearkened not, or inclined their ear to turn from their wickedness to burn no incense unto other gods. Wherefore, My fury and Mine anger was poured forth and was kindled in the cities of Judah and in the streets of Jerusalem, and they are wasted and desolate as at this day. What did God say back in Deuteronomy 11? He said that if you had a deceived heart and you followed after other gods, that He would withhold the rain. Remember, He said, if you obey Me, if you keep these commandments, I'm gonna send the rain, the former and the latter rain. I'm gonna bless and I'm gonna, God controls, listen, there's no mother nature. It's God that's controlling, amen. He is the creator and the sustainer of all things. And we find here that as you skip down and look at verse number 16, if you will,",
      "context": "...the streets of Jerusalem, and they are wasted and desolate as at this day. What did God say back in Deuteronomy 11? He said that if you had a deceived heart and you followed after other gods, that He would withhold...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=948",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 1088.2999877929688,
      "text": "do whatsoever thing goeth forth out of our own mouth to burn incense unto the queen of heaven, and to pour out drink offerings unto her, as we have done, we and our fathers, our kings and our princes, in the cities of Judah and in the streets of Jerusalem. For then had we plenty of vittles, and were well, and saw no evil. God's grace and God's mercy and God's long-suffering was misinterpreted by the people of God as being God's approval, that God was okay with their behavior, because God didn't immediately judge them. They thought, man, when we were serving these idols and pouring these things out to the queen of heaven, we had plenty. We didn't have all these problems. We have the problems that you're dealing with now because God's judgment came. And instead of them turning to God, they said, you know what? We're just gonna keep on doing what we did before. Man, that's terrible. And God tells us in Deuteronomy 11, take heed, and here's what he says, take heed that your heart be not deceived. How many times have you heard somebody say, I mentioned about hearing people say all the time in the culture and the society in which we're living that we need to be open-minded and we've dealt with that, but I want you to consider this. How many times do you hear people say, follow your heart? You've heard people say that?",
      "context": "... what? We're just gonna keep on doing what we did before. Man, that's terrible. And God tells us in Deuteronomy 11, take heed, and here's what he says, take heed that your heart be not deceived. How many times have...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=1088",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 1235.3599548339844,
      "text": "putteth his trust in the Lord shall be made fat. Continue, verse 26. He that trusteth in his own heart is a fool. Is that what your Bible says? I'm not making it up, amen? That's what the Word of God says. But whoso walketh wisely, he shall be delivered. Do you see the contrast in verses 25 and 26 between the one that puts his trust in the Lord versus the one that's trusting in his own heart? Your heart and my heart can deceive us. It's not about me following my heart. It's about me following the Lord. We sang tonight about following the Lord. Anywhere with Jesus, I can go, right? As I follow him. And we find here that we trust in him, and as we put our trust in the Lord, it says that he shall be made fat, but if we trust in our own heart, we're a fool. Why does he say that? Because the heart is deceitful. And he gives the warning to his people in Deuteronomy 11, preserved for us, take heed that your heart be not deceived. You say, oh man, my heart's not going to be deceived. I can trust my heart. First Corinthians 11 says, let he that thinketh he stand, take heed lest he fall, amen? I think it's verse 12 in First Corinthians 11, verse 12. And so the reality is that we must take heed to the warning that God gives us.",
      "context": "...ol. Why does he say that? Because the heart is deceitful. And he gives the warning to his people in Deuteronomy 11, preserved for us, take heed that your heart be not deceived. You say, oh man, my heart's not going...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=1235",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 1090.8000183105469,
      "text": "understanding or definition or description of a blessing may differ from what God would look at as being a blessing. There are times when God says no, and I would submit to you this evening that that's a blessing. We say, no, I want God to say yes. Sometimes God says no, and that's a blessing, and we need to thank God for it, and we think about the trials and difficulties and how God is growing us and developing us, and we find the blessings that God had bestowed upon Abraham. As we look at the Word of God, I want you to consider this truth that Moses gives us in Deuteronomy. Turn to the 11th chapter, if you will. We'll be back to Genesis here in just a moment, but I want you to think about this when the Bible tells us that God blessed him, and we understand the content of what God is telling us, and really the summary of the life of Abraham, and to think about the blessing of God upon him that the Lord had blessed Abraham in all things, and we find that in Deuteronomy chapter 11, and this is a biblical principle that we find throughout the Word of God. I want you to notice, begin looking with me in verse number 26 of Deuteronomy 11. The Bible says this, \"'Behold, I set before you this day a blessing and a curse.'\"",
      "context": "... find throughout the Word of God. I want you to notice, begin looking with me in verse number 26 of Deuteronomy 11. The Bible says this, \"'Behold, I set before you this day a blessing and a curse.'\"",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=1090",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 1155.6000366210938,
      "text": "in Deuteronomy chapter 11, and this is a biblical principle that we find throughout the Word of God. I want you to notice, begin looking with me in verse number 26 of Deuteronomy 11. The Bible says this, \"'Behold, I set before you this day a blessing and a curse.'\" That sounds like a pretty good deal. There's a blessing and a curse, and so I want the blessing, right? If we took and pretended this evening, used our sanctified imaginations to say that there were two lines and a header over the door where the line would be formed, and the description of that particular door, one says, \"'Blessing, enter here,' and the other says, \"'Cursing, enter here.'\" You'd be crazy to get in the line that said, \"'Cursing.'\" Right? Somebody thinks something's wrong with you. You say, but this line is shorter. There's a reason it's shorter, amen? And you get in the line that says, \"'Blessing.'\" You say, yeah, that's what I'm signing up for. I desire God's blessing upon my life. Do you desire the blessing of God upon your life? Sure you do. The favor of God, the blessing of God, knowing that all that God gives us is for our good and for his glory, amen? And we say, God, I want your blessing, I want your favor upon my life. But as we know that as Moses is giving this instruction to the children of Israel, and he's saying to them as",
      "context": "... find throughout the Word of God. I want you to notice, begin looking with me in verse number 26 of Deuteronomy 11. The Bible says this, \"'Behold, I set before you this day a blessing and a curse.'\" That sounds lik...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=1155",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 2256.800048828125,
      "text": "me. It has. Amen? If you'd be honest, I hope that you could say it's preserved you. Because that's what the Word of God says. If you hear it and you keep it, it shall preserve thee. It's going to keep us, it's going to protect us and guard us. Number two, what is the result that we see? In verse 8 and 9, notice it says, Exalt her and she shall promote thee. She shall bring thee to honor when thou dost embrace her. She shall give to thine head an ornament of grace, a crown of glory shall she deliver to thee. I see here in verses 8 and 9 that wisdom shall promote thee. And really in my mind's eye, I see the truth of blessings. You know what, and we're going to look at the passage, Lord willing we'll have time. In Deuteronomy, actually we won't look in there, we'll skip that, I don't have time. But in Deuteronomy 11, let me just give you what it says. This day what I do, I lay before you a blessing and a curse. Right? Is that what the Bible says? Those of you that are familiar with Deuteronomy 11, it's what it says. A blessing if you obey. A curse if you disobey. I mean, it's pretty straightforward, right? And so guess what? God has attached in His Word blessings to obedience. It's just the truth. Why is it that we have the blessing,",
      "context": "...e time. In Deuteronomy, actually we won't look in there, we'll skip that, I don't have time. But in Deuteronomy 11, let me just give you what it says. This day what I do, I lay before you a blessing and a curse. Ri...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=2256",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 2326.2000122070312,
      "text": "are familiar with Deuteronomy 11, it's what it says. A blessing if you obey. A curse if you disobey. I mean, it's pretty straightforward, right? And so guess what? God has attached in His Word blessings to obedience. It's just the truth. Why is it that we have the blessing, the certainty of heaven? Because we obeyed the Gospel. Amen? We heard the Gospel, we believed it, we accept that Christ is our Savior. Because Jesus Christ died on the cross for us, He was buried, He rose in victory, and we understood that truth and it was delivered to us, and we obeyed the truth of the Word of God. We obeyed the Gospel. But throughout our lives, we think about when we exalt wisdom, when we are hearing and doing and following the instruction or understanding that God has given us the written Word of God, He's given us the living Word of God, that the blessings are going to come. This evening when we deal with the subject matter in which we're going to deal with, we'll see it particularly in the passage that we'll be dealing with tonight. Number three, notice in verse 10, \"'Hear, O my son, and receive my sayings, and the years of thy life shall be many.'\" The Bible says the way of the transgressor is hard. We find that as we look at this, and we understand the longevity, length of, and quality of life.",
      "context": "are familiar with Deuteronomy 11, it's what it says. A blessing if you obey. A curse if you disobey. I mean, it's pretty straightfor...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=2326",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "We8921d40Z4",
      "timestamp": 1299.7000045776367,
      "text": "believe that it's clear the choice that God would want his children to make. I believe that it's clear that Paul made it abundantly clear of the choice that he, as a spiritual leader, would like for these readers, these recipients of this letter, the choice for them to make. But at the end of the day, God's given us a free will, and the choice is yours. You know what Moses, God, says to the people in Moses writes? He says, you're going to make a choice. Deuteronomy 11. I set before you a blessing and a curse. Is that not what God said in Deuteronomy 11? We read it, we see it, we understand it. What about Joshua, in Joshua chapter 24? Choose you this day whom ye will serve. Is that not what it says? But as for me and my house, we will serve the Lord. See, Joshua said, I've made a choice, but I can't make the choice for you. I'm going to make the choice, and I'm going to lay out the reason that you ought to make the same choice that I'm making, and I believe if you read Joshua 24, that's clear, that Joshua says, look, let me help you understand why you should make the same choice that I'm making. You know what all the people said? We're going to serve God. You read it, that's what they say. We're going to serve God.",
      "context": "...u know what Moses, God, says to the people in Moses writes? He says, you're going to make a choice. Deuteronomy 11. I set before you a blessing and a curse. Is that not what God said in Deuteronomy 11? We read it, ...",
      "sermon_title": "Sermon We8921d40Z4",
      "url": "https://www.youtube.com/watch?v=We8921d40Z4&t=1299",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}