{
  "reference": "Deuteronomy 1",
  "occurrences": [
    {
      "sermon_id": "i0tgIGEcUCc",
      "timestamp": 0.0,
      "text": "Acts 27, Acts chapter number 27, and as you're turning there, I'm going to read a verse from the book of Deuteronomy. We'll reference some other things in the Old Testament as we go through the message this evening, but I'd like for you to be there in Acts chapter number 27, and I'm so thankful for the Word of God and for the way in which it's changed my life, and I know that you too could testify of the change that God has made in your life using His Word. I want to read this verse as kind of a springboard into the message this evening from Acts 27. The book of Deuteronomy is recording, rehearsing some of the history of the children of Israel, and here's what is said in Deuteronomy 1 and verse number 32, yet in this thing ye did not believe the Lord your God. Yet in this thing ye did not believe the Lord your God. I hope that it would never be said of us, individually or corporately, that we did not believe God. Amen? I wouldn't want it to be said of me personally. I wouldn't want it to be said of our family. I wouldn't want it to be said of our church that we did not believe God. Amen? I'd much rather be known for believing God, trusting God, exercising faith in God. Hebrews 11 reminds us that without faith, it is impossible to please Him, for he that",
      "context": "... is recording, rehearsing some of the history of the children of Israel, and here's what is said in Deuteronomy 1 and verse number 32, yet in this thing ye did not believe the Lord your God. Yet in this thing ye d...",
      "sermon_title": "Sermon i0tgIGEcUCc",
      "url": "https://www.youtube.com/watch?v=i0tgIGEcUCc&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "i0tgIGEcUCc",
      "timestamp": 468.4599914550781,
      "text": "was going to believe someone. The reality is that the information that this man, this centurion received, was conflicting information. He had Paul on one hand saying, it's not safe for us to depart, it's not safe for us to sail, it's dangerous, it's going to be wrought with danger. And not only of the lading of the ship, but also of our lives. And on the other hand, you have the master and owner of the ship saying, let's go. You have the more part, as it says in verse number 12, you know what that means when it says the more part advised, it means the majority. The majority. They say, no, no, it's good, it's fine, we're going to be able to make it. The Bible says that the centurion, he is given this conflicting information, but he's got to believe someone. And who does he believe? He goes with the majority. He goes with the more part. He goes with the owner and master of the ship, and they set sail. As we go through the passage of Scripture this evening, we'll find that it was actually a very poor decision on the part of this centurion. But I want you to notice this evening that everyone believes someone. Including you. Including me. You know that God wants you to believe Him. God wants us to believe Him. Do you think, as I read that verse of Scripture in Deuteronomy 1 and verse number 32, when",
      "context": "...you to believe Him. God wants us to believe Him. Do you think, as I read that verse of Scripture in Deuteronomy 1 and verse number 32, when",
      "sermon_title": "Sermon i0tgIGEcUCc",
      "url": "https://www.youtube.com/watch?v=i0tgIGEcUCc&t=468",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "i0tgIGEcUCc",
      "timestamp": 542.2999877929688,
      "text": "centurion. But I want you to notice this evening that everyone believes someone. Including you. Including me. You know that God wants you to believe Him. God wants us to believe Him. Do you think, as I read that verse of Scripture in Deuteronomy 1 and verse number 32, when it says that they did not believe God, do you think that's what God wanted? Well, no. They absolutely, God absolutely wanted those people to believe Him. This is really what Deuteronomy 1 is speaking of when you think about the children of Israel and you think about their journey and all that had taken place. I'm mindful of what the Word of God says in Numbers 14. In Numbers chapter number 13, the Bible gives us the record of the spies going to spy out the land. And we find that in chapter number 13, the spies are selected and they're given their instruction as with regard to what their task is. We find that they depart and they go into the land as they had been instructed to do so. And they come back and we, several times this week, we were singing the song, 12 men went to spy on Canaan. And we're familiar with the text of Scripture and we know that the Bible teaches us that there were 10 that came back with an evil report. They did not believe God. They did not believe that they were able",
      "context": "...you to believe Him. God wants us to believe Him. Do you think, as I read that verse of Scripture in Deuteronomy 1 and verse number 32, when it says that they did not believe God, do you think that's what God wante...",
      "sermon_title": "Sermon i0tgIGEcUCc",
      "url": "https://www.youtube.com/watch?v=i0tgIGEcUCc&t=542",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}