{
  "reference": "Deuteronomy 5",
  "occurrences": [
    {
      "sermon_id": "MD6v9zE8L4E",
      "timestamp": 297.0799865722656,
      "text": "did, he fulfilled his responsibility in giving the message to the people that he was called the minister to. We find that God had given him the responsibility of delivering this message of honor thy father, honor thy mother. We find that it's first given in the book of Exodus during the 10 commandments in Exodus 20 in verse number 12. Again, we find in the book of Deuteronomy, now understanding the times of the Old Testament and understanding the audience, if you will, right after the Egyptian bondage, the Exodus, as we read of in the book of Exodus, obviously we understand that after that great deliverance, God was moving and working and gave the 10 commandments. And then there was a matter of disobedience on the part of the children of Israel, and they did not enter into the land for fear of the inhabitants of the land. They did not trust the Lord. And so there were 40 years of wanderings, and we find that after that generation died that would not be permitted to enter in, that now Moses is called to instruct the group of people that would enter into the land. And as you read the book of Deuteronomy, you find that it's in that book that now Moses is addressing this group of people that would actually enter into the land of promise. They would inherit that land, inhabit that land. And we find that in Deuteronomy 5 in verse number 16,",
      "context": "...nter into the land of promise. They would inherit that land, inhabit that land. And we find that in Deuteronomy 5 in verse number 16,",
      "sermon_title": "\"Honor Thy Mother\" Ephesians 6:1-3",
      "url": "https://www.youtube.com/watch?v=MD6v9zE8L4E&t=297",
      "channel": "Unknown",
      "publish_date": 20240513
    },
    {
      "sermon_id": "MD6v9zE8L4E",
      "timestamp": 363.44000244140625,
      "text": "you read the book of Deuteronomy, you find that it's in that book that now Moses is addressing this group of people that would actually enter into the land of promise. They would inherit that land, inhabit that land. And we find that in Deuteronomy 5 in verse number 16, this same truth is given once again. So we find in Exodus 20, we find again in Deuteronomy 5, and then we find in the gospel records, if you were to read through the gospels, that Jesus Christ himself, God in flesh, he speaks these words, honor thy father and thy mother. Now we find in the text that we're looking at this evening in the book of Ephesians, the apostle Paul writing to this church, this church in Ephesus, this important instruction. See, we sang tonight, oh Lord, send a revival and let it begin in me. Is that what the song said? That's what the songwriter said. And we find that there's definitely biblical truth to that with regard to the individual. And see, if our land, if our church is ever gonna have revival, it begins with individuals having revival. And then we find that there's revival in the home. And what a blessing to think about this portion of scripture. We're not studying through all of it, beginning in chapter five, verse 18, through chapter six, verse number three, but we find that there's the possibility to have revival in our homes.",
      "context": "...nter into the land of promise. They would inherit that land, inhabit that land. And we find that in Deuteronomy 5 in verse number 16, this same truth is given once again. So we find in Exodus 20, we find again in ...",
      "sermon_title": "\"Honor Thy Mother\" Ephesians 6:1-3",
      "url": "https://www.youtube.com/watch?v=MD6v9zE8L4E&t=363",
      "channel": "Unknown",
      "publish_date": 20240513
    },
    {
      "sermon_id": "MD6v9zE8L4E",
      "timestamp": 934.8800048828125,
      "text": "A way in which a child can honor their mother is to walk in wisdom, to not forsake the instruction, to walk in wisdom, to apply the principles in their lives, to honor their mother. We see that there's a principle to obey, but there's also a promise to receive. If you note the truth back in Ephesians chapter 6 and verse number 2, the Bible tells us to honor thy father and mother, but then there's that parenthetical statement where the Bible says which is the first commandment with promise. If you were to go back to Exodus 20 and again to Deuteronomy 5, you'll find exactly what the Apostle Paul says here in verse number 3 with regard to the promise to receive. When we honor our father and mother, when we honor our parents, notice this promise that is given, a two-fold promise that says, number one, in verse number 3, that it may be well with thee. Then it says this, and that thou mayest live long on the earth. The first commandment with promise, in Exodus chapter 20 and verse number 12, when Moses gives the first reference of this command, this instruction, it says that thy days may be long upon the land which the Lord thy God giveth thee. In Deuteronomy 5 it says that thy days may be prolonged and that it may go well with thee.",
      "context": "... says which is the first commandment with promise. If you were to go back to Exodus 20 and again to Deuteronomy 5, you'll find exactly what the Apostle Paul says here in verse number 3 with regard to the promise t...",
      "sermon_title": "\"Honor Thy Mother\" Ephesians 6:1-3",
      "url": "https://www.youtube.com/watch?v=MD6v9zE8L4E&t=934",
      "channel": "Unknown",
      "publish_date": 20240513
    },
    {
      "sermon_id": "MD6v9zE8L4E",
      "timestamp": 1003.2799987792969,
      "text": "number 12, when Moses gives the first reference of this command, this instruction, it says that thy days may be long upon the land which the Lord thy God giveth thee. In Deuteronomy 5 it says that thy days may be prolonged and that it may go well with thee. You know, the reality is that God, as we as children, as you look here at this, children obey your parents and the Lord for this is right, honor thy father and mother, which is the first commandment with promise, that as children obey and honor their parents, they're obeying and honoring the Lord, and the Lord blesses that. The Lord blesses obedience, it's a principle that we find throughout the whole of Scripture. As we walk in obedience, God blesses. And he says that it may be well with thee and thou mayest live long on the earth. What great promises. You think about the way that God references this, the first commandment with promise, the promise that is directly attached to the commandment. What we do with the commandment depends on, or what we do with the commandment dictates the promise that is received. And so we find that here, even in Ephesians chapter number six, Paul reiterates this biblical truth from the Old Testament. As we think about the simple thoughts of these verses of Scripture, it's important this evening that we not simply deal with a principle and a promise, but number three this evening,",
      "context": "...instruction, it says that thy days may be long upon the land which the Lord thy God giveth thee. In Deuteronomy 5 it says that thy days may be prolonged and that it may go well with thee. You know, the reality is ...",
      "sermon_title": "\"Honor Thy Mother\" Ephesians 6:1-3",
      "url": "https://www.youtube.com/watch?v=MD6v9zE8L4E&t=1003",
      "channel": "Unknown",
      "publish_date": 20240513
    }
  ]
}