{
  "reference": "Deuteronomy 19",
  "occurrences": [
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 1090.2600402832031,
      "text": "Jesus is saying. Jesus is not saying, I haven't told you the truth. He's saying, you aren't receiving what I've told you, and so I'm gonna give you more witness. I'm gonna give you more evidence of the truth that I've revealed to you. Notice in verse number 32, there is another that beareth witness of me, and I know that the witness which he witnesses of me is true. Now, it says he's gonna start talking about John, and I want you to be mindful of this, and I'm gonna stop right in the middle of the passage in order to read two Old Testament verses of Scripture, because I think it's important to know, as Jesus is dealing with these religious leaders, these Jews that would have been familiar with the Old Testament, he is going to provide them with, as we think about the clear teaching of Scripture, he's gonna provide them, number one, with a three-fold witness. And that's significant, because in Deuteronomy chapter number 19, as they're preparing to enter into the land, and the law is being given really a second time here in the book of Deuteronomy, in Deuteronomy 19 and verse number 15, I want you to notice what the Word of God says with regard to witnesses. The Bible says this in Deuteronomy 19 and verse number 15, one witness shall not rise up against a man",
      "context": "... into the land, and the law is being given really a second time here in the book of Deuteronomy, in Deuteronomy 19 and verse number 15, I want you to notice what the Word of God says with regard to witnesses. The B...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=1090",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 1152.3400268554688,
      "text": "second time here in the book of Deuteronomy, in Deuteronomy 19 and verse number 15, I want you to notice what the Word of God says with regard to witnesses. The Bible says this in Deuteronomy 19 and verse number 15, one witness shall not rise up against a man for any iniquity or for any sin, and any sin that he sinneth. At the mouth of two witnesses, or at the mouth of three witnesses, shall the matter be established. Okay, now we keep that in mind, look at the book of Ecclesiastes, if you will, look at the book of Ecclesiastes, and I want you to notice in Ecclesiastes chapter number four, Ecclesiastes chapter number four and verse number 12, and if one prevail against him, two shall withstand him. Notice, a threefold cord is not quickly broken. As we come to John 5, Jesus is going to provide these Jewish people with a three-fold witness. He says, listen, you won't listen to my witness. You're claiming that my witness isn't true, so I'm going to give you first the witness of John. Specifically, John the Baptist, not the Apostle John. John the Baptist. Notice in verse 32, back in John 5, there is another that beareth witness of me, and I know that the witness which he witnesseth of me is true. Ye sent unto John, and he beareth witness unto the truth. But I receive not testimony from man,",
      "context": "second time here in the book of Deuteronomy, in Deuteronomy 19 and verse number 15, I want you to notice what the Word of God says with regard to witnesses. The B...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=1152",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}