{
  "reference": "Deuteronomy 21",
  "occurrences": [
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 952.6599731445312,
      "text": "understand we won't go through all of it, but we come to the point where all of the brothers are now there. And the Bible tells us that here in this text of scripture that he, Joseph, he's not yet made himself known. He doesn't do that until chapter 45. But at the end of chapter number 43, he tells them all that they're going to have a meal and they all gather together. And notice what it says in verse 33. This is of interest just to see the reference that is made to the birth order and to the significance of the firstborn. It says, and they sat before him, the firstborn, according to his birthright, and the youngest, according to his youth. Notice what it says, and the men marveled one at another. And we understand, of course, that there's some indication within that where they're wondering how in the world did he know what our birth order was and so on and so forth. But it's certainly interesting how this would have been customary when you think about the birth order and just the process and the birthright. We find that in Deuteronomy chapter 21, turn over there, and I want you to note what happens in Deuteronomy 21 as God is giving instruction to the people of God as they would be preparing to enter into the land of promise. And of course, really kind of a review of the law",
      "context": "...ht. We find that in Deuteronomy chapter 21, turn over there, and I want you to note what happens in Deuteronomy 21 as God is giving instruction to the people of God as they would be preparing to enter into the land...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=952",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 1016.6599731445312,
      "text": "Deuteronomy chapter 21, turn over there, and I want you to note what happens in Deuteronomy 21 as God is giving instruction to the people of God as they would be preparing to enter into the land of promise. And of course, really kind of a review of the law that's been given and all of the requirements and what have you. Notice in Deuteronomy 21 in verse number 17, the Bible says this. But he shall acknowledge the son of the hated for the firstborn by giving him a double portion of all that he hath. For he is the beginning of his strength, the right of the firstborn is his. Now, what's being discussed in the previous verses of Scripture is if a man has more than one wife and he has one wife that's beloved and another wife that isn't, that he could not choose who he would bestow the blessing of the firstborn based upon the mother. It had to be by the birth order, the birthright that was given. And it says this at the end of verse number 17, by giving him a double portion of all that he hath, for he is the beginning of his strength, notice the right of the firstborn is his. So birthright in the firstborn, it's significant, it's valuable. We do find that the blessing that was attached or associated with the firstborn, with the birthright could be lost. You remember that is, and we won't turn there",
      "context": "Deuteronomy chapter 21, turn over there, and I want you to note what happens in Deuteronomy 21 as God is giving instruction to the people of God as they would be preparing to enter into the land...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=1016",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}