{
  "reference": "Deuteronomy 30",
  "occurrences": [
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 2803.0000610351562,
      "text": "those thou shalt nots. I'm thankful God gave us a bunch of thou shalt nots. You know why? It's preserved me. It's prevented me from dealing with some hardships. Why? Because God said thou shalt not. God, I understand that in your wisdom you told me not to do this, and by your grace and with your help, I'm not gonna do it. Notice, by them is thy servant warned, and in keeping of them, there is great reward. The keeping of them. See, we're warned, but then we keep it. Notice Deuteronomy chapter 30. I preached short last week, and I'm gonna preach longer today. I'm not, I'm just teasing. I didn't really preach short last week. In fact, Joseph was doing the sound last week, and he was rooting for me to go another minute longer because I preached 58 and a half minutes. I never preach that long. But Hebrews chapter number seven was just such a technical passage of scripture, and I didn't wanna break it up, and so I almost got to a full hour, and he was cheering for just a little bit more, Daddy. And so thank Joseph, amen? He's not doing sound today, but Deuteronomy chapter 30, notice in verse number 10, and I'll finish with this passage. Notice the first word, if. Deuteronomy 30 and verse number 10. If. It's an important word. Just two letters in our English language, but oh, what a message they carry.",
      "context": "...hapter 30, notice in verse number 10, and I'll finish with this passage. Notice the first word, if. Deuteronomy 30 and verse number 10. If. It's an important word. Just two letters in our English language, but oh, ...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=2803",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 2881.6600341796875,
      "text": "He's not doing sound today, but Deuteronomy chapter 30, notice in verse number 10, and I'll finish with this passage. Notice the first word, if. Deuteronomy 30 and verse number 10. If. It's an important word. Just two letters in our English language, but oh, what a message they carry. If thou shalt hearken unto the voice of the Lord thy God. To keep his commandments and his statutes, which are written in this book of the law. And if, we see it again, thou turn unto the Lord thy God with all thine heart, with all thy soul. For this commandment, which I command thee this day, notice this, it is not hidden from thee, neither is it far off. Aren't you thankful that we have the word of God? We have it. I'm not saying this to pat myself on the back, but you ought to be thankful that you got a church and a pastor that preaches the word of God. Because the reality is that you can go long and far around this nation and you can find a dearth of good Bible preaching. I'm just saying, preach the Bible. Notice verse number 12. It is not in heaven that thou shouldest say, who shall go up for us to heaven and bring it unto us, that we may hear it and do it. Neither is it beyond the sea that thou shouldest say,",
      "context": "...hapter 30, notice in verse number 10, and I'll finish with this passage. Notice the first word, if. Deuteronomy 30 and verse number 10. If. It's an important word. Just two letters in our English language, but oh, ...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=2881",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}