{
  "reference": "Ephesians 1",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1770.52001953125,
      "text": "He's working in us, how we learn more of who He is and what He's able to do, what a joy. Say, thank you, Lord. Thank you, Lord, for your work in my life. Let me say this, number nine, He provides for us. I'm so thankful for His provision. This evening, I'm not simply speaking of any sort of monetary provision, though we could understand that to be the case. But I want you to notice back in Ephesians 1, if you will, and I want you to see what the Word of God says here with regard to the provision in which my mind is thinking of this evening. We'll mention briefly Philippians 4 as He speaks about that monetary blessing. But notice here in Ephesians 1, the Bible says this in verse number three. Ephesians 1 and verse number three. Blessed be the God and Father of our Lord Jesus Christ, notice this, who hath blessed us with all spiritual blessings in heavenly places in Christ. And you think about the provision, the spiritual provision. You think about this. You couple that verse with 2 Peter 1 and verse number 3, and we read that just a few moments ago by way of introduction, but in 2 Peter 1 and verse number 3, the Bible says this, according as His divine power, notice what it says, hath given unto us all things that pertain unto life and godliness through the knowledge of Him",
      "context": "...onetary provision, though we could understand that to be the case. But I want you to notice back in Ephesians 1, if you will, and I want you to see what the Word of God says here with regard to the provision in ...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1770",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1994.780014038086,
      "text": "care of. And He will supply. If you're reading our daily devotional, you read about that individual that gave that gold piece. And he gave that gold piece. And man, he got back, I think it was 12, and then there were two more, so he got 14 for one. And he gave it to that widow. And the widow said, I'm gonna pray for you. I'm gonna pray God's blessing. And he got 14 pieces of gold. He had given one. He thought, this is wonderful. And then he found out just a short time later that there was an estate that was left, and they left, I think it was 512 or something like that pieces of gold. Huh. You can't outgive God. And we can rejoice in God's provision monetarily, and we ought to rejoice in His provision and the way that He takes care of us and how good He's been to us. But I want you to think this evening of how He's provided for us spiritually as we mentioned in Ephesians 1 and in 2 Peter 1. He has given us all things that pertain unto life and godliness. And I'm so thankful for that. And I hope that you'd be thankful for that promise. He's promised that He has given us those things. Let me say this. As we think about our Christian life, He has promised that our labor is not in vain. Our labor is not in vain, number 10.",
      "context": "...us. But I want you to think this evening of how He's provided for us spiritually as we mentioned in Ephesians 1 and in 2 Peter 1. He has given us all things that pertain unto life and godliness. And I'm so thank...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1994",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "zo6IdkJY-nY",
      "timestamp": 506.4800109863281,
      "text": "I make mention of you always in my prayers. Paul's praying for these believers in Rome. Turn to the book of Ephesians, if you will. Ephesians chapter number one. And I want you to note, really, there's a couple of passages in the book of Ephesians that we could look to. There are a couple of specific prayers that are outlined here in the book of Ephesians as Paul is praying for these believers. But note with me in Ephesians 1, in verse number 15, the Bible says this, wherefore I also, after I heard of your faith in the Lord Jesus and love unto all the saints, cease not to give thanks for you, making mention of you in my prayers. So we find that in the book of Romans he says that without ceasing, and here in the book of Ephesians he says that he says, I cease not to give thanks for you all. We understand that verse 16 does not include the I, but as we look at verse number 15, we would understand that it's Paul that's speaking, and in essence we could say that he's saying, I cease not to give thanks for you, making mention of you in my prayers. He goes on here in Ephesians 1 to tell them how he's praying for them. That will be the subject of our next study in the book of Colossians as we enter into verses 9 and following",
      "context": "... outlined here in the book of Ephesians as Paul is praying for these believers. But note with me in Ephesians 1, in verse number 15, the Bible says this, wherefore I also, after I heard of your faith in the Lord...",
      "sermon_title": "Sermon zo6IdkJY-nY",
      "url": "https://www.youtube.com/watch?v=zo6IdkJY-nY&t=506",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "zo6IdkJY-nY",
      "timestamp": 566.239990234375,
      "text": "not to give thanks for you, making mention of you in my prayers. He goes on here in Ephesians 1 to tell them how he's praying for them. That will be the subject of our next study in the book of Colossians as we enter into verses 9 and following in Colossians chapter number 1. We're going to look at Paul saying to these believers in Colossae that he's praying always for them, but then he says, here's how I'm praying for you. How encouraging that is. Look over if you look in the book of Philippians, turn over a few pages in Philippians chapter number 1. In Philippians chapter number 1, in verse number 3, the Bible says this, I thank my God upon every remembrance of you, always in every prayer of mine for you all, making request with joy. Again, in the very first few verses of the book of Philippians, for these believers in Philippi to understand that Paul is praying for them. And he's letting them know that this is not just a situation where, hey, I'm going to be seeing you in a little while, so I'm going to let you know that I'm praying for you, so that you have…no, he's faithfully engaged in the work of intercessory prayer. And he's letting people know, the example is all throughout the Scriptures. First Thessalonians. We'll look at a few more verses here in First Thessalonians chapter number 1.",
      "context": "not to give thanks for you, making mention of you in my prayers. He goes on here in Ephesians 1 to tell them how he's praying for them. That will be the subject of our next study in the book of C...",
      "sermon_title": "Sermon zo6IdkJY-nY",
      "url": "https://www.youtube.com/watch?v=zo6IdkJY-nY&t=566",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}