{
  "reference": "Exodus 9",
  "occurrences": [
    {
      "sermon_id": "HyiDXKZbWS8",
      "timestamp": 2050.0599975585938,
      "text": "became the end of the road for them. They were imitating, they were deceiving, and they imitated that the rods turned to serpents, they imitated the first plague and they made that water turn to blood, they imitated the second with bringing more frogs, but then in the third plague, when they used their enchantments to bring forth lice, the Bible says that they could not, so there were lice upon man and upon beast, and then it tells us in verse 19, then the magician said unto Pharaoh, notice what they say, this is the finger of God. And Pharaoh's heart was hardened and he hearkened not unto them as the Lord had said. And so we find that they tried to bring more, but they could not, they recognized that it was the finger of God, as the magicians, as the imitators, as those that were resisting the truth, and they were seeking to deceive the masses. Think about the scene in Egypt at this time, and all that was taking place in the court of Pharaoh. We come to the ninth chapter, and we find that these magicians, they were also impacted according to verse number 11, by the boils, the sixth plague. The Bible says in Exodus 9 and verse number 11, and the magicians could not stand before Moses because of the boils, for the boil was upon the magicians and upon all the Egyptians. Literally, pus filled open and running sores.",
      "context": "... were also impacted according to verse number 11, by the boils, the sixth plague. The Bible says in Exodus 9 and verse number 11, and the magicians could not stand before Moses because of the boils, for the b...",
      "sermon_title": "\"Perilous Times\" II Timothy 3:1-9",
      "url": "https://www.youtube.com/watch?v=HyiDXKZbWS8&t=2050",
      "channel": "Unknown",
      "publish_date": 20241104
    },
    {
      "sermon_id": "HyiDXKZbWS8",
      "timestamp": 2127.7000122070312,
      "text": "verse number 11, by the boils, the sixth plague. The Bible says in Exodus 9 and verse number 11, and the magicians could not stand before Moses because of the boils, for the boil was upon the magicians and upon all the Egyptians. Literally, pus filled open and running sores. The Bible tells us that these magicians, as they sought to imitate, that they were doing these things, but then they come to the place where, in chapter 10 and verse number seven, they say to Pharaoh, and Pharaoh's servants said unto him, how long shall this man be a snare unto us? Let the men go that they may serve the Lord their God. Knowest thou not yet that Egypt is destroyed? It's very interesting, we don't have time, and over the next several months, as we study through the book of Revelation, we'll notice this, but even during the time of the tribulation, the time of the tribulation is gonna be a period of great deception. And we find that even though men will suffer greatly, you know what the Bible tells us? They won't repent. They'll suffer greatly, but they won't repent. We find here that these magicians, they recognize these things to be true, they've imitated, they've deceived, but now they're being impacted and affected, but we see nowhere that they actually are going to repent. If we go back to the truth of this deception,",
      "context": "verse number 11, by the boils, the sixth plague. The Bible says in Exodus 9 and verse number 11, and the magicians could not stand before Moses because of the boils, for the b...",
      "sermon_title": "\"Perilous Times\" II Timothy 3:1-9",
      "url": "https://www.youtube.com/watch?v=HyiDXKZbWS8&t=2127",
      "channel": "Unknown",
      "publish_date": 20241104
    }
  ]
}