{
  "reference": "Ezra 8",
  "occurrences": [
    {
      "sermon_id": "Byn6kSjmOVQ",
      "timestamp": 666.359992980957,
      "text": "me of the ability that God has to answer prayer? Well, because God says pray without ceasing. And so therefore, if He instructs us, if He gives us that piece of instruction to pray without ceasing, it is reminding us not only that we have access, but it's reminding us of His ability. Why would He tell us to pray? Why would He tell us to come to Him if He doesn't have the ability to do something about it? And He has the ability, He has all the ability. He is the omnipotent, all-wise God. And so He says to His people, pray without ceasing, because He is able to answer prayer. He's able to change the circumstances of our lives. He's able to work through the circumstances of our lives. He gives us the grace that we need. In fact, we have found many times in our lives personally that His grace is sufficient. His grace is sufficient. This evening, I want you to take and turn to the book of Ezra, if you will. Look at this Old Testament illustration of this truth that we're looking at this evening in Ezra chapter number 8. We see here in Ezra 8, there's prayer and fasting that takes place. And we see God's ability to answer in Ezra 8, beginning in verse number 21. See, they're trying to get to Jerusalem. We're going to see that in just a moment, but they're taking a journey to Jerusalem.",
      "context": "...ustration of this truth that we're looking at this evening in Ezra chapter number 8. We see here in Ezra 8, there's prayer and fasting that takes place. And we see God's ability to answer in Ezra 8, beginni...",
      "sermon_title": "\"Pray Without Ceasing\" I Thessalonians 5:17",
      "url": "https://www.youtube.com/watch?v=Byn6kSjmOVQ&t=666",
      "channel": "Unknown",
      "publish_date": 20240415
    },
    {
      "sermon_id": "Byn6kSjmOVQ",
      "timestamp": 761.9599914550781,
      "text": "see here in Ezra 8, there's prayer and fasting that takes place. And we see God's ability to answer in Ezra 8, beginning in verse number 21. See, they're trying to get to Jerusalem. We're going to see that in just a moment, but they're taking a journey to Jerusalem. And this journey that they're going to take to Jerusalem, there's going to be a lot of danger along the way. And so the Bible tells us that there's a fast that's proclaimed. There's a seeking of God. And what are they seeking? Well, they're seeking that God would give them some direction, that God would provide for them and give them the protection that they need. But I want you to notice, verse 22 always impacts me. Every time I read it, I'm impacted of the importance of us trusting the Lord. Notice the Bible says, for I was ashamed to require of the king a band of soldiers and horsemen to help us against the enemy in the way. There are records, by the way, of others that requested such help, and the help was granted. In those circumstances, it does not necessarily say that it was wrong, but we find here in Ezra that he says, I was ashamed to ask the king to provide for us soldiers and horsemen that they would give us the protection that we needed along the way. Why was it that he was ashamed to ask of that?",
      "context": "see here in Ezra 8, there's prayer and fasting that takes place. And we see God's ability to answer in Ezra 8, beginni...",
      "sermon_title": "\"Pray Without Ceasing\" I Thessalonians 5:17",
      "url": "https://www.youtube.com/watch?v=Byn6kSjmOVQ&t=761",
      "channel": "Unknown",
      "publish_date": 20240415
    }
  ]
}