{
  "reference": "Galatians 4",
  "occurrences": [
    {
      "sermon_id": "Ap8WkGwQMm4",
      "timestamp": 152.9199981689453,
      "text": "reality of Christ's birth is a settled matter historically. I'm sure we could find some that would debate that, but I think by and large, it is a settled truth of history that Christ was born. Unfortunately, there are far too many, even those that would acknowledge the birth of the Lord and Savior, our Lord and Savior, Jesus Christ, that they do not understand why it is that Christ was born. As we look at what the Scriptures teach us, obviously, within the passage here and other portions of Scripture, we understand with great clarity as to the reason that Christ was born. Paul says it this way in the book of Galatians as he's writing to the believers in that region in Galatians 4 and verses 4 and 5, but when the fullness of the time was come, God sent forth His Son, made of a woman, made under the law, verse number 4. Verse number 5 says, to redeem them that were under the law that we might receive the adoption of sons. I'm so thankful that not only do we have the reality, the truth with regard to the fact that Christ was born, but through the pages of Scripture, we understand the reason that Christ was born. And we understand, listen, we are privileged, I use that terminology, we are blessed to be able to have the truth with regard to not only has Jesus come, but why He has come.",
      "context": ".... Paul says it this way in the book of Galatians as he's writing to the believers in that region in Galatians 4 and verses 4 and 5, but when the fullness of the time was come, God sent forth His Son, made of a w...",
      "sermon_title": "Sermon Ap8WkGwQMm4",
      "url": "https://www.youtube.com/watch?v=Ap8WkGwQMm4&t=152",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "20HHrsvLvZg",
      "timestamp": 2646.460006713867,
      "text": "he would tarry there, and he stayed there for two days. And I want you to notice verses 41 and 42. It says that many more believed because of his own word, and said unto the woman, Now we believe, not because of thy saying, for we have heard him ourselves, and know that this indeed is indeed the Christ, the Savior of the world. We sang this morning, joy to the world, the Savior is come. He has come. And as we understand this gift of God, Galatians chapter number 4, you don't need to turn there, but in Galatians 4, in verse number 4, the Bible says, when the fullness of the time was come, God sent forth his Son, made of a woman, made under the law. What was the purpose of sending his Son? To redeem them that were under the law, that we might receive the adoption of sons. How did he redeem us? Through his substitutionary atonement. The gift of God that we're speaking of this morning, this gift that's been made available to us, and as we understand this gift, and as we've received this gift, then we ought to have the desire to give him our praise, to give him our life, to lift up our voice and testify of him. In John chapter number 1, John the Baptist is preaching, and the Lord Jesus Christ walks by,",
      "context": "...as we understand this gift of God, Galatians chapter number 4, you don't need to turn there, but in Galatians 4, in verse number 4, the Bible says, when the fullness of the time was come, God sent forth his Son,...",
      "sermon_title": "Sermon 20HHrsvLvZg",
      "url": "https://www.youtube.com/watch?v=20HHrsvLvZg&t=2646",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}