{
  "reference": "Galatians 6",
  "occurrences": [
    {
      "sermon_id": "ZWhiVzLFfxc",
      "timestamp": 365.82000732421875,
      "text": "and there's their truth and there's my truth and so on and so forth, but the fact of the matter is that there is absolute truth and that is found in the Word of God. But when truth is rejected and when error is… when truth is rejected, then deception is very easy to creep in and it's very easy to deceive many because of an absence of truth. As we think about this age of deception, we come again to a passage of Scripture here in Galatians 6 where the verse of Scripture begins with, be not deceived. Look in verse number 7 of Galatians 6. That's a familiar verse of Scripture, and the Bible says, be not deceived. You know, there are warnings that are issued throughout the Word of God. I'm thankful for the warnings that God gives us. In fact, in the book of Psalms, in the 19th Psalm, as we find that great declaration, the law of the Lord is perfect and all that God tells us about the written Word of God, we find that the text of Scripture in verse number 11 concludes by saying, moreover, by them is thy servant warned, and in keeping of them there is great reward. One of the ways in which Paul described the ministry that he'd been given by the Lord in Colossians 1 was that it was not only a teaching ministry, but it was a warning ministry.",
      "context": "... of truth. As we think about this age of deception, we come again to a passage of Scripture here in Galatians 6 where the verse of Scripture begins with, be not deceived. Look in verse number 7 of Galatians 6. T...",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc&t=365",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "ZWhiVzLFfxc",
      "timestamp": 931.5,
      "text": "all of these things and we find that He's a deceiver. Remember when we first started this particular series, we talked about the fact that Eve was deceived. This is the oldest tool in the toolbox of Satan, that of deception. The reality is that we can be deceived ourselves. In 1 Corinthians 3 and verse number 8, the simple statement that is given in Scripture where the Bible… In verse number 18, excuse me, where the Bible says, let no man deceive himself. Let no man deceive himself in 1 Corinthians 3 and verse number 18. If any man among you seemeth to be wise in this world, let him become a fool that he may be wise. And he talks about the wisdom of God and how we need God's wisdom. Let no man deceive himself. Listen, we're not seeking to use the world's wisdom, we're seeking to use God's wisdom. And we need to know the Word of God and so we see the problem as we begin looking at these verses of Scripture in Galatians 6, verses 7 and 8, that the problem is deception. Be not deceived. Then God gives us this principle, really principles that are provided to us within the remainder of verse 7 and verse number 8. This principle or these principles that are given, we've used the title this evening, sowing and reaping, and we'd understand that this law, if you will, is a self-evident principle",
      "context": "... know the Word of God and so we see the problem as we begin looking at these verses of Scripture in Galatians 6, verses 7 and 8, that the problem is deception. Be not deceived. Then God gives us this principle, ...",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc&t=931",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "ZWhiVzLFfxc",
      "timestamp": 1070.0199890136719,
      "text": "plants and get peppers, right? You plant tomatoes, you expect to get tomatoes. You plant peppers, you expect to get peppers. You plant apple trees, you expect to get apples. It's pretty simple. We see it observed in nature, but really the context is not dealing with the law in nature though that is observable and helps us to understand the truth that has been given, but we find that this is given to us with regard to the spiritual world. The Bible says, for whatsoever a man soweth, that shall he also reap. Notice in verse 8, for he that soweth, it begins with a negative example, he that soweth to his flesh shall of the flesh reap corruption. Remember I mentioned the truth of Galatians 5 verses 16 through 26 a moment ago and how that there's a correlation between that portion of Scripture and this truth that is given to us in Galatians 6 verses 7 and 8. When he's talking about the flesh lusteth against the spirit and this whole process of crucifying the flesh that is mentioned back in Galatians 2 in verse number 20, and so I am to die daily, I'm to crucify the flesh as Paul says in Galatians 2.20, but we find here that it is possible for us to sow to the flesh. The Bible says that he that soweth to his flesh shall of the flesh, what does it say? Reap corruption. That doesn't sound very good, does it?",
      "context": "... that there's a correlation between that portion of Scripture and this truth that is given to us in Galatians 6 verses 7 and 8. When he's talking about the flesh lusteth against the spirit and this whole process...",
      "sermon_title": "Sermon ZWhiVzLFfxc",
      "url": "https://www.youtube.com/watch?v=ZWhiVzLFfxc&t=1070",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "GWHY7Tnt1EI",
      "timestamp": 357.1600036621094,
      "text": "church discipline is reconciliation and restoration. That's the idea. Listen, God's people need to belong to a church. The church is God's idea, it's God's plan, and God has instituted the church, and God has given us instructions with regard to church discipline, and from time to time it's necessary because of an offense and what have you, but the purpose is always reconciliation, restoration, and we rejoice in that truth, the biblical truth of reconciliation and restoration, and it's coupled there with forgiveness, and I'm mindful of what Galatians 6 tells us. It tells us this, brethren, if a man be overtaken in a fault, ye which are spiritual, notice what it says, restore such an one in the spirit of meekness, considering thyself, lest thou also be tempted, and we think about that restoration, and back a couple of summers ago, my dad preached through Psalm 23 on Wednesday evenings, and I want to remind you what the Bible says in Psalm 23. He says, he, speaking of the Lord being our shepherd, he restoreth my soul, and what a blessing to understand this evening, and then to see this picture between Jacob and Esau. I mean, again, Jacob, why did he leave? Mom said, hey, I've heard that Esau's going to kill you. You need to go a little ways, and you need to get away for a little while so that his",
      "context": "...of reconciliation and restoration, and it's coupled there with forgiveness, and I'm mindful of what Galatians 6 tells us. It tells us this, brethren, if a man be overtaken in a fault, ye which are spiritual, not...",
      "sermon_title": "Sermon GWHY7Tnt1EI",
      "url": "https://www.youtube.com/watch?v=GWHY7Tnt1EI&t=357",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "kZ4u2Ljc7cU",
      "timestamp": 1823.1600246429443,
      "text": "tracing it back, you have to recognize as a child of God that it was God that blessed you with it. In the book of Deuteronomy, you know what God says to His people? It's God that gives them the ability to get wealth. You couldn't go to work tomorrow if God didn't let you wake up. Am I right? Whose air are you breathing? God's air, right? And we find, listen, everything that we have is because of the grace of God. Everything that we have and everything that we are. Now, if we recognize that it's because of the grace of God, it's a result of the grace of God, where is room for pride? It's really gone, is it not? There's no room for pride when I have that proper perspective. Notice, and we'll just look at this last verse, Galatians 6.14, if I'm going to glory, I'm going to glory in Christ. But notice in 1 Peter 5. In 1 Peter 5, James 4 and verse 6 is a great verse of Scripture dealing with humility as well. But I want to close quickly here with 1 Peter 5, verses 5 and 6. Notice what Peter says. He says this in verse 5, Likewise, you younger, submit yourselves unto the elder, yea, all of you be subject one to another. Notice what he says, Be clothed with what? With humility. Be clothed with humility. Why? For God resisteth the proud, and giveth grace to the humble.",
      "context": "...room for pride when I have that proper perspective. Notice, and we'll just look at this last verse, Galatians 6.14, if I'm going to glory, I'm going to glory in Christ. But notice in 1 Peter 5. In 1 Peter 5, Jam...",
      "sermon_title": "Sermon kZ4u2Ljc7cU",
      "url": "https://www.youtube.com/watch?v=kZ4u2Ljc7cU&t=1823",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}