{
  "reference": "Galatians 2",
  "occurrences": [
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 1267.4200286865234,
      "text": "it costs Jesus everything. Not only did he suffer on a cruel cross, but he left the glory of heaven, the splendor and the glory that he had with the Father from ages gone by for all of eternity, he left that so he could come to a sin-cursed world. We find this morning he said, for whosoever shall call upon the name of the Lord shall be saved. Think of this truth in Galatians 2. So Paul writes to these believers in Rome and he tells them, you're guilty sinners, but the wage, the payment for that sin is death, but Jesus Christ died for you and he offers you this free gift and if you call on him, he'll save you. Therefore, I beseech you, therefore, brethren, by the mercies of God that you present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service when you understand the foundation by which we find in the book of Romans, it seems as if it would simply be that we as God's people, we would live surrendered lives, we would voluntarily yield to Christ because we understand what he did for us. It's amazing how many of God's people, how often in my life I try to live for myself, I try to take back that control. Paul, he didn't simply beg others, he did not simply encourage others to live a surrendered life, but we find that Paul himself lived a life of surrender.",
      "context": "... he said, for whosoever shall call upon the name of the Lord shall be saved. Think of this truth in Galatians 2. So Paul writes to these believers in Rome and he tells them, you're guilty sinners, but the wage, ...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=1267",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 1346.780029296875,
      "text": "many of God's people, how often in my life I try to live for myself, I try to take back that control. Paul, he didn't simply beg others, he did not simply encourage others to live a surrendered life, but we find that Paul himself lived a life of surrender. In fact, we're familiar with Galatians 2 in verse 20. Why does Paul say I'm crucified with Christ? Why does he say this truth of his position of surrender? If you look at the end of the verse, he says this, who loved me and gave himself for me. What's the reason, child of God? What's the reason that we should live a surrendered life? Because he loved me and he gave himself for me. Because without him, I'd be hopeless and helpless. You know where you'd be this morning without Christ? I don't even like to think about it. I don't know where I would be like geographically today without Christ, I'm not sure. But I know where I would be headed today without Christ and that's to a Christless eternity to a place called the Lake of Fire. Oh, what grace and what mercy, what love. We find that in 1 Corinthians 6 in verses 19 and 20 that Paul, as he's speaking to the believers there in Corinth, he says what? Know ye not that your body is the temple of the Holy Ghost which is in you, which you have of God,",
      "context": "...endered life, but we find that Paul himself lived a life of surrender. In fact, we're familiar with Galatians 2 in verse 20. Why does Paul say I'm crucified with Christ? Why does he say this truth of his positio...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=1346",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 0.0,
      "text": "As he's writing to these believers in this region of Galatia. He said this in Galatians 2 in verse number 20 I am crucified with Christ Nevertheless, I live yet not high but Christ liveth in me He says this in the life, which I now live in the flesh I live by the faith of the Son of God who loved me and gave himself for me the Apostle Paul said to the believers in Corinth and second Corinthians 5 in verse number 15 and that he died for all that They which live should not henceforth live unto themselves But unto him which died for them and rose again I'm so thankful for the privilege of living for Jesus and giving our heart to him Colossians chapter number two this morning if you have your Bible there with you Colossians chapter number two, I will be preaching through the book of Colossians this year But as you know, if you've been here for any length of time each year I choose an annual theme for our church as I seek the Lord for direction I ask him and I desire of him to provide me with direction That will lead me to a theme that will encourage strengthen and Challenge the members and attenders of Fellowship Baptist Church. It's hard to believe but it's true nonetheless that this is",
      "context": "As he's writing to these believers in this region of Galatia. He said this in Galatians 2 in verse number 20 I am crucified with Christ Nevertheless, I live yet not high but Christ liveth i...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}