{
  "reference": "Genesis 10",
  "occurrences": [
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 2403.7400512695312,
      "text": "to read of these genealogies and all of the the sons of Japheth and the sons of Ham and the sons of Shem and you read of all of these descendants and then we find at the end of chapter number 11 that the Bible gives us all the descendants of Shem, and it begins to provide us with all of these names and all of these years and all that's taken place, and we find that we come to this place where the Bible tells us in verse number 26 of Genesis 11, and Terah lived 70 years and begat Abram, Nahor, and Haran, and we find that it's at that point that the Bible begins to focus its attention on Abram, on Abraham. We find even as we studied and looked throughout the text of Scripture, beginning in those messages at that particular place in the book of Genesis, how that the Hebrew race and the promise that God had given with regard to the Lord Jesus Christ and the line, the messianic line, and all of the prophecies of Scripture, and we find how that the broadness of the scope of Genesis 10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just zeroes in on Abraham, and we read all of these chapters and all of these events of a hundred years of the life of Abraham. Remember it was that God said",
      "context": "...ic line, and all of the prophecies of Scripture, and we find how that the broadness of the scope of Genesis 10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=2403",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "4vUlrsA0Z_s",
      "timestamp": 1118.0599975585938,
      "text": "this passage of Scripture to say something that it does not say. Notice, he says, Cursed be Canaan, and he says this, A servant of servants shall he be unto his brethren. It's interesting, at the end of verse number 26 and at the end of verse number 27, it says, And Canaan shall be his servant. And Canaan shall be a servant. Can I tell you that the Canaanites were known for their wickedness and their immorality. As you study the Scriptures and begin to see all that transpires, as you begin to see the interactions between the children of Israel and the Canaanites, in fact, even within the book of Genesis, you see references to the Canaanites, you see they are known for their wickedness and their immorality. We find that in Genesis chapter number 10, turn over there if you will and look at verses 15 through 19, it's important for us to note this because the Bible says, Cursed be Canaan, and we find that in Genesis 10 verses 15 through 19 that God provides us with a list of the descendants of Canaan. Again, this prophecy of Noah is not on all of the descendants of Ham, it's simply on the Canaanites. Notice in verse number 15 of Genesis 10, And Canaan begat Sidon his firstborn in Heth, and the Jebusite, and the Amorite, and the Gergesite, and the Hivite, and the Archite, and the Sinite, and the Arvidite, and the",
      "context": "...9, it's important for us to note this because the Bible says, Cursed be Canaan, and we find that in Genesis 10 verses 15 through 19 that God provides us with a list of the descendants of Canaan. Again, this pro...",
      "sermon_title": "Sermon 4vUlrsA0Z_s",
      "url": "https://www.youtube.com/watch?v=4vUlrsA0Z_s&t=1118",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "4vUlrsA0Z_s",
      "timestamp": 1189.9800415039062,
      "text": "all of the descendants of Ham, it's simply on the Canaanites. Notice in verse number 15 of Genesis 10, And Canaan begat Sidon his firstborn in Heth, and the Jebusite, and the Amorite, and the Gergesite, and the Hivite, and the Archite, and the Sinite, and the Arvidite, and the Zemurite, and the Hamathite, and afterward were the families of the Canaanites spread abroad. Verse 19, And the border of the Canaanites was from Sidon as thou goest to Gerir, unto Gaza, as thou goest unto Sodom, and Gomorrah, and Admah, and Zeboiim, even unto Lasha.\" In fact, as you read the book of Joshua, as we've been studying the book of Joshua, you'll note many of those places and many of those names are found within the context of the book of Joshua. We find here that, as we would think about this curse that's been placed upon Canaan, this prophecy more than a curse, and we think about it as a prophecy in the sense of, yes, it says, curse it be Canaan, we understand that, but what we find that is happening is Noah is giving this prophecy with regard to the descendants, the wickedness that he saw in Ham, he would see it fully gone in Canaan, his son. And we find that in Genesis chapter 15, let's take a walk through some scripture here and look at some things with regard to the",
      "context": "all of the descendants of Ham, it's simply on the Canaanites. Notice in verse number 15 of Genesis 10, And Canaan begat Sidon his firstborn in Heth, and the Jebusite, and the Amorite, and the Gergesite...",
      "sermon_title": "Sermon 4vUlrsA0Z_s",
      "url": "https://www.youtube.com/watch?v=4vUlrsA0Z_s&t=1189",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}