{
  "reference": "Genesis 34",
  "occurrences": [
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 868.6199951171875,
      "text": "in verse number 7, the Bible says, cursed be their anger for it was fierce and their wrath for it was cruel. Now notice what Jacob says and this is that prophetic view, if you will. It says this, I will divide them in Jacob and scatter them in Israel. So Simeon and Levi, they work together, if you will, in this situation with Shechem that's recorded in Genesis 34 and it's exposed here in this text of Scripture and Jacob says that they're going to be divided in Jacob and scattered in Israel. And so we find that as we were to look at the inhabiting of the land, if you think about this time in Israel's history, just as early on as a nation, they just have gotten to Egypt, they're there for 17 years, they would be in Egyptian bondage, they'd have of course the Exodus and eventually after 40 years of the wandering in the wilderness, they would enter into the land of promise. The land that God promised Abraham and we find that they would enter into that land, they would conquer the land, they would divide the land, they would inhabit the land. But Simeon, their inheritance is within the boundaries of Judah. So if you were to look at a map of the inheritance of the nation of Israel when they entered the land, the southern part of Israel is where Judah is and within Judah, it's almost like",
      "context": "...Simeon and Levi, they work together, if you will, in this situation with Shechem that's recorded in Genesis 34 and it's exposed here in this text of Scripture and Jacob says that they're going to be divided in ...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=868",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 203.36000061035156,
      "text": "Shechem spake unto his father Hamar, and saying this, Get me this damsel to wife. And Jacob heard that he had defiled Dinah his daughter. Now his sons were with his cattle in the field, and Jacob held his peace until they were come. And Hamar, the father of Shechem, went out unto Jacob to commune with him. The sons of Jacob came out of the field when they heard it, and the men were grieved. They were wroth, because he had wrought folly in Israel, in lying with Jacob's daughter, which thing ought not to be done.\" I've titled the message this evening, as I've already mentioned by way of introduction, Avoid Taking Matters Into Your Own Hands. As we look at the account that God gives us here in this particular passage of Scripture, if you're taking notes, I want you to notice under the thought of the historical account, notice with me the recorded offense. We've read the first seven verses of Genesis 34, and in this portion of Scripture, God provides us with the recorded offense. God tells us in verse number one that Dinah, Jacob's daughter, went out and she interacted with the inhabitants of the land. The Bible says at the end of verse number one that she went out to see the daughters of the land. And we find that in that position, perhaps we could look at that and speak about the fact of being vulnerable in the position",
      "context": "...f the historical account, notice with me the recorded offense. We've read the first seven verses of Genesis 34, and in this portion of Scripture, God provides us with the recorded offense. God tells us in verse...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=203",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 1000.9400329589844,
      "text": "Genesis 49, turn over if you will, when he's dying and the blessings are being given to his sons. Notice what he says in Genesis chapter 49, beginning in verse number 1, Genesis 49 and verse 1, the Bible says, and Jacob called unto his sons and said, gather yourselves together that I may tell you that which shall befall you in the last days. Gather yourselves together and hear you sons of Jacob and hearken unto Israel your father. Notice beginning in verse number 5, he begins speaking to Simeon and Levi. These are the two that we read of in Genesis 34 that we just read the entirety of the account, this historical account that took place. And notice what Jacob says when he's on his deathbed here. It says, Simeon and Levi are brethren, instruments of cruelty are in their habitations. Oh my soul, come not thou into their secret, unto their assembly. Mine honor, be not thou united. For in their anger, they slew a man and in their self-will, they digged down a wall. Cursed be their anger, for it was fierce, and their wrath, for it was cruel. I will divide them in Jacob and scatter them in Israel. Isn't it interesting that Jacob makes mention specifically of this event that we just read of Genesis 34 about Simeon and Levi and he talks about their anger and how it was fierce and how their wrath was cruel.",
      "context": "...ning in verse number 5, he begins speaking to Simeon and Levi. These are the two that we read of in Genesis 34 that we just read the entirety of the account, this historical account that took place. And notice ...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=1000",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 1074.2000122070312,
      "text": "I will divide them in Jacob and scatter them in Israel. Isn't it interesting that Jacob makes mention specifically of this event that we just read of Genesis 34 about Simeon and Levi and he talks about their anger and how it was fierce and how their wrath was cruel. There are times in our lives that we want to take matters into our own hands. And I believe this evening that as we look at the historical account in Genesis 34, and obviously I've gone very quickly at these 31 verses to kind of dig through it and look at the account, but I want to spend some time this evening to seek to make an application for each of us this evening. Because we are tempted in our lives as we go through life, there are times in which you will be tempted and I will be tempted to take matters into my own hands and into your own hands. Look over at the New Testament, if you will, to the book of Romans. Look at Romans chapter number 12 and then we'll look at a number of passages of Scripture this evening as we seek to make this point this evening of how important it is that we resist, that we avoid taking matters into our own hands. We said number one, the account, number two, the application, the application that we receive from this portion of Scripture.",
      "context": "...rael. Isn't it interesting that Jacob makes mention specifically of this event that we just read of Genesis 34 about Simeon and Levi and he talks about their anger and how it was fierce and how their wrath was ...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=1074",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 2647.5800018310547,
      "text": "saith the Lord. And in our lives, listen, you're going to be wronged and I'm gonna be wronged. It's gonna happen. It might happen tonight. It might happen this week. Maybe you've been wronged recently. Maybe you can think this evening of a specific time in which you took matters into your own hands. Said, man, how did I make a mess of this situation? This evening, as we look at the account in Genesis 34, we see the historical account that God provides. Terrible situation. Two wrongs don't make a right. They tried to justify their actions, but what they did was wrong. It was wrong, but it doesn't give you a right to respond wrong. And this evening, if we're gonna avoid taking matters into our own hands, we must recognize the providence of God. We must exercise restraint. And we must understand this evening that God is able. It reveals maturity in the life of a believer. When we're able to be wronged, God's in control. God knows. God is able. I said at the beginning of the message, when we got to Romans, so not really the beginning, the middle of the message, this is not an easy principle. It's not something you're gonna do in your own power. It's not something you're gonna do in your own flesh. Because my flesh and your flesh wants to get even. We don't like being wronged. But this evening, we must avoid taking matters into our own hands.",
      "context": "...nds. Said, man, how did I make a mess of this situation? This evening, as we look at the account in Genesis 34, we see the historical account that God provides. Terrible situation. Two wrongs don't make a right...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=2647",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 2732.1199951171875,
      "text": "an easy principle. It's not something you're gonna do in your own power. It's not something you're gonna do in your own flesh. Because my flesh and your flesh wants to get even. We don't like being wronged. But this evening, we must avoid taking matters into our own hands. Learn the lessons from the life of David. And thank God when God sends an Abigail in your life. You know what happens for some of us? God sends an Abigail in our life and we get mad at Abigail. Seriously. Who are you to tell me? Just trust the Lord. He's able. Let's pray. Father, we love you. We thank you for loving us. God, we look at a difficult passage of scripture in Genesis 34 this evening. I believe that you've recorded that event not only to give us the historical account, but Lord, to help us understand the importance of not taking matters into our own hands. It's such a common response. At times, if we'd be honest, it's desirable. We wanna get even. We want that revenge. That moment of feeling good. God, we need to take the whole counsel of God into account. You told us that vengeance is yours. You told us to not be overcome with evil, but to overcome evil with good. God, I pray that you'd help us tonight. We live in a world in which we'll be wronged. People will do us wrong and they'll treat us wrong.",
      "context": "...ather, we love you. We thank you for loving us. God, we look at a difficult passage of scripture in Genesis 34 this evening. I believe that you've recorded that event not only to give us the historical account,...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=2732",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}