{
  "reference": "Genesis 31",
  "occurrences": [
    {
      "sermon_id": "PcWAoGx4sog",
      "timestamp": 2081.3599853515625,
      "text": "thy curse, my son. Only obey my voice and go fetch me them. And now because of the hatred that Esau has for Jacob because of the blessing, because of his purposing to kill Jacob, Rebekah says, go to my brother and stay there a few days until Esau's anger, until his fury turn away. Rebekah would never see her son again. She'd never see Jacob again. Turned into years, in Genesis 31 and verse number 38, notice what I'm jumping right into the middle of the text of Scripture, but Jacob says this, This twenty years have I been with thee. Thy ewes and thy she-goats have not cast their young, and the rams of thy flock have I not eaten. A few days, twenty years. It's a long time. The impact on the family. By the way, during those twenty years, Jacob was deceived on more than one occasion, wasn't he? It's unfortunate, all that transpired. In verse 45, she continues, Until thy brother's anger turn away from thee, and he forget that which thou hast done to him, then I will send and fetch thee from thence. Why should I be deprived also of you both in one day? And so, she says, I'm going to send you there, but when his anger, when Esau's anger is turned away from thee, and he forgets what's taken place, then I'm going to send for you, and",
      "context": "...urn away. Rebekah would never see her son again. She'd never see Jacob again. Turned into years, in Genesis 31 and verse number 38, notice what I'm jumping right into the middle of the text of Scripture, but Ja...",
      "sermon_title": "Sermon PcWAoGx4sog",
      "url": "https://www.youtube.com/watch?v=PcWAoGx4sog&t=2081",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "hMIOkmwPfzg",
      "timestamp": 1721.760009765625,
      "text": "always. Even unto the end of the world. Amen. He promises to go with us. He promises His presence. And as we learn the reality of His presence, as we learn the power of His presence, it ought to encourage us this evening. It ought to encourage us to know that God says, I'm with you. It's not just a promise that's reserved for Jacob or for Joshua or for Jeremiah or one of the other multiple people that we could look to the word of God this evening, but it's a promise that's given to us as the very people of God today. That God says, I'm with you. I'm with you. And as Jacob is rehearsing back in Genesis 31, he says to Rachel and Leah, he says, listen, I know I can see that your father's countenance, Laban, he's not favorable towards me. There's some hostility there, but the God of my father hath been with me. What a joy. It was at the end of verse number three when God spoke specifically to Jacob. He says at the end, and I will be with thee. And I will be with thee. He's not only rehearsing it for the purpose of informing them, but you know, when we rehearse the promises of God, we're also reminding ourselves of those very promises. And it's good for us to remind ourselves of the promises that God has given. Notice as we continue, it says in verse six,",
      "context": "... people of God today. That God says, I'm with you. I'm with you. And as Jacob is rehearsing back in Genesis 31, he says to Rachel and Leah, he says, listen, I know I can see that your father's countenance, Laba...",
      "sermon_title": "Sermon hMIOkmwPfzg",
      "url": "https://www.youtube.com/watch?v=hMIOkmwPfzg&t=1721",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}