{
  "reference": "Genesis 6",
  "occurrences": [
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 566.239990234375,
      "text": "mention a few. And there are many references to the heart. It's been defined as the seat of the affections and passions, the seat of the understanding, the seat of the will. You'll be mindful that it was God in Genesis chapter number 6, you don't need to turn there, but He's speaking to Noah and talking about the judgment that would come with regard to the wickedness God saw in verse number 5 of Genesis 6, that the wickedness of man was great in the earth and that every imagination of the thoughts of his heart was only evil continually. We think about this warning in Deuteronomy 11 and really we couple it with what Jeremiah proclaims in Jeremiah 17 in verse number 9 when he says, The heart is deceitful above all things, and desperately wicked. Who can know it? The answer is given in v. 10 of Jeremiah 17. I, the Lord, search the heart. I try the rains, even to give every man according to his ways and according to the fruit of his doing. But in the idea this evening that your heart be not deceived, we recognize that God is telling His people and telling us through preservation that the heart is deceitful above all things, and desperately wicked. Who can know it? He says that your heart be not deceived. It's interesting back in Deuteronomy 11 in v. 16 when He says that your heart be not deceived,",
      "context": "...lking about the judgment that would come with regard to the wickedness God saw in verse number 5 of Genesis 6, that the wickedness of man was great in the earth and that every imagination of the thoughts of hi...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=566",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 726.2199859619141,
      "text": "be as narrow as the Word of God is. Why? As a preacher from yesteryear said, never, or let me put it this way, this is how he said it, where God puts a period, don't put a question mark. What's he saying? Just trust God's Word. It's not necessary. Listen, God understood as He gave us the Word of God, He is the eternal God, Alpha and Omega, the first and the last, the beginning and the end. He understood the cultures and the various aspects of thoughts that human beings would have. It's nothing new. We see all the way back in Genesis 6, the reason that I use that passage of Scripture to talk about the heart being wicked, this idea of deception that began in the garden in Genesis chapter number three. And he says that we need to take heed to yourselves that your heart be not deceived. And the word means to be simple, to be naive, to be gullible, or to be open-minded. I understand that we're living in a time, in an era, in a generation, when it's popular that people are saying you just need to be open-minded. You need to consider other ways of thinking. You need to understand and consider other perspectives. Why would I leave the truth for something that's less than truth? It doesn't really make sense, does it? And so if God has given us the truth, and He has,",
      "context": "...ious aspects of thoughts that human beings would have. It's nothing new. We see all the way back in Genesis 6, the reason that I use that passage of Scripture to talk about the heart being wicked, this idea of...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=726",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}