{
  "reference": "Genesis 33",
  "occurrences": [
    {
      "sermon_id": "GWHY7Tnt1EI",
      "timestamp": 0.0,
      "text": "Genesis chapter 33, we had some extra specials tonight, I shared the situation there about love thy neighbor, so you listen fast, I'm going to preach fast, amen? And we got a fellowship over in the other room after the service, and a farewell fellowship for Jared. We're going to look at the entirety of Genesis 33 this evening, but it's only 20 verses, and so not too bad, and trust the Lord to help us here. I've titled the message, as you look at the back of the bulletin there, from verse number 11, the Bible says in verse 11, take, I pray thee, my blessing that is brought to thee, because God hath dealt graciously with me, and because I have enough, and he urged him, and he took it. I'm telling the message this evening, God hath dealt graciously with me. Of course, as we looked at Genesis chapter number 32, that long, life-altering night that we studied a couple of weeks ago, we find the reunion between Jacob and Esau would finally come to pass. As we have noted, Jacob is quite concerned about this reunion. We understand that Jacob has departed from Paddan Aram to go back to the land of his fathers at the instruction, as a result of the instruction of the Lord. God had given him the instruction to return, and Jacob was obedient to that instruction,",
      "context": "...room after the service, and a farewell fellowship for Jared. We're going to look at the entirety of Genesis 33 this evening, but it's only 20 verses, and so not too bad, and trust the Lord to help us here. I've...",
      "sermon_title": "Sermon GWHY7Tnt1EI",
      "url": "https://www.youtube.com/watch?v=GWHY7Tnt1EI&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "GWHY7Tnt1EI",
      "timestamp": 1290.9399795532227,
      "text": "God's grace right now that we're even here. And we recognize here this evening that God has been so good to us and Jacob, after he embraces his brother, he then explains God's blessing. In the next several verses we read of the journey that takes place, there's a departure that's documented and arrivals to different places. Notice it says in verse number 12, back in Genesis 33, and he said, let us take our journey and let us go and I will go before thee. And he said unto him, my Lord knoweth that the children are tender and the flocks and herds with young are with me and if men should overdrive them one day, all the flock will die. Let my Lord, I pray thee, pass over before his servant. Notice this phrase, and I will lead on softly. There's some wisdom in that. It's not the duration of the message this evening. But the thing of leading, and he says, I will lead on softly. He understood the state of his flock, according to verse number 13. By the way, Proverbs talks about that. He understood the state of his flock and he said, look, it's not good for me to overdrive them. It's not good for me to become in a place where we're vulnerable. And so he understood what was going on and he says, I will lead on softly, in the middle",
      "context": "...ture that's documented and arrivals to different places. Notice it says in verse number 12, back in Genesis 33, and he said, let us take our journey and let us go and I will go before thee. And he said unto him...",
      "sermon_title": "Sermon GWHY7Tnt1EI",
      "url": "https://www.youtube.com/watch?v=GWHY7Tnt1EI&t=1290",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}