{
  "reference": "Genesis 29",
  "occurrences": [
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 91.12000274658203,
      "text": "name of God and recognizing God's favor and God's blessing, and then the depth of carnality and the competition and how they began to compete one with another, and as we looked at these first eight sons, we noticed and left on a high note with son number four in verse number 35 of Genesis 29, that this son, his name was Judah, and here's what the Bible tells us, that here's what Leah said in verse number 35 of Genesis 29, \"'Now will I praise the Lord.' Therefore she called his name Judah and left bearing.'\" As we looked at that particular juncture of our text of Scripture and we mentioned how that she says, \"'Now will I praise the Lord.'\" Once again, she's acknowledging God as being Jehovah God. That reference was completely dismissed when she named Levi in verse number 34. There's no reference to God whatsoever, and here in verse 35 of Genesis 29, she's saying that she's going to praise the Lord Jehovah, and she called his name Judah, which literally means praise. I believe that her joy and praise, as I mentioned last week, would be in the Lord, that no longer would she be focused upon this conflict with Rachel, and what a joy and what a blessing. But we find that Rachel begins to implement some really worldly, carnal behavior because she sees that she has no children.",
      "context": "...ese first eight sons, we noticed and left on a high note with son number four in verse number 35 of Genesis 29, that this son, his name was Judah, and here's what the Bible tells us, that here's what Leah said ...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=91",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 713.8799743652344,
      "text": "found that in chapter number 29, the Bible taught us that she was barren and she longed to have children. And I think there's a great problem here where she was envying her sister. We mentioned that last week and how terrible envy is and we ought not be envious. We ought not have envy in our lives and we understand that that was her position at the beginning of the chapter. But as we come to the latter part here of Genesis chapter number 30 and looking at the birth of Joseph, we see that the Bible tells us that God remembered her, hearkened to her and had opened her womb. And the reality is that that envy that she had at the beginning of chapter 30 led to great strife. It led to just carnality and fleshly living. And if we're not careful, envy in our lives will result in the same type of behavior. I understand that the circumstances will be quite different than what they are here in Genesis 29 and 30. But it's amazing to me how there's this, when there's envy, there's this desire for vain glory. There's this desire for attention. There's this desire. And you see that between Rachel and Leah and I believe that it's so imperative that we can make that application in our lives. The Bible tells us in verse 23 of Genesis 30 that she conceived and bear a son. And notice what she says,",
      "context": "...of behavior. I understand that the circumstances will be quite different than what they are here in Genesis 29 and 30. But it's amazing to me how there's this, when there's envy, there's this desire for vain gl...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=713",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "8LNBaTbwuzM",
      "timestamp": 1189.739990234375,
      "text": "the Psalm this evening, but I want you to begin looking with me in verse number nine. He says, for all our days are passed away in thy wrath. We spend our years as a tale that is told. The days of our years are three score years and 10. And if by reason of strength, they be four score years. Yet is there strength, labor, and sorrow for to soon cut off and we fly away. Who knoweth the power of thine anger even according to thy fear. So is thy wrath. So teach us to number our days that we may apply our hearts unto wisdom I want you to look back in verse number 9 and I want you to consider that last phrase when he says we spend our Years as a tale that is told I want you to think about your story I want you to think this evening about Leah and Rachel and their story in Genesis 29 and 30 And I want you to think this evening if we can make Application and using this portion of scripture this evening to make application and to think about our own lives I want you to think about their story Because the Bible says that we live our life as a tale that is told Every day there's some Entry into our story The the story of our lives is being written as I think about it from a from a perspective of",
      "context": "...to think about your story I want you to think this evening about Leah and Rachel and their story in Genesis 29 and 30 And I want you to think this evening if we can make Application and using this portion of sc...",
      "sermon_title": "Sermon 8LNBaTbwuzM",
      "url": "https://www.youtube.com/watch?v=8LNBaTbwuzM&t=1189",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}