{
  "reference": "Genesis 13",
  "occurrences": [
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 872.4400024414062,
      "text": "consider this progression of worldliness, but I want you to be mindful of this, if I could use an illustration quickly from the book of Genesis. Notice back in Genesis chapter number 13, I'll say this, Lot didn't end up in Sodom overnight. Lot didn't end up in Sodom overnight. The Bible tells us in Genesis chapter number 13, in verse number 12, but even if you think about the context in the book of Genesis, it tells us in chapter 13 and verse number 7, there was a strife there between the herdmen of Abram's cattle and the herdmen of Lot's cattle, and the Bible tells us that the Canaanite and the Perizzite dwelt in the land at that time, according to Genesis 13 and verse number 7. Abram says that there should be no strife, and the instruction is given with regard to where they would go and how they would depart, and it tells us in verse number 12 of Genesis 13 that Abram dwelt in the land of Canaan, but it says this, that Lot dwelt in the cities of the plain, but notice this phrase, he pitched his tent towards Sodom. He pitched his tent towards Sodom. He's not in Sodom. He's just pitched his tent towards Sodom. The Bible tells us, if you consider the progression in chapter number 14, of course you read of the battle that takes place and how Abram is going to deliver Lot, but notice what the",
      "context": "...he Bible tells us that the Canaanite and the Perizzite dwelt in the land at that time, according to Genesis 13 and verse number 7. Abram says that there should be no strife, and the instruction is given with re...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=872",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 936.2799987792969,
      "text": "his tent towards Sodom. He's not in Sodom. He's just pitched his tent towards Sodom. The Bible tells us, if you consider the progression in chapter number 14, of course you read of the battle that takes place and how Abram is going to deliver Lot, but notice what the Bible tells us about this great battle. It tells us in verse number 12 of Genesis 14, and they took Lot, Abram's brother's son. Notice this phrase, who dwelt in Sodom, and his goods, and departed, and so Lot was now, in Genesis 13, he had pitched his tent towards Sodom, but now in Genesis chapter 14 and verse number 12, the Bible tells us that he dwelt in Sodom. As you continue through the book of Genesis, you come to the 19th chapter, and you find something very interesting in the first verse. Of course, in chapter 18, God had revealed to Abraham that he was going to destroy Sodom and Gomorrah because of their wickedness, but the Bible tells us that these angels come to the city of Sodom, and even in Genesis 19 and verse number 1, and I want you to notice that the Bible says that Lot sat in the gate of Sodom. He had some level of influence and some level of responsibility, perhaps even being a judge in the city at some level, and the Bible tells us that they, as these two angels came into",
      "context": "...'s son. Notice this phrase, who dwelt in Sodom, and his goods, and departed, and so Lot was now, in Genesis 13, he had pitched his tent towards Sodom, but now in Genesis chapter 14 and verse number 12, the Bibl...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=936",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}