{
  "reference": "Genesis 11",
  "occurrences": [
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 2403.7400512695312,
      "text": "to read of these genealogies and all of the the sons of Japheth and the sons of Ham and the sons of Shem and you read of all of these descendants and then we find at the end of chapter number 11 that the Bible gives us all the descendants of Shem, and it begins to provide us with all of these names and all of these years and all that's taken place, and we find that we come to this place where the Bible tells us in verse number 26 of Genesis 11, and Terah lived 70 years and begat Abram, Nahor, and Haran, and we find that it's at that point that the Bible begins to focus its attention on Abram, on Abraham. We find even as we studied and looked throughout the text of Scripture, beginning in those messages at that particular place in the book of Genesis, how that the Hebrew race and the promise that God had given with regard to the Lord Jesus Christ and the line, the messianic line, and all of the prophecies of Scripture, and we find how that the broadness of the scope of Genesis 10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just zeroes in on Abraham, and we read all of these chapters and all of these events of a hundred years of the life of Abraham. Remember it was that God said",
      "context": "... taken place, and we find that we come to this place where the Bible tells us in verse number 26 of Genesis 11, and Terah lived 70 years and begat Abram, Nahor, and Haran, and we find that it's at that point th...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=2403",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 2474.8600540161133,
      "text": "10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just zeroes in on Abraham, and we read all of these chapters and all of these events of a hundred years of the life of Abraham. Remember it was that God said this as we read Galatians, and just hold your place, yeah, just turn over to Galatians, you don't need to hold your place in Genesis anymore, but go over to Galatians, if you will, and I want you to know what God tells us here in the book of Galatians in chapter number 3, and we find again how the the attention of Scripture, the focus of Scripture from Abraham now shifting to Isaac, and we see this in Galatians 3 and verse number 16. Notice what the Bible says, \"...now to Abraham and his seed were the promises made.\" Notice what it says, \"...he saith not unto seeds, plural, as of many, but as of one, and to thy seed, which is Christ.\" We've mentioned in the past the phraseology of the title of a book that was written by William Scroggie, the unfolding drama of redemption, and we find how God, no doubt He could have given us all of the history of any of the other descendants that He chose to give us because He knows everything, but in His plan, in His plan of redemption, the Messianic line, the birth of",
      "context": "10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just zeroes in on A...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=2474",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "vrOSuRckXw0",
      "timestamp": 0.0,
      "text": "at this particular point in his life and the record that we have of his life. We find that the Bible tells us, beginning in the latter section of Genesis 11, about the way in which Abram departed from the Ur of the Chaldees, and he was following the direction of the Lord. And we find that the Lord appeared to Abram, and the Lord spake to Abram. And we've read a number of accounts already in which God tells us that he speaks with Abram. As we continue to journey through the biblical record of the life of Abram, and of course, in just a short period of time, his name will be changed to Abraham, and we often refer to him as Abraham. And we will find that there are many interactions between the Lord, God Almighty, and Abraham. And I'm so thankful when we read, and the Bible says that the Lord spake to Abram, and the Lord spoke to him. And we read that phraseology throughout the scriptures, not only with regard to Abraham, but others as well. And what a joy it is to know that God speaks to his children. We understand this evening that God is not speaking to us in an audible voice, like he did to Abraham and to many of the others that are written there within the Word of God. But I find that each time I open the Word of God,",
      "context": "...ecord that we have of his life. We find that the Bible tells us, beginning in the latter section of Genesis 11, about the way in which Abram departed from the Ur of the Chaldees, and he was following the direct...",
      "sermon_title": "Sermon vrOSuRckXw0",
      "url": "https://www.youtube.com/watch?v=vrOSuRckXw0&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}