{
  "reference": "Genesis 1",
  "occurrences": [
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 339.739990234375,
      "text": "about maybe the the Grand Canyon we speak about the Ice Age we talk about dinosaurs these things do not take millions or even billions of years I I believe that they simply require the right conditions and we dealt with that we talked about the the Grand Canyon we dealt with that we talked about the Ice Age and some of those conditions and I think that that's also pertinent here to our discussion this evening I have you there in the book of Genesis I want to read one verse to you from the New Testament in 1st Thessalonians 5 and then we'll get right back to Genesis chapter 1 but in 1st Thessalonians 5 in verse number 21 the Bible says this prove all things hold fast that which is good and let me just give you let me look at read a couple of verses of Scripture and then give you some common teaching with regard to dinosaurs and then give some biblical answers in Genesis 1 in verse number 24 the Bible says this and God said let the earth bring forth the living creature after his kind cattle and creeping thing and beast of the earth after his kind and it was so and God made the beast of the earth after his kind and cattle after their kind and everything that creepeth upon the earth after his kind and God saw that it was good we'll look at some",
      "context": "... then give you some common teaching with regard to dinosaurs and then give some biblical answers in Genesis 1 in verse number 24 the Bible says this and God said let the earth bring forth the living creature a...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=339",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 407.9800109863281,
      "text": "thing and beast of the earth after his kind and it was so and God made the beast of the earth after his kind and cattle after their kind and everything that creepeth upon the earth after his kind and God saw that it was good we'll look at some more verses here as we get through the lesson this evening but we find that here these verses in verse 24 and 25 are the first verses dealing with that which was created on day six of creation and we find that God is giving us information throughout the record of Genesis chapter 1 with regard to creation and one phrase that you'll find repeated we read it multiple times just in those two verses is this word kind after his kind after their kind and it's important that we understand that we dealt with that many many months ago actually a year and a half ago as we studied Genesis 1 in more detail in each day of creation with regard to dinosaurs specifically and answering the question what about dinosaurs let me just give you a few things that people will say common teaching common thoughts with regard to dinosaurs number one they'll say this dinosaurs reigned for a hundred and sixty five million years after evolving from some other type of reptile now rate at face value do you have any problems with that statement I got a couple of problems right away the",
      "context": "...nderstand that we dealt with that many many months ago actually a year and a half ago as we studied Genesis 1 in more detail in each day of creation with regard to dinosaurs specifically and answering the ques...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=407",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 714.9399948120117,
      "text": "dinosaurs because the word doesn't exist in the Bible, and so God doesn't know anything about it. That's just foolish. But the reality is that sometimes it will stop us dead in our tracks because you cannot find the word dinosaur in the Bible. I don't care what kind of concordance you have, it's not there, but it does not mean that God's Word doesn't deal with the subject matter of dinosaurs. And so let me answer just a few questions if I can. The first question I would ask by way of kind of teaching through this this evening would be this, where did dinosaurs come from? Of course, I'm sure you already know what my answer is, but let's look at what the Word of God says. Where did dinosaurs come from? Of course, we mentioned that they said that they reigned upon the earth for about 165 million years after evolving from reptiles, some other kind of reptile. We reject evolution, and therefore we would conclude that they had to have been created by God. The Word of God clearly states in multiple places, remember I mentioned to you that the the subject of creation is not isolated to Genesis 1. The subject of creation is found all throughout the Word of God, and we find that there are many references throughout the whole of the Bible that speaks of God being the creator of all things. And we find that God is the",
      "context": "...in multiple places, remember I mentioned to you that the the subject of creation is not isolated to Genesis 1. The subject of creation is found all throughout the Word of God, and we find that there are many r...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=714",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 776.1799926757812,
      "text": "creation is not isolated to Genesis 1. The subject of creation is found all throughout the Word of God, and we find that there are many references throughout the whole of the Bible that speaks of God being the creator of all things. And we find that God is the creator of all things, and we understand that as you read the record of Genesis chapter number 1, and we dealt with this in great detail, that this is a literal 24-hour day, a six-day creation. We find that God mentions to the children of Israel that in six days God made all things, and he repeats this throughout the Word of God. And the reference that I read in verses 24 and 25, that is the event of the creation on day number six, and you find that in verse number 25 that the Word of God says, and God made the beast of the earth after his kind. And so we find their cattle after their kind, everything that creepeth upon the earth after his kind, and God saw that was good. And we focus upon that statement, it says God made the beast of the earth after his kind. Admittedly, the Word is not dinosaur. Again, to reference what I said a moment ago, the Word did not exist, and therefore we would not expect to find that Word in the Word of God. But we remember, and we're mindful of the fact",
      "context": "creation is not isolated to Genesis 1. The subject of creation is found all throughout the Word of God, and we find that there are many r...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=776",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 940.6600036621094,
      "text": "Word of God. Now, when we think about God creating these dinosaurs on day number six, as we look at verses 24 and 25, we will remember to answer the question where they say that man and dinosaur did not dwell on the earth at the same time. Remember they mentioned that there's 65 million years after the extinction, if you will, of dinosaurs, that man came upon the earth. Well, the Bible continues in verse number 26 of Genesis 1, and says, and God said, let us make man in our image after our likeness, and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. Verse 27, so God created man in his own image, and the image of God created he him, male and female created he them. God blessed them, and God said unto them, be fruitful and multiply, replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth, including dinosaurs. All right, that's what God says. He doesn't say including dinosaurs, I'm saying that's what he's saying, because he says every living thing that moveth upon the earth, that would be inclusive of dinosaurs, and therefore we",
      "context": "...u will, of dinosaurs, that man came upon the earth. Well, the Bible continues in verse number 26 of Genesis 1, and says, and God said, let us make man in our image after our likeness, and let them have dominio...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=940",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 2099.239990234375,
      "text": "life expectancy of mankind and you see the way in which man, very quickly, their life expectancy decreases after the flood and you begin to see the impact of the climate and so we see that lifespan decreases. Think about the vegetation changes, right? And so what is the vegetation? Well, that's a source of sustenance for these animals and you understand that. You think about the ice age. We dealt with a whole lesson on the ice age. Well, what kind of an impact did the ice age have upon the dinosaurs? Some animals, no doubt, as they came off the ark and they began to deal with some of the climatic changes that were so much drastically different, the oxygen levels in the atmosphere are different than they were pre-flood and just so many variables and you say, okay, how did all of these things impact the ability for certain animals to live? And how did it cause those things to happen? And so we look at that and we find that all of these factors would contribute to an eventual extinction of dinosaurs. I would also say this. The reality is that the animal-human interaction differed greatly post-flood. Pre-flood, there was a way in which God had given the instruction, as you look in Genesis 1 and we read it earlier, when God created man, he was to have dominion over, right? And there was this certain level of interaction,",
      "context": "...eatly post-flood. Pre-flood, there was a way in which God had given the instruction, as you look in Genesis 1 and we read it earlier, when God created man, he was to have dominion over, right? And there was th...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=2099",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 2170.4200134277344,
      "text": "is that the animal-human interaction differed greatly post-flood. Pre-flood, there was a way in which God had given the instruction, as you look in Genesis 1 and we read it earlier, when God created man, he was to have dominion over, right? And there was this certain level of interaction, if I can use that terminology this evening, of how man and animal would interact with each other. But after the flood, all of those things changed. We understand that one day, there's going to be in the millennial kingdom of Christ, there's going to be a change into the animal kingdom as well and how man interacts with animals and so on and so forth and you see that. You read in Isaiah some of those things that God gives us with regard to the millennial reign of Christ. And so that difference in the interaction between these that would now leave the ark and go to inhabit the earth, you think about the way in which the Tower of Babel is described in chapter number 11 of the book of Genesis and how those people eventually, after their language was changed, how they departed and spread out, no doubt they would come in contact with dinosaurs. And what would they do? How would that interaction be? And we find there are plenty of historical events and evidences, if you will, that would refer to various encounters that individuals had with these dragons or these dinosaur-like creatures.",
      "context": "...eatly post-flood. Pre-flood, there was a way in which God had given the instruction, as you look in Genesis 1 and we read it earlier, when God created man, he was to have dominion over, right? And there was th...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=2170",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 1930.7599487304688,
      "text": "just wanted to bring it to you. And I'm like, thank you very much. Just trying to, just wagging it around, right? Listen, the Bible is a precious book. You say, Pastor, you're gonna get a new one. I understand but it's my Bible. It's my Bible. I love the Bible. I love the Bible. This book is like no other book. It has absolutely changed my life. And those of you here this morning that have read this book, you know that this book is like no other book. You know the impact and the difference that this book has made in your life. I'm reading through the Bible for a second time right now. I personally like to read in Genesis and go through Revelation and start back in Genesis and go to Revelation and start back. That's just what I like to do. Near the end of the year, depending on what the time of the month is when I finish Revelation for a, whatever the time is that I finish it in that calendar year, depending on the number of days or months left in the year, I might just read the New Testament and then I'll start on January 1st in Genesis 1. It's just what I do. The last few days I've been reading Leviticus. Right now I'm reading Deuteronomy. It's exciting. I know that numbers is in between those two books. I understand that. But I bring up",
      "context": "... months left in the year, I might just read the New Testament and then I'll start on January 1st in Genesis 1. It's just what I do. The last few days I've been reading Leviticus. Right now I'm reading Deuteron...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=1930",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nKp9POTWPKI",
      "timestamp": 2004.0799407958984,
      "text": "the New Testament and then I'll start on January 1st in Genesis 1. It's just what I do. The last few days I've been reading Leviticus. Right now I'm reading Deuteronomy. It's exciting. I know that numbers is in between those two books. I understand that. But I bring up Leviticus because so many people criticize the book of Leviticus. Let me give you just a moment of insight with regard to the book of Leviticus. The book of Exodus is exciting because it records for us how God delivered His people out of Egyptian bondage. And it's exciting to read the book of Exodus. I had regularly, I admit that. I willingly admit that the book of Exodus is exciting. I mean, you start reading about the Red Sea, you read about all the plagues, you read about the Red Sea, man, it's exciting. You end the book with the tabernacle being reared up and the presence of God being there. I mean, it's exciting. You come to the book of Leviticus, you start reading all this stuff. You say, what in the world is going on here? Two quick takeaways. Number one, Moses was a faithful minister. God gave Moses truth for the people and Moses delivered the truth to the people. But let me tell you what the book of Leviticus is really all about. See, God got His people out of Egypt. But in the book of Leviticus, God has to get",
      "context": "the New Testament and then I'll start on January 1st in Genesis 1. It's just what I do. The last few days I've been reading Leviticus. Right now I'm reading Deuteron...",
      "sermon_title": "Sermon nKp9POTWPKI",
      "url": "https://www.youtube.com/watch?v=nKp9POTWPKI&t=2004",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 2168.8599548339844,
      "text": "that is applicable to all of scripture, it's only found in the way that it's given to us here in the book of Revelation. In other words, in this concise statement. Notice what the Bible says in verse number three. Blessed is he that readeth. Blessed is he that readeth. Now let me ask you, is that singular or plural? It's singular. Blessed is he that readeth. So in other words, when I come to verse number three, here's what I'm understanding that God is seeking to communicate to us as his people, that as individual believers, I ought to read the book of Revelation. Not only the book of Revelation, but the whole of scripture, because there's a blessing in reading the word of God. And so we find that he says, blessed is he that readeth. You know, there are some denominations that absolutely flat out ignore the entire book of Revelation. It's as if it's not even part of the Bible. But it's in this book in the opening statements that say, blessed is he that readeth. And so there's an expectation that God communicates to me, and I hope to you this evening, that God expects his people to read his word. Yes, the book of Revelation, as it's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it stop there?",
      "context": "... of Revelation, as it's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=2168",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 2247.2599487304688,
      "text": "God expects his people to read his word. Yes, the book of Revelation, as it's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it stop there? Notice, and they, now that's plural, that hear the words of this prophecy. Now, that's kind of interesting, because it's the blessed is he that readeth, so that's an individual reading, but then it says, and they, plural, that hear the words of this prophecy. Now, how do you hear the words of the prophecy? Somebody else publicly reading it or preaching it, right? That's how, you're hearing it tonight, because I'm reading it, so you're hearing it. Now, you're following along in your Bible, so you're getting a double blessing, amen? You're reading it and you're hearing it, praise the Lord. And it says, so again, if the expectation in verse number three in the beginning part of the verse is that God's people would read it, the expectation also is that the people of God would gather together and hear the word of God. You ever read the book of Ezra? Man, they gathered together for a big part of the day. Why? To hear the word of the Lord. He stood up on a pulpit of wood, amen? And he just read. Now, they confessed, but they read publicly. The reading of God's word is so important.",
      "context": "... of Revelation, as it's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=2247",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 1374.6399993896484,
      "text": "walk. And I was a little bit apprehensive. Pierre, they told me there were rattlesnakes there. And so you're walking at night and I'm kind of, you know, I'm looking down instead of up. But you just got to a point where you began to look up into the heavens. And it's like, man, you don't see stars like this around the big cities. And God says, now think about when this is being written several thousand years ago, right? Abram is there and God says, look toward heaven and tell the stars if thou be able to number them. Have you ever tried to count the stars? There are people that have attempted to do such tasks. The reality is that they're numberless. The reality this evening is that we're mindful of what God said to us in Genesis, and I love it, in Genesis 1-16, where the last five words of the verse of Scripture says He made the stars also. And in making these stars, He made an innumerable host of stars and He spread them through the heavens and through the galaxies. And we find here this evening that Abram is taken by God and He leads them out and He says, Abram, I want you to look toward heaven. And He says, Abram, tell the stars if thou be able to number them. And He said unto him, God is speaking to Abram and He says unto him, so shall thy seed be. Wow.",
      "context": "...The reality this evening is that we're mindful of what God said to us in Genesis, and I love it, in Genesis 1-16, where the last five words of the verse of Scripture says He made the stars also. And in making ...",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=1374",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1865.4400024414062,
      "text": "with the fact that the Bible is pure and also deals with the truth that we mentioned about verbal plenary inspiration. The Bible says this in Proverbs 30 and verse number 5, every word of God is pure. He is a shield unto them that put their trust in Him. The psalmist says this in Psalm 119 and verse number 140, thy word is very pure, therefore thy servant loveth it. Whew, man, it's a pure book. Everything that is contained within the pages of this Bible from Genesis 1-1 through Revelation 22-21, it is absolutely pure in everything that is contained therein. And we look at the Bible and we understand that the Bible says that all Scripture is given by inspiration of God. And because it is the word of God, it's pure. There are some that say they don't agree with what God's word is. So then they have difficulty with what God's word says because they don't agree with what God's word is. We talk about the word of God being pure, the Bible being pure. It is pure in all that it records. The record that is provided is reliable. It is trustworthy. How do we know what happened? We dealt with Hezekiah a couple of weeks ago. How do we know what Sennacherib and Rabshakeh really said? How do we know if it's true? How do we know if Hezekiah didn't just make something up, if Isaiah was just making something up?",
      "context": "...h it. Whew, man, it's a pure book. Everything that is contained within the pages of this Bible from Genesis 1-1 through Revelation 22-21, it is absolutely pure in everything that is contained therein. And we l...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1865",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 1671.9000244140625,
      "text": "say proving. It's that work, and we dig into the Scriptures, and we're seeking to prove what is acceptable unto the Lord. What is well-pleasing to God? Well in our journey of doing this, as we have the opportunity to go through and to study the Scriptures, we have many examples that God has given us with regard to things that please Him and things that do not please Him. In fact, there's a great example of something that does not please Him. We mentioned already in Romans 8 about walking in the flesh, but notice, if you will, in 1 Corinthians chapter number 10. In 1 Corinthians chapter number 10, the Bible tells us, as God is using Paul to minister to these believers in Corinth, and he's going back to the Old Testament and says, in fact, in the text of Scripture that the things that were written aforetime are written for our admonition. I'm so thankful that God chose to preserve the Old Testament. The Old Testament, listen, all Scripture is given by inspiration of God. That means from Genesis 1-1 to Revelation 22-21, amen? All of it is inspired by God, and it is profitable. So I don't, a certain portion of the Scripture, I don't like reading. You ought to get that right with the Lord, amen? Because it's God's Word to you, and He has preserved it for a reason, and Paul says it was written for our admonition. The things that he",
      "context": "...Testament. The Old Testament, listen, all Scripture is given by inspiration of God. That means from Genesis 1-1 to Revelation 22-21, amen? All of it is inspired by God, and it is profitable. So I don't, a cert...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=1671",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "i0tgIGEcUCc",
      "timestamp": 1473.4800415039062,
      "text": "the Lord Jesus Christ and took Him to the cross of Calvary? Do the disciples think so? They were confused. In fact, Peter, did he not try to stop the Lord Jesus Christ from going? Not so, Lord! That's what Peter said. He was as in much control at Calvary as he was at creation. As much control. At creation in Genesis 1 when God said let there be light and there was light. And He had His power on display and He was in full control. He was as much in control at Calvary as He was at creation. Because God makes no mistakes. And God knew what He was doing. And the reality is that the Lord Jesus Christ, He had to go to that cross of Calvary so that He could pay for your sin and for my sin. We understand that in the book of Luke when God records for us when those disciples are walking back on the road of Emmaus and they're downhearted. I mean, they are struggling and their countenance is sad that Jesus comes along them and is walking with them. And He says, why is it that your countenance is sad? And they say, are you just a stranger in Jerusalem? You don't know what's happened? They were going home not because they thought God was in control. They were perplexed. We thought it had been Him. That's what they say. What does Jesus do? He begins to talk to them.",
      "context": "...r said. He was as in much control at Calvary as he was at creation. As much control. At creation in Genesis 1 when God said let there be light and there was light. And He had His power on display and He was in...",
      "sermon_title": "Sermon i0tgIGEcUCc",
      "url": "https://www.youtube.com/watch?v=i0tgIGEcUCc&t=1473",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "timestamp": 785.2799835205078,
      "text": "nature, co-equal in power and in glory. Jesus was not created. He always has been, okay? He's God. The Holy Ghost was not created. He always has been. He's God. And so as we begin to understand the truth of the Word of God, we come to the first page of the Bible, Genesis 1 and verse number 1. And the Bible tells us as we read the Word of God, in the beginning, God created the heaven and the earth. Now we understand this is not the beginning of eternity. We understand this is the beginning of creation, as God would give us a record of the creative work that He did here in the book of Genesis. And we find that He says in the beginning, God created the heaven and the earth. We've often said that God does not seek to prove His existence. He simply declares that He exists. In fact, the name Jehovah means self-existent one. And that's the God that we serve. But here, when the Bible says in the beginning, God created the heaven and the earth, it's not the word Jehovah. The Hebrew word that is used here in Genesis 1 and verse number 1 for God is a word that is used regularly throughout the Old Testament referring to God. It's the word Elohim. We think about the word Elohim, we find that here, this truth that is given to us with regard to Elohim, the strong one.",
      "context": "... so as we begin to understand the truth of the Word of God, we come to the first page of the Bible, Genesis 1 and verse number 1. And the Bible tells us as we read the Word of God, in the beginning, God create...",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE&t=785",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "timestamp": 855.1599731445312,
      "text": "Genesis 1 and verse number 1 for God is a word that is used regularly throughout the Old Testament referring to God. It's the word Elohim. We think about the word Elohim, we find that here, this truth that is given to us with regard to Elohim, the strong one. It's very interesting because Elohim is a plural noun, but here the verb is singular. And again, revealing to us this truth, this teaching, this concept, if you will, of God being revealed in three distinct persons. And we find that it's quite interesting. Turn to the book of Deuteronomy, if you will. We'll be back to Genesis here in just a moment, but turn to the book of Deuteronomy, if you will, in chapter number 6. Deuteronomy 6 and verse number 4 is a very familiar verse of Scripture, especially amongst the people of Israel, the children of Israel. This is a verse, a portion of Scripture that would have been very familiar to them, especially the fourth verse here, Deuteronomy 6 and verse number 4. In Deuteronomy 6 and verse number 4, the Bible says, Here, O Israel, the LORD our God is one LORD. Now, you see LORD twice in that verse of Scripture, and it's all caps, right? And your Bible's all caps, and so what does that teach us? It reveals to us it's speaking of Jehovah, right? And so the LORD Jehovah, our God, Elohim, is one Jehovah.",
      "context": "Genesis 1 and verse number 1 for God is a word that is used regularly throughout the Old Testament referring ...",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE&t=855",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "timestamp": 925.3999938964844,
      "text": "is one LORD. Now, you see LORD twice in that verse of Scripture, and it's all caps, right? And your Bible's all caps, and so what does that teach us? It reveals to us it's speaking of Jehovah, right? And so the LORD Jehovah, our God, Elohim, is one Jehovah. And again, we're seeing that plural aspect with the singular. And what is God revealing to us? Again, He's revealing to us this truth of the Trinity that God is revealed in three distinct persons, the Father, the Son, and the Holy Ghost. And we see that as we study the Word of God, that this truth or this teaching of the Trinity is really revealed to us even in the Old Testament. We find the fullness as we read the entirety of the Word of God, of course, and compare Scripture with Scripture. But notice in Genesis, I said that we'd be back there. In Genesis chapter number 1, I want you to notice as we go through the days of creation, how that the Trinity is revealed here in the Old Testament. I'll give you three examples of the Trinity being revealed in the Old Testament. In Genesis 1, in verse number 26, we find that God is going to reveal to us the creation of man. So the first example of the Trinity being revealed in the Old Testament is with regard to the creation of man.",
      "context": "... Old Testament. I'll give you three examples of the Trinity being revealed in the Old Testament. In Genesis 1, in verse number 26, we find that God is going to reveal to us the creation of man. So the first ex...",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE&t=925",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "timestamp": 984.5199890136719,
      "text": "the Trinity being revealed in the Old Testament. In Genesis 1, in verse number 26, we find that God is going to reveal to us the creation of man. So the first example of the Trinity being revealed in the Old Testament is with regard to the creation of man. The Bible says this in verse number 26, and God said, let us, God said, let us make man in our image after our likeness, and let them, the man that He's going to create, let them have dominion over the fish of the sea, over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. So God created man in His own image. In the image of God created He Him, male and female created He them. And so we find that even here in creation, when we speak about the creation of man, Adam of course, we find here that it says, let us make man in our image. Again, it's not a polytheistic view. We understand the truth of the Trinity, that there's one God revealed in three distinct persons. Notice again in Genesis chapter 11, you skip forward several chapters and you find what's taking place here in Genesis chapter 11, the Tower of Babel, and we find that here, not only do we see it in the creation of man, but now also in the confounding of the languages",
      "context": "the Trinity being revealed in the Old Testament. In Genesis 1, in verse number 26, we find that God is going to reveal to us the creation of man. So the first ex...",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE&t=984",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cndo5VpvDZo",
      "timestamp": 655.7400016784668,
      "text": "here in Colossians 1, in verse 15 and following, you find that the Apostle Paul, under the inspiration of the Holy Spirit of God, gives us a portrait of Jesus Christ that is like no other in all of the Scriptures. We find in just a few verses of Scripture, He exalts Him in such an amazing way. We're thinking this morning at this point that He is Creator. Notice in verse number 15, who is the image of the invisible God, the firstborn of every creature, for by Him were all things created that are in heaven and that are in earth, visible and invisible, whether they be thrones or dominions or principalities or powers, all things were created by Him and for Him. Aren't you thankful that He's the Creator? Indeed, when you think about creation, we understand this morning that there's all kinds of debates with regard to creation, and we understand this morning that the enemy wants to deny the Creator because if they can deny the Creator, they deny their responsibility to God. We see that in Romans 1, but indeed, the Word of God, it's not just exclusive to Genesis 1-3, dealing with creation. We find the record of creation all throughout the Scriptures, and we find that He is the Creator. He is the Creator. He is the sustainer. In Hebrews 1 and verse number 3, the Bible tells us this great truth with regard to not only the creative work of God",
      "context": "...onsibility to God. We see that in Romans 1, but indeed, the Word of God, it's not just exclusive to Genesis 1-3, dealing with creation. We find the record of creation all throughout the Scriptures, and we find...",
      "sermon_title": "Sermon cndo5VpvDZo",
      "url": "https://www.youtube.com/watch?v=cndo5VpvDZo&t=655",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}