{
  "reference": "Genesis 12",
  "occurrences": [
    {
      "sermon_id": "UJuC0OTu5_I",
      "timestamp": 678.4800262451172,
      "text": "And if I were to look at verses 7 and 8 this evening, I would look at those as really being a eulogy. And you think about the eulogy that would be given, and obviously the length of eulogy here is quite short, but we find that God gives us some very interesting things with regard to the life of Abraham. We find that he is 175 years old, according to verse number 7, and we find that he walked with the Lord for a hundred years. That's a lengthy period of time. You think about that, if you go all the way back to Genesis 12, as I mentioned by way of introduction, that God calls Abram, and he calls him from the Ur of the Chaldees, and over the next 100 years from that initial response, that call that God gave to Abram in Genesis chapter number 12, all that we've read in all of these chapters, and watching Abraham grow and develop, and thinking about the increase of his faith, and how God was revealing himself to Abraham, and how wonderful that is. We begin to reflect on our own lives, and we think about the journey that we're on, and we understand that no one's having a funeral service this evening, but we begin to think about when was it that we started walking with God, and however many days God would give us the length of our life, and to consider the opportunity that",
      "context": "...hundred years. That's a lengthy period of time. You think about that, if you go all the way back to Genesis 12, as I mentioned by way of introduction, that God calls Abram, and he calls him from the Ur of the C...",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I&t=678",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 289.7799987792969,
      "text": "few verses, the plan of God that is being once again spoken to Abraham with regard to these things that would come to pass with regard to this covenant that God is making with Abraham, and we find the first aspect of what God will deal with is the seed. We focused on this as we've studied in Genesis 12 and in Genesis 15, but you notice that the Bible says this in verse number 4, \"...as for me, behold, my covenant is with thee, and thou shalt be a father of many nations. Neither shall thy name any more be called Abram, but thy name shall be Abraham. For a father of many nations have I made thee, and I will make thee exceeding fruitful, and I will make nations of thee, and kings shall come out of thee. And I will establish my covenant between me and thee, and thy seed after thee in their generations.\" Notice, \"...for an everlasting covenant, to be a God unto thee, and to thy seed after thee.\" We tend to think about the plan that God is revealing to Abraham, and we understand the seed that is referenced, and we'd say this as we look at this portion of Scripture, there's one aspect with regard to the physical or natural seed, the descendants of Abraham, if you will, and we'd understand that here in this passage, and of course in a few chapters",
      "context": "...ind the first aspect of what God will deal with is the seed. We focused on this as we've studied in Genesis 12 and in Genesis 15, but you notice that the Bible says this in verse number 4, \"...as for me, behold...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=289",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 566.6199951171875,
      "text": "children of Abraham. We'd find that all mankind needs to be redeemed, that there are but two categories of people in our world. There are those that have been born again, those that are saved, and there are those that are yet to be born again, those who are lost. And we'd find that all come by the way of the cross, and it does not matter what your heritage or lineage is, it does not matter where you grew up or what your parents were. God, as one preacher said, has no grandchildren. He only has children. And I'm thankful for the truth that God gives us, and we think about the plan of God being revealed and the seed that is mentioned in verses 2-7, again back in Genesis 17, in verse 8, we'll find the focus now shifts to the land, to the land, and this again is truth been revealed to us already in Genesis 12 and 15, again, the reaffirmation of this covenant. Verse number 8, it says, Now I will give unto thee, and to thy seed after thee, the land wherein thou art a stranger, all the land of Canaan, for an everlasting possession, and I will be their God. So God, once again, as He's giving this plan to Abraham, as He's speaking to Abraham, the Bible says that God talked with him, and Abraham, his posture is that he fell on his face, and",
      "context": "...e focus now shifts to the land, to the land, and this again is truth been revealed to us already in Genesis 12 and 15, again, the reaffirmation of this covenant. Verse number 8, it says, Now I will give unto th...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=566",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 1054.5999755859375,
      "text": "in Genesis chapter number 17. Notice with me the plea. In verse 17, well, let me continue reading. In verse number 14, we read about those that disobeyed and did not follow in circumcision and the consequence. In verse 15, \"...and God said unto Abraham, Ask for Sarai thy wife. Thou shalt not call her name Sarai, but Sarah shall her name be. And I will bless her, and give thee a son also of her, yea, I will bless her, and she shall be a mother of nations. Nations of people shall be of her.\" So we find that God gave the plan. He spoke to Abraham about the seed, about the land. He changed Abram's name from Abram to Abraham. He changed Sarai's name from Sarai to Sarah. He gave him the token of the covenant, that of circumcision. And we find that God is, once again, interested in communicating to Abraham the plan. Now it's interesting to note, you could ask the question, why is it that God is rehearsing these things? Had God not already told Abraham that these things would happen? Absolutely. But there were some things that happened between Genesis 12, 15, and 17, and one of the most significant things that happened is what's recorded in chapter number 16 with the birth of Ishmael. And we find that, as we've mentioned, that God has given to Abraham this promise all",
      "context": "...braham that these things would happen? Absolutely. But there were some things that happened between Genesis 12, 15, and 17, and one of the most significant things that happened is what's recorded in chapter num...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=1054",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 1120.239990234375,
      "text": "But there were some things that happened between Genesis 12, 15, and 17, and one of the most significant things that happened is what's recorded in chapter number 16 with the birth of Ishmael. And we find that, as we've mentioned, that God has given to Abraham this promise all the way back in Genesis chapter number 12 about a seed, and yet now as we look at the passage in which we're in, remember, at the close of Genesis chapter number 16 until the beginning, the opening of Genesis chapter number 17, 13 years pass. Now 13 years is a long time. He was 86 when Ishmael was born, and he's 99 in verse number 1 when the Lord appears to him. Thirteen years. It's a lengthy period of time. So God is reaffirming that which He had promised, and we see the plan. Notice the plea. Verse 17, \"'Then Abraham fell upon his face and laughed and said in his heart, Shall a child be born unto him that is an hundred years old, and shall Sarah that is ninety years old bear?' Notice what Abraham says in verse 18, \"'And Abraham said unto God, O that Ishmael might live before thee.'\" There's much division perhaps is a good word, disagreement maybe is a better word actually. There's much disagreement amongst theologians with regard to Abraham laughing here in Genesis chapter number 17. There are some that will say that Abraham laughed out of joy.",
      "context": "But there were some things that happened between Genesis 12, 15, and 17, and one of the most significant things that happened is what's recorded in chapter num...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=1120",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 510.239990234375,
      "text": "before I look at this, what God had said, it's interesting that God reveals to us in chapter number 11 and verse number 30, but Sarah was barren, she had no child. And God gives us that information so that we understand the circumstances in which they were dealing with. She was barren, they had no children, but in Genesis 12, after God calls Abraham, Abram at that time, to leave the earth, the Chaldees, we find that in verse number 7 of Genesis 12, the Bible says, and the Lord appeared unto Abram and said, unto thy seed will I give this land, and there builded he an altar unto the Lord who appeared unto him. What is God saying to Abram? He's saying, listen, unto thy seed will I give this land. Well, Abram has no seed at this particular time, and so God is no doubt understanding the promise that he's made and that he would reiterate to Abraham with regard to this child, this seed, and here to the land. Notice if you will, in chapter number 13 and verse number 16. In chapter number 13, we read of the separation of Lot and Abraham. Of course, there was a strife between the herdmen of Abram's cattle and the herdmen of Lot's cattle, and we find that it's in this portion of Scripture in which Lot determined that he would take that section, that place, that was well-watered and was pleasant to",
      "context": "...and the circumstances in which they were dealing with. She was barren, they had no children, but in Genesis 12, after God calls Abraham, Abram at that time, to leave the earth, the Chaldees, we find that in ver...",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=510",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 1509.1999816894531,
      "text": "in 1st Samuel 15, to obey is better than sacrifice. What happens when Samuel comes, God tells Samuel that Saul has disobeyed, he's to kill the Amalekites, right? And what happens, he comes and Samuel shows up and he says, I have obeyed the voice of the Lord, but he disobeyed. It was partial obedience, and God places a premium on obedience. And so in verses 1 and 2, as we look at, excuse me, verses 1 through 4, when we look at this account that is given to us of the birth of Isaac, we find it in the first two verses that there are three statements that are made that remind us and reveal to us the faithfulness of God. In verses 3 and 4, there are two actions that are recorded for us that remind us and reveal to us the obedience of Abraham, and I'm so thankful for his obedience. We find that in verses 5 through 7, the Bible says, and Abraham was a hundred years old when his son Isaac was born unto him, I said, and dealt with that by way of introduction, the 25 years that had passed from Genesis 12, when Abram was called out of the Ur of the Chaldees to begin following the Lord. He went out not knowing whither he went, yet he obeyed, and we find that now he's a hundred years old. And Sarah, the Bible",
      "context": "...orn unto him, I said, and dealt with that by way of introduction, the 25 years that had passed from Genesis 12, when Abram was called out of the Ur of the Chaldees to begin following the Lord. He went out not k...",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=1509",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 1567.1999816894531,
      "text": "the 25 years that had passed from Genesis 12, when Abram was called out of the Ur of the Chaldees to begin following the Lord. He went out not knowing whither he went, yet he obeyed, and we find that now he's a hundred years old. And Sarah, the Bible then gives us this statement that Sarah makes in verses 6 and 7. She says, God hath made me to laugh. No doubt she has in her mind that which happened in chapter number 18. God hath made me to laugh, so that all that hear will laugh with me. And she said, Who would have said unto Abraham that Sarah should have given children suck? For I have born him a son in this old age. Who but God? Amen? No person is going to say you're going to have a child at this age. They were past that point, but God had given the promise. As we look at this passage of Scripture, I really want to think about a couple of things this evening that I hope would be a blessing and encouragement to you. Number one, waiting on the Lord isn't always easy. How many of you like to wait? Nobody. No one likes to wait. I had to run to Aldi this afternoon to get a couple of things real quick. Not a good idea on Sunday afternoon. Just tuck that away somewhere. Next time you're at Aldi on Sunday afternoon, you'll remember that pastor",
      "context": "the 25 years that had passed from Genesis 12, when Abram was called out of the Ur of the Chaldees to begin following the Lord. He went out not k...",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=1567",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 648.2199745178223,
      "text": "the Lord had said unto Abram, get thee out of thy country and from thy kindred and from thy father's house unto a land that I will show thee, and I will make of thee a great nation, and I will bless thee, and I will make thy name great, and thou shalt be a blessing. No doubt from verse number two of Genesis chapter number 12 that Abram would understand that there would be a son, a child that would be given when God says, I will bless thee, I will make of thee a great nation. Verse number seven, and the Lord appeared unto Abram and said unto thy seed will I give this land. And there builded he an altar unto the Lord who appeared unto him. We find that God gives him this promise in verse number seven of Genesis 12, and he says this, he says unto thy seed will I give this land. Abram builds an altar, he worships the Lord, he responds in proper manner, but yet we find that this promise that is given in verse number seven of chapter number 12, when we come to chapter 15, Abram's saying it's not happened yet. We find that in chapter number 13, look there in verses 15 and 16, it's repeated what we just read in Genesis 12 and verse number seven. Here in Genesis 13 and verse number 15, the Bible says for all the land which thou seest,",
      "context": "...to the Lord who appeared unto him. We find that God gives him this promise in verse number seven of Genesis 12, and he says this, he says unto thy seed will I give this land. Abram builds an altar, he worships ...",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=648",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 717.4799728393555,
      "text": "saying it's not happened yet. We find that in chapter number 13, look there in verses 15 and 16, it's repeated what we just read in Genesis 12 and verse number seven. Here in Genesis 13 and verse number 15, the Bible says for all the land which thou seest, to thee will I give it, notice the next phrase, and to thy seed forever. Now you'll remember with me as we study Genesis chapter number 13, that here is the division between Abram and Lot. Remember there was some discord, there was some contention, some strife between the herdmen of Abram's cattle and the herdmen of Lot's cattle. And Abram says listen, this isn't good for us and we need to separate. He tells Lot you go ahead and you pick and Lot picks and he goes towards Sodom. We see and we understand that. And the Bible tells us that the men there were wicked and sinners before the Lord exceedingly. And Abram, he took that which was left, he took that land and he had given the option to Lot. We find here that God then speaks to Abram beginning in verse number 14. And the Lord said unto Abram after that Lot was separated from him and you notice what he says, that he was going to give him the land and to thy seed forever. Notice what he says in verse number 16. And I will make thy seed as the dust of the earth.",
      "context": "... find that in chapter number 13, look there in verses 15 and 16, it's repeated what we just read in Genesis 12 and verse number seven. Here in Genesis 13 and verse number 15, the Bible says for all the land whi...",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=717",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6jkKQL6IlWQ",
      "timestamp": 2073.97998046875,
      "text": "in verse number seven, to give this land, to give thee this land to inherit it. And so God then answers that request that Abram made at the beginning of our study this evening. He passes through giving Abram the sign that this is the sign, I've made this covenant, this promise with you that I now am telling you I have given this land to your seed. Now it's interesting because now we're speaking in terms that it's already settled. It says unto thee have I given this land. Prior to this verse of Scripture, everything that is spoken of with regard to the land is spoken of in future. I'm going to give this to you. Now he says I have given you this land. Notice with me, turn back if you will to chapter number 12. We did this last week as we looked at the promise with regard to the seed, but look at it now as the passage in Genesis 15 shifts from seed to land. We find in verse number seven of Genesis 12, the Bible says, and the Lord appeared unto Abram and said, unto thy seed will I give this land. That's future, correct? Will I give this land? And there builded he an altar unto the Lord who appeared unto him. Abram then responded to that promise by worshiping the Lord. We see in chapter number 13, look in verse number 15. This is after the division between Abram and Lot.",
      "context": "...k at it now as the passage in Genesis 15 shifts from seed to land. We find in verse number seven of Genesis 12, the Bible says, and the Lord appeared unto Abram and said, unto thy seed will I give this land. Th...",
      "sermon_title": "Sermon 6jkKQL6IlWQ",
      "url": "https://www.youtube.com/watch?v=6jkKQL6IlWQ&t=2073",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6jkKQL6IlWQ",
      "timestamp": 2358.8800048828125,
      "text": "as we studied through the 15th chapter of the book of Genesis over these last few weeks and really over the last few chapters of the book of Genesis that this promise has been given to Abram and it's a seed and it's a land and we focus upon that seed and we see that as Christ. Now you understand as you go from this portion of scripture in Genesis 12 through 15 and look at how God zeros in. Remember he starts in Genesis with creation. He looks at the creation of man, all of the different groups of people. You see the tower of Babel, the spreading of the people and so on and so forth. And then God zeros in upon Abram and the Hebrew people and that will be the direction in which the book of Genesis and really all of scripture begins to travel. There are references that are provided to us with regard to other people groups as they interact with God's people. But why? What's the significance? Well, that's the seed. That's where Messiah would come from. come through the line the messianic line and the significance of all that you read of and you think about the spiritual warfare that were engaged in the spiritual battles that Satan has spent all of those years as recorded in the Old Testament to try to defile and destroy that line so that that Messiah",
      "context": "...that seed and we see that as Christ. Now you understand as you go from this portion of scripture in Genesis 12 through 15 and look at how God zeros in. Remember he starts in Genesis with creation. He looks at t...",
      "sermon_title": "Sermon 6jkKQL6IlWQ",
      "url": "https://www.youtube.com/watch?v=6jkKQL6IlWQ&t=2358",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}