{
  "reference": "Genesis 22",
  "occurrences": [
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 605.2399854660034,
      "text": "unto him out of heaven and said, Abraham, Abraham. And he said, hear my. And he said, lay not thine hand upon the lad, neither do thou anything unto him. For now I know. that thou fears God seeing thou has not withheld thy son thine only son for me and Abraham lifted up his eyes and looked and notice what it says and behold behind him a ram caught a thicket by his horns and Abraham went and took the ram and offered him for a burnt offering in the stead of his son and Abraham called the name of that place Jehovah Jireh as it is said to this day in the Mount of the Lord it shall be seen the Lord will provide Abraham experienced this and we sometimes we look at the scriptures and we study the Word of God and we're aware of some of the accounts and we know what happens we sometimes can fail to remember the fact that they were living this moment by moment step by step and Abraham had faith and the book of Hebrews tells us in the 11th chapter that he believed that even if his son were to die there upon the altar that God could raise him up and what faith Abraham had but we find that the Lord provided of course we would understand as we look at Genesis 22 and think about the the type of Messiah who would come of course the",
      "context": "...at faith Abraham had but we find that the Lord provided of course we would understand as we look at Genesis 22 and think about the the type of Messiah who would come of course the",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=605",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 666.6399841308594,
      "text": "were to die there upon the altar that God could raise him up and what faith Abraham had but we find that the Lord provided of course we would understand as we look at Genesis 22 and think about the the type of Messiah who would come of course the Lamb of God that would go of course and go to the cross of Calvary shed his precious blood so that we could have redemption and have of course be reconciled to God and what a blessing that is God the the greatest need of mankind is a Savior the greatest need our greatest need is not an educator our greatest need is not a philosopher our greatest need is not a you to fill in the blank and we don't need someone to come and do these things know where the greatest need for mankind is a Savior and God provided his own son of course God and flesh the Lord Jesus Christ came and went to the cross of Calvary to pay for the sin of mankind and what a blessing that is for us to understand this evening and of course as we think about this passage again understanding the impact that these names would have upon the patriarchs and the people of God as they would read the accounts and they would read the names and they would be aware of the fact that our God provides and how that was to give them a",
      "context": "...at faith Abraham had but we find that the Lord provided of course we would understand as we look at Genesis 22 and think about the the type of Messiah who would come of course the Lamb of God that would go of c...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=666",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 1610.1000061035156,
      "text": "son indeed. Isn't that encouraging? Remember, who's speaking? El Shaddai, the Almighty God. He says, Abraham, Sarah, thy wife, shall bear thee a son indeed, and thou shalt call his name Isaac. And I will establish my covenant with him for an everlasting covenant and with his seed after him. To the plea of Abraham and the cry in verse 18, oh, that Ishmael might live before thee, God repeats the promise that he's made, and he says, Sarah, thy wife, shall bear thee a son indeed. His name shall be Isaac. And it's through him that I will establish my covenant, which is an everlasting covenant. We find that this would come to pass in Genesis 22. In fact, if you turn just a few pages over, excuse me, Genesis chapter 21, if you turn over just a few pages, you find the Bible says in verse number one of Genesis 21, and the Lord visited Sarah, notice these next words, as he had said. And the Lord did unto Sarah as he had spoken. You know, God always does what he says he will do. God's never going to fail you. He always does what he says he will do. We find that it came to pass in Genesis chapter 21. Notice in verse number 20, back in Genesis chapter number 17. I love how God says this in verse number 20, and as for Ishmael, we find that it's",
      "context": "...ll establish my covenant, which is an everlasting covenant. We find that this would come to pass in Genesis 22. In fact, if you turn just a few pages over, excuse me, Genesis chapter 21, if you turn over just a...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=1610",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}