{
  "reference": "Genesis 48",
  "occurrences": [
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 0.0,
      "text": "chapter tonight, Genesis 48, it's only 22 verses, and this is message number 97 through the book of Genesis, and we are near the very end, and chapter 49 and then chapter 50. I do not believe that I will be able to get through chapter 49 in one message, it's probably gonna take two, and then probably two for chapter 50 as well, but we are nearing the end, and I have been praying about where to go on Sunday evenings for our new series, it's been a long time that we've been in the book of Genesis, and obviously message 97, but also we had some other things going on on Sunday evenings, different periods of time, I did a period of time where we did Ask the Pastor on Sunday night, and what have you, and so it's been a number of years that we've been sending through the book of Genesis, and by the way, let me say this, I'm thankful for, we heard testimonies tonight, Brother Mark and Brother Isaac, they both said about God's word, I'm thankful for Genesis to Revelation, amen, and all God's word is profitable, the Bible says all scripture is given by inspiration of God, and is profitable in the context of 2 Timothy chapter number three, we know that Paul says to Timothy, and that from a child thou hast known the holy scriptures, what's he talking about, he's talking about the Old Testament, which are able",
      "context": "chapter tonight, Genesis 48, it's only 22 verses, and this is message number 97 through the book of Genesis, and we are near th...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 212.1199951171875,
      "text": "situation, he gets his two boys, Ephraim and Manasseh, or Manasseh and Ephraim, oldest youngest, we find that he gets his two sons, and he heads over, I would say this, to have a visit with his dad. We find that the text of scripture, the details of this meeting, are provided here in Genesis 48. I'll begin reading in verse number one, the Bible says this, and it came to pass after these things, after those 17 years in which they were there in Egypt, that one told Joseph, notice the message, behold, thy father is sick, and he, Joseph, took with him his two sons, Manasseh and Ephraim, and one told Jacob and said, behold, thy son Joseph cometh unto thee, and Israel strengthened himself and sat upon the bed. We'll read the entirety of the text this evening, but I wanna give you, you know, it's amazing, the Bible is an awesome book, it's a living book, and I said this this morning, but I'll say it again this evening, the best commentary on the Bible is the Bible. I don't know who originally coined that phrase, I know that I heard Clarence Sexton say that a number of times during his ministry, but the Bible is an awesome book, it's a living book, it is God's word, and I want you to hold your place here in Genesis 48, but take with me just for a moment over to Hebrews chapter number 11.",
      "context": "...with his dad. We find that the text of scripture, the details of this meeting, are provided here in Genesis 48. I'll begin reading in verse number one, the Bible says this, and it came to pass after these thing...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=212",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 279.6000061035156,
      "text": "say that a number of times during his ministry, but the Bible is an awesome book, it's a living book, it is God's word, and I want you to hold your place here in Genesis 48, but take with me just for a moment over to Hebrews chapter number 11. In Hebrews chapter number 11, God gives us just a simple verse of scripture that really in this simple verse of scripture, I believe that great light is shed upon the meeting that we read of in Genesis 48, and we find that in Hebrews chapter 11, many of us would refer to this passage of scripture as the great hall of faith, if you will, and we read of all of the great things that were accomplished, and we find that in verse 21, notice what the Bible says in Hebrews 11 and verse 21, by faith Jacob, when he was a dying, blessed both the sons of Joseph. That's what we're talking about in Genesis 48, that is, Genesis 48 is the record of what is being referred to here in Hebrews chapter 11 and verse 21, when Jacob is going to die and he blesses the two sons of Joseph. The other blessings are recorded in Genesis 49 for the other sons, but the sons of Joseph in chapter 48, notice this next phrase that says, and worshiped, and worshiped, leaning upon the top of his staff. Why did he have a staff?",
      "context": "...is an awesome book, it's a living book, it is God's word, and I want you to hold your place here in Genesis 48, but take with me just for a moment over to Hebrews chapter number 11. In Hebrews chapter number 11...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=279",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 357.8399963378906,
      "text": "he blesses the two sons of Joseph. The other blessings are recorded in Genesis 49 for the other sons, but the sons of Joseph in chapter 48, notice this next phrase that says, and worshiped, and worshiped, leaning upon the top of his staff. Why did he have a staff? Because he wrestled with the Lord one night and God touched his thigh, right? And I believe that for the rest of his days, he had a limp. And he remembered, I preached on this when we dealt with that passage of scripture, but it really comes up again as we look at this tonight in Genesis 48, and so we see that he's leaning upon his staff, and it's not just because of his old age, it's not just because of the health circumstances that are leading to his death that we're speaking of in Genesis 48, but we find that he had that staff for a long time, and it was a reminder of an event that took place in his life, but I want you to see also that in Hebrews 11, verse 21, it says that he worshiped, that he worshiped. Now, I like that, I was beginning as I was preparing this week and looking through this portion of scripture in Genesis 48, and I was reminded of Hebrews 11, and I'm thinking as I'm reading through the context, turn back to Genesis 48, if you will, and as you're reading through the context,",
      "context": "...we dealt with that passage of scripture, but it really comes up again as we look at this tonight in Genesis 48, and so we see that he's leaning upon his staff, and it's not just because of his old age, it's not...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=357",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 421.4800109863281,
      "text": "I was beginning as I was preparing this week and looking through this portion of scripture in Genesis 48, and I was reminded of Hebrews 11, and I'm thinking as I'm reading through the context, turn back to Genesis 48, if you will, and as you're reading through the context, if you're not careful, you can look at Genesis 48 and just look at a meeting between a father and a son, and two grandsons, and you can look at a discussion, an interaction that's taking place, but indeed, God says he worshiped, he worshiped. By the way, God is worthy of our worship. He alone is to be worshiped. The word worship means chiefly and eminently the act of paying divine honors to the supreme being. Of course, we know that is our Lord and Savior. I'm so thankful that the God of the universe is my father. Isn't that awesome? You think about that, our heavenly father, the God of the universe, the one who said, \"'Let there be light,' and there was light.\" And we find that in Genesis 48, as God gives us the record of this interaction and the people that are there, the setting, the conversation, but the Bible says that he worshiped. Keep that in mind as we go through the text this evening. I've titled the message really here in verse number 14. The Bible says, in Israel, Jacob stretched out his right hand and laid it upon Ephraim's head,",
      "context": "I was beginning as I was preparing this week and looking through this portion of scripture in Genesis 48, and I was reminded of Hebrews 11, and I'm thinking as I'm reading through the context, turn back t...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=421",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 2592.280029296875,
      "text": "that are in them, heard I saying, Blessing and honor and glory and power be unto Him that sitteth upon the throne and unto the Lamb forever and ever. And the four beasts said, Amen. The four and twenty elders fell down and worshipped Him that liveth forever and ever. Fourteen verses in chapter five, but man, what a scene. We're going to be there. Hallelujah. Listen, we're going to worship Him. But you don't have to wait until then to worship God. Worship in a, if you just read Genesis 48, it just seems like a meeting between a father and a son and a couple of grandsons. And yes, he's talking about what God has done and the past and what He's doing in the present, what He's going to do in the future, but Hebrew says that He worshipped this evening. We need to worship our God. He is worthy of worship. He alone is to be worshipped. Our children and our children's children, a generation that would rise after us need to see that we're worshipping God. We worship Him because of what He's done. You know, He's done some amazing things, He really has. We worship Him because of what He's doing. I know that it's a dark hour that we live in, but God's still working. God's still on His throne. People are still getting saved. God's still at work.",
      "context": "...o worship Him. But you don't have to wait until then to worship God. Worship in a, if you just read Genesis 48, it just seems like a meeting between a father and a son and a couple of grandsons. And yes, he's t...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=2592",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}