{
  "reference": "Genesis 28",
  "occurrences": [
    {
      "sermon_id": "IMtCrSMeE_8",
      "timestamp": 0.0,
      "text": "number 29 this evening, Genesis chapter number 29, and I mentioned last week as we were taking our path through the first section of Genesis 29, really looking at verses 1 through 30, and in that study we traced the steps of Jacob as he arrived to Haran, and it's interesting because we noted in verse number 1 of Genesis 29, the Bible says, then Jacob went on his journey, and I made the statement that the journey continues, and what a blessing to read about the experience that Jacob had at the end of Genesis 28, and the Lord appearing to him, and the Lord speaking to him, and his commitments to God, and setting up the altar there at Bethel, and what a blessing to read about that experience, and the impact of that experience that he had, but the journey continues, and I kind of likened it to our own lives, and how we can think about that day of our salvation when we recognized our need for Christ, and he saved our soul, and then we continue our journey, and we know that Jacob's journey ends as we read of his death later on here in the book of Genesis, and our journey, too, will end one day, but as we journey with the Lord, that we'd be mindful of the importance of keeping our eyes on him, and keeping our eyes on Jesus. Hebrews chapter number 12 says,",
      "context": "...he journey continues, and what a blessing to read about the experience that Jacob had at the end of Genesis 28, and the Lord appearing to him, and the Lord speaking to him, and his commitments to God, and setti...",
      "sermon_title": "Sermon IMtCrSMeE_8",
      "url": "https://www.youtube.com/watch?v=IMtCrSMeE_8&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "eusw5oiGk-A",
      "timestamp": 346.44000244140625,
      "text": "number 10, it says, and it came to pass when Jacob saw Rachel, the daughter of Laban, his mother's brother, and the sheep of Laban, his mother's brother, that Jacob went near and rolled the stone from the well's mouth and watered the flock of Laban and his mother's brother. I've titled the message this evening from verse number 10, Jacob saw Rachel. Of course, it's in this chapter that we read of the marriages, if you will, of Jacob, and we'll study some things here. If you are taking notes, notice with me, first of all, Jacob's arrival in Haran. We understand that Jacob had left Bethel. Remember he had left, according to chapter number 28 in verse number 1 and 2, that Isaac tells him to go to Paddan Aram and to the house of Bethuel, thy mother's father, and take thee a wife from thence of the daughters of Laban, thy mother's brother, according to Genesis 28 in verse number 2. We find that the Bible recorded for us that stop that he had at Beersheba. It says, excuse me, he went out from Beersheba and went toward Haran in verse number 10, and then the stop that he had in Bethel, as it was called according to verse number 19. Of course, prior to that, the place was called Luz. And we find that Jacob is now continuing on his journey. He's continuing to go in the direction in which he had been instructed.",
      "context": "...her, and take thee a wife from thence of the daughters of Laban, thy mother's brother, according to Genesis 28 in verse number 2. We find that the Bible recorded for us that stop that he had at Beersheba. It sa...",
      "sermon_title": "Sermon eusw5oiGk-A",
      "url": "https://www.youtube.com/watch?v=eusw5oiGk-A&t=346",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "hMIOkmwPfzg",
      "timestamp": 584.8400268554688,
      "text": "of Bethuel, thy mother's father, and take thee a wife from thence of the daughters of Laban, thy mother's brother. And notice what he says in verses three and four. And God Almighty bless thee, and make thee fruitful, and multiply thee, that thou mayest be a multitude of people, and give thee the blessing of Abraham to thee, and to thy seed with thee, and that thou mayest inherit the land whereon thou art a stranger which God gave unto Abraham. And at that moment, after those words, the Bible says that Isaac, sent away Jacob, in verse number five. And as Jacob was sent away, it picks up and tells us in verse number 10 that Jacob went out from Beersheba and went toward Haran. We've mentioned already in previous studies that Paddan Aram is the chief city of Haran, and he's going to the place where he's been instructed to do so. And it's during that journey that he has that dream, that vision. And notice as you pick it up with me in verse number 13 of Genesis 28, the Bible says that behold, the Lord stood above it and said. As you read verses 13 through 15, I would say that you could summarize these three verses of Scripture by saying God has given Jacob some encouraging promises. God is speaking directly to Jacob and He's giving him some very specific promises. It says, I am the Lord God of Abraham, thy father,",
      "context": "...ney that he has that dream, that vision. And notice as you pick it up with me in verse number 13 of Genesis 28, the Bible says that behold, the Lord stood above it and said. As you read verses 13 through 15, I ...",
      "sermon_title": "Sermon hMIOkmwPfzg",
      "url": "https://www.youtube.com/watch?v=hMIOkmwPfzg&t=584",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 311.5,
      "text": "the truth of this passage of Scripture and to think about the way in which God reveals great truth to Jacob. If you're taking notes this evening, notice in verses 10 and 11, as we begin looking through this passage, his departure. Very quickly, not much that we'll discuss here. But I do want you to note that the Bible says that he went out from Beersheba and he went toward Haran. Now Haran was the chief city of Paddan Aram. And according to verse number two of Genesis 28, he was instructed by his father Isaac to go to Paddan Aram and to the house of Bethuel, thy mother's father, and take thee a wife from then, so the daughters of Laban, thy mother's brother. And so we see that in verse number 10, that when the Bible tells us that he went out from Beersheba and he went toward Haran, that he went in obedience. He followed the instruction that had been given. And what a blessing, because we find that it's very important where he finds himself here in this passage of Scripture and how God appears to him and God speaks to him. And I find that that act of obedience that begins our portion of Scripture, our study this evening, is of great significance and it's of great importance. We find that the Bible tells us that he alighted upon a certain place. He tarried there all night because the sun was set.",
      "context": "...ent toward Haran. Now Haran was the chief city of Paddan Aram. And according to verse number two of Genesis 28, he was instructed by his father Isaac to go to Paddan Aram and to the house of Bethuel, thy mother...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=311",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Q_1QzEYkQvA",
      "timestamp": 555.6599731445312,
      "text": "in verse number 51 as it pertains to this dream that Jacob had. In verse number 50, Jesus answered unto him, because I said unto thee, I saw thee under the fig tree, believest thou? Thou shalt see greater things than these, and he saith unto him, verily, verily, of a truth of a truth, I say unto you, hereafter ye shall see heaven open, and the angels of God ascending and descending upon the Son of Man. That ladder that Jacob saw in our passage of Scripture in Genesis 28, that's no other than Jesus Christ. He says he's the Son of Man, amen? And it says that you're going to see heaven open, and the angels of God ascending and descending upon the Son of Man. In Genesis chapter 28, in verse number 12, it says that he dreamed, and behold, a ladder set up on the earth, and the top of it reached heaven, and behold, the angels of God ascending and descending on it. And Jesus ties it. in with Nathanael in John chapter 1 and verse number 51, all the way back to this dream of Jacob in Genesis chapter 28, and what precious truth that we see there. And so as we consider this dream this evening, we note first of all what he saw, but I want you to pay close attention to what he heard. Beginning in verse number 13 and down through verse number 15, Jacob heard some",
      "context": "...nding and descending upon the Son of Man. That ladder that Jacob saw in our passage of Scripture in Genesis 28, that's no other than Jesus Christ. He says he's the Son of Man, amen? And it says that you're goin...",
      "sermon_title": "Sermon Q_1QzEYkQvA",
      "url": "https://www.youtube.com/watch?v=Q_1QzEYkQvA&t=555",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}