{
  "reference": "Genesis 49",
  "occurrences": [
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 0.0,
      "text": "verses this evening from Genesis chapter 49. And I had mentioned to someone this afternoon, I said it this morning as well, that I had planned to go through the whole chapter this evening. And then I got into studying it and said, there's no way we're getting through the whole chapter. And we're just getting near the end of our study through the book of Genesis. In fact, this is message number 98. And so if you've been with me through the whole process of studying through the book of Genesis, we are near the end and we're not quite there yet, but we are getting close. I wanna read just a few verses to you, verses one and two and then verse number 28 before we dig into the text this evening. The Bible says in Genesis 49 and verse number one, and Jacob called unto his sons and said, gather yourselves together that I may tell you that which shall befall you, notice, in the last days. Gather yourselves together and hear, ye sons of Jacob and hearken unto Israel, your father. Skip down if you will and look at verse 28. The Bible says this, all these are the 12 tribes of Israel. And this is it that their father spake unto them and blessed them. Everyone according to his blessing, he blessed them. As we look at this portion of scripture, we are mindful of the fact that Jacob's life is coming to an end.",
      "context": "...es one and two and then verse number 28 before we dig into the text this evening. The Bible says in Genesis 49 and verse number one, and Jacob called unto his sons and said, gather yourselves together that I ma...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 82.4800033569336,
      "text": "these are the 12 tribes of Israel. And this is it that their father spake unto them and blessed them. Everyone according to his blessing, he blessed them. As we look at this portion of scripture, we are mindful of the fact that Jacob's life is coming to an end. In fact, it's at the end of this chapter that God records for us the death of Jacob. By the way, as we consider that truth this evening, that day is going to come for each and every one of us, the day of our death, right? That's going to happen and we understand that. And so we find that prior to the death, Jacob, of course, we looked the last time in chapter 48 as he spoke with Joseph and had Ephraim and Manasseh before him and all that he said there. But we come to the 49th chapter and we find that Jacob calls for his sons to gather themselves in his presence throughout the chapter this evening and over the next several Sunday evenings as we study through Genesis 49, we will note several things. Number one, we will note the purpose of this gathering. And as we consider the purpose and recall what is taking place as God has recorded it for us, we will see clearly the purpose of the gathering. We find not only the purpose, but we find that there's a process that is followed.",
      "context": "...e throughout the chapter this evening and over the next several Sunday evenings as we study through Genesis 49, we will note several things. Number one, we will note the purpose of this gathering. And as we con...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=82",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 147.52000427246094,
      "text": "note the purpose of this gathering. And as we consider the purpose and recall what is taking place as God has recorded it for us, we will see clearly the purpose of the gathering. We find not only the purpose, but we find that there's a process that is followed. And as we look at the purpose and the process, we also see the prophetic view that is given to us. You notice I mentioned at the end of verse number one that it says, that which shall befall you in the last days. There were some things that would be soon fulfilled, but there's many things within Genesis 49 that look even still today to the future. And we'll note that as we study through the portion of scripture. What a scene this is. I want you to think about the scene. As we kind of enter into the room with Jacob, he's dying, he knows that he's on his deathbed and he calls for his sons to gather themselves together to enter into his presence. We find that each son will stand before their father. We find that the father Jacob here in this portion of scripture, he has his 12 boys and one by one, they will stand before him and he'll begin to say certain things, some that are more lengthy than others and some that are more of a blessing than others. And we find that in this text of scripture,",
      "context": "... the last days. There were some things that would be soon fulfilled, but there's many things within Genesis 49 that look even still today to the future. And we'll note that as we study through the portion of sc...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=147",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1010.1799926757812,
      "text": "that time the size of the tribe of Simeon decreased by over 37,000 people. That's a lot of people. The tribe during the first census, they were counted at 59,300 and by the time of the second census they were down to 22,200. Wow. We see the decrease in Simeon. We see, and we'll note it in just a moment in Deuteronomy chapter 33, but it's interesting because in Deuteronomy chapter 33, Moses is preparing to die. Here in Genesis 49, Jacob is going to die and he brings all of his sons before him and we find that in Deuteronomy chapter 33, Moses is not going to be permitted to enter into the land and we find that prior to his death, Moses does something interesting. He begins to talk about all the tribes and, you know, if you were to study Deuteronomy chapter 33, you'll find that there's one tribe missing from all the tribes that are mentioned by Moses. That one tribe, Simeon, Simeon. It's not there and you study that and you begin to see and you look here how it talks about being scattered. He says, I will divide them in Jacob and scatter them in Israel and you think about how the Simeonites, they really did not have that identity, if you will, of their own little tribe and to see the decrease in their census of their population to understand that they're not even mentioned there by Moses in Deuteronomy 33.",
      "context": "...pter 33, but it's interesting because in Deuteronomy chapter 33, Moses is preparing to die. Here in Genesis 49, Jacob is going to die and he brings all of his sons before him and we find that in Deuteronomy cha...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1010",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1217.0800170898438,
      "text": "will in the 32nd chapter. In Exodus chapter 32. We find that the people are guilty. Moses is up on the mount and the people are there and they say to Aaron, and up make us gods which shall go before us. You can read that in verse number one. And he tells them what to do and he fashions this molten calf. And it's a wicked scene in Exodus chapter 32. I mean, it's a bad situation. And we find that Moses, you remember singing the song, Who is on the Lord's side? Amen, it's a good song, right? And we are on the Lord's side, amen? And it's a great song and we sing it. It comes from this passage of scripture. Notice what Moses says in verse number 26. Then Moses stood in the gate of the camp and said, Who is on the Lord's side? Let him come unto me. And what does it say? All the sons of Levi gathered themselves together unto him. That's a good decision by the people of Levi, the tribe of Levi. And it says in Exodus 32 and verse 26 that all the sons of Levi gathered themselves together unto him. Perhaps this gives us a little insight as to why in Deuteronomy chapter 33, what we could look at in Genesis 49 as being this scattering, this judgment, if you will, is really turned into a blessing because of what they did. They stood for right.",
      "context": "...erhaps this gives us a little insight as to why in Deuteronomy chapter 33, what we could look at in Genesis 49 as being this scattering, this judgment, if you will, is really turned into a blessing because of w...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1217",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1296.0800170898438,
      "text": "themselves together unto him. Perhaps this gives us a little insight as to why in Deuteronomy chapter 33, what we could look at in Genesis 49 as being this scattering, this judgment, if you will, is really turned into a blessing because of what they did. They stood for right. By the way, it's always right to stand for right. Amen? Who is on the Lord's side? Listen, I'd rather be on the Lord's side than the world's side. Amen? And notice what the Bible says in Deuteronomy 33. We'd eventually get here. In Deuteronomy chapter 33, notice what God says through Moses in verses 10 and 11. Again, this is a passage of Scripture. I'll read verse 1 and then we'll get down to verses 10 and 11. But in Deuteronomy 33 and verse 1, it says, And this is the blessing wherewith Moses, the man of God, blessed the children of Israel before his death. You can go through here and you can read beginning here in this text of Scripture in verse 6 with Reuben, and you can go right down through and you can see the tribes that are mentioned, of course, not Simeon, but all the other tribes mentioned. Look down in verse number 10. Actually, I'm going to back up to verse number 8. It says, And of Levi he said, Let thy Thummim and Urim be with thy Holy One, whom thou didst prove at Massah, and with whom thou didst strive",
      "context": "...erhaps this gives us a little insight as to why in Deuteronomy chapter 33, what we could look at in Genesis 49 as being this scattering, this judgment, if you will, is really turned into a blessing because of w...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1296",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1424.0800170898438,
      "text": "They shall put incense before thee and hold burnt sacrifice upon thine altar. Bless, Lord, his substance and accept the work of his hands. Smite through the loins of them that rise against him and of them that hate him that they rise not again. That's a pretty good situation, is it not? I mean, the responsibility that they roll, that they have, and that they'll play within the nation of Israel's history. And of course, after they are serving and all that they do, and what a blessing to think about the truth of how they responded and what God then allows them to do. So we see Reuben. We see Simeon and Levi. Number three, we see Judah. In verses 8 through 12, we read in Genesis 49 of Judah. The Bible says in verse number 8, Judah, thou art he whom thy brethren shall praise. The word means praise. Thy hand shall be in the neck of thine enemies. Thy father's children shall bow down before thee. Judah is a lion's whelp from the prey. My son, thou art gone up. He stooped down. He couched as a lion and as an old lion who shall rouse him up. The scepter shall not depart from Judah nor a lawgiver from between his feet until Shiloh come. And unto him shall the gathering of the people be, binding his foal unto the vine and his ass's colt unto the choice vine. He washed his garments in wine",
      "context": "... see Reuben. We see Simeon and Levi. Number three, we see Judah. In verses 8 through 12, we read in Genesis 49 of Judah. The Bible says in verse number 8, Judah, thou art he whom thy brethren shall praise. The ...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1424",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1658.0800170898438,
      "text": "before Joseph and Judah is truly broken. I said this when we preached through the text of Scripture in Genesis 44, that it's a beautiful picture of brokenness and repentance. And we see, listen, when we're broken and we're repentant, guess what we have? We have forgiveness. We have forgiveness. You know, it's interesting as I say that this is kind of a picture, if you will, with regard to the situation there in Genesis 49. And we think about the forgiveness that we have. You know, when God says that He forgives us, He says He removes it as far as the east is from the west. Amen? I'm thankful for that truth. He that covereth his sins shall not prosper. But whoso confesseth and forsaketh, they shall find have mercy, grace. What a blessing. It's interesting. We won't take time, but you could read in Genesis 44, beginning in verse number 14, how Judah stands up and all that he rehearses and all that he says and how he's completely broken. And it was after that speech, if you will, as he pours out his heart and brokenness before Joseph, that Joseph in Genesis 45 could no longer refrain himself and he makes known his identity. Why? Because Judah was broken. He was repentant. We find that here in this text of Scripture, Judah in Genesis chapter 49, back in verses 8, down through verse number 12, we begin to read of this blessing",
      "context": "...resting as I say that this is kind of a picture, if you will, with regard to the situation there in Genesis 49. And we think about the forgiveness that we have. You know, when God says that He forgives us, He s...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1658",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1737.0800170898438,
      "text": "45 could no longer refrain himself and he makes known his identity. Why? Because Judah was broken. He was repentant. We find that here in this text of Scripture, Judah in Genesis chapter 49, back in verses 8, down through verse number 12, we begin to read of this blessing and though there was fault in his life, there was sin in his life, it's not mentioned here and I believe it's because of that brokenness, but we see the blessing that's given Judah would be the royal tribe. He'd be the royal tribe. Kings. Not a blessing. But I think more than just kings that would rule over Israel, in our text of Scripture, there's no doubt that the Holy Spirit of God has given us this portion of Scripture and in view is the Lord Jesus Christ who remember in Revelation 5 in verse number 5 is known as the lion of the tribe of Judah. We know that in Hebrews 7 in verse number 14 when the Bible's speaking about the priesthood, it says that we know that Jesus, He didn't come from Levi. No, He came from Judah, from the tribe of Judah. And so we find that here, no doubt there's a view. I mentioned already the purpose, the process and the prophetic view. There's a view here. here in verses 8-12 that goes all the way through the Millennial Kingdom of Christ. All the way back in Genesis 49.",
      "context": "... in verses 8-12 that goes all the way through the Millennial Kingdom of Christ. All the way back in Genesis 49.",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1737",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1810.0800170898438,
      "text": "of Judah. And so we find that here, no doubt there's a view. I mentioned already the purpose, the process and the prophetic view. There's a view here. here in verses 8-12 that goes all the way through the Millennial Kingdom of Christ. All the way back in Genesis 49. I don't think Jacob fully understood all that he was saying. We understand that here as we have the whole canon of Scripture and we're able to compare Scripture with Scripture and we can see the far-reaching view of these statements made by Jacob, these blessings if you will. We find that he says in verse number 10, the scepter shall not depart from Judah, nor a lawgiver from between his feet. Notice this, until Shiloh come. It's kind of interesting because here in the text of Scripture in Genesis 49, Shiloh in verse number 11, excuse me, in verse number 10 is not a place, it's a person. A person. You know Shiloh is very interesting, I mentioned this to Ronnie this afternoon, Shiloh has the same root Hebrew word, the Hebrew root word for Shiloh is the same as shalom or peace. Now Jesus is the Prince of Peace, right? We see that of course in Isaiah 9 and verse number 6 and we find here that indeed the Lord Jesus Christ is in view of being that one that will one day come, he is going to rule and reign for a thousand years, amen?",
      "context": "... in verses 8-12 that goes all the way through the Millennial Kingdom of Christ. All the way back in Genesis 49. I don't think Jacob fully understood all that he was saying. We understand that here as we have th...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1810",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 1952.540023803711,
      "text": "you but one day you're going to find out the truth, amen? And here we have in view, look at the beautiful picture of peace and plenty that is painted for us in verses 11 and 12 which really will not be fully known until the millennial reign of Christ. In verse number 11 it says, binding is fall unto the vine. No one does that. Why? Well because you're going to lose your animal because you're going to eat the vine, right? He says look and his ass is cold under the choice vine. They're going to eat it up and depart but it's going to be so plentiful, it's going to be so bountiful that one would be able to bind his fall unto the vine and his ass is cold unto the choice vine. What a beautiful picture. The verbiage that is used in verses 11 and 12 paint for us this beautiful picture of peace and plenty again which will not be fully realized or known until the millennial reign of Christ. God tells us much about the millennium. We find that scattered throughout many of the prophets there are many references with regard to the millennial reign of Christ and we find that here all the way back in Genesis 49 he speaks, Jacob does, when he is giving this blessing to Judah looking all the way through human history down to the millennial reign of Christ. That's amazing to me.",
      "context": "... references with regard to the millennial reign of Christ and we find that here all the way back in Genesis 49 he speaks, Jacob does, when he is giving this blessing to Judah looking all the way through human h...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=1952",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "09KQDExB3yQ",
      "timestamp": 2027.1400146484375,
      "text": "with regard to the millennial reign of Christ and we find that here all the way back in Genesis 49 he speaks, Jacob does, when he is giving this blessing to Judah looking all the way through human history down to the millennial reign of Christ. That's amazing to me. God was no doubt working and I think about Jacob and it's evident as we consider one person said this, I think he was right on point when he made this statement. He said in his carnal or fleshly person Jacob would like to have given this blessing that he gives to Judah to Joseph. But in his spiritual man the blessing is given to Judah because that was God's plan. By the way, it ties hand in hand with the message from this morning, thy will be done. See Joseph was Jacob's favorite, was he not? He was the favorite son. He was the one that got the coat of many colors. He was the one that for 17 years, excuse me, for those first 17 years of his life he was the one that was well loved and favored and all the others knew it. And then for over 20 years he's there in Egypt and all that takes place and then for 17 years Jacob has an opportunity to see his son and to dwell there in the land. And maybe in the carnal, fleshly mind of the individual he'd want to give such a blessing",
      "context": "with regard to the millennial reign of Christ and we find that here all the way back in Genesis 49 he speaks, Jacob does, when he is giving this blessing to Judah looking all the way through human h...",
      "sermon_title": "Sermon 09KQDExB3yQ",
      "url": "https://www.youtube.com/watch?v=09KQDExB3yQ&t=2027",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 0.0,
      "text": "this evening, Genesis chapter 49. Last week, we looked at verses one through 12, and we really dealt with the subject with regard to Jacob blessing his sons. And last week, we looked at Reuben, Simeon, Levi, and Judah, and we had the opportunity to look at them last week. And this week, we will continue here in Genesis 49, verses 13 through 19. And as we look this evening, we mentioned last week, it's part two, but let me just give you a very quick overview. We mentioned last week that Jacob knew that he was near the end of his life. In fact, it's here in this chapter that we read of the death of Jacob, and we find that, of course, that is something that each of us ought to be prepared for. When is it that we will take our final breath? In fact, someone shared with me an account this morning of someone out sharing the gospel, and they'd heard this story, a firsthand account. It wasn't them that was out sharing the gospel, but someone had shared this story, and the individual that they were speaking to was in their middle age, 40, mid-40, something like that, and they said, oh, no, I'm not in need of that. I'm perfectly fine. I got plenty of time. And the folks that were out knocking doors were knocking doors down the block, and sure enough, just a little while later, an ambulance came to that house,",
      "context": "...udah, and we had the opportunity to look at them last week. And this week, we will continue here in Genesis 49, verses 13 through 19. And as we look this evening, we mentioned last week, it's part two, but let ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2063.7200317382812,
      "text": "to help your wife have time with God because it's going to help your home. It's busy. I get it. And so as a wife, helping your husband, he's got a job and responsibilities, the time with God is important. We find this evening that idolatry there in Israel, introduced by Dan. I believe it's very prophetic what we read in Genesis 49. It is of interest when we think about Dan, some have noted and perhaps you've seen it before as well, that if you look at Revelation chapter 7 and verses 1 through 8, Dan as a tribe is not mentioned. We find also that in 1 Chronicles chapters 2 through 10, there's a chronological order that is given of the tribes, and you'll notice that in that portion of Scripture that Dan also is missing from there. Now it's interesting if you understand the timeline of the book of Revelation, and this isn't a lesson on the book of Revelation, but, but Revelation chapter 7 is in the midst of the tribulation. All right? The rapture's already taken place. The church age as we know it has ceased to exist. We see that in Revelation 2 and 3 with the church age. Chapter 4, I believe, is a picture of the rapture and the timing of the rapture. And then you begin to see the throne room of heaven. You begin to start seeing",
      "context": "...ing that idolatry there in Israel, introduced by Dan. I believe it's very prophetic what we read in Genesis 49. It is of interest when we think about Dan, some have noted and perhaps you've seen it before as we...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2063",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2261.320037841797,
      "text": "some of the wickedness that they did, the sacrificing of their children to Molech. You say, how in the world? That was the pagan practice. How in the world would they be guilty? This is a slippery slope. They begin to put these idols and they begin to get involved in idolatry and all that takes place. Listen, it's a dangerous thing. God must be first in our lives. I wonder this evening as we begin to think about these tribes and begin to think about the prophetic view here in Genesis 49 and wondering if they would take and God would be prominent and preeminent in their lives, how it could change some things. See they can't get a redo and the fact of the matter is you and I don't get a redo either. I said this to someone last week. I was having a meeting with them and I said, listen, you can't change yesterday, but you can have a reset today. You can determine today. All of that stuff that happened, there's nothing you can do about it. You can't change it. You can be upset about it. You can be angry about it. You can, whatever all the emotions are, but you're not going to change it. But you can have a reset today and you can determine starting today, I'm going to serve God. He's going to have preeminence in my life. He's",
      "context": "...evening as we begin to think about these tribes and begin to think about the prophetic view here in Genesis 49 and wondering if they would take and God would be prominent and preeminent in their lives, how it c...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2261",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2386.280029296875,
      "text": "department, Brother Mark, and said, hey, I just wanted to find out if you guys still have trucks. Do they have gas? Do you have water? Do you have hoses? Like, I just want to make sure you're still operating. I've never made that. Have any of you ever made that phone call? No. But if I have a fire and I call 911 and I call for the fire department, I'm hoping that they're there and they're coming, right? That's not how we treat God and church. It's not just when my life is falling apart, oh, I need God, I need church. No, I need Him every moment of my life. And I must be careful that I learn lessons and say, look, don't go down the path of idolatry that we see within Dan and the tribe and introducing it. No, we must make Christ preeminent in our lives. Gad is mentioned in verse 19. Of course, the Bible says in Genesis 49 and verse 19, Gad, a troop shall overcome him, but he shall overcome at the last. Again, not a whole lot given to us about Gad. We find that it says that a troop shall overcome him, but he shall overcome at the last. It says in Deuteronomy 33 and verse number 20 that it talks about his enlarging and his strength. And Moses says like a lion is really kind of the imagery that is given there with regard to Gad.",
      "context": "...ust make Christ preeminent in our lives. Gad is mentioned in verse 19. Of course, the Bible says in Genesis 49 and verse 19, Gad, a troop shall overcome him, but he shall overcome at the last. Again, not a whol...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2386",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 279.6000061035156,
      "text": "say that a number of times during his ministry, but the Bible is an awesome book, it's a living book, it is God's word, and I want you to hold your place here in Genesis 48, but take with me just for a moment over to Hebrews chapter number 11. In Hebrews chapter number 11, God gives us just a simple verse of scripture that really in this simple verse of scripture, I believe that great light is shed upon the meeting that we read of in Genesis 48, and we find that in Hebrews chapter 11, many of us would refer to this passage of scripture as the great hall of faith, if you will, and we read of all of the great things that were accomplished, and we find that in verse 21, notice what the Bible says in Hebrews 11 and verse 21, by faith Jacob, when he was a dying, blessed both the sons of Joseph. That's what we're talking about in Genesis 48, that is, Genesis 48 is the record of what is being referred to here in Hebrews chapter 11 and verse 21, when Jacob is going to die and he blesses the two sons of Joseph. The other blessings are recorded in Genesis 49 for the other sons, but the sons of Joseph in chapter 48, notice this next phrase that says, and worshiped, and worshiped, leaning upon the top of his staff. Why did he have a staff?",
      "context": "...en Jacob is going to die and he blesses the two sons of Joseph. The other blessings are recorded in Genesis 49 for the other sons, but the sons of Joseph in chapter 48, notice this next phrase that says, and wo...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=279",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "CejLq4peEWY",
      "timestamp": 357.8399963378906,
      "text": "he blesses the two sons of Joseph. The other blessings are recorded in Genesis 49 for the other sons, but the sons of Joseph in chapter 48, notice this next phrase that says, and worshiped, and worshiped, leaning upon the top of his staff. Why did he have a staff? Because he wrestled with the Lord one night and God touched his thigh, right? And I believe that for the rest of his days, he had a limp. And he remembered, I preached on this when we dealt with that passage of scripture, but it really comes up again as we look at this tonight in Genesis 48, and so we see that he's leaning upon his staff, and it's not just because of his old age, it's not just because of the health circumstances that are leading to his death that we're speaking of in Genesis 48, but we find that he had that staff for a long time, and it was a reminder of an event that took place in his life, but I want you to see also that in Hebrews 11, verse 21, it says that he worshiped, that he worshiped. Now, I like that, I was beginning as I was preparing this week and looking through this portion of scripture in Genesis 48, and I was reminded of Hebrews 11, and I'm thinking as I'm reading through the context, turn back to Genesis 48, if you will, and as you're reading through the context,",
      "context": "he blesses the two sons of Joseph. The other blessings are recorded in Genesis 49 for the other sons, but the sons of Joseph in chapter 48, notice this next phrase that says, and wo...",
      "sermon_title": "Sermon CejLq4peEWY",
      "url": "https://www.youtube.com/watch?v=CejLq4peEWY&t=357",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 930.1400146484375,
      "text": "you to understand the perspective of the sons as it's given to us in verse 31. The Bible says that they said, should he deal with our sister as with an harlot? Really I believe that as you look at verse number 31, this answer to Jacob when he expresses his fear and concern in verse number 30 to his sons, to Simeon and Levi specifically, I believe that these boys and their response as it's recorded in verse 31 is really seeking to justify their actions, to justify their actions. By the way, isn't that typically what we do when we take matters in our own hands? We take matters in our own hands and then we justify our actions. But do you know what they did to me? Do you know what they said? Do you know what...isn't that what we do? And we find here, listen, I've already acknowledged this evening that what took place as they say in verse number 7, this thing ought not to be done. They were absolutely correct. They took matters in their own hands. Jacob will mention this very thing in Genesis 49, turn over if you will, when he's dying and the blessings are being given to his sons. Notice what he says in Genesis chapter 49, beginning in verse number 1, Genesis 49 and verse 1, the Bible says, and Jacob called unto his sons and said, gather yourselves",
      "context": "...ere absolutely correct. They took matters in their own hands. Jacob will mention this very thing in Genesis 49, turn over if you will, when he's dying and the blessings are being given to his sons. Notice what ...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=930",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "aG_nBkVcOeE",
      "timestamp": 1000.9400329589844,
      "text": "Genesis 49, turn over if you will, when he's dying and the blessings are being given to his sons. Notice what he says in Genesis chapter 49, beginning in verse number 1, Genesis 49 and verse 1, the Bible says, and Jacob called unto his sons and said, gather yourselves together that I may tell you that which shall befall you in the last days. Gather yourselves together and hear you sons of Jacob and hearken unto Israel your father. Notice beginning in verse number 5, he begins speaking to Simeon and Levi. These are the two that we read of in Genesis 34 that we just read the entirety of the account, this historical account that took place. And notice what Jacob says when he's on his deathbed here. It says, Simeon and Levi are brethren, instruments of cruelty are in their habitations. Oh my soul, come not thou into their secret, unto their assembly. Mine honor, be not thou united. For in their anger, they slew a man and in their self-will, they digged down a wall. Cursed be their anger, for it was fierce, and their wrath, for it was cruel. I will divide them in Jacob and scatter them in Israel. Isn't it interesting that Jacob makes mention specifically of this event that we just read of Genesis 34 about Simeon and Levi and he talks about their anger and how it was fierce and how their wrath was cruel.",
      "context": "Genesis 49, turn over if you will, when he's dying and the blessings are being given to his sons. Notice what ...",
      "sermon_title": "Sermon aG_nBkVcOeE",
      "url": "https://www.youtube.com/watch?v=aG_nBkVcOeE&t=1000",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6SpHqGGtcFw",
      "timestamp": 1286.8000106811523,
      "text": "we see the transaction is completed. We see that Abraham gave in the presence of all as it says there in v. 16, he named in the audience of the sons of Heth that he measured out that 400 shekels of silver and we find that the transaction was completed and thus Abraham was able to bury Sarah. It says in v. 19, and after this, after the request was made known, after the negotiations took place, after the price was settled, the transaction was completed, the Bible says that Abraham buried Sarah his wife in the cave of the field of Machpelah before Mamre, the same as Hebron in the land of Canaan. And the field and the cave that is therein were made sure unto Abraham for a possession of a burying place by the sons of Heth. Now it's interesting that as we look here at the transaction being completed and the burial of Sarah, that we'd be mindful of understanding that not only would Sarah be buried in this place, but we find that Abraham also would be buried in this place. If you were to look at chapter 25 in v. 9, we won't take the time to go to all of these verses, but you'll find as we'll study in weeks to come that Abraham is buried here. You find that Isaac and Rebekah are also buried here, according to Genesis 49 in verse number 31.",
      "context": "...ome that Abraham is buried here. You find that Isaac and Rebekah are also buried here, according to Genesis 49 in verse number 31.",
      "sermon_title": "Sermon 6SpHqGGtcFw",
      "url": "https://www.youtube.com/watch?v=6SpHqGGtcFw&t=1286",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6SpHqGGtcFw",
      "timestamp": 1347.8400115966797,
      "text": "chapter 25 in v. 9, we won't take the time to go to all of these verses, but you'll find as we'll study in weeks to come that Abraham is buried here. You find that Isaac and Rebekah are also buried here, according to Genesis 49 in verse number 31. And then you'll also find that Leah in chapter number 49 is buried there, and then Jacob in chapter number 50. And all of these are buried here in this cave, in this place that Abraham purchased. And as we look at this passage of Scripture and as we begin to unfold and we note the response and we note the request and we see the transaction that's completed in the burial of Sarah, I think this evening that as I look at this passage of Scripture, I say, what is it that is revealed to me here? What is it that I should learn? What is it that I can take away from this passage of Scripture? And so if you are taking notes, number three, what Abraham reveals. What is it that is revealed through this transaction? God in his wisdom determined that he was going to record these 20 verses in the Bible. And he's recorded it for a reason, for a purpose. And first that I would say, the first item that I would look to that is revealed to me through this passage of Scripture is number one, the love that Abraham had for Sarah.",
      "context": "...ome that Abraham is buried here. You find that Isaac and Rebekah are also buried here, according to Genesis 49 in verse number 31. And then you'll also find that Leah in chapter number 49 is buried there, and t...",
      "sermon_title": "Sermon 6SpHqGGtcFw",
      "url": "https://www.youtube.com/watch?v=6SpHqGGtcFw&t=1347",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}