{
  "reference": "Genesis 2",
  "occurrences": [
    {
      "sermon_id": "NQwl69OFN-Y",
      "timestamp": 482.7799987792969,
      "text": "if we're honest this morning, we have had the opportunity to see historically, to see even in our day to day, how the society and the culture is having a great influence on the church. And it's so vital that we understand that the church is to influence the culture, not the other way around. Consider with me a few thoughts this morning with regard to the exhortation to work hard. There are many people that erroneously have the idea that work was a result of the fall. But I would submit to you in Genesis chapter two in verse number 15, that Adam was placed in the garden by God Almighty. And God said that he was put there to dress it and to keep it. And the word dress it literally means to labor or to work. That's what the word means, that's what that phrase means. And so there are times in which we misunderstand the truth. Yes, work got a whole lot more complicated after the fall with regard to the curse and the thorns and thistles and all of that. But the reality is that we find that God placed Adam in the garden according to Genesis 2.15, to dress it and to keep it. Who was he doing it for? He was doing it for God. He was doing it for God. God gave him, Adam, that responsibility. The Bible tells us in Lamentations nine, a passage of scripture that sometimes",
      "context": "...es and all of that. But the reality is that we find that God placed Adam in the garden according to Genesis 2.15, to dress it and to keep it. Who was he doing it for? He was doing it for God. He was doing it f...",
      "sermon_title": "\"A Good Soldier - Part 5\" II Timothy 2:6, 24-26",
      "url": "https://www.youtube.com/watch?v=NQwl69OFN-Y&t=482",
      "channel": "Unknown",
      "publish_date": 20241013
    },
    {
      "sermon_id": "NQwl69OFN-Y",
      "timestamp": 549.7999877929688,
      "text": "the garden according to Genesis 2.15, to dress it and to keep it. Who was he doing it for? He was doing it for God. He was doing it for God. God gave him, Adam, that responsibility. The Bible tells us in Lamentations nine, a passage of scripture that sometimes we really just can look over and not focus on the truth. But the Bible tells us in Lamentations that we are to work. Notice in Lamentations nine, sorry, Ecclesiastes nine. I don't know why I wrote down Lamentations. Ecclesiastes chapter nine and verse number 10, the Bible says this. Let me back up. Ecclesiastes nine and verse 10, there it is. Whatsoever thy hand findeth to do, do it with thy might. For there's no work, nor device, nor knowledge, nor wisdom in the grave, whither thou goest. And so we notice the first part of Ecclesiastes nine, 10. Whatsoever thy hand findeth to do, do it with thy might. Can I submit to you this morning that our work for God ought to be done with our all? Because we understand the Bible says, whatsoever thy hand findeth to do, do it with all thy might. But we understand that when God lets us serve Him, what a privilege it is, and He deserves our best. He deserves our absolute best. Colossians 3 and verse 23 says this, and whatsoever you do, do it heartily, as to the Lord and not unto men. I'm working for the Lord.",
      "context": "the garden according to Genesis 2.15, to dress it and to keep it. Who was he doing it for? He was doing it for God. He was doing it f...",
      "sermon_title": "\"A Good Soldier - Part 5\" II Timothy 2:6, 24-26",
      "url": "https://www.youtube.com/watch?v=NQwl69OFN-Y&t=549",
      "channel": "Unknown",
      "publish_date": 20241013
    }
  ]
}