{
  "reference": "Hebrews 12",
  "occurrences": [
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1818.1800022125244,
      "text": "that He endured great hardship for your salvation, for my salvation. What a joy to be able to speak to people and understand this morning that it is a free gift. But our Savior suffered greatly. We find that the Bible then says He endured the cross despising the shame. Hebrews 12 and verse number 2 notice and is set down at the right hand of the throne of God. He lives. Aren't you thankful for that? What a joy to know that we serve a risen Savior. What a joy to know that on that first day of the week they came early to the tomb and they found that the stone was rolled away. They begin to be sorrowful and the angel says, I know why you're here. Why seek ye the living amongst the dead? He is not here for He is risen as He said. Oh, what joy. We understand immediately there was some confusion amongst the disciples. We find that Jesus eventually appeared to them in Galilee as He said that He would. We find that the word of God would record for us that after He had appeared to them for many days and had given instruction, then Acts chapter 1 records for us the ascension of our Lord and Savior Jesus Christ when He ascended to heaven. Really the reference here in Hebrews 12 and verse number 2 at the end when it says that",
      "context": "...Savior suffered greatly. We find that the Bible then says He endured the cross despising the shame. Hebrews 12 and verse number 2 notice and is set down at the right hand of the throne of God. He lives. Aren't ...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1818",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1878.9800033569336,
      "text": "had appeared to them for many days and had given instruction, then Acts chapter 1 records for us the ascension of our Lord and Savior Jesus Christ when He ascended to heaven. Really the reference here in Hebrews 12 and verse number 2 at the end when it says that He sat down at the right hand of the throne of God, it really reminds us all the way back to the beginning of Hebrews chapter number 1 when the Bible says, God who at sundry times and in divers manners spake in time past unto the fathers by the prophets, hath in these last days spoken unto us by His Son, whom He hath appointed heir of all things, by whom also He hath made the worlds, who being the brightness of His glory and the expression of the image of His person, upholding all things by the word of His power, when He had by Himself purged our sins, sat down on the right hand of the majesty on high, being made so much better than the angels, as He hath by inheritance obtained a more excellent name than they. And here as we come to the end of verse number 2 of Hebrews 12, it says, and has sat down at the right hand of the throne of God. I'm so thankful that one day He's going to come again. Amen?",
      "context": "...ension of our Lord and Savior Jesus Christ when He ascended to heaven. Really the reference here in Hebrews 12 and verse number 2 at the end when it says that He sat down at the right hand of the throne of God,...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1878",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1937.260009765625,
      "text": "inheritance obtained a more excellent name than they. And here as we come to the end of verse number 2 of Hebrews 12, it says, and has sat down at the right hand of the throne of God. I'm so thankful that one day He's going to come again. Amen? I mean, the Bible tells us that the trumpet of the Lord shall sound, and we understand that as we sing songs about the return of Christ, we understand that right now He's seated at the right hand of the throne of God, but one day, He's going to come back. I'm so thankful for that truth of the word of God. We find the example that is given to us, let me say this, as we've mentioned already that throughout His earthly ministry, the earthly ministry of the Lord Jesus Christ, that He was focused on His purpose. You understand in John 8 and verse number 29, He says this, I do always those things that please Him. We mentioned already from John 17 and verses 15 through 17 about the fact that we're in the world but not of the world, but we find that Jesus, as He's praying, as He begins that prayer, He says, Father, the hour has come, glorify Thy Son that Thy Son also may glorify Thee, and just a few more verses as we really think about the transition to",
      "context": "...tance obtained a more excellent name than they. And here as we come to the end of verse number 2 of Hebrews 12, it says, and has sat down at the right hand of the throne of God. I'm so thankful that one day He'...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1937",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2129.6199951171875,
      "text": "finished. Notice as we look at the text of Scripture in Hebrews chapter number 12, notice verse number three. The Bible says for consider him. The word consider is an interesting word. It means to think over, to ponder, to muse upon, and we begin to think if there were a period there after that for consider him, that no doubt there are many things that we could consider about our Lord and Savior Jesus Christ. No doubt as we would begin to think about his earthly ministry and all of the wonderful things that are contained within the word of God concerning his ministry, there are many things that we can ponder. There are many things that we can think over. But there's not a period in your Bible, there's not a period in my Bible, for the Bible is going to tell us what the writer wants us to consider with regard to the subject matter that's at hand. The subject matter at hand, finish the race, run the race. Notice it says for consider him that endured such contradiction of sinners against himself. Wow. Here as we look at Hebrews 12 and verse number three, they, the original recipients and us this morning by way of preservation, we have been given this charge to consider something specific about the life and ministry of the Lord Jesus Christ, and we consider this within",
      "context": "...or consider him that endured such contradiction of sinners against himself. Wow. Here as we look at Hebrews 12 and verse number three, they, the original recipients and us this morning by way of preservation, w...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2129",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2194.6400146484375,
      "text": "himself. Wow. Here as we look at Hebrews 12 and verse number three, they, the original recipients and us this morning by way of preservation, we have been given this charge to consider something specific about the life and ministry of the Lord Jesus Christ, and we consider this within the context of running this race, shall I say finishing the race, and what is it that we consider? Well, we consider the contradiction of sinners that Jesus faced. You understand that he faced great difficulty during his life and ministry. Do you understand that on many occasion, I believe that as you would look through the gospel accounts, you'll find in times in which the enemy sought to destroy Jesus before he could ever go to the cross of Calvary. You understand that the enemy, the Sadducees and the Pharisees on more than one occasion described they picked up stones to stone our Lord and Savior Jesus Christ. But shall I say to you this morning that he could not die from stoning. He had to go to that old rugged cross. It's what had been prophesied that he would go to that cross and he would shed his precious blood for you and for me and for all of mankind, and we find that Jesus, he suffered those things. He endured the contradiction of sinners. By the way, shall I say this, turn over to the book of Matthew, if you will, in chapter 16.",
      "context": "himself. Wow. Here as we look at Hebrews 12 and verse number three, they, the original recipients and us this morning by way of preservation, w...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2194",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2471.7600021362305,
      "text": "to the cross. I believe that Saint was trying to kill him in the garden before he could ever get to the cross, because the Bible here in Hebrews tells us that he, for the joy that was set before him, Jesus understood that which he would accomplish on the cross of Calvary with his precious blood, the redemption of mankind, the plan would now be complete with his death, burial, and glorious resurrection, and so we find that Saint, I believe, was seeking to kill him so he can never make it to the cross. When we begin to think about what the writer in Hebrews tells us here in Hebrews 12 and verse number 3, what it is that we should consider about the life and ministry of the Lord Jesus Christ, we would find this, that in spite of great opposition, he finished the work that he was given to do. And I would submit to you this morning that we need to take note. I would submit to you this morning that as we notice what he says that we would consider him, listen, there are going to be people that will oppose you. The enemy does not want you to run the race. The enemy does not want you to finish the race. The enemy is perfectly content with you being distracted and never fulfilling what God has called you",
      "context": "...ever make it to the cross. When we begin to think about what the writer in Hebrews tells us here in Hebrews 12 and verse number 3, what it is that we should consider about the life and ministry of the Lord Jesu...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2471",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 3062.6400299072266,
      "text": "into us to help us to be properly focused as we run this race? I wonder this morning, will we finish our race? Will we finish? I hope this morning that you would say with the Apostle Paul that I might finish my course with joy, that that's your desire. Having that stated desire does not guarantee that you will finish your race with joy, but it goes a long way to getting you there, amen? And we state that desire, oh Lord, help me to finish my course with joy. And then we can come to that place, Lord willing. We get to the end of our life. We're going to pass through that door called death, and we'll ever be with our Savior, that we could say, I have finished my course, I finished. I did what God has called me to do. This morning, what a great challenge is given to us in these three verses of Scripture in Hebrews 12. I'm mindful of what Paul says at the end of the book of 1 Corinthians, really the 15th chapter. It's got 16 chapters, but in chapter 15, therefore, my beloved brethren, be steadfast, unmovable, always abounding in the work of the Lord. For you know that your work is not in vain, right? Your work, Lord, is not in vain. And we just keep our eyes on the Lord, and we just say, by God's grace and with God's help, I'm going to finish the race.",
      "context": "...me to do. This morning, what a great challenge is given to us in these three verses of Scripture in Hebrews 12. I'm mindful of what Paul says at the end of the book of 1 Corinthians, really the 15th chapter. It...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=3062",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1913.5799560546875,
      "text": "being eternal, He knew that He was going to finish this work and He says I have finished the work. I have finished. Aren't you thankful that He finished? He didn't just live a sinless life and just heal a bunch of people and perform miracles and then just say, well, I'm not going to do that part. No, if you look back in Hebrews 12 for the joy that was set before Him He endured the cross, despising the shame. Why? Because He understood that was the purpose. It was for Me that He died on that cross. We find that it's in John 19 in verse 30 that Jesus lifts up His head and as it says, it is finished. And He bowed His head and gave up the ghost. We've been told in John 10 that He's the Good Shepherd and that the Good Shepherd lays down His life for the sheep. And Jesus did just that. And just before He bowed His head and gave up the ghost, He said, it is finished. This morning, we have great examples. There's a cloud of witnesses. Archipus is receiving this charge, but we make application for us this morning. We see it. There's a cloud of witnesses. There are many people that we could look to and we could say, they finished their course. They fulfilled their ministry. They did what God called them to do. But I want you to understand that in Hebrews 12,",
      "context": "...nd perform miracles and then just say, well, I'm not going to do that part. No, if you look back in Hebrews 12 for the joy that was set before Him He endured the cross, despising the shame. Why? Because He unde...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1913",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1987.5799560546875,
      "text": "us this morning. We see it. There's a cloud of witnesses. There are many people that we could look to and we could say, they finished their course. They fulfilled their ministry. They did what God called them to do. But I want you to understand that in Hebrews 12, when we read that phraseology about a cloud of witnesses, that really the focus of that passage of Scripture is on us. Notice it in Hebrews 12 in verse number 1. We read about that cloud of witnesses, but really the focus is upon the believers that are still living. We find that He says this in Hebrews 12 in verse number 1. Wherefore, seeing also we also are encompassed about with so great a cloud of witnesses, notice, let us, let us lay aside every weight and the sin which doth so easily beset us and let us run with patience the race that is set before us. Four times the word us is used in verse number 1 of Hebrews 12. Because the emphasis is, yes, there's a great cloud of witnesses, but we have to run our race. I would submit to you this morning that by way of application, we will look at this verse in Hebrews 12 in verse number 1 and speak of the race that is set before us as our ministry. The race. And the reality is that as we look at this passage of Scripture we see, yes,",
      "context": "...fulfilled their ministry. They did what God called them to do. But I want you to understand that in Hebrews 12, when we read that phraseology about a cloud of witnesses, that really the focus of that passage of...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1987",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2067.5799560546875,
      "text": "morning that by way of application, we will look at this verse in Hebrews 12 in verse number 1 and speak of the race that is set before us as our ministry. The race. And the reality is that as we look at this passage of Scripture we see, yes, there's a cloud of witnesses. Yes, Archippus, there are many others that have fulfilled their ministry, but the charge is to Archippus to take heed to the ministry. You've been discouraged and you've dealt with whatever opposition you've dealt with, but you need to take heed to the ministry which thou hast received in the Lord that thou fulfill it. There's a cloud of witnesses. Finally this morning, there's a challenge for each of us. Contextually in Colossians 4 as we close out the book, we find that the Lord is speaking to Archippus. But by way of application, I believe this morning that this charge can be applied in each of our lives. That thou fulfill it. You say, how is it that I can fulfill the ministry that I've been given of the Lord? See, understand this morning that there are many adversaries. Understand this morning that we have an enemy. And the enemy wants to destroy us. He wants to devour us. The enemy would like to do nothing more but to derail us and to distract us, to cause us to be discouraged so that we quit. No doubt there are people",
      "context": "morning that by way of application, we will look at this verse in Hebrews 12 in verse number 1 and speak of the race that is set before us as our ministry. The race. And the re...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2067",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2561.3399505615234,
      "text": "then they all thought John's gonna live until Jesus comes back. That's not what, that's not what Jesus said. What he's saying is that don't worry about other people. Focus on what I told you, Peter, follow me. Peter, follow me. Number two, number one was know your ministry. Number two, keep your eyes on Jesus. Keep your eyes on Jesus. Can I tell you this morning, people will fail you. People will hurt you. What did Paul say? The more I love, the less I be loved. People will hurt you. The people that you care about and minister to the most will hurt you the deepest. But when we have our eyes on Jesus, he will never disappoint you. Never will Jesus disappoint you. Man will disappoint you, but Jesus will never. Aren't you thankful for that? You know what he said in Hebrews 12 in verse 1? We've referenced it a couple of times already, but in verse number 2, looking unto Jesus, the author and finisher of our faith, we read at the end of verse number 1, let us run with patience the race that is set before us. Well then, how do I run this race? How do I finish this course? Looking unto Jesus. Archippus, get your eyes on Jesus. Did he not have adversity? Absolutely. But he finished his course. Archippus, for us this morning, keep our eyes on the Lord. Number three, remain humble. Pride destroys. People will",
      "context": "...n will disappoint you, but Jesus will never. Aren't you thankful for that? You know what he said in Hebrews 12 in verse 1? We've referenced it a couple of times already, but in verse number 2, looking unto Jesu...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2561",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 1687.719970703125,
      "text": "lessons and messages, we'll be able to reference back but we find that the Bible says that that Jacob then gives Esau this food and he ate and he drank and Then he rose up and went his way Despised his birthright notice keep your hand here in Genesis 26 But notice what the scriptures tell us in the book of Hebrews in the 12th chapter how this man Esau is described in Hebrews chapter number 12 in verse number 16, the Bible gives us a description of This man Esau. It's not a very good description Again as we interpret Scripture with Scripture and compare Scripture with Scripture we get we gather Additional insight and notice what God says in Hebrews 12 in verse number 16 Lest there be any fornicator notice or profane person as Esau Who for one morsel of meat sold? His birthright two things that I would take away from this particular statement that is given to us in verse number 16 is the way in which the scriptures authenticate the record of Genesis So many people think that the the scriptures are so independent one of another But the reality is that when you study the New Testament, it's really exciting to see how the New Testament Authenticates the Old Testament in the accounts that you read of as their reference back to Help see that authentication",
      "context": "...nd compare Scripture with Scripture we get we gather Additional insight and notice what God says in Hebrews 12 in verse number 16 Lest there be any fornicator notice or profane person as Esau Who for one morsel...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=1687",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 1758.9199829101562,
      "text": "that the the scriptures are so independent one of another But the reality is that when you study the New Testament, it's really exciting to see how the New Testament Authenticates the Old Testament in the accounts that you read of as their reference back to Help see that authentication But we also see that the Bible refers to Esau as being this profane person. It really just simply means this ungodly ungodly and and when you think about the the Symbolism that we mentioned in our previous message and that I referenced by way of introduction this evening And you think about the flesh versus the spirit and you understand the flesh minds fleshly things The flesh is interested in the here and now the immediate the flesh as we see Given through the actions of Esau says I need this now and I'm willing to forfeit whatever I need to forfeit in order to get this that I need right now And I sacrifice the future for the immediate. Now we understand that God has a plan through all of this, and we'll mention that here in just a moment. But notice the Bible says in verse number 17, continuing in Hebrews 12, for ye know how that afterward, when he would have inherited the blessing, he was rejected, for he found no place of repentance, though he sought it carefully with tears.",
      "context": "...'ll mention that here in just a moment. But notice the Bible says in verse number 17, continuing in Hebrews 12, for ye know how that afterward, when he would have inherited the blessing, he was rejected, for he...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=1758",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oOFjt9BwwsE",
      "timestamp": 1825.5599613189697,
      "text": "mention that here in just a moment. But notice the Bible says in verse number 17, continuing in Hebrews 12, for ye know how that afterward, when he would have inherited the blessing, he was rejected, for he found no place of repentance, though he sought it carefully with tears. And here it's speaking of the seeking of Esau for the blessing, he sought the blessing with tears. He didn't seek repentance with tears, he sought the blessing with tears. He was angered with his brother over what had transpired. And we note here as we look at the circumstances in this particular text of Scripture, and we note the behavior of Esau, and we can make application as to how we can operate in the flesh, and how we need to be careful not to mind fleshly things. That we would understand, as Paul says in 2 Corinthians 4, while we look not at these things which are temporal, but at things which are eternal. But I want to focus just for a moment on Jacob back in Genesis chapter number 25, because when we look back at Jacob, and we find that often he speaks about his name closely associated with actually about three different Hebrew words, but a couple of them carry with it the idea of being a deceiver, and Jacob is known for that, and we understand that.",
      "context": "mention that here in just a moment. But notice the Bible says in verse number 17, continuing in Hebrews 12, for ye know how that afterward, when he would have inherited the blessing, he was rejected, for he...",
      "sermon_title": "Sermon oOFjt9BwwsE",
      "url": "https://www.youtube.com/watch?v=oOFjt9BwwsE&t=1825",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}