{
  "reference": "Hebrews 5",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 1357.6800384521484,
      "text": "and of the true tabernacle which the Lord pitched, and not man. We've read some of these verses already, but you notice as I repeat in Hebrews 4 and verse number 14, the Bible says, seeing then that we have a great high priest that is passed into the heavens. Jesus, the Son of God, let us hold fast our profession. See, the high priest, he could only enter into the holy of holies. He could only pass through that veil, but Jesus entered into heaven. We find that in chapter number 7, we studied this a few weeks ago, but in verse number 25, the Bible says at the end of that verse, seeing He ever liveth to make intercession for them. I'm so thankful that our Savior lives. Hallelujah, what a Savior. And He is our high priest. Notice that as we look at the passage of Scripture, not only does our high priest minister in a better place, but number two, our high priest presented a better offering. He presented a better offering. As we look at the passage, we come to verse number 3 in Hebrews chapter number 8, and the Bible says this, for every high priest is ordained to offer gifts and sacrifices. He dealt with this back in chapter number 5, when he talked about the fact that they were to bring those sacrifices. Notice in verse number 1 of Hebrews 5, the Bible says,",
      "context": "...when he talked about the fact that they were to bring those sacrifices. Notice in verse number 1 of Hebrews 5, the Bible says,",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=1357",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 1425.8800354003906,
      "text": "8, and the Bible says this, for every high priest is ordained to offer gifts and sacrifices. He dealt with this back in chapter number 5, when he talked about the fact that they were to bring those sacrifices. Notice in verse number 1 of Hebrews 5, the Bible says, for every high priest taken from among men is ordained for men in things pertaining to God, that he may offer both gifts and sacrifices for sins. In chapter 7, in verse number 27, the Bible talks about how they would first offer for their own sins, then for the people's. We find that as we go through the book of Hebrews and you enter into the 10th chapter, you find that the Bible would say this about these offerings. In verse number 1, it says, for the law having a shadow of good things to come, and not the very image of the things, can never with those sacrifices which they offered, notice this, year by year continually, make the comers thereunto perfect. Notice it says, in verse number 3, but in those sacrifices, there is a remembrance again made of sins every year, for it is not possible the blood of bulls and of goats should take away sins. Wherefore, when he cometh into the world, he sayeth, sacrifice and offering thou wouldest not, but a body hast thou prepared for me. Notice in verse number 11, the Bible says, and every priest standeth daily ministering and offering,",
      "context": "...when he talked about the fact that they were to bring those sacrifices. Notice in verse number 1 of Hebrews 5, the Bible says, for every high priest taken from among men is ordained for men in things pertainin...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=1425",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}