{
  "reference": "Hebrews 8",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 425.67999267578125,
      "text": "book of John When he was speaking about the fact that he would go to the cross of Calvary and that he would rise from the dead He said this in verse 19 of John 2 he said destroy this temple and in three days I will raise it up Then said the Jews forty and six years was this temple in building and wilt thou rear it up in three days? But he Jesus spake of the temple of his body We spent a number of weeks a few years ago on Wednesday evening Studying all of the details with regard to the tabernacle and as we studied the tabernacle We understood that the tabernacle was a picture It was a type and how that every detail within the tabernacle in some way is pointing to Jesus Christ We'll deal with some of those things as we go through here in Hebrews 8 and then again in Hebrews 9 as some of those things Are dealt with but we rejoice in the fact that as we come to this passage of Scripture You notice in verse number 1 of chapter 8. It's where I've adopted the title this morning He says we have such and high priest I've simply titled we have and high priest see the reality is that these people the Jewish believers They understood what it was to have a priest and they understood the responsibility of the priest",
      "context": "... some way is pointing to Jesus Christ We'll deal with some of those things as we go through here in Hebrews 8 and then again in Hebrews 9 as some of those things Are dealt with but we rejoice in the fact that ...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=425",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 991.260009765625,
      "text": "true tabernacle. It's not pitched by man, it was pitched by the Lord. If you run all the way back to the book of Exodus, and for sake of time we won't do that, we find that the Old Testament tabernacle served as a shadow and it was made after the pattern that was given to Moses. We understand that even as you look at verse number 5 here in Hebrews 8, the Bible says, who serve unto the example and shadow of heavenly things. Notice what the Bible continues to say here, as Moses was admonished of God when he was about to make the tabernacle. For see, saith he, that's God, that thou, that's Moses, make all things according to the pattern showed to thee in the mount. You might want to jot down in your notes Exodus chapter 25 in verse number 40, Exodus chapter 26 in verse number 30. In both of those passages of Scripture or verses of Scripture, we find that God gives the instruction to Moses and God specifically tells Moses, you have to follow the pattern, you can't deviate. Why? Because of what it typified, because of the type, because of what the tabernacle was a type of, and we understand in all of the offerings and all of those things how that they were a picture of Messiah. We think about the children of Israel as they first left from Egypt and",
      "context": "... the pattern that was given to Moses. We understand that even as you look at verse number 5 here in Hebrews 8, the Bible says, who serve unto the example and shadow of heavenly things. Notice what the Bible co...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=991",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}