{
  "reference": "Hebrews 13",
  "occurrences": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2017.2200317382812,
      "text": "with you. Man, they had some communion with God. We understand that as we look at the truth of the New Testament, Jesus said in Matthew 28 before His ascension, all power is given unto Me. He gives the great commission. And He says, lo, I am with you always. Hebrews 13 and v. 5, a precious promise of the Word of God. He will never leave thee nor forsake thee. When we understand the truth of v. 6, He is my Helper. Therefore, who or what am I going to fear? The psalmist said in Psalm 121, I will lift up mine eyes unto the hills. From whence cometh my help? My help cometh from the Lord which made heaven and earth. He is my Helper. He's your Helper. And here, these men, they find themselves in the fiery furnace, they find themselves enjoying some communion with God. Can I tell you this morning that if you're going to stand and if I'm going to stand, we may face some consequences. But can I tell you, God will be with you. God will be with you. And you'll have seasons of communion that are sweeter than you've ever enjoyed any time before. I think about Paul and Silas when they were in prison. They were cast into the prison fast, locked away. But man, they were singing, were they not? Singing to God, they were having communion with God. See, this morning,",
      "context": "..., all power is given unto Me. He gives the great commission. And He says, lo, I am with you always. Hebrews 13 and v. 5, a precious promise of the Word of God. He will never leave thee nor forsake thee. When we...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2017",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G38C0Tuh6UA",
      "timestamp": 1365.939956665039,
      "text": "Why? Well, we'll get to the why at the end of the text because he's got an eternal focus, not a temporal focus. He's got a focus of pleasing God, not pleasing man. And we find that he says we're not distressed. He says, number two, in verse number eight, when he mentions about we are perplexed, but not in despair. To not be, he says, we're not without hope. He says this, we're not depressed. You hear that word often used about depression. I read a bunch of statistics this week. I can't remember exactly the number, so don't quote me, but it was about 45%, if I remember correctly, of pastors that were surveyed that reported they were depressed. Let me ask you this, if the pastor's depressed, how's he gonna lead the ministry? If you're depressed, how are you leading your home? You know what I'm saying? It's a great number. But Paul says God's provision, his grace. Oh yeah, I'm perplexed, but I'm not in despair. I'm not without hope. I'm not depressed. He says this in verse number nine, persecuted. Oh yeah, we're persecuted, but not forsaken. It means not to be abandoned. It means not to be deserted. It means not to be deserted. Oh, I'm so reminded of the truth, and I used it by way of introduction, that there's hardships, but there's help. And our God, it says in Hebrews 13, verse five and six, at the end of verse five,",
      "context": "...I used it by way of introduction, that there's hardships, but there's help. And our God, it says in Hebrews 13, verse five and six, at the end of verse five,",
      "sermon_title": "Sermon G38C0Tuh6UA",
      "url": "https://www.youtube.com/watch?v=G38C0Tuh6UA&t=1365",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G38C0Tuh6UA",
      "timestamp": 1439.0999603271484,
      "text": "means not to be deserted. It means not to be deserted. Oh, I'm so reminded of the truth, and I used it by way of introduction, that there's hardships, but there's help. And our God, it says in Hebrews 13, verse five and six, at the end of verse five, I will never leave thee nor forsake thee, so that we might boldly say, the Lord is my helper. I will not fear what man shall do unto me. Listen, I'm not abandoned. I'm not deserted. There are times, loneliness, it's on the top list of those that are talking, these pastors that were interviewed and surveyed. Oh, they feel loneliness, they feel, no, no, the Holy Spirit's with us. The Holy Spirit's with us, and as we look here, and we see God's provision, we rejoice in knowing that in the pressures, there's also the provision, and this is true in your life just as much as it's true in my life. This is true in the lives of the believers in the church in Corinth as much as it was in the life of the apostle Paul. And he says in verse number nine, we're cast down, but not destroyed. Cast down, but not destroyed, the idea, obviously, to be killed or to be rendered useless. I think Paul had a fear of becoming a castaway. Mentioned in 1 Corinthians chapter nine. Paul understood God had a purpose for his life, and God understood he faced great pressures.",
      "context": "...I used it by way of introduction, that there's hardships, but there's help. And our God, it says in Hebrews 13, verse five and six, at the end of verse five, I will never leave thee nor forsake thee, so that we...",
      "sermon_title": "Sermon G38C0Tuh6UA",
      "url": "https://www.youtube.com/watch?v=G38C0Tuh6UA&t=1439",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 2859.6199951171875,
      "text": "and he wants to deceive me, and one thing that he uses is fear, fear. When we look at these promises of God that we've looked at in the New Testament, and we are mindful that over and over that God says to his people, fear not, be not afraid. Over and over and over we read those words in this precious book. I'm mindful of the truth of Hebrews 13, in verses 5 and 6, the Bible says in Hebrews 13 verse 5, let your conversation be without covetousness, and be content with such things as you have, completely different message in that portion of verse number 5, but notice what he says at the end of verse number 5, for he hath said, I will never leave thee nor forsake thee, isn't that precious? But you know what the result of that understanding is, is verse number 6, so that we may boldly say the Lord is my helper, and I will not fear what man shall do unto me. Why is it that you do not have any fear? Because the Lord is my helper, the Lord is my helper, and he said I'll never leave thee nor forsake thee. Remember Psalm 121, I will lift up mine eyes unto the hills, from whence cometh my help? My help cometh from the Lord, notice this, which made heaven and earth. Now how did he make it? He spoke and it was so, amen?",
      "context": "...raid. Over and over and over we read those words in this precious book. I'm mindful of the truth of Hebrews 13, in verses 5 and 6, the Bible says in Hebrews 13 verse 5, let your conversation be without covetous...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=2859",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 589.739990234375,
      "text": "we study this passage of Scripture this morning is how is it that we respond? in time of fear How is it that we respond with dilemmas that we face in time of difficulty in time of trial? When we have that fear, how does it does it cripple us? Does it cause us to just begin to make all sorts of decisions that that are not appropriate? Decisions we find that the fear that Jehoshaphat experiences in this passage of Scripture caused him to seek God. And I mean, that's powerful. It's such an imperative truth for us to grasp this morning because v. 3 says that Jehoshaphat feared and set himself to seek the Lord and proclaimed a fast throughout all Judah. Fasting in the Word of God as we've mentioned throughout the years is a sign of really the seriousness of the individual seeking the Lord. He's not only seeking God through prayer, but he's proclaimed this fast. Why? Because they're serious about what's going on and through this prayer, this seeking and this fasting, they're demonstrating their seriousness with regard to the situation. And so we find that the fear that Jehoshaphat would experience because of this dilemma properly drove him to the Lord. Sometimes we get to the place in our lives, and I understand that even as we studied in Hebrews 13 just a few weeks ago, when we understand that our God is with us,",
      "context": "...o the Lord. Sometimes we get to the place in our lives, and I understand that even as we studied in Hebrews 13 just a few weeks ago, when we understand that our God is with us,",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=589",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 665.8600234985352,
      "text": "the fear that Jehoshaphat would experience because of this dilemma properly drove him to the Lord. Sometimes we get to the place in our lives, and I understand that even as we studied in Hebrews 13 just a few weeks ago, when we understand that our God is with us, He said, I'll never leave thee nor forsake thee. And then we can say that we're not gonna fear what man can do unto us. Why? Because God is my helper. But even though we understand that biblical truth, I would submit to you this morning that there are times even as the people of God that circumstances will invade your life and invade my life that will cause us to respond with fear. But what do we do in that time of fear? Oh, we seek God. And we begin to have Him remove those fears, right? Because we're focused upon Him and we're seeking Him and we're seeing how He will work in and through the situation. So number one, we consider the dilemma. Number two, notice the declaration of Jehoshaphat. Over the next several verses, we find this response of Jehoshaphat to this dilemma. And as we begin to just dissect, really verses three through 13, and begin to look at this prayer and this proclamation, this declaration, as I have termed it, we find that not only is it impactful for us as the people of God, but I would submit to you this morning",
      "context": "...o the Lord. Sometimes we get to the place in our lives, and I understand that even as we studied in Hebrews 13 just a few weeks ago, when we understand that our God is with us, He said, I'll never leave thee no...",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=665",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1425.0000305175781,
      "text": "a little bit about that, don't we? He says, in me, what a great contrast. In me, you might have peace. In the world, you shall have tribulation. We have a world full of tribulation, trouble, trial. The disciples were going to face tribulation. The disciples were gonna face persecution. They were gonna deal with difficulties and adversity. And Jesus lets them know that even though in the world they're gonna have tribulation, that in him, they can have peace. This is a great truth that is given to us in John 16 in verse number 33, that yes, we understand that in that world, there's going to be tribulation and we see it, we experience it, we understand this morning the way that the world operates. But I understand this morning that though all of the enemy is raging and all the wickedness that is taking place and all the tribulation that is around me, that we can still have peace. Why? Because Jesus said, in me, you might have peace. He said in Hebrews 13, I will never leave thee nor forsake thee. We find that in Acts chapter 12, it's an interesting passage of scripture in which God provides for us an account of what's taking place with the persecution and Herod and all that he's doing and killing James and intending to kill Peter and putting him in prison and the church is praying and all that is taking place.",
      "context": "... me, that we can still have peace. Why? Because Jesus said, in me, you might have peace. He said in Hebrews 13, I will never leave thee nor forsake thee. We find that in Acts chapter 12, it's an interesting pas...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1425",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}