{
  "reference": "Hosea 2",
  "occurrences": [
    {
      "sermon_id": "kSiYJ1lbpPo",
      "timestamp": 757.9199981689453,
      "text": "because of their guilt they would face judgment. By the way, we find that in the Pentateuch, as you study throughout the instruction that God gives to his people Israel, God made it abundantly clear that if you do this, here's the blessing. If you do this, here's the judgment. I mean, over and over we find that God made it crystal clear to his people, we dealt with it a little bit in Sunday school this morning, about the choices. The consequences to your choices and to my choices are not always known, but our choices always have consequences. At times, however, the consequences of our choices are crystal clear, and God says I have a blessing for you, and I set before you a blessing and a curse. A blessing if you obey, a curse if you disobey. And we find this evening that the children of Israel were guilty, and therefore they would face judgment, but I'm thankful that our God is long-suffering, I'm thankful that our God is merciful, I'm thankful that our God is loving, and we look at that here in this portion of Scripture. Here's the question that was posed in Hosea chapter 2. The question reads this way, what is the meaning of the valley of Achor for a door of hope in Hosea 2 and verse number 15? We'll begin reading with me in verse 14, we're going to look at the context here as we've",
      "context": "...er 2. The question reads this way, what is the meaning of the valley of Achor for a door of hope in Hosea 2 and verse number 15? We'll begin reading with me in verse 14, we're going to look at the context he...",
      "sermon_title": "\"The Valley Of Achor\" Hosea 2:14-23",
      "url": "https://www.youtube.com/watch?v=kSiYJ1lbpPo&t=757",
      "channel": "Unknown",
      "publish_date": 20240819
    },
    {
      "sermon_id": "kSiYJ1lbpPo",
      "timestamp": 822.0399932861328,
      "text": "was posed in Hosea chapter 2. The question reads this way, what is the meaning of the valley of Achor for a door of hope in Hosea 2 and verse number 15? We'll begin reading with me in verse 14, we're going to look at the context here as we've already dealt with the introduction, kind of understand the setting, look at verse 14 if you will. The Bible says in Hosea 2 and verse 14, therefore behold, I will allure her and bring her into the wilderness and speak comfortably unto her. And I will give her her vineyards from thence, and the valley of Achor for a door of hope. And she shall sing there as in the days of her youth, and as in the day when she came up out of the land of Egypt. And it shall be at that day, saith the Lord, that thou shalt call me Ishi, and shalt call me no more Bally. For I will take away the names of Balaam out of her mouth, and they shall no more be remembered by their name. And in that day will I make a covenant for them with the beast of the field, and with the fowls of heaven, and with the creeping things of the ground. And I will break the bow and the sword and the battle out of the earth, and will make them to lie down safely.",
      "context": "...er 2. The question reads this way, what is the meaning of the valley of Achor for a door of hope in Hosea 2 and verse number 15? We'll begin reading with me in verse 14, we're going to look at the context he...",
      "sermon_title": "\"The Valley Of Achor\" Hosea 2:14-23",
      "url": "https://www.youtube.com/watch?v=kSiYJ1lbpPo&t=822",
      "channel": "Unknown",
      "publish_date": 20240819
    },
    {
      "sermon_id": "kSiYJ1lbpPo",
      "timestamp": 2234.500030517578,
      "text": "of what is going to happen, that at that point when the millennial kingdom begins, all of Israel shall be saved. Those that trusted in the true Messiah, the Lord Jesus Christ, because of the tribulation and all that's taking place, all Israel shall be saved. That's what it means. And so we find that when we look here at, in that day, at that day, the repeated phraseology in Hosea 2, when is it going to happen? Well, the day of Christ, the day of the Lord, that seven-year period begins with the rapture of the church. The clock begins. Three and a half years, I mean exactly three and a half years, the abomination of desolation is going to take place, the midpoint of the tribulation. Daniel speaks about it. Jesus speaks about it. Paul speaks about it. It's going to take place at that time, and we find that he's going to violate the peace treaty, the Antichrist will, all of that stuff that's going to happen, and then there's going to be three and a half more years. Then there's going to be the battle of Armageddon. Jesus is coming back. He's coming back with his saints, hallelujah. That's the next time, Samantha, I'm going to ride a horse, amen? And hallelujah, I rode a horse down in Tennessee a few years ago, and we're planning a trip to Tennessee tomorrow, and I said, one thing we're not doing is riding horses, amen?",
      "context": "...ns. And so we find that when we look here at, in that day, at that day, the repeated phraseology in Hosea 2, when is it going to happen? Well, the day of Christ, the day of the Lord, that seven-year period b...",
      "sermon_title": "\"The Valley Of Achor\" Hosea 2:14-23",
      "url": "https://www.youtube.com/watch?v=kSiYJ1lbpPo&t=2234",
      "channel": "Unknown",
      "publish_date": 20240819
    }
  ]
}