{
  "reference": "Isaiah 1",
  "occurrences": [
    {
      "sermon_id": "MyCOoL7O768",
      "timestamp": 1079.5599975585938,
      "text": "to repent. But obviously, though at this time, in the time of the writing, there was no repentance, and therefore the judgment is given, and it's explained to us, again, the severity of the judgment. We read already in Numbers 25, and we referenced historically the severity of that judgment. But notice here, the Bible says, behold, verse 22, I will cast her into a bed, and them that commit adultery with her into great tribulation, except they repent of their deeds. So again, there's still this offer of repenting. You know, throughout the Old Testament, especially the minor prophets, you'll read regularly where the Bible says that God says, return, return, return, turn to me. God is pleading with His people. God is so longsuffering to His people. Think about the nation of Israel, and think about Judah and all of their wickedness and all of their idolatry. We find that God continuously raised up the prophets to come and to deliver a message, and that message was, think about Isaiah 1, come and let us reason together. Though your sins be as scarlet, they can be as white as snow. God is calling these people within the church here that they've allowed this false teacher, this one that called herself a prophetess, and those that have been caught up with this false teaching, He says they need to repent. Notice in verse 23, and I will kill her children with death, and all the churches shall know",
      "context": "...inuously raised up the prophets to come and to deliver a message, and that message was, think about Isaiah 1, come and let us reason together. Though your sins be as scarlet, they can be as white as snow. God...",
      "sermon_title": "\"The Church In Thyatira - Part 2\"  Revelation 2:20-29",
      "url": "https://www.youtube.com/watch?v=MyCOoL7O768&t=1079",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 2085.5999450683594,
      "text": "the will of God in his life to minister to those that God would call him to minister to, to follow Jesus wherever Jesus would lead him to go. You know, tonight, if we love Jesus the way that we should, then we, too, would be in the same position. Lord, I'll do what you want me to do. I'll go where you want me to go because I love you. Go over to the book of Isaiah, if you will, Isaiah chapter 1. Give you a few thoughts tonight from Isaiah and Jeremiah very quickly. There's a problem in the day of Hosea, in chapter 10 of Hosea, the Bible says they had a divided heart. You know, we've got to be careful. We can't have a divided heart. We can't serve God and mammon. That's what Jesus said. Isaiah chapter number 1, we find that verse number 11, notice what the Bible says in Isaiah 1 and 11, to what purpose is the multitude of your sacrifices unto me, saith the Lord? I am full of the burnt offerings of rams and the fat of red fed beasts, and I delight not in the blood of bullocks or of lambs or of he goats. When you come to appear before me, who hath required this at your hand to tread my courts? Bring no more, notice what it says, vain oblations, incenses and abomination unto me, the new",
      "context": "...at Jesus said. Isaiah chapter number 1, we find that verse number 11, notice what the Bible says in Isaiah 1 and 11, to what purpose is the multitude of your sacrifices unto me, saith the Lord? I am full of t...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=2085",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 2145.1199340820312,
      "text": "and I delight not in the blood of bullocks or of lambs or of he goats. When you come to appear before me, who hath required this at your hand to tread my courts? Bring no more, notice what it says, vain oblations, incenses and abomination unto me, the new moons and Sabbaths, the calling of assemblies I cannot away with. It is iniquity, even the solemn meeting, your new moons and your appointed feasts my soul hateth. They are a trouble unto me, I am weary to bear them. And when you spread forth your hands, I will hide mine eyes from you, yea, when you make many prayers, I will not hear. Your hands are full of blood, wash you, make you clean, put away the evil of your doings from before mine eyes, cease to do evil. Understand that as we look at this passage of scripture, that they were bringing offerings, they were, where did they get the idea of bringing offerings? Well, they were doing what God had commanded them to do back in Leviticus. But you know what was missing? Their heart. Their heart. God says, why are you bringing me these things? Notice in Isaiah chapter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse",
      "context": "...pter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=2145",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 2203.719940185547,
      "text": "missing? Their heart. Their heart. God says, why are you bringing me these things? Notice in Isaiah chapter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse that would be quoted later in the Gospels, the Bible says this in verse 13, wherefore the Lord said, forasmuch as this people draw near me with their mouth and with their lips do honor me, but notice, but have removed their heart far from me. And their fear toward me is taught by the precept of men. God says with their mouth, they draw near me with their mouth, and with their lips they do honor me. But there's a problem because their heart, their heart has been removed. In Jeremiah chapter 4 and verse number 4, notice what the prophet says with regard to the subject of our heart tonight. In verse number 3, I'll read with it. In Jeremiah chapter 4 and verse number 3, it says, for thus saith the Lord to the men of Judah and Jerusalem, break up your fallow ground and sow not among thorns, circumcise yourselves to the Lord. Notice what he says, and take away the foreskins of your heart, ye men of Judah and inhabitants of Jerusalem, lest my fury come forth like fire and burn that none can quench it because of the evil of your doings.",
      "context": "...pter 29 and verse 13, notice what the Bible says, and I don't have time to develop all of that from Isaiah 1, but notice in Isaiah 29 and verse 13, a verse that would be quoted later in the Gospels, the Bible...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=2203",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "G5YRE5OaH7s",
      "timestamp": 228.17999267578125,
      "text": "therefore come and therefore he pronounces that even in Deuteronomy chapter 31. Seven times in the book of Judges, we read this statement that the children of Israel did evil, seven times. And we find, obviously, really a theme of the book of Judges is that every man did that which was right in his own sight. There's no king in Israel in those days and we find that people were doing whatever it was that they wanted to do. There was a generation that outlived Joshua and then there was a generation that went, they forsook the Lord. They followed after all sorts of idols and God allowed, because of their evil behavior, he allowed for various people groups to rise up and to bring opposition to them and we find that God would graciously raise up a judge and then they'd turn around and after they'd have a period of peace and rest from whatever that people were that were bringing opposition, we find that they would then, once again, do evil. In Isaiah 1 and verse 16, the prophet says, cease to do evil. Why does he tell them cease to do evil? Well, because they were doing evil. He wouldn't have to tell them to cease to do evil if they were doing no evil, but we find that they were disobedient to so many other commands that have been given and this is not an entire list of the commands",
      "context": "...at people were that were bringing opposition, we find that they would then, once again, do evil. In Isaiah 1 and verse 16, the prophet says, cease to do evil. Why does he tell them cease to do evil? Well, bec...",
      "sermon_title": "\"Abstain From All Appearance of Evil\" I Thessalonians 5:22",
      "url": "https://www.youtube.com/watch?v=G5YRE5OaH7s&t=228",
      "channel": "Unknown",
      "publish_date": 20240415
    }
  ]
}