{
  "reference": "Isaiah 6",
  "occurrences": [
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 307.20001220703125,
      "text": "the righteous Lord loveth righteousness, if you're taking notes this evening, notice number one, and it's a very simple truth, that our God is righteous. Our God is righteous. He's not becoming righteous. He is righteous. And we find that the Bible says that He, the righteous Lord, loveth righteousness. We find that the psalmist says in Psalm 145 and verse number 17, the Lord is righteous in all His ways and holy in all His works. We understand this evening that our God is holy, and that attribute of our God is probably the most pronounced attribute in all of the Scriptures, dealing with the fact that our God is holy. Of course, we're mindful of various passages of Scripture, and one that runs to mind immediately upon thinking of the holiness of God is Isaiah 6, when Isaiah sees God and all of His majesty and His holiness, and the angels there, they cry out, holy, holy, holy. Our God is holy. The Bible teaches us that it's the people of God that we're to give thanks, the remembrance of His holiness. And here we find that as we think about the righteous God that we serve, we would understand that His righteousness really is the expression of His holiness as He deals with mankind. We find that the idea of God's righteousness means that He is just and lawful, that He always does that which is right. And we ought to rejoice in that truth this evening.",
      "context": "...assages of Scripture, and one that runs to mind immediately upon thinking of the holiness of God is Isaiah 6, when Isaiah sees God and all of His majesty and His holiness, and the angels there, they cry out, ...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=307",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "i0tgIGEcUCc",
      "timestamp": 2463.4800415039062,
      "text": "probably for you as well. And lean not unto thine own understanding. We struggle with that, do we not? We're human. That's why God said lean not on your own understanding. In all thy ways. And how many of your ways? All. Acknowledge Him. And He shall direct thy paths. Who better to direct your path and my path than the almighty, all-knowing God? Amen? This evening, when we understand who He is, when we see Him in all of His glory, when we see Him as Isaiah did in Isaiah 6, high, holy, and lifted up, when we read of His attributes and the way in which He's described Himself, but then the way in which He's displayed His attributes, we stand in awe of who He is. The psalmist said in Psalm 48, Great is the Lord, and greatly to be praised. And he ends that chapter with saying, after a whole host of things about how great God is, that this God is our God. Listen, He's trustworthy. He wants us to believe Him. He said in Numbers 14, when He speaks to Moses, How long will it be ere my people believe me? I hope He's not saying that today. I hope that He's not looking at 2021 Christians and saying, Aren't they believing me? I've given them my word. I've proven myself over and over. Why won't they believe me? And I'll finish with the verse that I started with,",
      "context": "...when we understand who He is, when we see Him in all of His glory, when we see Him as Isaiah did in Isaiah 6, high, holy, and lifted up, when we read of His attributes and the way in which He's described Hims...",
      "sermon_title": "Sermon i0tgIGEcUCc",
      "url": "https://www.youtube.com/watch?v=i0tgIGEcUCc&t=2463",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "timestamp": 1116.5999755859375,
      "text": "And we come there to verse number 7, he says, go to, let us go down, again, revealing to us even in the opening pages of the Word of God, this truth of the Trinity. Think about the call of Isaiah, turn to the book of Isaiah, if you will. The third illustration we'll look at this evening is that of the call of Isaiah. And by the way, when we look at Isaiah chapter number 6, there's many things that we could rejoice in there in Isaiah 6 and be not, as we, as we look at the passage of Scripture that we understand the importance of being in that same position of Isaiah, seeing God in His rightful place, high, holy, and lifted up, and the Bible says that His train did fill the temple. I'm so thankful that we serve the God of the universe. And when we look at Isaiah chapter number 6, it tells us, it sets the timing for us, this is in the year that King Uzziah died, and there's some things that we know about King Uzziah, we're aware of some things as we study his life, but when we see that this really life-altering, if you will, nation-altering event takes place, that the king has died, that the Bible says that Isaiah's giving his testimony, he says, I saw also the Lord sitting upon a throne, high and lifted up, and His train filled the temple.",
      "context": "...way, when we look at Isaiah chapter number 6, there's many things that we could rejoice in there in Isaiah 6 and be not, as we, as we look at the passage of Scripture that we understand the importance of bein...",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE&t=1116",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}