{
  "reference": "Isaiah 40",
  "occurrences": [
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 2467.9199752807617,
      "text": "waiteth for the Lord more than they that watch for the morning. I say more than they that watch for the morning. Waiting on the Lord. Notice it says not only waiting on the Lord. Listen, when we think about waiting on the Lord, it's not that we're sitting idle doing nothing. I told you that when we waited for those seven months, that was before we ever even got a call about Fellowship Baptist Church, that we waited for seven months. We kept serving God. I kept teaching the adult Sunday school class. I remember that each time we'd start a new quarter, my pastor would meet with me and say, are you sure you want to start a new quarter? We don't know when you're going to leave. We don't know when God's going to open up a door. I said, well, as far as we know right now, I'm here, so let's just keep teaching if you're okay with it. I just kept on teaching. Kept on serving. As we wait on the Lord, it says in verse number 5, and in His word do I hope. Do I hope. Having that confidence that God's going to do what He said He's going to do. That blessed hope that Paul speaks of when he's writing and encouraging Titus, in Titus chapter number 2. We're familiar with this verse of scripture, Isaiah 40 and verse number 31. Someone years",
      "context": "...ting and encouraging Titus, in Titus chapter number 2. We're familiar with this verse of scripture, Isaiah 40 and verse number 31. Someone years",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=2467",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 2522.9999771118164,
      "text": "I hope. Having that confidence that God's going to do what He said He's going to do. That blessed hope that Paul speaks of when he's writing and encouraging Titus, in Titus chapter number 2. We're familiar with this verse of scripture, Isaiah 40 and verse number 31. Someone years ago no doubt put this particular verse to song, and it is a good scripture song in Isaiah 40 and verse number 31. But they that wait upon the Lord shall renew their strength. They shall mount up with wings as eagles. They shall run and not be weary. They shall walk and not faint. Then I want you to think about this in James chapter number 5, and we'll close with this verse of scripture. In James chapter number 5, as you're turning to James, let me remind you of what the writer of Hebrews says in Hebrews 10 and verse 37, if we get a little while, and he that shall come will come and will not tarry. Aren't you thankful for that promise? No doubt at some point in your life you've heard someone say if the Lord doesn't tarry His coming, He's not going to. He says He will not tarry. He's coming right on time. But notice what James says in James 5 and verse number 7. It says be patient therefore brethren unto the coming of the Lord. Notice this, behold",
      "context": "...ting and encouraging Titus, in Titus chapter number 2. We're familiar with this verse of scripture, Isaiah 40 and verse number 31. Someone years ago no doubt put this particular verse to song, and it is a good...",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=2522",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}