{
  "reference": "Isaiah 56",
  "occurrences": [
    {
      "sermon_id": "G5YRE5OaH7s",
      "timestamp": 288.6000061035156,
      "text": "evil? Well, because they were doing evil. He wouldn't have to tell them to cease to do evil if they were doing no evil, but we find that they were disobedient to so many other commands that have been given and this is not an entire list of the commands that God gives with regard to doing evil. You could look it up and I mean, there are just countless times that God gives this instruction to his people, but we find in Isaiah, he says, cease to do evil. We find it's also in the book of Isaiah. Often we reference this where in Isaiah's day, they would call evil good and they would call good evil and God brings an indictment against the nation of Israel because of that and you understand that it's never the culture, the society, it's never the individual that determines what's good and what's evil. It is God and God alone who determines what is good and what is evil. We find this evening that Jeremiah says this of the children of Israel, Judah in particular, he says that they are wise to do evil. Now, that's not a commendation, that's a condemning statement. He's not commending them that you are wise to do evil. No, we're not to be wise to do evil. We find that we're to do no evil. In Isaiah 56 and verse two, the Bible says, blessed is the man that doeth this",
      "context": "... you are wise to do evil. No, we're not to be wise to do evil. We find that we're to do no evil. In Isaiah 56 and verse two, the Bible says, blessed is the man that doeth this",
      "sermon_title": "\"Abstain From All Appearance of Evil\" I Thessalonians 5:22",
      "url": "https://www.youtube.com/watch?v=G5YRE5OaH7s&t=288",
      "channel": "Unknown",
      "publish_date": 20240415
    },
    {
      "sermon_id": "G5YRE5OaH7s",
      "timestamp": 360.3599853515625,
      "text": "a commendation, that's a condemning statement. He's not commending them that you are wise to do evil. No, we're not to be wise to do evil. We find that we're to do no evil. In Isaiah 56 and verse two, the Bible says, blessed is the man that doeth this and the son of man that layeth hold on it, that keepeth the Sabbath from polluting it and then it says this and keepeth his hand from doing any evil. Without going through a number of other scriptures, we find that it's abundantly clear in God's word that God's people are to do no evil. We're not to be people that do evil things. But we find that the New Testament principle brings us to a higher plane. It's actually very interesting. If you read the Sermon on the Mount in Matthew chapter number five, Jesus says you've heard, but I say unto you, you've heard not to murder, but we're not to hate. He said you're not to commit adultery, but if you think on a lady, you've already committed in your heart. He brings it to a whole nother plane of spiritual living. And we find that yes, we would all agree that God's people should not engage in evil behavior. They should not be doing evil, but we find that in the New Testament, God's people are instructed to abstain from the very appearance of evil. That's a whole nother level, it's a higher plane.",
      "context": "... you are wise to do evil. No, we're not to be wise to do evil. We find that we're to do no evil. In Isaiah 56 and verse two, the Bible says, blessed is the man that doeth this and the son of man that layeth ho...",
      "sermon_title": "\"Abstain From All Appearance of Evil\" I Thessalonians 5:22",
      "url": "https://www.youtube.com/watch?v=G5YRE5OaH7s&t=360",
      "channel": "Unknown",
      "publish_date": 20240415
    }
  ]
}