{
  "reference": "Isaiah 59",
  "occurrences": [
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 1427.1999969482422,
      "text": "defined by God, and God has directed the family. How do we operate as husband, as wife, as children? Understand with me this morning that there is an effort to destroy the nuclear family structure as we've known it. That term nuclear family refers to a man and a woman that marry and have children and live in a home. And that's the idea of a nuclear family. And this morning, they have distorted that, they have tried to break that down. Can I tell you that those are the truths of the backbone of our society that made America what it is? It's the enemy, it's Satan that wants to attack what God instituted and to attack what God has designed, and we find that happening in the family. And it's so sad to see what's happening in our society today with regard to the family. I want you to think about the matter of justice, the matter of justice. You say that we live, you're familiar with this, the lady justice is supposed to be blindfolded. And we find that today, we live in a time in which there's, we could say that the justice is corrupt. And we don't have to, we're not exaggerating by saying that this morning, but we understand the importance of justice. The Bible says this, righteous art thou, O Lord, and upright are thy judgments, in Psalm 119, in verse 137. In Isaiah 59, in verses 14 and 15,",
      "context": "...ays this, righteous art thou, O Lord, and upright are thy judgments, in Psalm 119, in verse 137. In Isaiah 59, in verses 14 and 15,",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=1427",
      "channel": "Unknown",
      "publish_date": 20241027
    },
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 1503.6799926757812,
      "text": "is corrupt. And we don't have to, we're not exaggerating by saying that this morning, but we understand the importance of justice. The Bible says this, righteous art thou, O Lord, and upright are thy judgments, in Psalm 119, in verse 137. In Isaiah 59, in verses 14 and 15, there's an indictment that is made, the Bible says in verse 14, and judgment is turned away backward, and justice standeth afar off, for truth is fallen in the street, and equity cannot enter. Verse number 15, the Bible says this, yea, truth falleth, faileth, excuse me, and he that departeth from evil maketh himself a prey, and the Lord saw it, and it displeased him that there was no judgment. Sad. Our God is a righteous, just God. There is right, and there is wrong. There is good, and there is evil. And God is the one that defines that. Isaiah deals with it. The Bible says that they were saying that that which was good is evil, and that which is evil is good. That's what's happening in our society today. We see it. And we begin to think about biblical principles for casting our votes, and we're gonna go stand at a ballot box, and we're gonna cast a vote, and these things that our politicians have tried to take and politicize them, we must acknowledge that they're biblical matters. The Bible tells us in Leviticus 19, in verse number 15,",
      "context": "...ays this, righteous art thou, O Lord, and upright are thy judgments, in Psalm 119, in verse 137. In Isaiah 59, in verses 14 and 15, there's an indictment that is made, the Bible says in verse 14, and judgment ...",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=1503",
      "channel": "Unknown",
      "publish_date": 20241027
    }
  ]
}