{
  "reference": "Isaiah 53",
  "occurrences": [
    {
      "sermon_id": "3e1Tf17WpHs",
      "timestamp": 694.4600143432617,
      "text": "discussion on this. I'm not really sure what it talks about either. I don't know. What are your thoughts? What are your thoughts? No, no. Philip is able to go in and give him truth. He was equipped. He was prepared. I think of Ezra the scribe who the Bible says that he had prepared his heart to seek the law of the Lord in Israel. And not only to seek but to do it and to teach in Israel statutes and judgments and how important it is even as we find Peter that says that we ought to be always to give an answer of the hope that lieth within us. And we find here that this man, Philip, he joins this eunuch in the chariot and he says, do you understand? And he says, how can I except some man should guide me? Notice in verse 32. We'll read the rest of verse 31. It says, and he desired Philip that he would come up and sit with him. What a great opportunity. Amen? In verse 32, the place of the scripture which he read was this. He was led as a sheep to the slaughter and like a lamb dumb before his shearer, so opened he not his mouth. In his humiliation, his judgment was taken away. And who shall declare his generation? For his life is taken from the earth. Isaiah 53 verses 7 and 8, the portion of Isaiah",
      "context": "...udgment was taken away. And who shall declare his generation? For his life is taken from the earth. Isaiah 53 verses 7 and 8, the portion of Isaiah",
      "sermon_title": "Sermon 3e1Tf17WpHs",
      "url": "https://www.youtube.com/watch?v=3e1Tf17WpHs&t=694",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "3e1Tf17WpHs",
      "timestamp": 760.3400115966797,
      "text": "sheep to the slaughter and like a lamb dumb before his shearer, so opened he not his mouth. In his humiliation, his judgment was taken away. And who shall declare his generation? For his life is taken from the earth. Isaiah 53 verses 7 and 8, the portion of Isaiah in which the eunuch was reading. And the Bible tells us and records for us question number three in verse 34. And the eunuch answered Philip and said, I pray thee, notice of whom speaketh the prophet this? Of himself or of some other man? It's a good question. What do we find? That as the eunuch is reading this portion of scripture in Isaiah 53, he says, I'm not sure. I can't discern. I don't understand who is being spoken of in these verses of scripture. And he asked the question, he says, of whom speaketh the prophet this? Of himself or of some other man? Well, I'm so glad that you asked. Can you see Philip? I mean, just rejoicing at the opportunity that is before him. For we find that in verse number 35, the Bible says, then Philip opened his mouth and began at the same scripture and preached unto him Jesus. Isn't that precious? Began at the same scripture. He used the Old Testament. Amen? Isaiah is in the Old Testament. Praise God. He used the Old Testament and he used those prophecies, those messianic",
      "context": "...udgment was taken away. And who shall declare his generation? For his life is taken from the earth. Isaiah 53 verses 7 and 8, the portion of Isaiah in which the eunuch was reading. And the Bible tells us and r...",
      "sermon_title": "Sermon 3e1Tf17WpHs",
      "url": "https://www.youtube.com/watch?v=3e1Tf17WpHs&t=760",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "3e1Tf17WpHs",
      "timestamp": 845.9400177001953,
      "text": "then Philip opened his mouth and began at the same scripture and preached unto him Jesus. Isn't that precious? Began at the same scripture. He used the Old Testament. Amen? Isaiah is in the Old Testament. Praise God. He used the Old Testament and he used those prophecies, those messianic prophecies that are recorded even there in that portion of Isaiah 53, and he preached unto him Jesus. Now, the Bible doesn't record the whole message that Philip preached. I'd love to know exactly how he articulated what it was that he said, but God has chosen that it was not necessary for us to receive the entirety of the message. In fact, as you read the scriptures, you read the gospel accounts, there are some occasions in which the teachings of Jesus are provided in great detail. There are other times in which the scriptures simply say that Jesus taught the multitudes. There are times even here in the book of Acts that you read lengthy sermons from Peter, from Stephen, from Paul, and there are other times that you just read something like this of Philip, that he preached unto him Jesus. Can I tell you that that's what our duty is, to preach Jesus. Amen? To lift him up, to preach Christ, to exalt our Savior. He's a wonderful Savior, and we find here that Philip is going to begin at that same scripture, and he's going to show this eunuch how that Jesus was the promised",
      "context": "...e used those prophecies, those messianic prophecies that are recorded even there in that portion of Isaiah 53, and he preached unto him Jesus. Now, the Bible doesn't record the whole message that Philip preach...",
      "sermon_title": "Sermon 3e1Tf17WpHs",
      "url": "https://www.youtube.com/watch?v=3e1Tf17WpHs&t=845",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6MLW_MPF-wo",
      "timestamp": 0.0,
      "text": "if you're taking notes, I would say this, that the response of the eunuch, his response to Philip reveals humility. His response reveals humility. The question in verse number 30 is a very important question. It is a question in which opens the door for this conversation. And the question is very simple. The Bible tells us that Philip ran to this chariot, the Spirit of God told him to go there, and he heard this eunuch reading. Obviously, he's reading out loud, he's reading audibly, he's reading the prophet Isaiah. As we go through the passage, we see that he's reading Isaiah 53. What a great passage of Scripture. And he's reading this portion of Scripture, and Philip says to this eunuch, do you understand? Understandest thou what thou readest? Now, I've said that his response reveals humility, because what he says is, how can I except some man should guide me? That is a response of humility, is it not? Certainly, it would be easy for a man of his position, we've mentioned already that verse 27 gives us some insight to his position, that he could have brushed it off and said, I'm good, I understand, even though he didn't. Right? We've been in situations like that. We have encountered experiences in our lives where people will say that they understand something, and they really don't. They just don't want to be embarrassed. They",
      "context": "...ng audibly, he's reading the prophet Isaiah. As we go through the passage, we see that he's reading Isaiah 53. What a great passage of Scripture. And he's reading this portion of Scripture, and Philip says to ...",
      "sermon_title": "Sermon 6MLW_MPF-wo",
      "url": "https://www.youtube.com/watch?v=6MLW_MPF-wo&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6MLW_MPF-wo",
      "timestamp": 546.47998046875,
      "text": "know? And just no desire. We can look at that in a whole host of avenues or arenas this evening and speak about it. We're looking, as we think about this subject matter in this series of Teach Me, looking at it from a spiritual perspective. I want to learn the Word of God. I want to learn who God is. I want to know Him in a more intimate way. I want to have that teachable spirit. It begins with humility. Desire is essential. And let me say this, as we continue looking through this passage of Scripture, I would say that His profession and His baptism reveal understanding or reveal learning has taken place. Now, look at it, if you will, in verse number 32. The Bible says this, the place of the Scripture which He read was this, He was led as a sheep to the slaughter, and like a lamb done before His shearer, so opened He not His mouth. In His humiliation, His judgment was taken away, and who shall declare His generation, for His life is taken from the earth? This is Isaiah 53, and the eunuch answers, Philip as they're looking at this place where he was reading in the Old Testament, and he says, as we made note of a moment ago, I pray thee, of whom speaketh the prophet this, of himself or of some other man? I love verse number 35.",
      "context": "...was taken away, and who shall declare His generation, for His life is taken from the earth? This is Isaiah 53, and the eunuch answers, Philip as they're looking at this place where he was reading in the Old Te...",
      "sermon_title": "Sermon 6MLW_MPF-wo",
      "url": "https://www.youtube.com/watch?v=6MLW_MPF-wo&t=546",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6MLW_MPF-wo",
      "timestamp": 692.6599731445312,
      "text": "preach unto him Jesus. I think that it would be fair to say that preaching is not always teaching, and teaching is not always preaching, but oftentimes preaching includes teaching. Amen? Is that fair? The Bible in the book of Ezra teaches us, it provides really an outline of preaching, that you read the Word of God distinctly, you give the sense of it, and enable the people to understand it. So we understand here that as he's preaching unto him Jesus, that we could say that he's teaching him. He's teaching him the truth. He's teaching him what it is that he's reading in Isaiah 53, and the Bible tells us in verse number 36, I want you to notice that the Bible says they went on their way. I'm not sure how long the preaching was in verse number 35. I don't know how long Philip took to explain these biblical truths to this Ethiopian eunuch, but for however long it took, they were there, and it says they went on their way, and they came unto a certain water. I want you to notice again the question that is asked of the eunuch. The eunuch says to Philip, See, here is water. What doth hinder me to be baptized? Is that not, again, a revelation of humility and desire? He's asking a question. You know, when we ask questions, sometimes we sit in places, we're sitting in a classroom having some type of interaction.",
      "context": "...t he's teaching him. He's teaching him the truth. He's teaching him what it is that he's reading in Isaiah 53, and the Bible tells us in verse number 36, I want you to notice that the Bible says they went on t...",
      "sermon_title": "Sermon 6MLW_MPF-wo",
      "url": "https://www.youtube.com/watch?v=6MLW_MPF-wo&t=692",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}