{
  "reference": "Isaiah 30",
  "occurrences": [
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1242.9199829101562,
      "text": "And the question, as we mentioned in that first point, the cry of the people, to whom do we look? To whom do we go? Notice what happens if you think about God's people. Turn to the book of Isaiah, if you will, and go to Isaiah chapter number 30. We're gonna look at a couple of passages here in the book of Isaiah, and then we're gonna go to the New Testament and make some final application this evening. But I want you to consider, as we look at this historical event, this recorded event that took place in the life of Joseph, but how it applies for us tonight in our own lives. In Isaiah chapter number 30, the Bible says this in verse number 1, Isaiah 30 and verse number 1, Woe to the rebellious children, saith the Lord, that take counsel, but then notice these words, but not of me. But take counsel, but not of me. And that cover with a covering, but not of my spirit, that they may add sin to sin. Notice verse number 2, that walk to go down into where? Egypt. It's a picture of what? It's a type of what? The world and the world system. And then notice this last phrase, and have not asked at my mouth. Can you imagine? It's just to strengthen themselves in the strength of who? Pharaoh. And to trust in the shadow of Egypt.",
      "context": "...or us tonight in our own lives. In Isaiah chapter number 30, the Bible says this in verse number 1, Isaiah 30 and verse number 1, Woe to the rebellious children, saith the Lord, that take counsel, but then not...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1242",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1632.9199829101562,
      "text": "want Pharaoh's strength? Do you understand? But this is what they're doing. It says at the end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not. You know the verses, right? And we find here this evening that they are going to seek to be strengthened by the strength of Pharaoh who is inferior to God Almighty and God had made it abundantly clear and demonstrated that truth. And then they're going to trust in the shadow of Egypt. That's a sad commentary, is it not? I mean, what a sad, sad indictment against the children of Israel here. And we find that we are to abide. You don't need to turn there, but I'm mindful this evening of the truth of Psalm 91. He that dwelleth in the secret place of the Most High shall abide under the shadow of the Almighty. Not the shadow of Pharaoh of Egypt, but of the shadow of the Almighty. I will say to the Lord, He is my refuge and my fortress. My God, in Him will I trust. Wow. If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help",
      "context": "... If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1632",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1715.9199829101562,
      "text": "Him will I trust. Wow. If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help and stay on horses and trust in chariots. Why are they trusting in chariots? Because there aren't any. And in horsemen, because why? They're very strong. But they look not unto the Holy One of Israel, neither seek the Lord. Verse 2, yet He also is wise and will bring evil and will not call back His words, but will rise against the house of the evildoers and against the help of them that work iniquity. Now the Egyptians, notice what God says here in verse number 3. Now the Egyptians are men and not God, and their horses flesh and not spirit. When the Lord shall stretch out His hand, both he that helpeth shall fall and he that is hopin' shall fall down and they shall fail together. He says, woe to them that go down to Egypt for help. They look not unto the Holy One of Israel, neither seek the Lord. The psalmist says in Psalm 121, we used it as a theme verse a couple of years ago. I will lift up mine eyes into the hills from whence cometh my help. My help cometh from the Lord, which made heaven and earth.",
      "context": "... If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help ...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1715",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}