{
  "reference": "James 4",
  "occurrences": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 1395.8800201416016,
      "text": "in the first four verses of chapter number six that they were trying to make him afraid in that meeting as well. I mean, when he says that they thought to do mischief to me, or they thought to do to me mischief, obviously they were trying to make him afraid. So the enemy wants to cause the people of God to be fearful so that the work of God would be hindered, so the work of God would cease from going forward. And so this morning, I believe that as we look at Nehemiah chapter number six, the first reality, the first thing that we need to learn is we need to learn how to recognize the enemy. And I submit to you this morning that it's not always easy to recognize the enemy. Look at the methods that are used in this portion of Scripture, the extent in which the enemy would go to deceive you, to deceive me. We find that we need to learn to recognize the enemy. Number two, we need to learn to resist the enemy. We need to learn to resist the enemy. Notice, you can hold your place here Nehemiah, but I want you to be mindful of what James says in James 4 and verse number 7. In James 4 and verse number 7, the Bible says this, submit yourselves therefore to God, resist the devil, and he",
      "context": ".... Notice, you can hold your place here Nehemiah, but I want you to be mindful of what James says in James 4 and verse number 7. In James 4 and verse number 7, the Bible says this, submit yourselves therefore...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=1395",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 1458.1200256347656,
      "text": "resist the enemy. Notice, you can hold your place here Nehemiah, but I want you to be mindful of what James says in James 4 and verse number 7. In James 4 and verse number 7, the Bible says this, submit yourselves therefore to God, resist the devil, and he will flee from you. That's a great promise of God's Word, is it not? Listen, before you resist the enemy, you need to submit to God. That's the formula. Submit to God, submit yourselves therefore to God, resist the devil, and he will flee from you. As we submit ourselves to God and we're filled with the power of the Holy Spirit of God, then we have the ability to be able to resist the enemy, and we have the promise that the enemy is going to flee. See, the devil don't want to mess with the Lord. He wants to mess with you, in your flesh, because he can be successful. Amen? I want you to notice on the four methods that were employed in Nehemiah chapter number 6, I want you to notice how Nehemiah responds to each of those situations, but before we look at that specifically in Nehemiah chapter number 6, I want you to note that Nehemiah was a man of prayer. Nehemiah is a man of prayer, and I believe that that's such a key for us to see how that he had the level of perception and discernment to be able to",
      "context": ".... Notice, you can hold your place here Nehemiah, but I want you to be mindful of what James says in James 4 and verse number 7. In James 4 and verse number 7, the Bible says this, submit yourselves therefore...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=1458",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 924.0999755859375,
      "text": "be done, two thoughts for you this morning. When we pray thy will be done, number one, we recognize that His will or His way is superior. When we pray, thy will be done. Now understand, that's not just a cliche that we add to the end of a prayer. And when you read James 4, and the Bible says that we ought to say, if the Lord is willing, that's not just a cliche that we say. Now sometimes we'll say, hey, Lord willing, we'll see you, and we might use that, and it can become cliche-ish. But you understand, it's not to be a cliche. It is the Lord's will. We desire to know the Lord's will. We understand this morning we are gathered here because it's God's will. God says not forsaking the assembling of ourselves together as the manner of some is, but exhorting one another, and so much the more as you see the day approaching. We are gathered together because it's God's will. I am preaching the word this morning because it's God's will. He said preach the word, be instant in season, out of season, reprove, rebuke, exhort, with all longsuffering and doctrine. He says, yes, the time will come. I think we're there, that men will not endorse sound doctrine. Nevertheless, we are to continue, and we are to preach the word. We do this at God's will. And when we delight ourselves in the Lord, when we're trusting Him,",
      "context": "...one. Now understand, that's not just a cliche that we add to the end of a prayer. And when you read James 4, and the Bible says that we ought to say, if the Lord is willing, that's not just a cliche that we ...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=924",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "YCUS9wAR_oA",
      "timestamp": 1939.1399536132812,
      "text": "want to submit. I remember trying with all of my might and all of my strength, and yet he's several years older than I am, much bigger and stronger than I was at that point as a little child. And he could do with me whatever he wanted to do. And he was trying to get me to submit. Sometimes it's hard to submit. Because you have a will. And I have a will. But when we pray thy will be done, not only are we recognizing that God's will is superior, but it reveals the submission in our lives to God's will. See, notice in James 4, in verse number 7, notice what the Bible says. Submit yourselves therefore to God. Submit yourselves to God. We see that the Bible continues. Resist the devil and he will flee from you. Draw nigh to God and he will draw nigh to you. Cleanse your hands, ye sinners, and purify your hearts, ye double-minded. In what great truth, in verse 9, be afflicted and mourn and weep. Let your laughter be turned to mourning and your joy to heaviness. Humble yourselves in the sight of the Lord and he shall lift you up. You know what is required for submission? Humility. Humility. Without humility, you're never going to submit. You're just not. But why should we humble ourselves? Well, we find that God instructs us to. He says that we're to humble ourselves.",
      "context": "...at God's will is superior, but it reveals the submission in our lives to God's will. See, notice in James 4, in verse number 7, notice what the Bible says. Submit yourselves therefore to God. Submit yourselv...",
      "sermon_title": "Sermon YCUS9wAR_oA",
      "url": "https://www.youtube.com/watch?v=YCUS9wAR_oA&t=1939",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 600.0,
      "text": "is my Savior, and the Holy Spirit of God indwells me. I'm heaven-bound, and He's left me here for the purpose of being His witness, His representative. And He says that we're in the world, but we're not of the world. But my flesh and your flesh still remains. Correct? And so here's what happens, the enemy is constantly, constantly trying to allure us and to taint us by this world. He knows that we had our course in time past, and we walked according to the course of this world. And so he understands that truth, but now as believers and we consider this truth of the progression of worldliness, we are mindful that John says, love not the world, neither the things that are in the world. I don't believe that it first starts with loving the world. That allure, that Satan is trying to tempt us and trying to taint us and pull us in. James 4 and verse number 4 tells us that we're not to be a friend of the world. Notice what the Bible says in James chapter number 4 and verse number 4, when we think about these truths and consider the progression this morning of worldliness by way of really getting into this passage in 1 John, notice the Bible says this in James 4 and verse number 4, ye adulterers and adulteresses, know ye not that the friendship of the world is enmity",
      "context": "...ing the world. That allure, that Satan is trying to tempt us and trying to taint us and pull us in. James 4 and verse number 4 tells us that we're not to be a friend of the world. Notice what the Bible says ...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=600",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 674.7600021362305,
      "text": "think about these truths and consider the progression this morning of worldliness by way of really getting into this passage in 1 John, notice the Bible says this in James 4 and verse number 4, ye adulterers and adulteresses, know ye not that the friendship of the world is enmity with God, whosoever therefore will be a friend of the world is the enemy of God. You say, pastor, that's strong language, that's Bible. When he says ye adulterers and adulteresses, I immediately, my mind races back to the book of Hosea, to the prophets of Israel when they were prophesying and they were preaching and proclaiming that they, the nation had left and they followed after idols and they were guilty of this spiritual adultery. We find here that God says that we're not to have friendship with the world because friendship with the world is enmity with God. And he says, whosoever therefore will be a friend of the world is the enemy of God. I don't want to be God's enemy, amen? And so it begins with this friendship and we find that the Bible tells us, look back a few passages or a few pages in James 1 and verse number 27, notice what he says here, pure religion and undefiled before God and the Father is this, to visit the fatherless and widows in their affliction, notice what he says, and to keep himself unspotted from the world.",
      "context": "... of worldliness by way of really getting into this passage in 1 John, notice the Bible says this in James 4 and verse number 4, ye adulterers and adulteresses, know ye not that the friendship of the world is...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=674",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}