{
  "reference": "James 5",
  "occurrences": [
    {
      "sermon_id": "9JjoBDbN7Ms",
      "timestamp": 767.1599731445312,
      "text": "that. Amen? And here in this passage of Scripture, we find that very reference in verse number 3, but as we consider this morning some truth from this passage that would help us in this process of evaluation, I would say, number one, that prayer is a priority. Prayer is a priority. Notice what he says in verse number 1, I exhort, therefore, that first of all – note those words – first of all, not second, not third, not last, but first of all, that supplications, prayers, intercessions, and giving of thanks be made for all men. There's a priority in our text of Scripture that is placed upon prayer. The reality is that prayer should be my first response and not my last resort. There are times, however, in my life, and if you'd be honest in evaluating your life this morning, that we try all sorts of things to figure it out, and then we come to the place when we say, maybe I should pray about this. But prayer should be our first response. In fact, without turning there, but in James 5, in verse 13 and 14, in both of those verses, there are questions that are asked. The first one in verse 13, are any afflicted? You know what the answer is? Let them pray. In verse 14, are any sick? You know what the answer is? Let them pray.",
      "context": "...ld pray about this. But prayer should be our first response. In fact, without turning there, but in James 5, in verse 13 and 14, in both of those verses, there are questions that are asked. The first one in ...",
      "sermon_title": "Sermon 9JjoBDbN7Ms",
      "url": "https://www.youtube.com/watch?v=9JjoBDbN7Ms&t=767",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "59eHWxG90YI",
      "timestamp": 474.6400146484375,
      "text": "diseases upon thee, which I have brought upon the Egyptians, for I am the Lord that healeth thee. And I want you to think about the impact that that truth, of God revealing himself to his people in this manner by using the name Jehovah Rapha, how that would encourage them when they were aware of diseases, when they were aware of those things, that we serve the Lord God who is able to heal. And we understand that the scriptures would record for us of those that had inquired and asked for God to provide healing, and we find many examples of God doing just that. Why? Because he's the Lord that heals, and he has power over sickness and disease. We see that in the person of Jesus Christ, as you study the gospel records, how that he would, through the miracles, perform many miracles in which he demonstrated this power over sickness and disease. And we as New Testament believers, we have the truth of James 5 when he says, if any are sick, let them pray, knowing that our God is able. He is the Lord that heals. Number seven, Jehovah Jireh. You have to turn back to the book of Genesis in chapter number 22, Jehovah Jireh, it means the Lord will provide. And aren't you thankful for the provision of God? And as we begin to look at our lives and look at how good God has been to us, we would understand",
      "context": "...rated this power over sickness and disease. And we as New Testament believers, we have the truth of James 5 when he says, if any are sick, let them pray, knowing that our God is able. He is the Lord that hea...",
      "sermon_title": "Sermon 59eHWxG90YI",
      "url": "https://www.youtube.com/watch?v=59eHWxG90YI&t=474",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 2522.9999771118164,
      "text": "I hope. Having that confidence that God's going to do what He said He's going to do. That blessed hope that Paul speaks of when he's writing and encouraging Titus, in Titus chapter number 2. We're familiar with this verse of scripture, Isaiah 40 and verse number 31. Someone years ago no doubt put this particular verse to song, and it is a good scripture song in Isaiah 40 and verse number 31. But they that wait upon the Lord shall renew their strength. They shall mount up with wings as eagles. They shall run and not be weary. They shall walk and not faint. Then I want you to think about this in James chapter number 5, and we'll close with this verse of scripture. In James chapter number 5, as you're turning to James, let me remind you of what the writer of Hebrews says in Hebrews 10 and verse 37, if we get a little while, and he that shall come will come and will not tarry. Aren't you thankful for that promise? No doubt at some point in your life you've heard someone say if the Lord doesn't tarry His coming, He's not going to. He says He will not tarry. He's coming right on time. But notice what James says in James 5 and verse number 7. It says be patient therefore brethren unto the coming of the Lord. Notice this, behold",
      "context": "...s not going to. He says He will not tarry. He's coming right on time. But notice what James says in James 5 and verse number 7. It says be patient therefore brethren unto the coming of the Lord. Notice this,...",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=2522",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "timestamp": 2594.0799713134766,
      "text": "say if the Lord doesn't tarry His coming, He's not going to. He says He will not tarry. He's coming right on time. But notice what James says in James 5 and verse number 7. It says be patient therefore brethren unto the coming of the Lord. Notice this, behold the husbandman waiteth for the precious fruit of the earth and hath long patience for it until he receive the early and latter rain. Isn't that a great example or illustration analogy that he gives? How many of you ever planted anything? Did you plant it and then tomorrow go reap your harvest? It doesn't work that way, right? I know they say often about corn that by the 4th of July it should be around knee high and then by whatever some date in August it should be close to your shoulder and so on and so forth. It takes time. There's a process, right? And so you go out there and notice what it says about the husbandman, the one that's doing that, it says that he waiteth for the precious fruit of the earth and it says and hath long patience for it. And then it says this, as that analogy or illustration is given in verse number 7 about the husbandman, James then turns his attention to the believers and said be ye also patient, establish your hearts for the coming of the Lord draweth nigh. He's coming. He's coming. We don't know when he's coming",
      "context": "...s not going to. He says He will not tarry. He's coming right on time. But notice what James says in James 5 and verse number 7. It says be patient therefore brethren unto the coming of the Lord. Notice this,...",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0&t=2594",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}