{
  "reference": "Jeremiah 39",
  "occurrences": [
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1518.9599914550781,
      "text": "Jeremiah did so. So they drew up Jeremiah with cords and took him out of the dungeon. And Jeremiah remained in the court of the prison. I see God's deliverance here. I understand that as I look at the passage of Scripture, I begin to see how God is able to deliver and we see the compassion of the Lord and we understand that there were some men that had this evil plan against Jeremiah. They wanted Jeremiah to die in the dungeon. But the reality is that God wasn't done with Jeremiah. And God knew where Jeremiah was and God would work on the behalf of Jeremiah by allowing this Ethiopian man that is mentioned here, Ebed-Melech, this Ethiopian man, to go and to inquire of the king and to seek permission from the king to go with these 30 men in order to bring this man Jeremiah out. It's of interest to me that in v. 4, there were four of them that put Jeremiah in the dungeon and then there's a group of 30 that come to bring him out. God is aware of where Jeremiah is and God is working on the behalf of His servant. We find that Ebed-Melech would be rewarded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man would be rewarded for his faithfulness. It says this in v. 16,",
      "context": "...ded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man would be rewarded for his faithfulness. It says this in v. 16,",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1518",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1594.9999694824219,
      "text": "servant. We find that Ebed-Melech would be rewarded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man would be rewarded for his faithfulness. It says this in v. 16, Go and speak to Ebed-Melech the Ethiopian, saying, Thus saith the Lord of hosts, the God of Israel, Behold, I will bring My words upon this city not for evil and not for good, and they shall be accomplished in that day before thee. Again, we see the reference to the coming judgment. We see the reference to the fact that God was going to bring this judgment upon His people because of their wickedness. But notice the promise in v. 17-18 with regard to Ebed-Melech. It says this, But I will deliver thee in that day, saith the Lord. And thou shalt not be given into the hand of the men whom thou art afraid. For I will surely deliver thee, and thou shalt not fall by the sword, but thy life shall be for a prey unto thee. Why? Notice this at the end of v. 18. Because thou hast put thy trust in Me, saith the Lord. See, this evening, we have to ask ourselves, even as we, yes, we're looking at Jeremiah in particular, but within the context of these chapters of Scripture, we are introduced to this other man that God used to bring deliverance",
      "context": "...ded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man would be rewarded for his faithfulness. It says this in v. 16,...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1594",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1952.6599578857422,
      "text": "command of Nebuchadnezzar. We find that in chapter 39, as we read already, we will not review these same verses and read them again. We find that the Bible tells us that the Babylonians enter in and they take the city. And it says that the city was broken up in verse 2 of Jeremiah 39. We find that the Bible records for us how Zedekiah and a group of others sought to flee from the city and yet they are taken and the army of the Chaldeans pursued them and overtook them. And we find that his sons are slain and his eyes are put out. And we come to that. We see all that's taking place. And if you know anything about the Babylonians, you understand if you look at the history and you see the power of these folks and really the brutality of these groups of people, and you find that you come to Jeremiah 39 in verse 11, and you notice a charge, a command that the king gives to the captain of the guard. It's amazing. In verse 11, the Bible says that Nebuchadnezzar, king of Babylon, gave charge concerning Jeremiah to Nebuchadnezzar Adan, the captain of the guard. Now think about this. Just pause in your mind for a moment and think about all that's taking place. The Chaldeans, the Babylonians, they've come in. They've been in a place where they've besieged the city for a lengthy period of time.",
      "context": "... Babylonians enter in and they take the city. And it says that the city was broken up in verse 2 of Jeremiah 39. We find that the Bible records for us how Zedekiah and a group of others sought to flee from the c...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1952",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}