{
  "reference": "Jeremiah 38",
  "occurrences": [
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 167.83999633789062,
      "text": "and understanding that we're living in those last days, there are some things that we should expect to happen in these last days. And Jeremiah was a man that was, of course, serving God on the eve of the Babylonian captivity. Historically speaking, we understand that as he is there and as he's preaching and giving the prophecies that have been given to him by the Lord God Almighty, that Jeremiah is in a place where he is actually seeing the very things that he's preached unfold. He's seeing the fulfillment of the very prophecies that he's proclaimed. As we begin to think about the events that are surrounding the Babylonian captivity and conquest of Jerusalem and the life of Jeremiah, I've asked you to turn to Jeremiah 38, and I want you to be there, but I want to remind you even before we jump into the portion of Scripture that we'll look at this evening, I want to remind you of a great promise that God gave to Jeremiah in Jeremiah chapter number one. In Jeremiah chapter number one in verse number eight, God said to Jeremiah, be not afraid of their faces, for I am with thee to deliver thee, saith the Lord. We have, as we have looked at Scripture and considered these similar words that we read in Jeremiah 1.8, we read how that God promised to be with",
      "context": "... Babylonian captivity and conquest of Jerusalem and the life of Jeremiah, I've asked you to turn to Jeremiah 38, and I want you to be there, but I want to remind you even before we jump into the portion of Scrip...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=167",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 237.8000030517578,
      "text": "eight, God said to Jeremiah, be not afraid of their faces, for I am with thee to deliver thee, saith the Lord. We have, as we have looked at Scripture and considered these similar words that we read in Jeremiah 1.8, we read how that God promised to be with Moses, he promised to be with Joshua, he promised to be with Jeremiah as we've just read, and we understand that he is with us. We understand that Hebrews 13 tells us and we can rejoice in the truth that he had said, I will never leave thee nor forsake thee, that Jesus said, I am with you always, and for that we could rejoice. But as we think about that promise and we think about the life and ministry of Jeremiah, we find that he was called of the Lord and we find that he was faithful. Notice in Jeremiah 38 in verse number 28, it's where I'll get the title for the message this evening, and then we'll go through a host of Scriptures in these four chapters and trust to be a blessing to you this evening. In Jeremiah 38 in verse number 28, the Bible says, so Jeremiah abode in the court of the prison until the day that Jerusalem was taken. And he was there when Jerusalem was taken. I've said already by way of introduction that Jeremiah witnessed what he had faithfully prophesied. If you're",
      "context": "...try of Jeremiah, we find that he was called of the Lord and we find that he was faithful. Notice in Jeremiah 38 in verse number 28, it's where I'll get the title for the message this evening, and then we'll go t...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=237",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 305.32000732421875,
      "text": "Jeremiah 38 in verse number 28, the Bible says, so Jeremiah abode in the court of the prison until the day that Jerusalem was taken. And he was there when Jerusalem was taken. I've said already by way of introduction that Jeremiah witnessed what he had faithfully prophesied. If you're taking notes this evening, I've simply entitled the message this evening, Jerusalem was taken. Jerusalem was taken. We can see that from a historical perspective. We see the Bible record that God gives us in His Word with regard to the captivity. And we find that Jeremiah is called to minister and called to serve the Lord in really some difficult days. As we would think about the life and ministry of Jeremiah, we would find that Jeremiah had the privilege of prophesying and ministering during the times of really some kings, Josiah in particular, where there was revival under the time of Jeremiah's ministry in the reign of Josiah. And we'd find that when Josiah died, that Jeremiah, with a whole host of those within Judah, they wept at the death of Josiah. Jeremiah, however, also prophesied and ministered during the time in which many in those that he was preaching to, they forsook the commandment of the Lord. They did not hearken to the Word of God. We find that Jeremiah is prophesying in such a day and he's ministering in such a day. If we're to take notes this",
      "context": "Jeremiah 38 in verse number 28, the Bible says, so Jeremiah abode in the court of the prison until the day that...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=305",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 900.6199951171875,
      "text": "follow the course of Jeremiah in these few chapters of Scripture and these events that are provided to us that he's not yet in prison. That soon would change as we're aware of. In verse number 15, the Bible says after Jeremiah had delivered this message of judgment, it says, wherefore the princes were wroth with Jeremiah. They didn't like his judgment. They didn't like the Word of the Lord. They didn't like the message that was being proclaimed. And the Bible says that they smote him and put him in prison in the house of Jonathan the scribe, for they had made that the prison. So we find in chapter 37 and verse number 15 that he's now in prison. According to chapter number 38, after once again, we mentioned how in verse number one, these folks, they heard the words that Jeremiah had spoken. And it says in verse number four of Jeremiah 38, therefore, the princes said unto the king, as he beseeched thee, let this man be put to death. For thus he weakened the hands of the men of war that remain in this city in the hands of all the people, and speaking such words unto them. For this man seeketh not the welfare of this people, but the hurt. Verse number five tells us that Zedekiah the king gave them permission. It says this, that he said, behold, he is in your hand.",
      "context": "...ne, these folks, they heard the words that Jeremiah had spoken. And it says in verse number four of Jeremiah 38, therefore, the princes said unto the king, as he beseeched thee, let this man be put to death. For...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=900",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 964.6199951171875,
      "text": "in the hands of all the people, and speaking such words unto them. For this man seeketh not the welfare of this people, but the hurt. Verse number five tells us that Zedekiah the king gave them permission. It says this, that he said, behold, he is in your hand. For the king is not he that can do anything against you. Verse six, then took they Jeremiah and cast him into the dungeon of Melchizedek, the son of Hamelak, that was in the court of the prison. And they let down Jeremiah with cords. And in the dungeon there was no water but mire, so Jeremiah sunk in the mire. No longer is Jeremiah in prison now. He's cast into the dungeon in verse number six of chapter 38. We find that there's some deliverance and we'll look at that in our final point this evening. And we skip down to verse number 13 of Jeremiah 38. We find that they drew Jeremiah with cords and took him up out of the dungeon. Then it tells us that Jeremiah remained in the court of the prison. So he's in prison. He goes in the dungeon. Now he's back in prison. We've read as our text verse, verse number 28, that he's there in prison until Jerusalem is taken. As we begin to think about the circumstances in which Jeremiah was facing and we take note of those circumstances, and we see the description of what God gives us",
      "context": "...ance and we'll look at that in our final point this evening. And we skip down to verse number 13 of Jeremiah 38. We find that they drew Jeremiah with cords and took him up out of the dungeon. Then it tells us th...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=964",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1093.9200134277344,
      "text": "Jonathan the scribe. Notice the last phrase of verse number 20. Lest I die there. Lest I die there. This is a very serious situation in which Jeremiah is facing. We find that he recognizes the potential of him dying in that prison. In chapter number 38, we've already mentioned that in verse number 4, the adversaries had the desire to have Jeremiah put to death because of the message that he proclaimed. In verse number 10 of Jeremiah 38, Ebed-Melech is used of the Lord. He's an Ethiopian man. And we'll deal with him a little bit in our final point this evening. We find that the Bible tells us in verse number 10 of Jeremiah 38, then the king commanded Ebed-Melech the Ethiopian saying, take from hence 30 men with thee to take up Jeremiah the prophet out of the dungeon. What's it say? Before he die. Dire circumstances. Great difficulty in which Jeremiah is facing. We find that after Jeremiah is delivered from the dungeon and sent back to the court of the prison, according to verse number 13, he's now back in the prison that in verse number 16, the Bible says, so Zedekiah the king swears secretly unto Jeremiah saying, as the Lord liveth that made us this soul, I will not put thee to death, neither will I give thee into the hand of these men that seek thy life. Or people that were seeking the life of Jeremiah.",
      "context": "...sire to have Jeremiah put to death because of the message that he proclaimed. In verse number 10 of Jeremiah 38, Ebed-Melech is used of the Lord. He's an Ethiopian man. And we'll deal with him a little bit in ou...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1093",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1376.7599792480469,
      "text": "take note of the compassion of the Lord. Really, we'll look at it from two perspectives this evening. Number one, I see the compassion of the Lord as seen in Jeremiah's deliverance from the dungeon. We find that there are these men in chapter 38 that want to kill Jeremiah. And they take Jeremiah and according to verse 6, they let him down into this dungeon where there's no water and Jeremiah sunk in the mire. The Bible tells us of this man in verse 7, Ebed-Melech the Ethiopian. He was one of the eunuchs which was in the king's house. He heard that they had put Jeremiah in the dungeon. The king then sitting in the gate of Benjamin, Ebed-Melech went forth out of the king's house and spake to the king saying, notice what he says. In v. 9 of Jeremiah 38, My lord the king, these men have done evil in all that they have done to Jeremiah the prophet, whom they have cast into the dungeon and he is like to die for hunger in the place where he is, for there's no more bread in the city. Then the king commanded Ebed-Melech the Ethiopian saying, take from hence 30 men with thee and take up Jeremiah the prophet out of the dungeon before he die. Notice what happens in v. 11, so Ebed-Melech took the men with him and went into the house of the king under the treasury and took thence old cast clouts",
      "context": "...ch went forth out of the king's house and spake to the king saying, notice what he says. In v. 9 of Jeremiah 38, My lord the king, these men have done evil in all that they have done to Jeremiah the prophet, who...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1376",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1518.9599914550781,
      "text": "Jeremiah did so. So they drew up Jeremiah with cords and took him out of the dungeon. And Jeremiah remained in the court of the prison. I see God's deliverance here. I understand that as I look at the passage of Scripture, I begin to see how God is able to deliver and we see the compassion of the Lord and we understand that there were some men that had this evil plan against Jeremiah. They wanted Jeremiah to die in the dungeon. But the reality is that God wasn't done with Jeremiah. And God knew where Jeremiah was and God would work on the behalf of Jeremiah by allowing this Ethiopian man that is mentioned here, Ebed-Melech, this Ethiopian man, to go and to inquire of the king and to seek permission from the king to go with these 30 men in order to bring this man Jeremiah out. It's of interest to me that in v. 4, there were four of them that put Jeremiah in the dungeon and then there's a group of 30 that come to bring him out. God is aware of where Jeremiah is and God is working on the behalf of His servant. We find that Ebed-Melech would be rewarded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man would be rewarded for his faithfulness. It says this in v. 16,",
      "context": "...behalf of His servant. We find that Ebed-Melech would be rewarded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man ...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1518",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 1594.9999694824219,
      "text": "servant. We find that Ebed-Melech would be rewarded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man would be rewarded for his faithfulness. It says this in v. 16, Go and speak to Ebed-Melech the Ethiopian, saying, Thus saith the Lord of hosts, the God of Israel, Behold, I will bring My words upon this city not for evil and not for good, and they shall be accomplished in that day before thee. Again, we see the reference to the coming judgment. We see the reference to the fact that God was going to bring this judgment upon His people because of their wickedness. But notice the promise in v. 17-18 with regard to Ebed-Melech. It says this, But I will deliver thee in that day, saith the Lord. And thou shalt not be given into the hand of the men whom thou art afraid. For I will surely deliver thee, and thou shalt not fall by the sword, but thy life shall be for a prey unto thee. Why? Notice this at the end of v. 18. Because thou hast put thy trust in Me, saith the Lord. See, this evening, we have to ask ourselves, even as we, yes, we're looking at Jeremiah in particular, but within the context of these chapters of Scripture, we are introduced to this other man that God used to bring deliverance",
      "context": "servant. We find that Ebed-Melech would be rewarded for his work that he does here in Jeremiah 38 if you look over quickly as kind of a sidebar. In Jeremiah 39, verses 16-18, we see where this man ...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=1594",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}