{
  "reference": "Jeremiah 1",
  "occurrences": [
    {
      "sermon_id": "hMIOkmwPfzg",
      "timestamp": 1568.6399841308594,
      "text": "and have a good courage. Man, when we know that God is with us, we can be strong and have that courage that God requires us to have and gives us through that great promise. Notice, if you will, in the book of Jeremiah. Turn to the book of Jeremiah and look in the first chapter of the book of Jeremiah. Now you understand that Jeremiah was called to minister to the nation of Judah during a very dark time in her history. A time in which they had forsaken the Lord. The Bible tells us it's a time in which they had forgotten the Lord. It's a time in which they followed idols. Jeremiah is to stand and to prophesy and to proclaim truth to this stiff-necked, rebellious people. And as God calls Jeremiah, He says to him in verse number eight of Jeremiah 1, be not afraid of their faces. Why? For I am with thee to deliver thee, saith the Lord. Man, I think that goes a long way for Jeremiah to stand to proclaim the messages that he proclaimed, to face the opposition that he faced, to be imprisoned as he was imprisoned and left for dead. Even as the people got together and they counseled among themselves that we're gonna kill Jeremiah. There's no reason for him to live. He says, listen, you do with me what you want. You're accountable to God. But he had this promise that God said, I'm with you.",
      "context": "...stiff-necked, rebellious people. And as God calls Jeremiah, He says to him in verse number eight of Jeremiah 1, be not afraid of their faces. Why? For I am with thee to deliver thee, saith the Lord. Man, I thin...",
      "sermon_title": "Sermon hMIOkmwPfzg",
      "url": "https://www.youtube.com/watch?v=hMIOkmwPfzg&t=1568",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 167.83999633789062,
      "text": "and understanding that we're living in those last days, there are some things that we should expect to happen in these last days. And Jeremiah was a man that was, of course, serving God on the eve of the Babylonian captivity. Historically speaking, we understand that as he is there and as he's preaching and giving the prophecies that have been given to him by the Lord God Almighty, that Jeremiah is in a place where he is actually seeing the very things that he's preached unfold. He's seeing the fulfillment of the very prophecies that he's proclaimed. As we begin to think about the events that are surrounding the Babylonian captivity and conquest of Jerusalem and the life of Jeremiah, I've asked you to turn to Jeremiah 38, and I want you to be there, but I want to remind you even before we jump into the portion of Scripture that we'll look at this evening, I want to remind you of a great promise that God gave to Jeremiah in Jeremiah chapter number one. In Jeremiah chapter number one in verse number eight, God said to Jeremiah, be not afraid of their faces, for I am with thee to deliver thee, saith the Lord. We have, as we have looked at Scripture and considered these similar words that we read in Jeremiah 1.8, we read how that God promised to be with",
      "context": "...he Lord. We have, as we have looked at Scripture and considered these similar words that we read in Jeremiah 1.8, we read how that God promised to be with",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=167",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "9Lj9S26ifeI",
      "timestamp": 237.8000030517578,
      "text": "eight, God said to Jeremiah, be not afraid of their faces, for I am with thee to deliver thee, saith the Lord. We have, as we have looked at Scripture and considered these similar words that we read in Jeremiah 1.8, we read how that God promised to be with Moses, he promised to be with Joshua, he promised to be with Jeremiah as we've just read, and we understand that he is with us. We understand that Hebrews 13 tells us and we can rejoice in the truth that he had said, I will never leave thee nor forsake thee, that Jesus said, I am with you always, and for that we could rejoice. But as we think about that promise and we think about the life and ministry of Jeremiah, we find that he was called of the Lord and we find that he was faithful. Notice in Jeremiah 38 in verse number 28, it's where I'll get the title for the message this evening, and then we'll go through a host of Scriptures in these four chapters and trust to be a blessing to you this evening. In Jeremiah 38 in verse number 28, the Bible says, so Jeremiah abode in the court of the prison until the day that Jerusalem was taken. And he was there when Jerusalem was taken. I've said already by way of introduction that Jeremiah witnessed what he had faithfully prophesied. If you're",
      "context": "...he Lord. We have, as we have looked at Scripture and considered these similar words that we read in Jeremiah 1.8, we read how that God promised to be with Moses, he promised to be with Joshua, he promised to be...",
      "sermon_title": "Sermon 9Lj9S26ifeI",
      "url": "https://www.youtube.com/watch?v=9Lj9S26ifeI&t=237",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}