{
  "reference": "Jeremiah 2",
  "occurrences": [
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 1577.3999633789062,
      "text": "supply chain procurement. And what Jeremiah is saying is that because of your actions, you have bought this, you have brought this upon you. Hast thou not procured this unto thyself? Remember, I mentioned a moment ago that principle that we find in the Word of God, as Paul would put it so plainly in Galatians, chapter number 6, when he said, be not deceived. God is not mocked. For whatsoever man soweth, that shall he also reap. Can I tell you, there is a positive side of that truth. You sow good seed, you reap good fruit. There's a negative side. You sow wicked seed, you're going to reap wicked fruit, evil fruit. It's a principle of the Word of God. You're not going to change it. It's a law. It's just not going to be changed. A preacher of yesteryear said, too many people are running around sowing wicked seeds all week long and then going to church on Sunday and praying for crop failure. I thought that was pretty interesting. Because you know what? It properly explains the approach of many today. They sow seeds of wickedness and then they pray for crop failure. Don't let it come. Don't let it happen. But God said, listen, God is not mocked. He says in Jeremiah 2.17, hast thou not procured this unto thyself? Turn over to chapter 6 here in the book of Jeremiah and notice in verse number 15. Great question that is asked here.",
      "context": "...ailure. Don't let it come. Don't let it happen. But God said, listen, God is not mocked. He says in Jeremiah 2.17, hast thou not procured this unto thyself? Turn over to chapter 6 here in the book of Jeremiah a...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=1577",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "O-P_67xx1P0",
      "timestamp": 1661.7799377441406,
      "text": "let it come. Don't let it happen. But God said, listen, God is not mocked. He says in Jeremiah 2.17, hast thou not procured this unto thyself? Turn over to chapter 6 here in the book of Jeremiah and notice in verse number 15. Great question that is asked here. It says, were they ashamed when they had committed abomination? Nay. They were not at all ashamed. Where could they blush? Therefore they shall fall among them that fall. The time that I visit them, they shall be cast down, saith the Lord. You know, we live in a time where they don't blush. There's no shame. I mean, they flaunt that wickedness. Do they not? I mean, they celebrate the wickedness. They're legislating the wickedness. Jeremiah says, were they ashamed when they committed abomination? Nay. They were not at all ashamed, neither could they blush. Jeremiah chapter 10, the first statement of verse number 3, for the customs of the people are vain. The customs of the people are vain. If you study anthropology, you're studying various customs and world cultures and what have you, and you begin to study the cultures and times and customs of various people groups. One of the classes that I least liked in Bible college was advanced cultural anthropology. I said, I had a hard enough time in cultural anthropology, you make me take advanced cultural anthropology.",
      "context": "let it come. Don't let it happen. But God said, listen, God is not mocked. He says in Jeremiah 2.17, hast thou not procured this unto thyself? Turn over to chapter 6 here in the book of Jeremiah a...",
      "sermon_title": "Sermon O-P_67xx1P0",
      "url": "https://www.youtube.com/watch?v=O-P_67xx1P0&t=1661",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}