{
  "reference": "Job 1",
  "occurrences": [
    {
      "sermon_id": "53lojYZz2_0",
      "timestamp": 2701.0599670410156,
      "text": "that will be, it's their pursuit. The love of how much can I get? So, how do we develop the biblical perspective of contentment? Well, we're not seeking riches. If God were to bless you, by the way, there are many people in God's Word that were wealthy. Wealth is not a problem. It's how you use it. It's like what Brother Cottle said, it's not the problem if you have wealth, it's the problem if wealth has you. That's the problem. Money is not the problem, but if money has you, it becomes the problem. God uses those, listen, I have found in my life that many times the people that God chooses to bless with monetary blessings are the people that are givers. That's just the way it works. And so, we find here that he says they that will be rich, the love of money is the root of all evil. So, we understand that godliness with contentment is great gain. We understand that we brought nothing into this world. It is certain we can carry nothing out. Having food and raiment let us be there with content. So, we have to develop this biblical perspective on contentment. The Bible tells us a few verses I'm going to reference for you quickly. Job 1 and verse number 21, and many of us are familiar with the life of Job. All of the destruction that came place",
      "context": "...perspective on contentment. The Bible tells us a few verses I'm going to reference for you quickly. Job 1 and verse number 21, and many of us are familiar with the life of Job. All of the destruction that ...",
      "sermon_title": "\"Developing Biblical Perspective\" I Timothy 6:1-10",
      "url": "https://www.youtube.com/watch?v=53lojYZz2_0&t=2701",
      "channel": "Unknown",
      "publish_date": 20240702
    },
    {
      "sermon_id": "53lojYZz2_0",
      "timestamp": 2765.939971923828,
      "text": "with content. So, we have to develop this biblical perspective on contentment. The Bible tells us a few verses I'm going to reference for you quickly. Job 1 and verse number 21, and many of us are familiar with the life of Job. All of the destruction that came place in chapter number 1, by the way, Job was a wealthy man. He was a wealthy man. He lost everything and at the end of the book, he's a wealthy man again. God gave him. God restored, actually more. Notice in Job chapter 1 and verse 21, notice what Job says. Verse 20 is important to read along with it. It says this in Job 1 and verse 20, then Job arose, rent his mantle and shaved his head and fell down upon the ground and worshipped. Here's what he said, naked came I out of my mother's womb and naked shall I return thither. The Lord gave. The Lord gave. That's the right perspective. The Lord gave. I got a job. You know who gave you the ability to earn wealth? Go back to Deuteronomy and read it. It says that God gives you the power to get wealth. God gave you the power to work. No, I have a, whatever job you have, whatever mind you have, whatever ability you have, God gave that to you. And so it says, the Lord gave and the Lord hath taken away. Blessed be the name of the Lord.",
      "context": "...perspective on contentment. The Bible tells us a few verses I'm going to reference for you quickly. Job 1 and verse number 21, and many of us are familiar with the life of Job. All of the destruction that ...",
      "sermon_title": "\"Developing Biblical Perspective\" I Timothy 6:1-10",
      "url": "https://www.youtube.com/watch?v=53lojYZz2_0&t=2765",
      "channel": "Unknown",
      "publish_date": 20240702
    }
  ]
}