{
  "reference": "Job 40",
  "occurrences": [
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 1000.0599975585938,
      "text": "air, and over every living thing that moveth upon the earth, including dinosaurs. All right, that's what God says. He doesn't say including dinosaurs, I'm saying that's what he's saying, because he says every living thing that moveth upon the earth, that would be inclusive of dinosaurs, and therefore we would confidently conclude that humans and dinosaurs absolutely lived at the same time, 100%. And we find, turn over to the book of Job, if you will, Job chapter number 40. Turn to the book of Job, and I'm not gonna get into all of this this evening, we won't be able to take the time to do so. I'm just gonna look at chapter number 40, but you can look at chapter number 41 and read about Leviathan. We're gonna look at chapter number 40 and read about a behemoth, and we think about behemoth, it begins here in Job chapter number 40, and I want you to begin looking with me at verse number 15. Job 40 and verse number 15. Notice what God is saying here. This is God's second speech, speaking of his power, the Lord answered Job, if you look at verse number six, it said, then answered the Lord unto Job out of the whirlwind and said, and so just so we can pick up context, I'm gonna begin in verse 15, but just so you understand, this is the Lord",
      "context": "...t begins here in Job chapter number 40, and I want you to begin looking with me at verse number 15. Job 40 and verse number 15. Notice what God is saying here. This is God's second speech, speaking of his p...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=1000",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 1188.719970703125,
      "text": "us to take this approach, and unfortunately Bible, study Bibles and some Bible scholars of yesteryear, they would just take this approach of saying, well, it must be a hippopotamus, it must be a whatever, because they don't know how to answer the question. And then you have more problems interacting with somebody because, well, the word dinosaur isn't there and they say that it's a hippopotamus. It just doesn't line up. The description that God gives here at the end of Job chapter number 40, this This is not a hippo, this is not some kind of a large mammal, animal, elephant or otherwise. We find that the description is given of a huge animal with a long neck that ate grass. I believe that it would describe a sauropod if you would, perhaps even, and you guys bear with me, some of these little kids can say the words better than I can, a brachiosaurus. And when you think about this particular, and I didn't take pictures and bring it up here or anything, but you think about this particular dinosaur and you think about the description of this dinosaur and you think about the way in which this description here in Job 40 and the fossils that have been found, it matches greatly. It's a great answer to, okay, it must have been behemoth, must have been a sauropod, and specifically a brachiosaurus.",
      "context": "...bout the description of this dinosaur and you think about the way in which this description here in Job 40 and the fossils that have been found, it matches greatly. It's a great answer to, okay, it must hav...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=1188",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "nEQdkmuMUk8",
      "timestamp": 1252.399974822998,
      "text": "about the description of this dinosaur and you think about the way in which this description here in Job 40 and the fossils that have been found, it matches greatly. It's a great answer to, okay, it must have been behemoth, must have been a sauropod, and specifically a brachiosaurus. And so we think about the pre-flood climate, remember we dealt with the flood and we talked about that pre-flood climate and how things, you think about the longevity of life, the longevity of all of those things, the way the climate was and so on and so forth, and you begin to find out how these creatures could thrive in such an environment. It's interesting because this here text tells us in verse number 15 about behemoth that he eateth grass as an ox. Well, that was always a problem for folks when they began to, especially with these evolutionary scientists that would give their answers as to what they would believe with regard to dinosaurs and their aging and so on and so forth. But there was some, and I apologize if it's crude, but there was some fossilized dinosaur dung that was found in the rocks of India. And this fossilized dinosaur dung that was found in the rocks of India showed very plainly that sauropods ate grass. Well that kind of caused a problem for them, because they didn't believe that grass existed",
      "context": "...bout the description of this dinosaur and you think about the way in which this description here in Job 40 and the fossils that have been found, it matches greatly. It's a great answer to, okay, it must hav...",
      "sermon_title": "Sermon nEQdkmuMUk8",
      "url": "https://www.youtube.com/watch?v=nEQdkmuMUk8&t=1252",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}