{
  "reference": "John 17",
  "occurrences": [
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1359.239974975586,
      "text": "not only as He speaks of our Savior here in 1 John chapter number 3, does He remind the recipients, does He remind us this morning that He took away our sins, that was accomplished at the cross of Calvary, but I want you to notice as well that He destroyed the works of the devil. Notice in verse number 8, the Bible says, He that committeth sin is of the devil, for the devil sinneth from the beginning. For this purpose, the Son of God was manifested, that He might destroy the works of the devil. Satan did everything he could do throughout history to prevent Messiah from coming and from going to that cruel cross. He did everything he could. You read in the Old Testament, you read about the various plots against the nation of Israel, you read against the attacks against the lineage, the line, you find that it's all an attack upon Messiah. You read about Haman's wicked plan in the book of Esther to annihilate the entirety of the Jewish race. Why? So that no Messiah could come. He tried to kill Him multiple times during His earthly ministry. You can read various portions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye that Satan begins to triumph, thinking",
      "context": "...ions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye t...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1359",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1441.3999786376953,
      "text": "portions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye that Satan begins to triumph, thinking he's won the victory. After he died and he was put in that borrowed tomb, they set a seal. Remember, they kept watch and they made it as sure as they could. But there was nothing that could keep them from rising and conquering sin, death, and the grave. He destroyed the works of the devil. And we understand as we look at this verse of Scripture and this truth that God is giving us with regard to the work that God did there at Calvary, and He's rendered this truth of destroying, it's rendered powerless. Notice what the Bible says, if you will, over in the book of Colossians in chapter number 2 and verse number 15 with regard to this truth of Christ destroying the works of the devil. In Colossians 2 and verse number 15, the Bible, I'll read verse 14 with it. Notice what He says here in verse number 14 of Colossians chapter number 2. He says this, blotting out the handwriting of ordinances that was against us, which was contrary to us, and took it out of the way, nailing it to His cross. And having spoiled principalities",
      "context": "...ions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye t...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1441",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 0.0,
      "text": "But before we get there, I'm going to be reading a passage from John 17. And so perhaps you want to start in John chapter number 17. And I'm going to read our text from 1 John. But then I'm going to immediately go to the book of John in the 17th chapter. Of course, we know that God has used the human penman for this book that we're studying here on Sunday mornings. The book of 1 John with our theme from this book in verse number 7 of chapter 1. If we walk in the light as he is in the light, our theme is walking in the light. And so thankful for the truth that God has given us already through this book of 1 John. Last week on Sunday morning, we looked at verses 12 through 14. And we noted the three groups of people that are identified and written to. The little children, the young men, and the fathers. And as we looked at that passage of scripture, we made note as to the particulars that were mentioned with regard to them. And we understand that the young men were said to have overcome the wicked one because of the spiritual strength received from the word of God. And I'm so thankful for God's word and for the truth of God's word.",
      "context": "But before we get there, I'm going to be reading a passage from John 17. And so perhaps you want to start in John chapter number 17. And I'm going to read our text from 1 ...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 130.0,
      "text": "is issued under the inspiration of the Holy Spirit of God by the Apostle John to those in whom he is writing. But I'm mindful, as I mentioned, that John chapter number 17 records for us just moments before the Lord Jesus Christ would go to the cross of Calvary. The Bible begins in John 17 and verse number 11, and it says this, And now I am no more in the world, but these are in the world. So I want you to pay attention as we read through and notice this word world that is used so often. It says, And I come to thee, Holy Father, keep through thine own name those whom thou hast given me, that they may be one as we are. While I was with them in the world, I kept them in thy name. Those that thou gavest me I have kept, and none of them is lost, but the son of perdition, that the Scripture might be fulfilled. Verse 13, And now come I to thee, in these things I speak in the world, that they might have my joy fulfilled in themselves. I have given them thy word, and the world hath hated them, because they are not of the world, even as I am not of the world. I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil.",
      "context": "... us just moments before the Lord Jesus Christ would go to the cross of Calvary. The Bible begins in John 17 and verse number 11, and it says this, And now I am no more in the world, but these are in the worl...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=130",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 195.0,
      "text": "in themselves. I have given them thy word, and the world hath hated them, because they are not of the world, even as I am not of the world. I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil. They are not of the world, even as I am not of the world. Sanctify them through thy truth, thy word is truth. As thou hast sent me into the world, even so have I also sent them into the world. And for their sakes I sanctified myself, that they also might be sanctified through the truth. As we notice in these verses of Scripture from John 17, many times the Lord Jesus Christ is referring to the world. And he says this, that he's given us his word in verse 14, And the world hateth them, hath hated them, why? Because they are not of the world, even as I am not of the world. Now he says this in verse 15, I pray not that thou shouldest take them out of the world. No doubt as believers there have been times in our lives where we thought, man, it'd be just great if we could go to heaven, amen, and leave this old world. But God did not ordain it that at the time of salvation we would immediately leave this world to go to our heavenly home, our eternal abode.",
      "context": "...hat they also might be sanctified through the truth. As we notice in these verses of Scripture from John 17, many times the Lord Jesus Christ is referring to the world. And he says this, that he's given us h...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=195",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 261.0,
      "text": "in our lives where we thought, man, it'd be just great if we could go to heaven, amen, and leave this old world. But God did not ordain it that at the time of salvation we would immediately leave this world to go to our heavenly home, our eternal abode. But he ordained it that he would leave us here for the purpose of being his representatives, his witnesses. And he says in verse 15, I pray not that thou shouldest take them out of the world, but that thou shouldest keep them, notice, from the evil. And then he says this in verse number 18, as thou hast sent me into the world, even so have I also sent them into the world. And we think about this truth that is revealed to us in John 17 and coupled with what we read in 1 John chapter number 2, and we are immediately confronted with a real difficulty that the child of God will face in his life with the world, the world in which we live. Now, when God speaks of the world, we understand that he speaks of creation as the world. That's not what he's speaking about here in 1 John chapter number 2. When he speaks of the world, there are times in which he speaks about the people. For God so loved the world, right?",
      "context": "...en so have I also sent them into the world. And we think about this truth that is revealed to us in John 17 and coupled with what we read in 1 John chapter number 2, and we are immediately confronted with a ...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=261",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 246.16000366210938,
      "text": "John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a concluding verse. It closes out all that Jesus taught his disciples, all of the instruction, all that he had communicated to them during that special time. We find that Jesus in the gospel of John regularly refers to his hour. And he speaks about in John chapter number two that his hour is not yet come, but we find that as immediately following our text of scripture this morning, that when you come to John 17 and verse number one, that Jesus says, father, the hour is come. What is he referring to? Well, he's going to the cross of Calvary. He's going to pay for the sin of mankind. He's going to fulfill his singular purpose of coming to this earth and that's to save sinners. He had to go to the cross of Calvary. We understand that he was buried and he rose conquering sin, death and the grave. The things that would transpire in these days ahead were going to be events that were going to cause the disciples to have many emotional responses. There were several things that they were going to have to deal with, not only during the crucifixion, the arrest and the trial and the crucifixion, the resurrection and then following thereafter. We find that as they would begin their ministry, as you study the book of Acts,",
      "context": "...but we find that as immediately following our text of scripture this morning, that when you come to John 17 and verse number one, that Jesus says, father, the hour is come. What is he referring to? Well, he'...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=246",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 2174.780029296875,
      "text": "place and then after He goes to the cross He does everything that He can to prevent the resurrection but there's nothing He can do. He's defeated because God is greater and we have to see Him in that rightful place. Great is the Lord and greatly to be praised. We need to see Him high, holy and lifted up. We need to see Him exalted. We find in John 17 that as Jesus says the hour has come glorify thy son that thy son also may glorify thee. We find that in verse number 2 the Bible says as thou hast given Him power over all flesh that He should give eternal life to as many as thou hast given Him and this is life eternal that they might know thee the only true God and Jesus Christ whom thou hast sent. I have glorified thee on the earth. I have finished the work which thou gavest me to do. You know at that point Jesus had not yet gone to the cross but He was able to say that He had finished the work because it was so absolutely certain that He would go to the cross. He would bury and He would rise again that He would speak in absolute terms of an event that had not yet taken place because we can't talk that way because I don't know what's going to happen tomorrow but He can and He did.",
      "context": "... to be praised. We need to see Him high, holy and lifted up. We need to see Him exalted. We find in John 17 that as Jesus says the hour has come glorify thy son that thy son also may glorify thee. We find th...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=2174",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1104.4999694824219,
      "text": "that the enemy makes it look so good and so appealing, and we find that the writer of Hebrews is saying, listen, there's some things that we need to set aside. If we're going to run this race, if we're going to do what God has called us to do, if we're going to be fit for the race, we've got to lay aside every weight. We've got to lay aside the sin which doth so easily beset us. We're mindful of what Jesus said in John 17 as He's nearing the time in which He would go to the cross of Calvary. And we find that He's praying. And there as He's praying, He says, I pray not, beginning in verse 15 of John 17, I pray not that thou shouldest take them out of the world, but that thou shouldest keep them from the evil. You understand that we live in an evil world. By the way, it's not hard for us to be able to conclude that statement this morning. We live in an evil world. There's sin all around us. We find that the Lord Jesus Christ as He's praying, He says that thou shouldest keep them from the evil. Notice verse 16. They are not of the world even as I am not of the world. We've been mentioning that from Hebrews 11. I'm a pilgrim. I'm a stranger. This world is not my home. I'm just a passing through. And what a blessing.",
      "context": ".... We've got to lay aside the sin which doth so easily beset us. We're mindful of what Jesus said in John 17 as He's nearing the time in which He would go to the cross of Calvary. And we find that He's prayin...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1104",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1937.260009765625,
      "text": "inheritance obtained a more excellent name than they. And here as we come to the end of verse number 2 of Hebrews 12, it says, and has sat down at the right hand of the throne of God. I'm so thankful that one day He's going to come again. Amen? I mean, the Bible tells us that the trumpet of the Lord shall sound, and we understand that as we sing songs about the return of Christ, we understand that right now He's seated at the right hand of the throne of God, but one day, He's going to come back. I'm so thankful for that truth of the word of God. We find the example that is given to us, let me say this, as we've mentioned already that throughout His earthly ministry, the earthly ministry of the Lord Jesus Christ, that He was focused on His purpose. You understand in John 8 and verse number 29, He says this, I do always those things that please Him. We mentioned already from John 17 and verses 15 through 17 about the fact that we're in the world but not of the world, but we find that Jesus, as He's praying, as He begins that prayer, He says, Father, the hour has come, glorify Thy Son that Thy Son also may glorify Thee, and just a few more verses as we really think about the transition to",
      "context": "... verse number 29, He says this, I do always those things that please Him. We mentioned already from John 17 and verses 15 through 17 about the fact that we're in the world but not of the world, but we find t...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1937",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 1995.4199981689453,
      "text": "world but not of the world, but we find that Jesus, as He's praying, as He begins that prayer, He says, Father, the hour has come, glorify Thy Son that Thy Son also may glorify Thee, and just a few more verses as we really think about the transition to our final point this morning, He says this in John 17 and verse number 4, I have glorified Thee on the earth, I have finished the work which Thou gavest Me to do. Jesus was focused. He had a purpose, and He'd be focused upon that purpose. Can I tell you this morning that we need to be focused upon our Lord and Savior, Jesus Christ. As I'm focused upon the person of Christ and I'm focused upon my Savior, it helps me as I run my race. It helps me to avoid those distractions and those hindrances that life wants to bring, that the enemy wants to distract us with and derail us from the course in which we've been called to run. We find that we have to be fit for the race. We find that we must be focused during the race. This morning, if I could submit to you that number three, we need to finish the race. We need to finish the race. You know, how you finish matters. Unfortunately, there are those that you can read of that started well that did not finish well.",
      "context": "...ore verses as we really think about the transition to our final point this morning, He says this in John 17 and verse number 4, I have glorified Thee on the earth, I have finished the work which Thou gavest ...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=1995",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "dQq2qxx8aHM",
      "timestamp": 2063.4400024414062,
      "text": "focused during the race. This morning, if I could submit to you that number three, we need to finish the race. We need to finish the race. You know, how you finish matters. Unfortunately, there are those that you can read of that started well that did not finish well. I hope that we would have the prayer that the Apostle Paul had as he spoke to the Ephesian elders in Acts chapter number 20, and he said this to them, he said that I might finish my course with joy. Look at a few things about the Apostle Paul at the end of the message this morning. When we begin to think about the call that's been given to us of running the race and we find that we need to be fit for the race, we need to be focused for the race, we need to finish the race. Jesus finished, as we mentioned already in John 17 and verse number four. He said, I've glorified thee, I finished. We find that in John 19 and verse number 30, he cried out on the cross of Calvary before he gave up the ghost. He said, it is finished. Notice as we look at the text of Scripture in Hebrews chapter number 12, notice verse number three. The Bible says for consider him. The word consider is an interesting word. It means to think over, to ponder, to muse upon, and we begin to think if there were",
      "context": "... to be focused for the race, we need to finish the race. Jesus finished, as we mentioned already in John 17 and verse number four. He said, I've glorified thee, I finished. We find that in John 19 and verse ...",
      "sermon_title": "Sermon dQq2qxx8aHM",
      "url": "https://www.youtube.com/watch?v=dQq2qxx8aHM&t=2063",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1767.97998046875,
      "text": "and the time would not permit us to discuss many others that would be noteworthy and important for us to focus on. I want us to think this morning of this cloud of witnesses, and I want you to think about our greatest example, and that's the Lord Jesus Christ. Peter says this as he's writing to those believers that were facing great difficulty, that Christ left us an example that we should follow His steps. He is the Son of God, He's my Savior, but He's a great example. We find that in John chapter number 17, notice what the Bible tells us. We know that this actually is, in John 17, the prayer of Jesus. And we find that oftentimes, the people will speak about the Lord's prayer, and they'll talk about the model prayer, or the instructive prayer, when Jesus says, when you pray, you  Here's how you pray. That's not the Lord's Prayer. John 17 is the Lord's Prayer as it's recorded for us. And I want you to notice what Jesus says in John 17 in v. 4. He says, I have glorified Thee on the earth. It begins in v. 1. Father, the hour has come. Glorify Thy Son that Thy Son also may glorify Thee. What hour is He speaking of? The time of His death. The time of His death. We sing oftentimes at Christmastime this season that we're in the midst of born to die. He was born to die.",
      "context": "...d that in John chapter number 17, notice what the Bible tells us. We know that this actually is, in John 17, the prayer of Jesus. And we find that oftentimes, the people will speak about the Lord's prayer, a...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1767",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 0.0,
      "text": "Morning will be the text that we'll be preaching from and the title for the message as you see in the bulletin there the power of The gospel. I'm so thankful that we have been entrusted with the gospel of Jesus Christ and we have the unique privilege I shall say Responsibility of sharing that precious message the good news of Jesus Christ You'll be mindful of the fact that before the Lord Jesus Christ went to the cross of Calvary in John chapter number 17 in verse Number 18, he declared as thou hast sent me into the world Even so have I also sent them Into the world. We understand that the gospel has been given and we have been sent and we have a Responsibility and Jesus made that declaration in John 17 before he would go to the cross of Calvary Of course We are mindful of the fact that after the resurrection of our Savior and before the ascension we understand that he gave the Great Commission as we often refer to it as You can read about the Great Commission and each of the Gospels again in the book of Acts But you'll be mindful of the fact that he the Lord Jesus Christ He said that we have been given this duty this job to preach the gospel to every creature What a unique privilege and responsibility it is",
      "context": "...as been given and we have been sent and we have a Responsibility and Jesus made that declaration in John 17 before he would go to the cross of Calvary Of course We are mindful of the fact that after the resu...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 1928.3399963378906,
      "text": "says that God was in Christ reconciling the world unto Himself, not imputing their trespasses unto them. See, the sin and the iniquity was poured upon Christ at His death on the cross. And it says here at the end of v. 19, \"...and hath committed...\" There's that word again. \"...unto us the word of reconciliation.\" So we find in v. 18, \"...he hath given to us the ministry of reconciliation.\" At the end of v. 19, \"...that he hath committed unto us the word of reconciliation.\" Remember what Jesus said right before He would go to the cross of Calvary as He's praying to His Father in John 17. And we find that He's praying there. And He says this, \"...sanctify them through Thy truth. Thy word is truth.\" But then He says in John 17, in v. 18, \"...as Thou hast sent Me into the world, even so have I also sent them into the world.\" What do you send us to do? To preach the Gospel. The ministry of reconciliation. Notice v. 20, \"...now then...\" Here's the understanding as to what's been given to us. The ministry of reconciliation. The word of reconciliation. He says, \"...now then, we are ambassadors for Christ.\" Isn't that a wonderful truth? That we're His ambassadors. What's an ambassador? It's a representative. One who goes on the behalf of another. Typically when we think about ambassadors, we think about it in the context of global, national things where we have an ambassador",
      "context": "...r what Jesus said right before He would go to the cross of Calvary as He's praying to His Father in John 17. And we find that He's praying there. And He says this, \"...sanctify them through Thy truth. Thy wo...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=1928",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}