{
  "reference": "John 3",
  "occurrences": [
    {
      "sermon_id": "LAgQEfojK6Q",
      "timestamp": 150.3000030517578,
      "text": "be mindful of the promises of God and to claim the promises of God in 2013 I preached through the book of Esther and the theme for that year was for such a time as This for such a time as this and as we had the opportunity and privilege To preach through the book of Esther and we understood that God gives us opportunity and how we must seize that opportunity in 2014 I preached to the book of John and Dealt with that great statement of John the Baptist in John 3 in verse number 30. He must increase It's all about Jesus and we understand that the entirety of that thought in that verse as he must increase and I must decrease and so we taught through preached through the book of John in 2015 boldness to speak thy word This was part one of the book of Acts and we studied through the first 12 chapters the book of Acts in 2015 and We saw how that the disciples of the Apostles there the early church how they faced much opposition and much difficulty and they faced threats and Imprisonment and beatings and all sorts of things that they endured and how they prayed that God would grant them Boldness to speak thy word and how we understand even still today how we need the boldness of the Holy Spirit of God to speak the Word of God in",
      "context": "...y in 2014 I preached to the book of John and Dealt with that great statement of John the Baptist in John 3 in verse number 30. He must increase It's all about Jesus and we understand that the entirety of th...",
      "sermon_title": "Sermon LAgQEfojK6Q",
      "url": "https://www.youtube.com/watch?v=LAgQEfojK6Q&t=150",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 414.0,
      "text": "waxed sore in the land of Egypt, and all countries came unto Egypt to Joseph for to buy corn, because the famine was so sore in all lands. I've titled the message from verse number 54 this evening, the seven years of dearth began. The seven years of dearth began. We notice as we conclude the chapter, I just read the verses, but God reveals to us really in verse 56 and verse number 57, how this circumstance, this great famine that was upon the land, that was described as being very grievous, that would consume the land, that God reveals to us how this would be the catalyst, if you will, that would eventually bring Jacob and his family into the land of Egypt. Because the Bible says that all countries, verse 57, came into Egypt to Joseph for to buy corn, because the famine was so sore, notice, in all lands. Now, it's kind of interesting, if you look at the end of verse number 57, before we get into the message this evening, notice that little word, so. We're familiar with that when we read John 3, 16, for God so loved the world. And you think about the impact when God is explaining to us the terribleness, if you will, of this famine. This is because the famine was so sore in all lands. As you enter into the 42nd chapter, you find that the Bible tells us",
      "context": "...t into the message this evening, notice that little word, so. We're familiar with that when we read John 3, 16, for God so loved the world. And you think about the impact when God is explaining to us the te...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=414",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 2865.3800354003906,
      "text": "of people, really of any size, there are dilemmas, there are difficulties, there's opposition, there's problems, but our God is able to help. And we must declare, as Jehoshaphat did, our eyes are upon thee. Our eyes are upon thee. I'm looking unto my Savior, understanding who He is, understanding what He's done, understanding what He's promised, and I'm saying, God, would you work? I was reading this morning in my own personal devotions to the book of John, and once again, it's a familiar verse of Scripture, but once again, my attention was focused upon that great declaration of John the Baptist in John 3 in verse 30, he must increase and I must decrease. Listen, it's all about God being glorified. And as long as you're trying to figure out your own problems, and as long as you're trying to have somebody recognize how smart you are to figure out all of your dilemmas in life, God's not gonna be glorified. And we need to just simply come in simple faith and obedience and say, God, I don't have the might, the strength, or the power. I don't have any idea what to do, but here's what I'm doing. My eyes are on you. I'm seeking you. I'm asking you for help. And God is a very present help at the time of trouble. And he says, here's what I want to do for you. Here's how I'm gonna work on your behalf. And he gives",
      "context": "...ipture, but once again, my attention was focused upon that great declaration of John the Baptist in John 3 in verse 30, he must increase and I must decrease. Listen, it's all about God being glorified. And ...",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=2865",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 834.7599792480469,
      "text": "John 3 and verse number 4 with regard to the definition or the description of sin. I would say this, as we look at verse number 4 and we understand that John speaks about sin, that we'd understand this morning that sin is awful. It is stated as being a transgression of the law, and we find that that literally means lawlessness. Lawlessness. And we find that here, as God is referring back to the truth of the Old Testament, we'd be familiar with the law even as we've studied the Old Testament, and we find that He's giving the clarity with regard to what is sin, and He speaks about sin. We understand this morning that the law, it reveals sin. In fact, Paul says this, If it had not been for the law, I would not have known sin, in Romans chapter number 7. But because the law says, and I look at my behavior, I find out that I'm a transgressor of God's law. And we find here this morning that sin is being spoken of. We know that sin has been dealt with earlier in the chapters of the book of 1 John. Remember, the Bible said this in 1 John chapter number 1 with regard to sin. He says if we say in verse number 8 that we have no sin, we deceive ourselves and the truth is not in us. If we confess our sins, He is faithful and just",
      "context": "John 3 and verse number 4 with regard to the definition or the description of sin. I would say this, as we...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=834",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}