{
  "reference": "John 4",
  "occurrences": [
    {
      "sermon_id": "d-1B6rYpHbw",
      "timestamp": 408.70001220703125,
      "text": "as we look at this portion of Scripture And we see how that these false teachers are described that they're described as being Antichrist They are against the Lord Jesus Christ The Bible tells us in 1st John chapter number 4 in verse number 3 in every spirit that confesseth Not that Jesus Christ has come in the flesh is not of God and this is that spirit of Antichrist Whereof ye have heard that it should come and even now Already is it in the world? We find that in verse number 1 of 1st John chapter number 4 He refers to these as being not only Antichrist, but as false prophets Notice it says in 1st John 4 in verse number 1 It says this beloved believe not every spirit, but try the spirits whether they are of God because why because many False prophets are gone out into the world the plurality the the number of these false prophets of these Antichrist these that are against the Lord Jesus Christ notice the description goes further in our text It says in 1st John 2 in verse number 22 It says who is a liar, but he that denieth that Jesus is the Christ He is Antichrist that denieth the father and the son he calls him a liar They're liars The Bible tells us that the devil is a liar. He's the father of it",
      "context": "...mber 4 He refers to these as being not only Antichrist, but as false prophets Notice it says in 1st John 4 in verse number 1 It says this beloved believe not every spirit, but try the spirits whether they a...",
      "sermon_title": "Sermon d-1B6rYpHbw",
      "url": "https://www.youtube.com/watch?v=d-1B6rYpHbw&t=408",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2322.9400024414062,
      "text": "claimed to be God. That's false. Jesus very much, in fact, claimed to be God. The religious leaders of the day knew exactly what Jesus was claiming. Notice in John chapter number 4, we'll look at a number of examples. John chapter number 4, the woman at the well, remember Jesus said, I must pass through, I must needs go through Samaria. The woman saith unto him in John 4 in verse number 25, the woman saith unto him, I know that Messiah cometh, which is called Christ. When He is come, He will tell us all things. Jesus saith unto her, I that speak unto thee am He. That's pretty plain, is it not? She says, I know that Messiah is coming. I know that Messiah is Christ. She knew some truth about the Old Testament and Jesus says, that's me. Pretty plain. Notice in John 8, we're familiar with this one, it's one that we often will quote in John 8. These religious leaders, of course, they're talking about Abraham at this particular time and Jesus talks about the fact that Abraham rejoiced to see my day and that really messed them up because they said unto him in verse number 57, thou art not yet fifty years old and hast thou seen Abraham. And Jesus saith unto them, verily, verily, I say unto you, before Abraham was, I am. Now, who did God really want to",
      "context": "...ember Jesus said, I must pass through, I must needs go through Samaria. The woman saith unto him in John 4 in verse number 25, the woman saith unto him, I know that Messiah cometh, which is called Christ. W...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2322",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1713.5599975585938,
      "text": "there, or on the back table, about how to song lead. I've never read the book. I'm sure there's some good things in there. But you have to understand that we're talking about song leading, we're talking about in the context of a church, that there are some spiritual truths that need to be understood before you're going to just write about how to lead singing. In the context of pleasing God, in the context of doing things decently and in order, in the context of they that worship him, John 4, must worship him in spirit and in truth. We find that the word of God is profitable. The Bible not only is profitable, the product of inspiration, but notice what the Bible says in 2 Timothy 3 and verse 17. The Bible equips the child of God. He says that it's profitable for these things, for doctrine, for reproof, for correction, for instruction in righteousness. Then notice verse 17, that the man of God may be perfect, throughly furnished unto all good works. The Bible equips the child of God. It equips us. I'm so thankful for the equipping. I'm so thankful that the Holy Spirit of God who lives within me, the Holy Spirit of God, if you've been saved this morning that lives within you, that he will guide you into all truth and that he will help you to be in that place where you're equipped, where you're complete",
      "context": "...God, in the context of doing things decently and in order, in the context of they that worship him, John 4, must worship him in spirit and in truth. We find that the word of God is profitable. The Bible not...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1713",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "8bqqorGPae8",
      "timestamp": 686.8200073242188,
      "text": "the inner circle, remember, John, he saw that Jesus slept, right? He was tired. He was asleep on the boat. He saw that Jesus was unhungered. He saw that Jesus was thirsty. He saw these things, these human attributes of the Lord Jesus Christ. He saw the deity of Christ. He saw the power of Christ. He saw the same God that was sleeping in the boat stand and say, peace, be still. He saw the same God who was wearied with his journey that was looking for water that gave freely of the living water that we look at in John 4. And he talked to the lady, the woman at the well of all of her history and all of those things. He is the God-man. And John says that he was made flesh and he dwelt among us. Notice the next phrase. And we beheld his glory, the glory as of the only begotten of the Father, full of grace and truth. That phrase, when it says we beheld his glory, is really the same phrase that we look at in 1 John when it says that we looked upon him. We beheld his glory. As we notice, as we study through the gospel records and we read of the life and ministry of the Lord Jesus Christ, and you think about the great privilege of these disciples, and John in particular with regard to the subject at hand,",
      "context": "...with his journey that was looking for water that gave freely of the living water that we look at in John 4. And he talked to the lady, the woman at the well of all of her history and all of those things. He...",
      "sermon_title": "Sermon 8bqqorGPae8",
      "url": "https://www.youtube.com/watch?v=8bqqorGPae8&t=686",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "20HHrsvLvZg",
      "timestamp": 0.0,
      "text": "passage of scripture that you would expect on the Sunday before Christmas. I do trust that the message, however, will be a blessing to you as we consider this statement that is made by the Lord Jesus Christ in this familiar passage of scripture in John 4, when Jesus has interaction with the woman at the well. And we're familiar with that passage in John 4, and I do trust it'll be a blessing to you. During this time of year, the Christmas season, we understand that it is common in our culture, and in many cultures, for that matter, to exchange gifts. Unfortunately, for some, that has become a primary focus. And we see that we, of course, live in a society in which we have just bombarded with advertisements from really successful marketing, a successful marketing industry, and we find that many times they're showing us, and they're preparing, and they're trying to get you to get this particular gift, and they make you, after watching all of their advertisements, think that you simply can't live life without whatever that item is. And they're very successful. You have children that just need this particular item, whatever the hot item is for any particular year, and we understand the society in which we live in. And we find, however, that really, the holiday that we would celebrate during this time of year in our society has really become over-commercialized. And we find that they estimate, in America,",
      "context": "...sider this statement that is made by the Lord Jesus Christ in this familiar passage of scripture in John 4, when Jesus has interaction with the woman at the well. And we're familiar with that passage in Joh...",
      "sermon_title": "Sermon 20HHrsvLvZg",
      "url": "https://www.youtube.com/watch?v=20HHrsvLvZg&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "20HHrsvLvZg",
      "timestamp": 1506.280029296875,
      "text": "man. Amen? We cannot earn this gift. We must simply receive this gift. So this morning, I would simply ask this question as we consider His gift to me, have you received the gift? Have you personally understood that you are a sinner and that Christ is the only Savior? Have you understood this truth that is being revealed to us this morning through John 4, that God has a gift for us and that this gift is eternal life through Jesus Christ our Lord. It's a precious gift that was paid for with His blood. There's nothing you can do to earn it. It's available to all people. You must simply receive it. The question this morning is, have you received the gift of God? Have you been born again? Have you trusted Christ as your Savior? Can I tell you this? He won't force you to receive the gift. In fact, you can reject the gift. I used to be able to say that I've never had anyone reject a gift that I tried to give them, but just recently I had someone reject a gift. And you wouldn't know who they are, and it was just a token of appreciation. I was trying to be a kind individual, and I extended a gift to someone, and it really wasn't anything of any great monetary value. It was just a small token of appreciation. Within just a few minutes, the person said, I don't want this.",
      "context": "...s the only Savior? Have you understood this truth that is being revealed to us this morning through John 4, that God has a gift for us and that this gift is eternal life through Jesus Christ our Lord. It's ...",
      "sermon_title": "Sermon 20HHrsvLvZg",
      "url": "https://www.youtube.com/watch?v=20HHrsvLvZg&t=1506",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}