{
  "reference": "John 21",
  "occurrences": [
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2414.4199562072754,
      "text": "it is, ever gonna know if I finished it? I know that's on the very low shelf, amen? But it's super practical. I got to know it or I'm not gonna do it. I show up to the wrong racetrack. You had a track meet yesterday, a basketball game yesterday. You show up to the wrong court. You don't play the game, right? You don't run the race. You're at the wrong track. It's like, man, no one else showed up. Yeah, you're at the wrong place. Know your race. Know your course. Know your ministry. Super practical. Notice what John 21 tells us. The Lord Jesus Christ in this passage of Scripture is speaking to Peter. He's speaking to Peter. Peter had said this, I go a-fishing. I go a-fishing in John 21 and verse number 3. The other disciples went with him. They caught nothing. And Jesus met him on the shore. John says, I think it's Jesus. And Peter swam and he just got off the boat and swam to shore, right? And then Jesus, after he's talking, he says, Peter, do you love me? Peter, do you love me? Peter, do you love me? And I want you to notice what John 21 in verse number 21 says. Peter seeing him, this him is speaking of John according to verse number 20, saith to Jesus, Lord, and what shall this man do? Now Jesus had",
      "context": "...the wrong place. Know your race. Know your course. Know your ministry. Super practical. Notice what John 21 tells us. The Lord Jesus Christ in this passage of Scripture is speaking to Peter. He's speaking to...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2414",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2488.1999588012695,
      "text": "do you love me? Peter, do you love me? And I want you to notice what John 21 in verse number 21 says. Peter seeing him, this him is speaking of John according to verse number 20, saith to Jesus, Lord, and what shall this man do? Now Jesus had already told Peter in verse number 19, follow me. And then Peter sees John and says, well, what about him? You know what Jesus' answer is in verse number 22? If I will that he tarry till I come, what is that to thee? Follow thou me. You know, I think Jesus is telling Peter in our own language today, don't worry about John. Because John's gonna do what John's ministry is and what my, but Peter, I told you, follow me. But so often we're, well, what about that person? What about this person? And we get distracted by those things and we worry about what other people are supposed to be doing. And at that time, guess what we're not doing? We're not fulfilling our ministry, right? And so Jesus says, if I will that he tarry till I come, what is that to thee? And then they all thought John's gonna live until Jesus comes back. That's not what, that's not what Jesus said. What he's saying is that don't worry about other people. Focus on what I told you, Peter, follow me. Peter, follow me. Number two, number one was know your ministry. Number",
      "context": "do you love me? Peter, do you love me? And I want you to notice what John 21 in verse number 21 says. Peter seeing him, this him is speaking of John according to verse number 2...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2488",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}