{
  "reference": "John 20",
  "occurrences": [
    {
      "sermon_id": "8bqqorGPae8",
      "timestamp": 970.2400207519531,
      "text": "said, ye shall bear witness, why? Because ye have been with me from the beginning, and John is testifying, he's giving this witness. Notice in the very last statements of John 21, the last two verses of this great book, in John 21, we understand that it's at this time in which the focus is really primarily dealing with Peter, here at the end of John 21, and John is there, for the Bible says that Peter, in verse number 20, turning about, seeth the disciple whom Jesus loved, following, and that's John, and so John is there, and Jesus is interacting with Peter, and we find that in verse number 24, as the book concludes, the Bible says, this is the disciple which testifieth of these things, and wrote these things, and we know that his testimony is true. Notice verse 25, and there are also many other things which Jesus did, the which, if they should be written, everyone, I suppose, that even the world itself could not contain the books that should be written, amen. And I want you to just meditate upon that for just a moment. We really, as we started our study in Sunday school, the family church Sunday school class that we started back in November, and going through the miracles of Jesus Christ, we looked at this verse of scripture, John 21 and verse 25, coupled with the truth in John 20, verse 30 and 31,",
      "context": "...Jesus Christ, we looked at this verse of scripture, John 21 and verse 25, coupled with the truth in John 20, verse 30 and 31,",
      "sermon_title": "Sermon 8bqqorGPae8",
      "url": "https://www.youtube.com/watch?v=8bqqorGPae8&t=970",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "8bqqorGPae8",
      "timestamp": 1045.7400207519531,
      "text": "we started our study in Sunday school, the family church Sunday school class that we started back in November, and going through the miracles of Jesus Christ, we looked at this verse of scripture, John 21 and verse 25, coupled with the truth in John 20, verse 30 and 31, speaking about the things that were written versus the things that were not written, but I want you, just for a moment, to think about John giving this eyewitness account in 1 John, these first four verses that are our focus of study this morning, and as you consider the credibility of the account, the credibility of that which John is giving, you must understand the great things that he heard and saw. He says, these things are written, but if all of the things were written, I'm not sure the world could contain. Can you imagine when we look through and study the gospels as we journey with Jesus during his earthly ministry, we have the opportunity to see some great things, but there's so many things that Jesus did that are not recorded for us in scripture, and John is a witness of those things. John is an eyewitness, and he says, I'm gonna give an account, and when you think about the senses, he says, the things that I've heard, the things that I've seen, as I've handled the word of life, this is the testimony that I'm going to give.",
      "context": "...Jesus Christ, we looked at this verse of scripture, John 21 and verse 25, coupled with the truth in John 20, verse 30 and 31, speaking about the things that were written versus the things that were not writt...",
      "sermon_title": "Sermon 8bqqorGPae8",
      "url": "https://www.youtube.com/watch?v=8bqqorGPae8&t=1045",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "8bqqorGPae8",
      "timestamp": 1966.6999969482422,
      "text": "write we unto you, that your joy may be full. I want you to keep that in mind, but turn to the book of John in the 20th chapter, and I want you to see, hold your place in 1 John, we're going to come right back, but I want you to see what it says in John 20. He says here in 1 John, and these things write we unto you, why? The purpose is stated, that your joy may be full. Notice in the gospel of John in chapter number 20, he says this in verse number 30, and many other signs truly did Jesus in the presence of His disciples, which are not written in this book. But these are written. Why? That you might believe that Jesus is the Christ, the Son of God, and that believing you might have life through His name. Do we understand the purpose of the gospel of John? Yeah, the purpose of the gospel of John is that you might believe that Jesus is the Christ, that He is the Son of God, and that as you believe that and receive that, that you have eternal life through His name. The purpose, as it's stated in 1 John, He's writing to believers. It's always helpful to understand the audience, the recipients, because He does not say here in 1 John 1 that I'm writing these things unto you so that you would believe that you",
      "context": "...e, hold your place in 1 John, we're going to come right back, but I want you to see what it says in John 20. He says here in 1 John, and these things write we unto you, why? The purpose is stated, that your ...",
      "sermon_title": "Sermon 8bqqorGPae8",
      "url": "https://www.youtube.com/watch?v=8bqqorGPae8&t=1966",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}