{
  "reference": "John 15",
  "occurrences": [
    {
      "sermon_id": "0lpK3XY3NtI",
      "timestamp": 934.7799987792969,
      "text": "again, I do not, yes, you could look at that from a physical strength perspective and you could understand that there's certainly an application with that. But I look at it from a spiritual perspective. Listen, there's going to be adversity that you face. You can guarantee when you decide that you're gonna serve the Lord, when you're going to do right, remember, what does he say? But ye brethren, be not weary in well-doing. When you're doing right, when you're living up rightly, you're gonna have the pressures, you're gonna have the opposition that's going to mount. And if you're doing it in your own power, if you're not recognizing that you're serving the Lord, then you're going to grow weary. So how can we avoid growing weary as we're seeking to live a life that's pleasing to God, as we're seeking to walk worthy and please God? We must remember that we serve Christ. We must rely on his power. Without me, we know the verse. Without me, you can do nothing, John 15. We know the verse, but I would submit to you that many of God's people, though we know the verse here, we try sometimes to live in our own strength. We try to live independent. We try to think that we can, without me, you can do nothing, nothing. How we need him. The songwriter said, I need thee every hour. We sing that song, we're familiar with that song,",
      "context": "...e Christ. We must rely on his power. Without me, we know the verse. Without me, you can do nothing, John 15. We know the verse, but I would submit to you that many of God's people, though we know the verse h...",
      "sermon_title": "Sermon 0lpK3XY3NtI",
      "url": "https://www.youtube.com/watch?v=0lpK3XY3NtI&t=934",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "oGfQDeDvcH0",
      "timestamp": 1731.9400024414062,
      "text": "don't have the ability, and we don't know what to do, but our eyes are upon thee. What a precious statement. Our eyes are upon thee. This, as we would say that it was a recognition of their inability in the first part of the verse, we'd say in the latter part of the verse that it's a declaration of their dependence. John 15, we find that Jesus teaches the disciples, and of course for us to have the understanding of that teaching, that without Him we can do nothing. The songwriter said, I need thee every hour, and I know I've often said not to try to one-up or correct the songwriter, but the reality is that we need Him every second of every minute of every hour. We need God. And here the the King of Judah, He says, our eyes are upon thee. In the dilemma that you're facing, we know the dilemma that Jehoshaphat is facing, it's historical record, it's for us to be able to examine, but God's Word is given to us, not just for a history lesson, God's Word is given to us so that we can apply in our own lives. What's the dilemma that you're facing? What's our difficulty that we're dealing with today, and have we come to the place of declaring our inability and declaring our dependence upon God? God, our eyes are upon thee. All year, look",
      "context": "...of the verse, we'd say in the latter part of the verse that it's a declaration of their dependence. John 15, we find that Jesus teaches the disciples, and of course for us to have the understanding of that t...",
      "sermon_title": "Sermon oGfQDeDvcH0",
      "url": "https://www.youtube.com/watch?v=oGfQDeDvcH0&t=1731",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 1936.8199615478516,
      "text": "subject of sanctification. It's once again necessary for us to point out as we did, we saw this first in 1 John chapter 2 verses 3 through 6, and as we looked at that passage of Scripture, I took some time to explain to you the verb tense in these particular verses, and we see it again in our passage of Scripture before us this morning. Sometimes it's challenging to get the sense of the verb, but we find here that in this passage of Scripture, just as it was in 1 John chapter 2 verses 3 through 6, that the conjugation of the verb indicates an ongoing action. And it's important for us to understand that because He says here, whosoever abideth in Him sinneth not. So some would take and say, okay, well that means you could never commit a sin. But it's talking about this because of the conjugation of the verb, it indicates that ongoing action, that lifestyle, that behavior that is prevalent. And so He says, as He begins to speak about our sanctification, I want you to see first of all that He immediately deals with the subject of abiding in verse number 6. Whosoever abideth in Him. Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subject of abiding and he says this, that",
      "context": "...Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subje...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=1936",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 2013.5399627685547,
      "text": "Whosoever abideth in Him. Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subject of abiding and he says this, that whosoever abideth in Him sinneth not, whosoever sinneth hath not seen Him, neither known Him. Little children, let no man deceive you. He that doeth righteousness is righteous, even as He is righteous. He that committed sin is of the devil, for the devil sinneth from the beginning. Skip down if you will to verse number 9. Whosoever is born of God doth not commit sin, for his seed remaineth in him, and he cannot sin because he is born of God. In this the children of God are manifest, and the children of the devil. Whosoever doeth not righteousness is not of God, neither he that loveth not his brother. And really that's a segue into the next text of scripture that we'll study next week with regard to loving the brethren there at the end of verse number 10. But we find here this morning that both salvation and sanctification are of Christ. It's of Christ. Sometimes what happens is we are saved, for by grace we are saved through faith. We understand that salvation is all of Christ. Right? There's nothing I can do. I can't save myself. But somehow we get to",
      "context": "...Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subje...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=2013",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 862.2200317382812,
      "text": "there's so many people that are trying to manufacture joy today. They use and they try to speak of joy in the terms of happiness, and they try to manufacture it. There's a place in Florida that some of us have visited. They say it's the happiest place on earth. And the reality is that if you've ever been there, you find some of the most miserable people you'll ever find on the face of the earth. It's 105 degrees. You've been standing in a line for three hours to go on one ride. Your kids are crying. You've got to use the bathroom, blah, blah, blah, blah, blah. And it's the happiest place on earth. Isn't that what they say? Listen, people are trying to manufacture joy. If you get this, if you have this, it'll bring you happiness. It'll bring you joy. Can I tell you that joy is found in the person of Jesus Christ? And he says, I'm giving you these things. I'm speaking these things unto you that your joy, that my joy might remain in you, and that your joy might be full. Look at verse 17 here in John 15. He says, these things I command you that you love one another. You know, I want you to think about what would happen in the days ahead and all that would take place with the religious leaders of the day and then with the persecution that would rise from the Jewish leaders",
      "context": "...our joy, that my joy might remain in you, and that your joy might be full. Look at verse 17 here in John 15. He says, these things I command you that you love one another. You know, I want you to think about...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=862",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2650.0399627685547,
      "text": "do I run this race? How do I finish this course? Looking unto Jesus. Archippus, get your eyes on Jesus. Did he not have adversity? Absolutely. But he finished his course. Archippus, for us this morning, keep our eyes on the Lord. Number three, remain humble. Pride destroys. People will disappoint, but pride destroys. In Acts chapter number 20, we won't turn back there, but in Acts chapter number 20, Paul said in verse number 24, none of these things move me, neither count I my life dear unto myself, so that I may finish my course with joy. But in verse number 19, he says, serving the Lord with all humility of mind. We need to be humble. If we want to finish our course, if we want to fulfill our ministry, humility is required. In 1 Peter chapter 5 and James chapter number 4, we read in both of those accounts how the Bible says that God resisteth the proud, but giveth grace unto the humble. What did Paul say in verse number 18? Grace of God be with you, amen? We need God's grace, but we don't get God's grace if we're prideful. That serving grace, I'm thankful for the saving grace, but the serving grace, I can do this. No, no, remain humble. Remain humble. Finally, this morning, number four, depend fully on Christ. Depend fully on Christ. John 15 speaks about the importance of abiding in him. You're the",
      "context": "... Remain humble. Finally, this morning, number four, depend fully on Christ. Depend fully on Christ. John 15 speaks about the importance of abiding in him. You're the",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2650",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 2721.659942626953,
      "text": "we're prideful. That serving grace, I'm thankful for the saving grace, but the serving grace, I can do this. No, no, remain humble. Remain humble. Finally, this morning, number four, depend fully on Christ. Depend fully on Christ. John 15 speaks about the importance of abiding in him. You're the branches, Jesus said, but I am the vine. Where's the life? In the vine. Cut a branch, it dies, right? It withers away. And Jesus says, without me, you can do nothing. I mentioned that in Sunday school this morning. But I want you to think about this morning, how can I fulfill my ministry? What's the challenge for us this morning? I need to know my ministry. I know what God's called me to do. I need to keep my eyes on Jesus, because he is the author and finisher of our faith. I need to remain humble, and I need to fully depend upon him. I'm not gonna do it in my own strength. I'm not gonna, I'm not gonna fulfill my ministry. You're not gonna fulfill your ministry in your own strength. You know, one of the most difficult things to do is to serve God in your own strength. It truly is. It's tough. But when you understand that it's him working through you, completely different. In closing, let me read this to you. I read this many, many years ago,",
      "context": "... Remain humble. Finally, this morning, number four, depend fully on Christ. Depend fully on Christ. John 15 speaks about the importance of abiding in him. You're the branches, Jesus said, but I am the vine. ...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=2721",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "d8tHudo0_3I",
      "timestamp": 2223.840057373047,
      "text": "therefore, because of what he saw, because of how he was stirred, therefore, disputed he in the synagogue with the Jews, and with the devout persons, and in the market daily with them that met with him. What's Paul do? Enough with the R&R, there's work to be done, amen? I'm not suggesting that we don't ever need rest. Jesus says, come apart and rest, amen, and we understand that there's a need for that, but you look at Paul, and you see how he's stirred, and how he is brought to action. He disputes with them. Notice it says that, there in verse number 18, then certain philosophers of the Epicureans and of the Stoics encountered him, and some said, what will this babbler say? You know, some are going to call you a babbler, that's okay. You know what Jesus said, newsflash, if they hate you, they hated me. Isn't that what Jesus said, John 15? You go and look at it, that's what Jesus said. They say, what will this babbler say? You know that there were people that encountered and went to where Jesus was teaching just to criticize him? That was the only reason why they went. I'm reading through the Gospels right now, my personal Bible time, and as I'm reading through the Gospels again, and I'm reading, I just finished Mark this morning, and as I'm reading through the Gospels again, and I'm reading, and I'm just mindful, hey listen,",
      "context": ".... You know what Jesus said, newsflash, if they hate you, they hated me. Isn't that what Jesus said, John 15? You go and look at it, that's what Jesus said. They say, what will this babbler say? You know that...",
      "sermon_title": "Sermon d8tHudo0_3I",
      "url": "https://www.youtube.com/watch?v=d8tHudo0_3I&t=2223",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}