{
  "reference": "John 10",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1005.9600219726562,
      "text": "Savior, that He empowers us and He dwells within us, and we have the power of God Almighty. It's not my own power, it's not your power, it's His power through us, and I'm thankful that He empowers us. What about this? He keeps us. Aren't you thankful for that? You know how miserable it would be if you had to keep your own salvation? Seriously, it'd be miserable. You know why I believe it would be so miserable? This is my opinion. Because you become the authority or the standard. And it would mess with my mind terribly. If I had to wonder, well, wonder what I did today that, man, that was really bad, and I don't know what I have to do to make up, it'd just be a mess. But He promised to keep us. Notice this in John chapter number 10. In John chapter number 10, it's a great passage of Scripture, and we think about the blessedness of being kept by the power of God, as He says in 1 Peter 1 and verse number 5, and I'm so thankful that He keeps us. Here in John 10 and verse number 27, notice what Jesus says, My sheep hear My voice, and I know them, and they follow Me. And I give unto them eternal life. Eternal life. He didn't say I give unto them temporary life. He didn't say I give unto them probationary life. He said I give unto them eternal life.",
      "context": "...r of God, as He says in 1 Peter 1 and verse number 5, and I'm so thankful that He keeps us. Here in John 10 and verse number 27, notice what Jesus says, My sheep hear My voice, and I know them, and they foll...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1005",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "uGo1HL4c1vk",
      "timestamp": 1913.5799560546875,
      "text": "being eternal, He knew that He was going to finish this work and He says I have finished the work. I have finished. Aren't you thankful that He finished? He didn't just live a sinless life and just heal a bunch of people and perform miracles and then just say, well, I'm not going to do that part. No, if you look back in Hebrews 12 for the joy that was set before Him He endured the cross, despising the shame. Why? Because He understood that was the purpose. It was for Me that He died on that cross. We find that it's in John 19 in verse 30 that Jesus lifts up His head and as it says, it is finished. And He bowed His head and gave up the ghost. We've been told in John 10 that He's the Good Shepherd and that the Good Shepherd lays down His life for the sheep. And Jesus did just that. And just before He bowed His head and gave up the ghost, He said, it is finished. This morning, we have great examples. There's a cloud of witnesses. Archipus is receiving this charge, but we make application for us this morning. We see it. There's a cloud of witnesses. There are many people that we could look to and we could say, they finished their course. They fulfilled their ministry. They did what God called them to do. But I want you to understand that in Hebrews 12,",
      "context": "...ead and as it says, it is finished. And He bowed His head and gave up the ghost. We've been told in John 10 that He's the Good Shepherd and that the Good Shepherd lays down His life for the sheep. And Jesus ...",
      "sermon_title": "Sermon uGo1HL4c1vk",
      "url": "https://www.youtube.com/watch?v=uGo1HL4c1vk&t=1913",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1409.0399475097656,
      "text": "Israel, and then said it is not meant to take the children's bread and to cast it to dogs. We'd understand that what the Lord is dealing with here in the text of Scripture, both in Matthew and Mark as He's revealing to us the truth that we've often said, as Paul would declare that the Gospel to the Jew first and also to the Greek. And we find that Jesus came first to the Jews, to Israel, to the household of Israel. And we understand that in the plan of God because He's omniscient, He's Alpha and Omega, He's eternal, He knows all things, that as Paul would deal with in the book of Romans, that the Gentiles were graft in. We understand that the nation of Israel rejected the Lord Jesus Christ as being Messiah. And we find that Jesus is dealing with that very truth here in Matthew and Mark. It's interesting if you look in John chapter number 10, I'll just make quick reference to it, but in John chapter number 10, when we deal with the passage of Scripture that deals with the Lord being our shepherd, that He is the good shepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfold, but climbeth up some other way,",
      "context": "...hepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfol...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1409",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1473.43994140625,
      "text": "is the good shepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfold, but climbeth up some other way, the same as a thief and a robber, but he that entereth in by the door is the shepherd of the sheep. Notice in verse 3, Unto him the porter openeth, and the sheep hear his voice, and he calleth his own sheep by name, and leadeth them out. And when he putteth forth his own sheep, he goeth before them. The sheep follow them, why? For they know his voice. And a stranger will they not follow, but will flee from him, for they know not the voice of a stranger, or of strangers, excuse me. Now skip down and look at verse number 16. The Lord says this, And other sheep have I, or I have, which are not of this fold, them also must I bring, and they shall hear my voice, and there shall be one fold and one shepherd. In John 10, verses 1 through 5, he's speaking about the nation of Israel, the sheep there. And then when he talks about the other sheep I have in verse number 16, he's speaking about Gentiles. And we know the mystery of the church. Remember, as we studied the book of Ephesians last year,",
      "context": "...hepherd and as the good shepherd He giveth His life for the sheep. You'll know in verse number 1 of John 10 that Jesus says, Verily, verily, I say unto you, He that entereth not by the door into the sheepfol...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1473",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}