{
  "reference": "John 11",
  "occurrences": [
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 2114.47998046875,
      "text": "he comes in this ministry of the Lord Jesus Christ's earthly ministry in John chapter 11, we find that they were able to send physically for Jesus to come. Jesus is not here physically anymore. We understand that we have the Holy Spirit of God that indwells us, we understand the Bible says that he ascended to heaven, and one day, one glorious day, he's coming back for us and how we should rejoice in that, but he's at the right hand of the Father, he ever liveth, the Bible says, to make intercession for us. And we cannot go call for Jesus that he's down at the, the, the wherever he is and bring him here physically like they could, but we pray. Why do we pray? Well, because we believe that Jesus is able. But when Jesus finds out about he whom thou lovest is sick, Jesus didn't immediately go. He tarried because he had a purpose. Notice in verse number 4 of John 11, the Bible says when Jesus heard that, heard what? That Lazarus was sick, he said, the sickness is not unto death, but then notice these words, but for the glory of God, but for the glory of God, that the Son of God might be glorified thereby. Listen, in your life and in my life, we go through trials. One of the purposes that God has is that he would receive the honor and glory.",
      "context": "...sick, Jesus didn't immediately go. He tarried because he had a purpose. Notice in verse number 4 of John 11, the Bible says when Jesus heard that, heard what? That Lazarus was sick, he said, the sickness is ...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=2114",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "qwt_XuUQD9E",
      "timestamp": 2300.199981689453,
      "text": "feel, daddy? How's this feel, daddy? Why? Because he knows that that's sore because of the muscles that we worked. It's just how it works. Sometimes the growth spiritually requires a trial. But God's developing us. You say, but I don't want that pain. I don't want that. But God's growing you. You're going to learn something that you would not learn under any other circumstance. Notice here in John 11, after Jesus delays, he tells the disciples that we're going to go. And he says in verse number 11, these things said he, and after that he saith unto them, Our friend Lazarus sleepeth, but I go that I may wake him out of sleep. Then said his disciples, Lord, if he sleep, he shall do well. Howbeit Jesus spake of his death, but they thought that he had spoken of taking a rest and sleep. Then said Jesus unto them plainly, Lazarus is dead. But then I want you to catch verse 15. Jesus says this, I am glad for your sakes that I was not there, to the intent you may believe. Nevertheless, let us go unto him. He says, I am glad for your sakes that I was not there. Listen, there's some things that God's going to teach us in the midst of trials that we're only going to learn through the trial. It's just the way it works. Some of you do various things",
      "context": "...u're going to learn something that you would not learn under any other circumstance. Notice here in John 11, after Jesus delays, he tells the disciples that we're going to go. And he says in verse number 11,...",
      "sermon_title": "Sermon qwt_XuUQD9E",
      "url": "https://www.youtube.com/watch?v=qwt_XuUQD9E&t=2300",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}