{
  "reference": "John 14",
  "occurrences": [
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2765.9800720214844,
      "text": "gonna keep trying, just try to be a good person, I'm gonna try to do this, and I'm gonna just try to turn a new leaf. Can I tell you on the authority of the Word of God, there's only one way to get to heaven, and it's through the Lord Jesus Christ. The blood that he shed on the cross of Calvary, the only payment that is valid for your sin, and for my sin, is the blood of Jesus Christ. Nothing else is accepted, nothing, amen? Peter, as he preached, and he in Acts chapter before, I almost said Hebrews, he wasn't preaching in Hebrews, amen? In Acts chapter number four, there's a great miracle that was recorded in Acts chapter number three. That man at the gate, beautiful, he was healed. We find that Peter is preaching in Acts chapter number four, he said, if you're asking by what name this man has been made whole, he helps them understand, listen, it's not in the name of Peter or John, it's the name of Jesus Christ of Nazareth. And then he says this, and there is no other name under heaven, given among men, whereby we must be saved. What was Peter saying? Well, he was saying the same thing that Jesus said in John 14. I am the way, the truth, and the life. No man cometh unto the Father but by me. This morning, if you're saved, would you rejoice that you have a",
      "context": "...reby we must be saved. What was Peter saying? Well, he was saying the same thing that Jesus said in John 14. I am the way, the truth, and the life. No man cometh unto the Father but by me. This morning, if y...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2765",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2mDKhmk687Y",
      "timestamp": 2842.540069580078,
      "text": "must be saved. What was Peter saying? Well, he was saying the same thing that Jesus said in John 14. I am the way, the truth, and the life. No man cometh unto the Father but by me. This morning, if you're saved, would you rejoice that you have a high priest, that he lives? And oh, that God would help us to live our lives daily with the understanding that we serve a risen Savior, that he lives. One day I'm gonna be with him, see him face to face, isn't that wonderful? That song that I shared the words to, the hallelujah, what a Savior, that verse that talks about when he comes, our glorious King, he's coming. No man knoweth the day nor hour, but I'd like to say that it's getting close. And I say that on the authority of the Word of God, when James recorded for us that the coming of the Lord draweth nigh. Amen? If you've not been saved, could I offer to you this morning the greatest gift that has ever been given? It's not a gift that I could offer you personally, it's a gift that has been offered by the Lord Jesus Christ, and it's the gift of God which is eternal life through Jesus Christ our Lord. Don't leave here this morning, don't tune off from live stream without knowing for sure that heaven is your home. Because our high priest offered a",
      "context": "must be saved. What was Peter saying? Well, he was saying the same thing that Jesus said in John 14. I am the way, the truth, and the life. No man cometh unto the Father but by me. This morning, if y...",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y&t=2842",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 2363.2999877929688,
      "text": "entered into this world physically. But of really greater significance in my mind is the date August 31st, because that's when I was born again. It was 17 years later, but I'm thankful for that date when I was born again. And we understand this evening all of those things that He has promised to do in and through us and the promises that we've rehearsed, but then as we get to the end of our walk with God, we understand that He says that the second death has no power over us. Let me tell you this, and you're well familiar with this promise. Number 12, if you're taking notes, He promised to return for us. He promised to return for us. We're familiar with this promise. In John 14, in verses one through three, Jesus says, let not your heart be troubled. You believe in God, believe also in me. In my Father's house. house or many mansions, if it were not so I would have told you. I go to prepare a place for you and if I go and prepare a place I will come again and receive you unto myself that where I am there you may be also.\" What great promise. We mentioned this morning in 2nd Peter 3 in verse 9 dealing with the long suffering of God and it says that our God He is not slack concerning His promises. Some men count slackness but His long-suffering to us were not",
      "context": "...s, He promised to return for us. He promised to return for us. We're familiar with this promise. In John 14, in verses one through three, Jesus says, let not your heart be troubled. You believe in God, belie...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=2363",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1019.6599731445312,
      "text": "God, yet we say, I'm too busy. We understand the truth that we have the access. We have the opportunity. In fact, He's given us the invitation. And so what does He say? Because we have access, let us draw near. Let us come. Let us approach in full assurance in that confidence that He mentions here. Let us draw near with a true heart in full assurance of faith. Now, understand with me this morning that there are some places upon this earth that you do not have access to. There are some places upon this earth that I do not have access to. If you work in a corporate setting, perhaps you have some kind of an ID badge. And back in the day, like nine months ago, when you used to go to the office and people actually had to use their little badge to get into the building. When I worked for Sikorsky, there were certain buildings that my badge would give me access to. And there were other buildings that I did not have access to. Why? Because I wasn't supposed to be in those buildings. There were things taking place in those buildings with manufacturing processes that I was not supposed to be there. So my badge wouldn't let me in. I didn't have access. But Jesus has provided the way. He is the way, the truth, and the life. John 14, remember Jesus said that to His disciples.",
      "context": "...e in. I didn't have access. But Jesus has provided the way. He is the way, the truth, and the life. John 14, remember Jesus said that to His disciples.",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1019",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "iT8pxOgIv0A",
      "timestamp": 1085.1399841308594,
      "text": "place in those buildings with manufacturing processes that I was not supposed to be there. So my badge wouldn't let me in. I didn't have access. But Jesus has provided the way. He is the way, the truth, and the life. John 14, remember Jesus said that to His disciples. He said, I am the way, the truth, and the life. No man cometh unto the Father but by Me. And we find this new and living way. And so we have access. It's good to know that we have the access, but the response to understanding that truth is that we draw near. How confusing it is to know that we have access and yet decide not to enter. To forego the opportunity of fellowship. To forego the privilege of prayer. In His presence, the psalmist said, is fullness of joy. And so the writer says the first response to the truth that has been presented is that we should draw near. Notice as he continues the latter part of verse number 22, having our hearts sprinkled from an evil conscience and our bodies washed with pure water, you understand the ceremonial washings that they would deal with, and understand again as these Jewish believers would be receiving this particular book and understanding the familiar aspect that they would have with all that took place on that day of atonement. We're familiar as you would think about the tabernacle itself. And that's the greatest similarity",
      "context": "...e in. I didn't have access. But Jesus has provided the way. He is the way, the truth, and the life. John 14, remember Jesus said that to His disciples. He said, I am the way, the truth, and the life. No man ...",
      "sermon_title": "Sermon iT8pxOgIv0A",
      "url": "https://www.youtube.com/watch?v=iT8pxOgIv0A&t=1085",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1188.9000244140625,
      "text": "morning, it's imperative that we understand that God's Word is profitable. That God has given us exactly what we need, and there is something to embrace. That we embrace the truth of God's Word. That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bible says this in John 16 and verse 33. these things I have spoken unto you.\" Notice, number one, when we think about this expectation that in me, you might have peace. I'm so thankful that he is the prince of peace. I'm so thankful that he is a peace, according to what Paul said, that passeth all understanding. I'm thankful that even in the text of this dialogue that Jesus has with his disciples, and of course we have the division of chapters and verses, but really he's just giving in this intimate setting all of this instruction that we have divided into chapters. He's providing this instruction to his disciples. And notice back in John 14 and verse 27, notice what Jesus says with regard to peace. He says, listen, there's something to embrace. I've spoken these things I have spoken unto you, but there's something to expect. He says, listen, in me, you might have peace. Notice in John 14 and verse number 27, Jesus says this, peace I leave with you.",
      "context": "...we have divided into chapters. He's providing this instruction to his disciples. And notice back in John 14 and verse 27, notice what Jesus says with regard to peace. He says, listen, there's something to em...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1188",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "timestamp": 1264.9800262451172,
      "text": "with regard to peace. He says, listen, there's something to embrace. I've spoken these things I have spoken unto you, but there's something to expect. He says, listen, in me, you might have peace. Notice in John 14 and verse number 27, Jesus says this, peace I leave with you. Do you notice the next word? My peace I give unto you. Not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid. We understand as we study the scriptures, the importance of this truth of peace. And we find that God has promised to give us this peace. And he says that it's his peace. He said, my peace give I unto thee, not as the world giveth. Listen, I'm thankful that Jesus gives us a peace that passeth all understanding, that he will keep us in perfect peace. The Bible says to who? To those who have their minds stayed upon him. And you think about this truth this morning as we look at the scriptures and we understand, listen, we live in a world today that's seeking for peace. They're longing for peace, but they're looking for it in all the wrong places for Jesus is the prince of peace. And he offers peace. He says, my peace give I unto thee. Listen, I'm so thankful this morning that God's peace can rule in our hearts. That's what Paul says to the believers in Colossae.",
      "context": "... unto you, but there's something to expect. He says, listen, in me, you might have peace. Notice in John 14 and verse number 27, Jesus says this, peace I leave with you. Do you notice the next word? My peace...",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k&t=1264",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}