{
  "reference": "John 9",
  "occurrences": [
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 1379.020004272461,
      "text": "said, go back and tell John that the blind can see, that the lame can walk, that the deaf can hear. What is He doing? He's saying the Old Testament prophecies, they prove that I am Christ, that I am God. That was the answer that John the Baptist received when he sent those witnesses, and what a great answer. We find that Jesus is giving the witness of the works, and you think about the great miracles, and you think about how the witnesses to these great miracles, they stood, and they wondered, and they marveled at times. They said, we've never seen it like this before. The miracle that we've been studying for the last few weeks in John 9, in our Sunday school class, our family Sunday school class, the man that was born blind, and you think about that great miracle, and you think about the interrogation of the religious leaders, and all that's taking place, and he says, listen, I was blind, but now I see. And the people couldn't stop talking about it. You read in John 10, and you read in John 11, that they're referencing about the man that was blind that could now see the miracles, the works. Jesus gives the third of this threefold witness, and it's the witness of the Father. In verse number 37 of John 5, he says, and the Father himself which hath sent me hath borne witness of me.",
      "context": "...e've never seen it like this before. The miracle that we've been studying for the last few weeks in John 9, in our Sunday school class, our family Sunday school class, the man that was born blind, and you t...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=1379",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2175.499969482422,
      "text": "her the first couple of times. The Bible says that Jesus finally answered her in verse 24 and said, I am not sent, but unto the lost sheep of the house of Israel. And then she came in verse 25 and worshiped Him. Notice what she says, Lord, help me. Lord, help me. She worshiped. Notice in chapter 28, after the resurrection of our Savior, His, He's been arrested. He's been on that cruel cross. He was buried in that borrowed tomb, and He rose, conquering sin, death, and the grave. And the announcement of His resurrection is given to us in the beginning of Matthew 28, that the angel said, He's not here, for He is risen, as He said, come, see the place where the Lord lay. And then, in verse number 9 of Matthew 28, the Bible says, and as they went to tell His disciples, behold, Jesus met them, saying, all hail, and they came and held Him by the feet and worshiped Him. Skip down to verse number 16, then the eleven disciples went away into Galilee, into a mountain where Jesus had appointed them, and when they saw Him, they worshipped Him. But some doubted. They worshipped Him. Only God is to be worshipped. The clear teaching of Scripture is that Jesus received worship. In John chapter number 9, we find that it was here in John 9 with the man that was born blind, and all of the discussion that's",
      "context": "... of Scripture is that Jesus received worship. In John chapter number 9, we find that it was here in John 9 with the man that was born blind, and all of the discussion that's",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2175",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2249.97998046875,
      "text": "Him. But some doubted. They worshipped Him. Only God is to be worshipped. The clear teaching of Scripture is that Jesus received worship. In John chapter number 9, we find that it was here in John 9 with the man that was born blind, and all of the discussion that's going on, and the interrogation, and His strong witness, and Jesus comes and reveals Himself to this man near the end of the passage of Scripture. Jesus had found out that they had cast Him out, and it says in verse number 35 of John 9 that Jesus heard that they had cast Him out, and when He had found Him, He said unto him, Dost thou believe on the Son of God? He answered and said, Who is He, Lord, that I might believe on Him? And Jesus said unto him, Thou hast both seen Him, and it is He that talketh with thee. Notice the response, Lord, I believe, and He worshipped Him. Jesus receives worship. The clear teaching of Scripture. Number 2, notice the claim of Jesus. So often people will make the statement, Jesus never claimed to be God. That's false. Jesus very much, in fact, claimed to be God. The religious leaders of the day knew exactly what Jesus was claiming. Notice in John chapter number 4, we'll look at a number of examples. John chapter number 4, the woman at the well, remember",
      "context": "... of Scripture is that Jesus received worship. In John chapter number 9, we find that it was here in John 9 with the man that was born blind, and all of the discussion that's going on, and the interrogation,...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2249",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "W8g6GlJtjpg",
      "timestamp": 1996.020004272461,
      "text": "to that, he talks about the fact that we've been redeemed through his blood, that's how we have forgiveness. He's our savior. But then you see this great description of who our God is, and then it says that he might have the preeminence. Well, absolutely, that just makes sense, knowing who he is, that in my life, in your life, he should have the preeminence. And so this evening, when we look at this thought of walking, we ought to walk as Christ walked. We find that he walked wisely, he walked humbly, as we looked at last week, but tonight, we consider this truth that he walked purposefully. If you study the gospels and you study through the ministry of the Lord Jesus Christ, he was always moving with purpose, always. John 9, he saw a man that was born blind. It was an opportunity. You come to John chapter 11, and you find there that he's made aware of the fact that he whom thou lovest is sick, and what did he do? He stayed there, he delayed, he didn't go. Why? Well, because he knew what he was gonna do. And he tells his disciples, he said, all right, it's time to go. And they said that Lazarus was asleep. Well, if he's sleeping, then that's good. I mean, he's sick, let him sleep. And he said, Lazarus is dead. And then he says this, I am glad for your sakes",
      "context": "...you study through the ministry of the Lord Jesus Christ, he was always moving with purpose, always. John 9, he saw a man that was born blind. It was an opportunity. You come to John chapter 11, and you find...",
      "sermon_title": "Sermon W8g6GlJtjpg",
      "url": "https://www.youtube.com/watch?v=W8g6GlJtjpg&t=1996",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "td5xeZwEM4k",
      "timestamp": 626.7600212097168,
      "text": "says looking unto Jesus, the Author and Finisher of our faith, who for the joy that was set before Him endured the cross, despising the shame, and is set down at the right hand of the throne of God. I'm thankful that He did not come down from that cross. These that are speaking here according to v. 41, it's the chief priest mocking Him with the scribes and elders. And notice what they say at the end of v. 42. If He were to come down and save Himself, they would believe Him. Oh, He had performed countless miracles and had demonstrated to them on a number of occasions that He is God. And yet, they did not believe. I'm mindful of the account in John 9. That's the account in which God gives us when the man that was born blind that He's healed. And of course, Jesus healed this man and there was much debate with regard to this healing. And they had questioned the man many times with regard to what had happened. And He eventually, seeming as if He's tired of hearing the same questions, He says, one thing I know that whereas I was blind, now I see in John 9 v. 25. And then in v. 27, He answered these that were questioning Him and He said, I have told you already, and you did not hear. Wherefore would you hear it again? Will you also be His disciples?",
      "context": "... a number of occasions that He is God. And yet, they did not believe. I'm mindful of the account in John 9. That's the account in which God gives us when the man that was born blind that He's healed. And of...",
      "sermon_title": "Sermon td5xeZwEM4k",
      "url": "https://www.youtube.com/watch?v=td5xeZwEM4k&t=626",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "td5xeZwEM4k",
      "timestamp": 701.9200210571289,
      "text": "that whereas I was blind, now I see in John 9 v. 25. And then in v. 27, He answered these that were questioning Him and He said, I have told you already, and you did not hear. Wherefore would you hear it again? Will you also be His disciples? Then they reviled Him and said, thou art His disciple, but we are Moses' disciples. We know that God spake unto Moses. As for this fellow, we know not from whence he is. And the man that was born blind, He answered these religious leaders and said unto them, why, herein is a marvelous thing that ye know not from whence he is, and yet, he hath opened mine eyes. They had seen so many miracles. Christ had manifested, demonstrated to them that He was the Messiah, and yet, they're going to say that if He were to come down and save Himself, then they would believe the reality is that they had been given much revelation. Verse 43 back in Matthew 27. He trusted in God, let Him deliver Him now. If He will have Him, for He said, I am the Son of God. The thieves also which were crucified with Him cast the same in His teeth. Verse 45, now from the sixth hour, there was darkness over all the land unto the ninth hour. And about the ninth hour, Jesus cried with a loud voice saying, Eli, Eli, lama sabachthani?",
      "context": "that whereas I was blind, now I see in John 9 v. 25. And then in v. 27, He answered these that were questioning Him and He said, I have told you ...",
      "sermon_title": "Sermon td5xeZwEM4k",
      "url": "https://www.youtube.com/watch?v=td5xeZwEM4k&t=701",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}