{
  "reference": "Joshua 24",
  "occurrences": [
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 1838.2199592590332,
      "text": "going to declare Thy greatness. Notice he says, one generation shall praise Thy works to another. We read in the book of Joshua, and you end the book of Joshua where Joshua, under the leadership of God and under the instruction of God, he begins to charge, to give charge to those that he's leading. We read of the charge to the two and a half tribes, and then they depart, but you read of the charge not only to the leaders, but then to the people. And so often in Joshua 24, we quote where Joshua says, and as for me and my house, we will serve the Lord. What a great truth. But Joshua is calling those that he's led that have seen the mighty hand of God, he's calling them to follow the Lord, to make a commitment to serve God. You begin to read in the book of Judges, you read how that Joshua and all the elders that outlived Joshua, they died. And there arose another generation. As you read the book of Judges, that generation that rose up, they knew not God. They served idols. You say, how in the world? History just keeps repeating itself. Really, history just keeps repeating itself. You go back in our nation's history, a hundred years, compared to today, somewhere along the line, a generation failed to declare the greatness of God. Amen?",
      "context": "...depart, but you read of the charge not only to the leaders, but then to the people. And so often in Joshua 24, we quote where Joshua says, and as for me and my house, we will serve the Lord. What a great truth...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=1838",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "We8921d40Z4",
      "timestamp": 1299.7000045776367,
      "text": "believe that it's clear the choice that God would want his children to make. I believe that it's clear that Paul made it abundantly clear of the choice that he, as a spiritual leader, would like for these readers, these recipients of this letter, the choice for them to make. But at the end of the day, God's given us a free will, and the choice is yours. You know what Moses, God, says to the people in Moses writes? He says, you're going to make a choice. Deuteronomy 11. I set before you a blessing and a curse. Is that not what God said in Deuteronomy 11? We read it, we see it, we understand it. What about Joshua, in Joshua chapter 24? Choose you this day whom ye will serve. Is that not what it says? But as for me and my house, we will serve the Lord. See, Joshua said, I've made a choice, but I can't make the choice for you. I'm going to make the choice, and I'm going to lay out the reason that you ought to make the same choice that I'm making, and I believe if you read Joshua 24, that's clear, that Joshua says, look, let me help you understand why you should make the same choice that I'm making. You know what all the people said? We're going to serve God. You read it, that's what they say. We're going to serve God.",
      "context": "...ay out the reason that you ought to make the same choice that I'm making, and I believe if you read Joshua 24, that's clear, that Joshua says, look, let me help you understand why you should make the same choi...",
      "sermon_title": "Sermon We8921d40Z4",
      "url": "https://www.youtube.com/watch?v=We8921d40Z4&t=1299",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "We8921d40Z4",
      "timestamp": 1365.8000030517578,
      "text": "if you read Joshua 24, that's clear, that Joshua says, look, let me help you understand why you should make the same choice that I'm making. You know what all the people said? We're going to serve God. You read it, that's what they say. We're going to serve God. And so we find this evening there's a choice, but that choice is just, it's not a one and done. Like salvation, you write down the date that you got saved, and man, you can rejoice in your spiritual birthday, and you can know that you're born again, but with regard to yielding to Christ multiple times in a day, you may have to make that decision. Nope, I'm going to yield to God. I'm bought with a price. I belong to Him. Notice with me as we conclude looking at verses 17 through 19, we're going to look at a couple of other, just one other passage quickly, but notice the consequences of this choice. The consequences, we find that there's a choice to be made, but the consequences are given to us. It says, but God be thanked. Notice what it says in verse 17, that ye were the servants of sin, but ye have obeyed from the heart that form of doctrine which was delivered you. Isn't that exciting that we were, but we are not any longer? He says it in past tense. Ye were the servants of sin. I was, you were, I was, everyone.",
      "context": "if you read Joshua 24, that's clear, that Joshua says, look, let me help you understand why you should make the same choi...",
      "sermon_title": "Sermon We8921d40Z4",
      "url": "https://www.youtube.com/watch?v=We8921d40Z4&t=1365",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WSQz1cqL0PE",
      "timestamp": 2198.8799743652344,
      "text": "God would visit and bring the nation into the land that he promised, but he says in verse number 25 that he took an oath of them, saying, carry up my bones from hence. You know, it's not until Joshua chapter 24 that we read of that being fulfilled, and we find that after, if you think about Genesis chapter 50, and you think about the period if you enter into the book of Exodus where there's another pharaoh, another king of Egypt that rises up that doesn't know Joseph, and all that generation dies, and you begin to think about the Egyptian bondage and all that takes place, and eventually you come to the place of the Exodus and the deliverance from Egypt land, followed by what? The wilderness wanderings. Though God never intended that that would be the plan, his plan was to deliver them from Egypt into the land, because of their disobedience and lack of faith, they wandered in the wilderness, but we come to the book of Joshua, and the book of Joshua provides us with that record of the entrance into, the conquering of, the inhabiting of the land of the nation of Israel, the land of Canaan, that land of promise. And we find that as God would give to us the book of Joshua, and we find that we come to the end of the book, and the Bible tells us in verse 29 of Joshua 24, and it came to",
      "context": "...k of Joshua, and we find that we come to the end of the book, and the Bible tells us in verse 29 of Joshua 24, and it came to",
      "sermon_title": "Sermon WSQz1cqL0PE",
      "url": "https://www.youtube.com/watch?v=WSQz1cqL0PE&t=2198",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WSQz1cqL0PE",
      "timestamp": 2268.0799560546875,
      "text": "Israel, the land of Canaan, that land of promise. And we find that as God would give to us the book of Joshua, and we find that we come to the end of the book, and the Bible tells us in verse 29 of Joshua 24, and it came to pass after these things that Joshua the son of Nun, the servant of the Lord, died being a hundred and ten years old. They buried him in the border of his inheritance in Timnath Sarai, which is in Mount Ephraim on the north side of the hill of Gash, and Israel served the Lord all the days of Joshua, and all the days of the elders that overlived Joshua, and which had known all the works of the Lord that He had done for Israel. And notice verse 32, the bones of Joseph, which the children of Israel brought up out of Egypt, buried they in Shechem, in a parcel of ground which Jacob bought of the sons of Hamor, the father of Shechem, for a hundred pieces of silver, and it became the inheritance of the children of Joseph. That's a long time that passes, but Joseph's bones are taken out of Egypt. We find that they're brought into this burying place that God tells us of in Shechem, in Joshua 24 and verse 32, but I want you to think about a life marked by faith.",
      "context": "...k of Joshua, and we find that we come to the end of the book, and the Bible tells us in verse 29 of Joshua 24, and it came to pass after these things that Joshua the son of Nun, the servant of the Lord, died b...",
      "sermon_title": "Sermon WSQz1cqL0PE",
      "url": "https://www.youtube.com/watch?v=WSQz1cqL0PE&t=2268",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "WSQz1cqL0PE",
      "timestamp": 2334.1199951171875,
      "text": "of Joseph. That's a long time that passes, but Joseph's bones are taken out of Egypt. We find that they're brought into this burying place that God tells us of in Shechem, in Joshua 24 and verse 32, but I want you to think about a life marked by faith. It's interesting, for Joseph finds himself in the Hall of Faith chapter, sort of the book of Hebrews, if you will, the 11th chapter, and we'll end here this evening. We think of Hebrews chapter 11, we've often referred to this chapter as the Hall of Faith chapter. Those that, by faith, they believed God and how they were moved and what they did and so on and so forth, and we find that Joseph, the statement that we read in Genesis 50, is recorded for us in Hebrews chapter 11. It tells us this in Hebrews 11 and verse 22. By faith Joseph, when he died, made mention of the departing of the children of Israel and gave commandment concerning his bones. By faith he believed God. The Bible tells us the just shall live by faith. Amen? The Bible tells us in this chapter, in Hebrews chapter 11 and verse number 6, without faith it is impossible to please Him. For he that cometh to God must believe that He is, and that He is a rewarder of them that diligently seek Him. God desires that His people would live a life of faith, that we believe God.",
      "context": "... of Egypt. We find that they're brought into this burying place that God tells us of in Shechem, in Joshua 24 and verse 32, but I want you to think about a life marked by faith. It's interesting, for Joseph fi...",
      "sermon_title": "Sermon WSQz1cqL0PE",
      "url": "https://www.youtube.com/watch?v=WSQz1cqL0PE&t=2334",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}