{
  "reference": "Judges 13",
  "occurrences": [
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 222.1999969482422,
      "text": "And we'll reference that verse of Scripture as we go through the message this morning, but the reality is that we come to Judges chapter number 13 this morning, and as we come to this passage of Scripture in our text this morning, Manoah and his wife had no children. We do not know their ages, but we do understand that the Bible tells us that Manoah's wife was barren. She had no children. But she received this announcement, she received word that she would have a son. If you begin reading with me in Judges 13 and verse number 1, the Bible says, and the children of Israel did evil again in the sight of the Lord, and the Lord delivered them into the hand of the Philistines forty years. And now as God gives us in verse number 1 the backdrop of what's going on in Israel broadly speaking, the text of Scripture goes in to verse number 2 and begins to share with us a particular family in Israel. As we look at this text of Scripture, it says there was a certain man of Zorah of the family of the Danites whose name was Manoah, and his wife was barren and bare not. And the angel of the Lord appeared unto the woman and said unto her, Behold now, thou art barren and barest not. Notice this, but thou shalt conceive and bear a son.",
      "context": "...ved this announcement, she received word that she would have a son. If you begin reading with me in Judges 13 and verse number 1, the Bible says, and the children of Israel did evil again in the sight of the L...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=222",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 1209.7400484085083,
      "text": "to, but the reality this morning is that this great promise in James one and verse number five, so often is not fulfilled. filled in your life or my life because I don't ask. Because you don't ask. Why don't we ask? Because we don't recognize that we need it. We think we can handle it. Then all of a sudden, something big comes in your life. And you say, oh man, this one right here, like I need wisdom on this one. I'm gonna go seek God because, can I submit to you this morning that you need God's wisdom every day of your life? It's not just for the quote unquote big things. For every day of your life, you need God's wisdom. You need to live dependent upon him. And so we find in our text of scripture in Judges 13 that there's a recognition of deficiency which leads to a request for direction, which leads to, as we go back to Judges 13, and really the primary focus of our message this morning, there is a robust directive. I'm thankful that God answers the prayer, the request that is given of Manoah here in Judges 13. He asks the question, he makes the request, teach us what we shall do unto the child that shall be born. How shall we order the child and how shall we do unto him? And we see the request is made, but we can rejoice this morning",
      "context": "... need God's wisdom. You need to live dependent upon him. And so we find in our text of scripture in Judges 13 that there's a recognition of deficiency which leads to a request for direction, which leads to, as...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=1209",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 1278.3400497436523,
      "text": "in Judges 13. He asks the question, he makes the request, teach us what we shall do unto the child that shall be born. How shall we order the child and how shall we do unto him? And we see the request is made, but we can rejoice this morning that there is a robust directive that is given. God does not simply say to us, hey, do your best, good luck, figure it out. No, he gives us direction. He provides directives. Have you ever been assigned to do a task and not instructed on how to do it? It's frustrating. It's frustrating. You say, how do I do this? And maybe a foreman, a boss, someone else says, figure it out. Okay. And then you figure it out. And you did it wrong. And they say, that's not how you're supposed to do it. Well, I asked you how I was supposed to do it and you didn't tell me. It can be frustrating. See, here in our text of Scripture, God graciously provides direction because Manoah requested direction. Notice with me in verse number 23, Manoah makes the statement in verse 22, Manoah said unto his wife, we shall surely die because we have seen God. But his wife said unto him, if the Lord were pleased to kill us, he would not have received a burnt offering and a meat offering at our hands. Neither would he have showed us all these things,",
      "context": "in Judges 13. He asks the question, he makes the request, teach us what we shall do unto the child that shall be...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=1278",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 1717.5000610351562,
      "text": "on how we are to order, how we are to teach, how we're to train, how we're to raise our children. Turn back to the book of Deuteronomy, if you will. In the sixth chapter, Deuteronomy chapter number six, beginning in verse number one, it's a familiar passage of scripture. As we look at this passage of scripture, we find that God had provided Israel with instruction with regard to the home life and the responsibility to teach and to train the children that would be born. In verse number one in Deuteronomy six, the Bible says now these are the commandments, the statutes and the judgments which the Lord your God commanded to teach you. Notice this phrase that ye might do them in the land whither you go to possess it. God did not give the commands so that we could just know them, but he gave the commands so that we would apply them and do them. We find that in verse number two, it says that thou mightest fear the Lord thy God to keep all his statutes and his commandments which I command thee, thou and thy son and thy son's son, all the days of thy life and that thy days may be prolonged. Now we understand as we look through Israel's history, there are many times even as we found there in our text of scripture in Judges 13 where they were not obedient to the commands that God had given.",
      "context": "...k through Israel's history, there are many times even as we found there in our text of scripture in Judges 13 where they were not obedient to the commands that God had given.",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=1717",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 1784.8600463867188,
      "text": "the days of thy life and that thy days may be prolonged. Now we understand as we look through Israel's history, there are many times even as we found there in our text of scripture in Judges 13 where they were not obedient to the commands that God had given. In fact, they were evil, they were wicked, they did wickedly in the sight of God and therefore judgment came as we started the 13th chapter of the book of Judges, it was the Philistines that brought great persecution, if you will, to the children of Israel. Israel for 40 years according to that text of scripture. In verse three it says, Hear therefore, O Israel, and observe to do it. You see again a focus on doing, that it may be well with thee, and that ye may increase mightily as the Lord God of thy fathers hath promised thee in the land that floweth with milk and honey. Hear, O Israel, the Lord our God is one Lord, and thou shalt love the Lord thy God with all thine heart, with all thy soul, and with all thy might. And these words which I command thee this day shall be in thine heart. By the way, if it's not really in your heart, your kids know it. If it's not really in your heart, the people you're trying to minister to, the people you're trying to influence, to reach, to teach, they know it.",
      "context": "...k through Israel's history, there are many times even as we found there in our text of scripture in Judges 13 where they were not obedient to the commands that God had given. In fact, they were evil, they were...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=1784",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 2488.8000411987305,
      "text": "chapter number six, the verse of scripture that's there on your bulletin this morning that we quoted by way of introduction, and ye fathers, provoke not your children to wrath, but bring them up in the nurture and admonition of the Lord. This admonition, this command to bring them up. Listen, your kids, the young people in our church, they need direction. Can I tell you this morning, there is a world out there that is standing by waiting to give your kids all kinds of direction. And I would submit to you that most of that direction that they want to give your children is in direct opposition to the instruction that's given in this precious book. But they're waiting to do it. Oh, there are people online that are waiting to instruct your children. There are people that are ready, they're ready to give false teaching, false instruction, false worldviews. Wouldn't have a biblical worldview. Bring them up in the nurture and admonition of the Lord, the involvement that is required. There's a great connection between Proverbs 22 in verse six and Ephesians six and verse number four. As we look at the passage of scripture this morning from Judges, and we look in the chapter and the situation there between Manoah and his wife and receiving this announcement in Judges 13 with regard to the fact that though they had no children, that they would soon have a child. There's a recognition on the part of Manoah",
      "context": "... the chapter and the situation there between Manoah and his wife and receiving this announcement in Judges 13 with regard to the fact that though they had no children, that they would soon have a child. There'...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=2488",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 2566.2200317382812,
      "text": "from Judges, and we look in the chapter and the situation there between Manoah and his wife and receiving this announcement in Judges 13 with regard to the fact that though they had no children, that they would soon have a child. There's a recognition on the part of Manoah of his own deficiencies. I don't know what I'm doing. Do you ever feel like that in life? You say, I don't want to admit it. I know, because we have a hard time admitting it. There are times in lives, listen, there's some times that God will bring you to a place that he'll bring you to the end of yourself so that you recognize you need him and you can no longer do it. You should no longer desire to do it in your own power and your own strength. Manoah recognized his deficiencies. He recognized and therefore he made a request. I wonder this morning, how often do we request of God to provide us with direction in our lives? Yes, within the context of this message this morning, specifically to fathers on training their children and bringing them up in the nurturing and the admonition of the Lord and running to the word of God to receive the directive that God has provided us with, absolutely. But what about where you are in your life? Regardless of who you are, with regard to your responsibilities, your position in life, you need God's direction.",
      "context": "... the chapter and the situation there between Manoah and his wife and receiving this announcement in Judges 13 with regard to the fact that though they had no children, that they would soon have a child. There'...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=2566",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "LXUyl5whAVc",
      "timestamp": 2726.7200317382812,
      "text": "direction. Can I tell you this morning, I've prayed that prayer in the context of parenting. I've prayed that prayer in the context of pastoring. I've prayed that prayer in the context of just being a Christian. God, I need your help. I'm thankful that he's a very present help at the time of trouble, that he will give us what we need. And he said, he promises to you, he promises to me that he will give us wisdom, that he'll give us the direction. But the person that receives the direction, the wisdom is the one who asks. The one who asks is the one that recognizes that they lack and they need it. This morning, we see a great example in the life of Manoah in Judges 13, an example that is applicable to every one of our lives, how desperately we need God to provide direction in our lives. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the opportunity that you've given us to gather today. We thank you, God, for the freedom that we have in this nation that we can openly worship thee. I pray, Father, that you would work in hearts and lives. If there's one here this morning that's not saved, God, I pray that they would understand how much you love them. That you sent your only begotten son, the Lord Jesus Christ, God in flesh,",
      "context": "...izes that they lack and they need it. This morning, we see a great example in the life of Manoah in Judges 13, an example that is applicable to every one of our lives, how desperately we need God to provide di...",
      "sermon_title": "Sermon LXUyl5whAVc",
      "url": "https://www.youtube.com/watch?v=LXUyl5whAVc&t=2726",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}