{
  "reference": "Leviticus 19",
  "occurrences": [
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 1503.6799926757812,
      "text": "is corrupt. And we don't have to, we're not exaggerating by saying that this morning, but we understand the importance of justice. The Bible says this, righteous art thou, O Lord, and upright are thy judgments, in Psalm 119, in verse 137. In Isaiah 59, in verses 14 and 15, there's an indictment that is made, the Bible says in verse 14, and judgment is turned away backward, and justice standeth afar off, for truth is fallen in the street, and equity cannot enter. Verse number 15, the Bible says this, yea, truth falleth, faileth, excuse me, and he that departeth from evil maketh himself a prey, and the Lord saw it, and it displeased him that there was no judgment. Sad. Our God is a righteous, just God. There is right, and there is wrong. There is good, and there is evil. And God is the one that defines that. Isaiah deals with it. The Bible says that they were saying that that which was good is evil, and that which is evil is good. That's what's happening in our society today. We see it. And we begin to think about biblical principles for casting our votes, and we're gonna go stand at a ballot box, and we're gonna cast a vote, and these things that our politicians have tried to take and politicize them, we must acknowledge that they're biblical matters. The Bible tells us in Leviticus 19, in verse number 15,",
      "context": "... take and politicize them, we must acknowledge that they're biblical matters. The Bible tells us in Leviticus 19, in verse number 15,",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=1503",
      "channel": "Unknown",
      "publish_date": 20241027
    },
    {
      "sermon_id": "35c77xaGibc",
      "timestamp": 1579.8399963378906,
      "text": "for casting our votes, and we're gonna go stand at a ballot box, and we're gonna cast a vote, and these things that our politicians have tried to take and politicize them, we must acknowledge that they're biblical matters. The Bible tells us in Leviticus 19, in verse number 15, he shall do no unrighteousness in judgment. Thou shalt not respect the person of the poor, nor honor the person of the mighty, but in righteousness shalt thou judge thy neighbor. In righteousness thou shalt judge thy neighbor. We find this matter of justice again living in a corrupt society with corrupt justice system. And we begin to understand the authority of those that are elected in the positions in which they're able to fill and how it affects our justice department. It's important that we understand this. I want you to think about this one, the matter of partiality. Today, many people wanna use the word racism, and I understand the term, and I understand why they use it. I use the word partiality because it's a Bible word, and I believe that partiality defines much clearer the subject than just racism, because partiality can be done without race being even in the conversation. You can be partial towards someone because of their economic status, though they are the same race as you are from that perspective of what they have as race being their calling card. You can have prejudice or partiality towards someone",
      "context": "... take and politicize them, we must acknowledge that they're biblical matters. The Bible tells us in Leviticus 19, in verse number 15, he shall do no unrighteousness in judgment. Thou shalt not respect the person ...",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc&t=1579",
      "channel": "Unknown",
      "publish_date": 20241027
    }
  ]
}