{
  "reference": "Luke 22",
  "occurrences": [
    {
      "sermon_id": "otLjEpBz9Rk",
      "timestamp": 1600.7799987792969,
      "text": "Of course, we often reference the Great Commission and we should because it is the responsibility of the child of God to proclaim the gospel to a lost and dying world. Jesus came in verse number 18 of Matthew 28 and he spake unto them. And notice what he says. All power is given unto me in heaven and in earth. He didn't say some power. He didn't say most power. He said, all power is given unto me in heaven and in earth. Notice in verse number 19, it says, go ye therefore and teach all nations, baptizing them in the name of the Father and the Son of the Holy Ghost, teaching them to observe all things whatsoever I have commanded you. And lo, I am with you all way, even unto the end of the world, amen. I mean, this passage of scripture has so much great truth in it. But as we focus upon the mighty power of the Lord, we see that he says to these disciples, he will soon be, if you look at the timeline and you look at Matthew 28 and you couple it with Acts chapter number one and giving the last of the Great Commission, then the Ascension, you can read Luke 22 as well and kind of see what's going on there with this record, excuse me, Luke 24, and see the Ascension of the Lord. And these disciples would hear the Lord Jesus Christ say,",
      "context": "...ts chapter number one and giving the last of the Great Commission, then the Ascension, you can read Luke 22 as well and kind of see what's going on there with this record, excuse me, Luke 24, and see the Asc...",
      "sermon_title": "Sermon otLjEpBz9Rk",
      "url": "https://www.youtube.com/watch?v=otLjEpBz9Rk&t=1600",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "otLjEpBz9Rk",
      "timestamp": 1669.6199951171875,
      "text": "and giving the last of the Great Commission, then the Ascension, you can read Luke 22 as well and kind of see what's going on there with this record, excuse me, Luke 24, and see the Ascension of the Lord. And these disciples would hear the Lord Jesus Christ say, all power is given unto me in heaven and in earth. Go ye therefore and teach all nations. And he gives that Great Commission. And so he kind of, the book ends, if you will, of the Great Commission. On the front end of it is the fact that he says, all power is given unto me. On the back of the commission, he says, I am with you all way, even unto the end of the world. Now think about that. We have this responsibility, this commission to go, but the Lord in his declaration and giving this commission, he says, I have all power and I'll be with you. Isn't that precious? Why is Jesus all the world to you? I hope that you would say, as the songwriter said, Jesus is all the world to me. And I have three more reasons that I'll give you next week as to why he is all the world to me, but when we start this and evaluate the scriptures, I would say number one, because of who he is, and number two, because of his mighty power. Let's pray. Father, we love you. We thank you for loving us.",
      "context": "and giving the last of the Great Commission, then the Ascension, you can read Luke 22 as well and kind of see what's going on there with this record, excuse me, Luke 24, and see the Asc...",
      "sermon_title": "Sermon otLjEpBz9Rk",
      "url": "https://www.youtube.com/watch?v=otLjEpBz9Rk&t=1669",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}