{
  "reference": "Luke 4",
  "occurrences": [
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 335.94000244140625,
      "text": "and I'm thankful that he's able to deliver us from anything At times in our lives. He's able to Instead of delivering us from something he will develop us through something but we find this evening that the request the twofold request that completes verse number four is not a general request for direction and deliverance, but it is a specific request with regard to temptation and Evil notice the first phrase as we complete verse number four. It says lead us not into temptation Lead us not into temptation. It is a known reality that we have an enemy Amen, we understand that we have an adversary the devil He's a roaring line walketh about seeking whom he may devour and we are mindful of the fact that we have an enemy The reality is that a few chapters earlier if you turn back to Luke chapter number four You'll find that God provides for us here in this portion of Scripture the passage in which the devil tempted the Lord Jesus Christ while he was in the wilderness and we understand that the Bible tells us in verse number one of Luke 4 and Jesus being full of the Holy Ghost returned from Jordan and was led by the Spirit into the wilderness being 40 days Tempted of the devil and in those days he did eat nothing and when they were ended he afterward and hungered and We are not gonna read through the whole portion",
      "context": "...ist while he was in the wilderness and we understand that the Bible tells us in verse number one of Luke 4 and Jesus being full of the Holy Ghost returned from Jordan and was led by the Spirit into the wild...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=335",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 1248.8000259399414,
      "text": "It would have been evil, it would have been wicked for him to engage in this act that this Potiphar's wife desired for Joseph to engage in this activity. It would be sinful, it would be wicked. He said, How can I do this great wickedness and sin against God? What a great response from Joseph in this passage of Scripture. And sometimes when temptation comes in our lives, man, we are ready for it in the sense of we've prayed, perhaps, and we're acknowledging it and we respond properly, but you understand the devil doesn't just depart after one time of resisting that temptation, of providing that answer. In Luke chapter number 4, when the enemy, when the devil is tempting the Lord Jesus Christ, after the first response of Jesus, when Jesus said it is written, the devil didn't just leave. He tempted him a second time, and then a third time. And I read verse number 12 of Luke 4, particularly this evening, because the Bible says that he departed for a season, and we find that here in the life of Joseph, he responds properly. But I want you to notice in verse number 10, it says, And it came to pass, as she spake to Joseph, what does it say? Day by day. You know what the enemy tries to do? He tries to wear you down. Bring that temptation day by day, day by day. Wear you down.",
      "context": "...dn't just leave. He tempted him a second time, and then a third time. And I read verse number 12 of Luke 4, particularly this evening, because the Bible says that he departed for a season, and we find that ...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=1248",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}