{
  "reference": "Mark 11",
  "occurrences": [
    {
      "sermon_id": "Xx99YvltqXQ",
      "timestamp": 355.5,
      "text": "Lord Jesus Christ here in Mark, if you turn to Mark chapter number 11, Mark chapter number 11, and notice we find that as we look here at this text that Jesus was walking, I believe, with courage. He was walking courageously. In verse number 27, the Bible says this, And they come again to Jerusalem, and as he was walking in the temple, there come to him the chief priests and the scribes and the elders. And notice what they say to him in verse 28, By what authority doest thou these things? And who gave thee this authority to do these things? Now, I find it quite interesting, of course, in Mark's gospel, chapter number 11, it only goes to chapter 16, he's nearing the end of his earthly ministry and soon going to the cross and all that will take place. But we find that he's walking and he's there, the Bible tells us in verse 27, in the temple, and he's walking there, he's walking out in the midst, the Pharisees, the scribes, the Sadducees, all the religious leaders, they all at this point in Christ's ministry, they were looking for any opportunity that they could possibly come up with to kill him, they hated him, they were, every time they were around, they were trying to find something to accuse him of, and we find that they take this approach in Mark 11, and they say, By what authority doest thou these things?",
      "context": "...d, they were trying to find something to accuse him of, and we find that they take this approach in Mark 11, and they say, By what authority doest thou these things?",
      "sermon_title": "\"We Ought To Walk As Christ Walked - Part 3\" I John 2:6",
      "url": "https://www.youtube.com/watch?v=Xx99YvltqXQ&t=355",
      "channel": "Unknown",
      "publish_date": 20241111
    },
    {
      "sermon_id": "Xx99YvltqXQ",
      "timestamp": 423.5,
      "text": "they could possibly come up with to kill him, they hated him, they were, every time they were around, they were trying to find something to accuse him of, and we find that they take this approach in Mark 11, and they say, By what authority doest thou these things? Now, it's an interesting question because we know who Jesus is. Now, they're asking the question, of course, they're denying the truth that was right before them. Jesus had made it abundantly clear, in fact, John, when there's another situation in the Gospel of John where they come and they say, Tell us plainly, are you the Christ? And he says, I have, but you didn't believe. And the reality is that he's made it abundantly clear who he is, they've already attempted to kill him on more than one occasion because they knew that he was claiming to be God, but then they ask the question, By what authority are you doing these things? Well, he's God, he's the creator. In the beginning was the Word, and the Word was with God, and the Word was God, and we find that they ask him this question, and then they say this, Who gave thee this authority to do these things? And notice in verse 29, the Bible says this, And Jesus answered and said unto them, And I just begin to see the courage of the Lord standing before these that are questioning me,",
      "context": "...d, they were trying to find something to accuse him of, and we find that they take this approach in Mark 11, and they say, By what authority doest thou these things? Now, it's an interesting question because...",
      "sermon_title": "\"We Ought To Walk As Christ Walked - Part 3\" I John 2:6",
      "url": "https://www.youtube.com/watch?v=Xx99YvltqXQ&t=423",
      "channel": "Unknown",
      "publish_date": 20241111
    }
  ]
}