{
  "reference": "Matthew 18",
  "occurrences": [
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 734.0999755859375,
      "text": "that is given to us in 1 Thessalonians 5 and verse number 14 where the Bible says be patient toward all men. I think honestly tonight if we'd each be transparent and honest this is an area in which we struggle with. People can really kind of get on our nerves, right? I mean be transparent tonight don't leave me up here on an island by myself, amen? And the reality is people can, they can be annoying from time to time. I can be annoying, amen? You can be annoying. We all can but but he says be patient toward all men. I want to go over and consider an example that we read of in Matthew chapter 18. Look in Matthew 18 if you will with me tonight and here's the reality and begin to think about this instruction where the Bible says be patient toward all men. We could find ourselves if we're not careful being patient with certain people and then lacking patience with others. We could find ourselves in a position where we desire for others to be patient toward us while we are not demonstrating patience toward others. But again we must recognize and we must understand that this is not something that you're going to conjure up in your own flesh. It's not something that you're just gonna, you know, sometimes oh well they're just patient. I mean they were",
      "context": "...d all men. I want to go over and consider an example that we read of in Matthew chapter 18. Look in Matthew 18 if you will with me tonight and here's the reality and begin to think about this instruction where ...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=734",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 799.8199768066406,
      "text": "we are not demonstrating patience toward others. But again we must recognize and we must understand that this is not something that you're going to conjure up in your own flesh. It's not something that you're just gonna, you know, sometimes oh well they're just patient. I mean they were just blessed with patience. Be patient toward all men. It's a command but I can only do it through the help of God and we find that the fruit of the Holy Spirit is described as being long-suffering. Notice with me in Matthew 18 and we're gonna pick it up in verse 21. Notice what the Bible says. Then came Peter to him and said, Lord how off shall my brother sin against me and I forgive him till seven times. Now honestly what Peter is saying here was looked at by that particular era and those others that would be in that arena of time and culture. Really he was being quite generous and saying till seven times because it was only thought that maybe two or three times you might forgive someone. But Peter says till seven times and Jesus says we are familiar. I say not unto thee until seven times but until seventy times seven. You see that in verse 22. Now I've said this before and you understand this. It is not the idea that Jesus was teaching that you keep a record book and when they get",
      "context": "...d we find that the fruit of the Holy Spirit is described as being long-suffering. Notice with me in Matthew 18 and we're gonna pick it up in verse 21. Notice what the Bible says. Then came Peter to him and said...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=799",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BZi-sUEn51M",
      "timestamp": 1471.6199951171875,
      "text": "instructed us to do so, it's obvious that we can with God's help. I use the illustration in the book of Matthew this evening for this purpose. Don't be like that individual that wants people to be patient with them and then turn around and not have patience with others. It's so common and so easy for us to fall in the trap. It's a human tendency that we see on display in Matthew 18. Have patience with me, but then I'm gonna go around and I'm not gonna have patience with others. God's people ought to be different. God's people ought to be different. And God tells us be patient toward all men. I wonder this evening, I know for me, even as I prepared, man, I need the help of God. You need the help of God. We need to be walking in the spirit if we're gonna be patient toward all men. And let me tell you this, you ever hear, my dad uses this terminology all the time. I'm not sure if other people use it or not, but he says people push his buttons. You ever hear somebody use that phraseology? And someone said I was looking for the off button. Bad decision. But what I'm saying this, when you seek to try to fulfill, as you're walking in the spirit, you can guarantee that there are gonna be some things that happen where if I could adopt and use for a moment that phrase,",
      "context": "...s so common and so easy for us to fall in the trap. It's a human tendency that we see on display in Matthew 18. Have patience with me, but then I'm gonna go around and I'm not gonna have patience with others. G...",
      "sermon_title": "Sermon BZi-sUEn51M",
      "url": "https://www.youtube.com/watch?v=BZi-sUEn51M&t=1471",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}