{
  "reference": "Matthew 8",
  "occurrences": [
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 1938.8199768066406,
      "text": "birth. Matthew chapter number 2. Notice, they ask the question, beginning in verse number 1, now when Jesus was born in Bethlehem of Judea in the days of Herod the king, behold, there came wise men from the east of Jerusalem saying, where is he that is born king of the Jews? We find that there was discussion that took place and they leave and the star guides them. You come to verse number 10, and when they saw the star, they rejoiced with exceeding great joy. And when they were coming to the house, they saw the young child with Mary his mother, and notice, and fell down and worshipped Him. Not them. Him. Amen? No Mary worship. Amen? Worshipped Him. At His birth. He's king. He took on human form. Amen? Philippians chapter number 2, He humbled Himself. He took on that human form so He could go to the cross of Calvary to redeem mankind, but He never stopped being God. He's king. He receives worship. Notice in Matthew 8. Matthew 8, you're doing well. We're gonna go late. I hope you're okay. Matthew 8, I didn't get to preach this morning, so we'll just blame it on that. Amen? Matthew 8, in verse number 1, it says, when He was come down from the mountain, great multitudes followed Him. In verse 2, and behold, there came a leper. What's it say? And worshipped Him. And worshipped Him, saying, Lord, if",
      "context": "...alvary to redeem mankind, but He never stopped being God. He's king. He receives worship. Notice in Matthew 8. Matthew 8, you're doing well. We're gonna go late. I hope you're okay. Matthew 8, I didn't get to ...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=1938",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2019.0599822998047,
      "text": "morning, so we'll just blame it on that. Amen? Matthew 8, in verse number 1, it says, when He was come down from the mountain, great multitudes followed Him. In verse 2, and behold, there came a leper. What's it say? And worshipped Him. And worshipped Him, saying, Lord, if Thou wilt, Thou canst make me clean. He worshipped Him. Chapter 9, in verse number 18. Just keep walking with me here through the book of Matthew. In chapter 9, in verse number 18, while He spake these things unto them, behold, there came a certain ruler and worshipped Him. And worshipped Him, saying, My daughter is even now dead, but come and lay Thy hand upon her, and she shall live. You know, those that attack the deity of Christ change the word worship. You go study it out. They change the word worship because they want to attack the deity of Christ. Same Greek word all the way through the New Testament. They use worship in Matthew 4, where we started, where Jesus says, you should only worship God. But when Jesus receives worship, they change the word. They change it to obeisance, reverence. That's not the same as worship. Amen? And notice Matthew 14, in verse 33. Matthew 14, in verse number 33, notice what the Word of God says. This is the disciples. Remember, He's walking there. The wind was contrary. The storm, they're",
      "context": "morning, so we'll just blame it on that. Amen? Matthew 8, in verse number 1, it says, when He was come down from the mountain, great multitudes followed Him...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2019",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}