{
  "reference": "Matthew 17",
  "occurrences": [
    {
      "sermon_id": "1G-uKA-Shpo",
      "timestamp": 865.1999816894531,
      "text": "and say, there is no hope for that person. And really there is. We just need to be patient. There's a balance with these three thoughts this morning with regard to consider the investment of Paul, the being purposed and being patient and being particular. There is a balance here. But the reality is that soon, early on in the ministry of investing, you can find out if there's, if that individual is faithful, if that individual is the one that you should continue to pour that resource into. Let me say this. Jesus followed that pattern. You say, no. Yeah, yeah. Jesus had how many disciples? Twelve. But there was an inner circle of three. Peter, James, and John. They were the inner circle. Let me show you a couple of verses over in Matthew. Hold your place here in 2 Timothy. We'll be there in just a moment. But look over at Matthew 17, if you will, and look at two passages of Scripture in the Gospel of Matthew. And I want you to see this principle employed by the Lord Jesus Christ as he's investing in others, and he had the twelve. We understand that one, Judas, was a, was a betrayer, and so there's eleven after he goes and kills himself, after he ratted out the Lord and betrayed him. And we find that as we come to Matthew 17, prior to all of that taking place, there's",
      "context": "...er in Matthew. Hold your place here in 2 Timothy. We'll be there in just a moment. But look over at Matthew 17, if you will, and look at two passages of Scripture in the Gospel of Matthew. And I want you to see...",
      "sermon_title": "\"Teach Others Also\" II Timothy 2:1-2",
      "url": "https://www.youtube.com/watch?v=1G-uKA-Shpo&t=865",
      "channel": "Unknown",
      "publish_date": 20240819
    },
    {
      "sermon_id": "1G-uKA-Shpo",
      "timestamp": 937.6799926757812,
      "text": "had the twelve. We understand that one, Judas, was a, was a betrayer, and so there's eleven after he goes and kills himself, after he ratted out the Lord and betrayed him. And we find that as we come to Matthew 17, prior to all of that taking place, there's twelve disciples at this particular time in history, in the life and ministry of the Lord Jesus Christ. But Matthew 17 reveals to us the three, the inner circle. Notice it says this, and after six days, Jesus taketh Peter, James, and John, his brother. Why didn't he take the other disciples? Well, there's an inner circle. And he takes Peter, James, and John. He's investing in them, the Bible says, and he bringeth them up into a high mountain apart and was transfigured before them. This is the record of the Mount of Transfiguration. And we find that Peter, in fact, spoke of this as he's writing later, and he talks about being on the Mount, and he talks about how we have a more sure word of prophecy. He literally heard the voice of God, this is my beloved Son. We find that as he heard that, and he encountered that, and he's there, and he hears all these things that he writes later, that we have a more sure word of prophecy. We have the Scriptures, we have the Word of God, and how thankful and how blessed we are.",
      "context": "...es and kills himself, after he ratted out the Lord and betrayed him. And we find that as we come to Matthew 17, prior to all of that taking place, there's twelve disciples at this particular time in history, in...",
      "sermon_title": "\"Teach Others Also\" II Timothy 2:1-2",
      "url": "https://www.youtube.com/watch?v=1G-uKA-Shpo&t=937",
      "channel": "Unknown",
      "publish_date": 20240819
    }
  ]
}