{
  "reference": "Matthew 27",
  "occurrences": [
    {
      "sermon_id": "td5xeZwEM4k",
      "timestamp": 264.79998779296875,
      "text": "of the Lord Jesus Christ, we said this, and we looked at examples throughout the Scriptures, He demonstrated His power over the demons, He demonstrated His power over disease, He demonstrated His power over death, and He demonstrated His power over nature. I'm so thankful that our God is omnipotent, that He has all power, in fact Jesus said before He ascended to heaven, all power is given unto me in heaven and in earth, and then He gave the great commission to the disciples. So as we continue our study this evening, Jesus is all the world to me, part two, we would say this, reason number three, because of His death, burial, and glorious resurrection. I'm going to invite you to go to the book of Matthew in the 27th chapter, here in Matthew chapter number 27, we'll look through a lengthy portion of Scripture that God has given us with regard to this, the death and the burial and the resurrection of our Savior, and as you're turning to Matthew 27, I'm going to remind you of what Paul said to the believers in the region of Galatia, in Galatians 3 and verse 13, Paul said, Christ hath redeemed us from the curse of the law, being made a curse for us, for it is written, cursed is everyone that hangeth on a tree. When we think about the death, burial, and resurrection",
      "context": "...gard to this, the death and the burial and the resurrection of our Savior, and as you're turning to Matthew 27, I'm going to remind you of what Paul said to the believers in the region of Galatia, in Galatians ...",
      "sermon_title": "Sermon td5xeZwEM4k",
      "url": "https://www.youtube.com/watch?v=td5xeZwEM4k&t=264",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "td5xeZwEM4k",
      "timestamp": 701.9200210571289,
      "text": "that whereas I was blind, now I see in John 9 v. 25. And then in v. 27, He answered these that were questioning Him and He said, I have told you already, and you did not hear. Wherefore would you hear it again? Will you also be His disciples? Then they reviled Him and said, thou art His disciple, but we are Moses' disciples. We know that God spake unto Moses. As for this fellow, we know not from whence he is. And the man that was born blind, He answered these religious leaders and said unto them, why, herein is a marvelous thing that ye know not from whence he is, and yet, he hath opened mine eyes. They had seen so many miracles. Christ had manifested, demonstrated to them that He was the Messiah, and yet, they're going to say that if He were to come down and save Himself, then they would believe the reality is that they had been given much revelation. Verse 43 back in Matthew 27. He trusted in God, let Him deliver Him now. If He will have Him, for He said, I am the Son of God. The thieves also which were crucified with Him cast the same in His teeth. Verse 45, now from the sixth hour, there was darkness over all the land unto the ninth hour. And about the ninth hour, Jesus cried with a loud voice saying, Eli, Eli, lama sabachthani?",
      "context": "..., then they would believe the reality is that they had been given much revelation. Verse 43 back in Matthew 27. He trusted in God, let Him deliver Him now. If He will have Him, for He said, I am the Son of God....",
      "sermon_title": "Sermon td5xeZwEM4k",
      "url": "https://www.youtube.com/watch?v=td5xeZwEM4k&t=701",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "cRs01nZR7xE",
      "timestamp": 1643.3199462890625,
      "text": "our Father, which art in heaven, hallowed be thy. That's not the Lord's Prayer. That's the model prayer. We find here that John 17 is giving us the record of the Lord's Prayer, and He's praying. And it goes all the way through the chapter, and you can read it. It's very powerful, all that takes place here. But then we remember that when Jesus is on the cross of Calvary, it's not here, but in Matthew chapter 27, in verse 46, if you want to jot it down, I'm not going to turn over there. But in Matthew 27, in verse number 46, Jesus is there on the cross, and He says, Eli, Eli, lama sabachthani. That is to say, my God, my God, why hast thou forsaken me? Now, many times I've heard over the years where people were criticized, if Jesus is God, why did He call the Father God? Well, the same way, the same reason the Father calls Jesus God, because they're both God. There's no discrepancy for us. In John chapter 1, in verse number 1, we find that here in these passages we looked at, the Father is referred to and acknowledged as being God. But in John 1, in verse number 1, down through verse number 4, in the beginning was the Word, and the Word was with God, and the Word was God. It's very interesting to me, and this is a side note. And as I've taught these lessons,",
      "context": "...tthew chapter 27, in verse 46, if you want to jot it down, I'm not going to turn over there. But in Matthew 27, in verse number 46, Jesus is there on the cross, and He says, Eli, Eli, lama sabachthani. That is ...",
      "sermon_title": "Sermon cRs01nZR7xE",
      "url": "https://www.youtube.com/watch?v=cRs01nZR7xE&t=1643",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}