{
  "reference": "Matthew 14",
  "occurrences": [
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2019.0599822998047,
      "text": "morning, so we'll just blame it on that. Amen? Matthew 8, in verse number 1, it says, when He was come down from the mountain, great multitudes followed Him. In verse 2, and behold, there came a leper. What's it say? And worshipped Him. And worshipped Him, saying, Lord, if Thou wilt, Thou canst make me clean. He worshipped Him. Chapter 9, in verse number 18. Just keep walking with me here through the book of Matthew. In chapter 9, in verse number 18, while He spake these things unto them, behold, there came a certain ruler and worshipped Him. And worshipped Him, saying, My daughter is even now dead, but come and lay Thy hand upon her, and she shall live. You know, those that attack the deity of Christ change the word worship. You go study it out. They change the word worship because they want to attack the deity of Christ. Same Greek word all the way through the New Testament. They use worship in Matthew 4, where we started, where Jesus says, you should only worship God. But when Jesus receives worship, they change the word. They change it to obeisance, reverence. That's not the same as worship. Amen? And notice Matthew 14, in verse 33. Matthew 14, in verse number 33, notice what the Word of God says. This is the disciples. Remember, He's walking there. The wind was contrary. The storm, they're",
      "context": "... the word. They change it to obeisance, reverence. That's not the same as worship. Amen? And notice Matthew 14, in verse 33. Matthew 14, in verse number 33, notice what the Word of God says. This is the discipl...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2019",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2094.8999633789062,
      "text": "the word. They change it to obeisance, reverence. That's not the same as worship. Amen? And notice Matthew 14, in verse 33. Matthew 14, in verse number 33, notice what the Word of God says. This is the disciples. Remember, He's walking there. The wind was contrary. The storm, they're tossed to and fro. They're, they're toiling and rowing. And Jesus says, be of good cheer, it is I, be not afraid. Peter says, if it's really you, bid me come to thee. And Jesus says, come. And of course, we know that Peter sank, and Peter had enough sense about him to say, Lord, save me. And Jesus delivered Peter as he cried out. And the Bible tells us that they were back on the ship, and the, the wind ceased, according to verse number 32. Then, in verse 33, they that were in the sheep, ship, came and worshiped Him, saying of a truth, thou art the Son of God. Notice in chapter 15, in verse number 25, this woman was bothering the disciples. The disciples said, Jesus, can't you hear her send her away? She's driving us crazy. Because Jesus didn't answer her the first couple of times. The Bible says that Jesus finally answered her in verse 24 and said, I am not sent, but unto the lost sheep of the house of Israel. And then she came in verse 25 and worshiped Him. Notice what she says, Lord, help me.",
      "context": "the word. They change it to obeisance, reverence. That's not the same as worship. Amen? And notice Matthew 14, in verse 33. Matthew 14, in verse number 33, notice what the Word of God says. This is the discipl...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2094",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EOBB4xsyduY",
      "timestamp": 1262.9600067138672,
      "text": "God and how God's Word reveals to us that our God is compassionate, that He is full of compassion, and we rejoice in that truth, but we find that on many occasions, especially if you study the life of Christ and the Gospel records, you will find that there is this expression in the Scriptures that is used regularly, that Christ was moved with compassion. We have a God that is full of compassion. We have a God who is moved with compassion. We find that in the book of Matthew, notice what the Bible says during, again, one of the examples of the life and ministry of the Lord Jesus Christ here in Matthew chapter number 14, and I want you to notice what is taking place here and to see the compassion of our Lord. We see here that the Bible tells us about Jesus and, of course, the things that are going on specifically in His ministry, and we're going to jump right in the middle of the text, but in Matthew 14 and verse number 14, the Bible says this, and Jesus went forth and saw a great multitude and was moved with compassion toward them, and He healed their sick. He was moved with compassion, and then what did He do? He healed those that were sick, and what a blessing, and we begin to see how",
      "context": "...ng on specifically in His ministry, and we're going to jump right in the middle of the text, but in Matthew 14 and verse number 14, the Bible says this, and Jesus went forth and saw a great multitude and was mo...",
      "sermon_title": "Sermon EOBB4xsyduY",
      "url": "https://www.youtube.com/watch?v=EOBB4xsyduY&t=1262",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}