{
  "reference": "Matthew 26",
  "occurrences": [
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 375.3999938964844,
      "text": "I mean, it's a great miracle of the Lord. And we find that it's at that moment that Jesus says to Peter, follow me, and I will make you fishers of men. It's Peter that stood there at Caesarea Philippi when Jesus said, whom do men say that I am? And then he says, who do you say that I am? And it's Peter that stands up with the power of God. And he says, thou art the Christ, the son of the living God. We find that in John chapter six, when all those that were following forsook the Lord and Jesus says to the disciples, will you go also? And it's Peter that stands and says, Lord, we know that you are the Christ. You have the words of eternal life. Where are we gonna go? And it's Peter that on the night before Jesus was crucified, that Jesus tells Peter that he's going to deny him. And it's Peter that says in Matthew 26 and verse 33, he answered and said to Jesus, though all men shall be offended because of thee, yet will I never be offended. And we know that over the course of the next several verses of Matthew 26, that much transpires. And eventually we read how Peter denied the Lord thrice. We read at the end of the chapter, how that the Lord and Peter, their eyes met. And the Bible says that he went out and he wept bitterly.",
      "context": "...esus was crucified, that Jesus tells Peter that he's going to deny him. And it's Peter that says in Matthew 26 and verse 33, he answered and said to Jesus, though all men shall be offended because of thee, yet ...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=375",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 458.8800048828125,
      "text": "of the next several verses of Matthew 26, that much transpires. And eventually we read how Peter denied the Lord thrice. We read at the end of the chapter, how that the Lord and Peter, their eyes met. And the Bible says that he went out and he wept bitterly. Because he recognized what had happened in his life. And I think is looking at this passage of scripture this evening and dealing with the subject of loving God with all of our hearts. It's this Peter. See what happens sometimes in our life is we kind of get like Peter in Matthew 26 and 33 and say, not me. It's not gonna happen to me. I mean, I'm never gonna not love you like I should. I'm never gonna be guilty of what the church of Ephesus was guilty of leaving their first love. No, not me. Peter said, Lord, I'm not gonna do that. I'll never deny you. I'll never be offended. I'll go with you unto the death. And I think he meant well, I think he was sincere in what he was saying. But we have an enemy. Remember what Jesus said in Luke? He's desired to sift you as wheat. As I look at this passage of scripture this evening, and I deal with this subject matter of loving God with all of our hearts, I want you to consider a few thoughts from these few verses of scripture.",
      "context": "of the next several verses of Matthew 26, that much transpires. And eventually we read how Peter denied the Lord thrice. We read at the end ...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=458",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 962.5599670410156,
      "text": "may not know it at the time We may not understand it maybe for this lifetime But we can rest assured in knowing that God has a purpose And we find that as we rest in that truth that God has a purpose we find in this interaction this evening This interaction that was personal was also purpose that Jesus was moving with purpose And we find that he comes to Simon and notice with me at least a first aspect of this purposed Interaction that Christ had with Peter one of the purposes was that of examination Notice what he says in verse number 15 Simon son of Jonas Lovest thou me more than these Now there's a couple of different ideas that people have had through the centuries of what did Christ mean when he said more than these? And there are some that have the idea Do you love me more than the other? Disciples than these others that are here and remember as I quoted earlier from Matthew 26 in verse 33 When he said this that that all men shall be offended because of thee though all men shall be offended because of thee yet will I never be offended and Certainly, it could be that Jesus was asking the question Love is now me more than these speaking of the other disciples We find also that it's possible. Remember a few verses back that when Peter got there that he was pulling those",
      "context": "...ore than the other? Disciples than these others that are here and remember as I quoted earlier from Matthew 26 in verse 33 When he said this that that all men shall be offended because of thee though all men sh...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=962",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "eKXXb-CvsCo",
      "timestamp": 1456.3599548339844,
      "text": "the use of the words and so on and so forth and the Greek word for love and there are multiple of them and so on and so forth but the reality is that Jesus was purposed to ask him the question three times and to be able to have Peter who had denied the Lord thrice to now publicly confess his love for Christ on three occasions. Back in Matthew 26 I've referenced verse 33 a couple of times but I want you to look at a few other verses in Matthew 26 beginning in verse 31. We'll look at more of the interaction that Jesus had with Peter before he made that quoted statement that I made earlier. But notice in verse 31 of Matthew chapter 26 the Bible says this, then saith Jesus unto them, all ye shall be offended because of me this night for it is written I will smite the shepherd and the sheep of the flock shall be scattered abroad. But after I am risen again, by the way aren't you thankful that we serve a risen savior? He says but after I am risen again I will go before you into Galilee. Peter answered and said unto him though all men shall be offended because of thee yet will I never be offended. Jesus said unto him verily I say unto thee that this night before the cock",
      "context": "... had denied the Lord thrice to now publicly confess his love for Christ on three occasions. Back in Matthew 26 I've referenced verse 33 a couple of times but I want you to look at a few other verses in Matthew ...",
      "sermon_title": "\"Loving God With All Your Heart\" John 21:15-19",
      "url": "https://www.youtube.com/watch?v=eKXXb-CvsCo&t=1456",
      "channel": "Unknown",
      "publish_date": 20241202
    },
    {
      "sermon_id": "1G-uKA-Shpo",
      "timestamp": 1006.3199768066406,
      "text": "find that as he heard that, and he encountered that, and he's there, and he hears all these things that he writes later, that we have a more sure word of prophecy. We have the Scriptures, we have the Word of God, and how thankful and how blessed we are. We understand that Peter would stand up on the day of Pentecost and he would preach, and you think about the roles of James and John in the early church and all that was taking place, and the Lord Jesus Christ was investing in these three individuals. We find in Matthew 26, turn there, if you will, and here in Matthew 26, we find that we're on the, really, the eve of the crucifixion and all that takes place and the preparation and all of that. And we find that it was there in the beginning of this text of Scripture, in Matthew 26, where it's spoken of Judas going to betray the Lord Jesus Christ. We find that Jesus mentions, as he's there at the Passover, about the fact that one that was there with them would be the one that would betray him. And we continue to read through, and we find that after they had observed that supper, it says in verse number 30, when they had sung a hymn, they went out into the Mount of Olives. Now, what was Judas doing at this point?",
      "context": "...at was taking place, and the Lord Jesus Christ was investing in these three individuals. We find in Matthew 26, turn there, if you will, and here in Matthew 26, we find that we're on the, really, the eve of the...",
      "sermon_title": "\"Teach Others Also\" II Timothy 2:1-2",
      "url": "https://www.youtube.com/watch?v=1G-uKA-Shpo&t=1006",
      "channel": "Unknown",
      "publish_date": 20240819
    }
  ]
}