{
  "reference": "Matthew 5",
  "occurrences": [
    {
      "sermon_id": "QuP5gIgrnmo",
      "timestamp": 1012.2999877929688,
      "text": "do this for you. But you know what? You can't. You can't. Because it's a personal responsibility. Crucify your flesh. Crucify your flesh. Can you be mindful this morning of what the Lord Jesus Christ said? You don't need to turn there, but perhaps you'd like to jot it down. Matthew 5, 29 and 30. I'm not gonna read the entirety of either one of those verses. But you'll be mindful of the verses when I share with you what he says. If your eye offends you, pluck it out. If your hand offends you, cut it off. You say, well, that's kind of strong. Yeah, it is. Just as Paul's instruction here, mortify therefore. I mean, put it to death, slay it. I like the idea of depriving it of power. Depriving it of power. So we find, as we look at this instruction and we begin in verse number five, we find how direct Paul is. He gets straight to the point. I want you to also notice with me how detailed Paul is. See, in this passage of Scripture, he's gonna call sin by name. And by the way, if you think you're gonna get away with it this morning, just come back next Sunday. Because the practicality of it gets even more where the rubber meets the road. You say, oh man, I dodged a bullet. I'm not guilty of any of those sins. Come back next week. Because we'll deal with some more by name.",
      "context": "...at the Lord Jesus Christ said? You don't need to turn there, but perhaps you'd like to jot it down. Matthew 5, 29 and 30. I'm not gonna read the entirety of either one of those verses. But you'll be mindful of...",
      "sermon_title": "Sermon QuP5gIgrnmo",
      "url": "https://www.youtube.com/watch?v=QuP5gIgrnmo&t=1012",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 1998.3599548339844,
      "text": "think about some of the results of magnifying the Lord is it that He would be known and really fulfilling the ultimate purpose of our lives, but I want to say this, I believe that as we magnify the Lord that we will remain humble. That we will remain humble. Remember back in Psalm 70 in verse number 5, He said, I am poor and needy. And I said this at that point as I was giving the introduction that far too often, unfortunately, we face the danger of being prideful and having the attitude of the Laodiceans that we are increased with goods and have need of nothing. And we find that as we magnify the Lord that it will enable us to remain humble. If we would be honest this morning, pride is something that we all face. Pride is something that every single one of us face. And one way, I believe, one way that we can avoid the danger of pride is to magnify our God. Why? Because we keep lifting Him up. We keep exalting Him. We keep magnifying Him. It's nothing about me. It's all about Him. There's nothing good in me. It's all about Him, right? And all of a sudden there's humility because it's not about us. It's not about me. It's not about you. It's about God. When the Bible talks about, Jesus says this in Matthew 5, that we're to let our light",
      "context": "...'s not about me. It's not about you. It's about God. When the Bible talks about, Jesus says this in Matthew 5, that we're to let our light",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=1998",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "6eUsQrWOpqo",
      "timestamp": 2070.439971923828,
      "text": "There's nothing good in me. It's all about Him, right? And all of a sudden there's humility because it's not about us. It's not about me. It's not about you. It's about God. When the Bible talks about, Jesus says this in Matthew 5, that we're to let our light so shine before men that they may see our good works and do what? They glorify our Father which is in heaven. If we'd be honest this morning, the reality is that sometimes we like the applause of man. Our pride likes that, right? But we have to understand it's all because of Jesus. It's all because of Jesus. There's nothing... I didn't do anything to get saved. I don't do anything to keep myself saved. I didn't do anything to be called in the ministry. And in fact, when He tried to call me in the ministry, I tried to refuse it. Just being honest, I can't do that, God. It's all about Jesus. And as we exalt Him, as we magnify Him, it enables us to remain humble because it's Christ in me, the hope of glory. We are His workmanship created in Christ Jesus unto good works, right? It's all about Christ. See the reality is that no one's going to see an exalted Chris man and say, I need that. But if they see an exalted Christ in my life, I want His God, amen?",
      "context": "...'s not about me. It's not about you. It's about God. When the Bible talks about, Jesus says this in Matthew 5, that we're to let our light so shine before men that they may see our good works and do what? They...",
      "sermon_title": "Sermon 6eUsQrWOpqo",
      "url": "https://www.youtube.com/watch?v=6eUsQrWOpqo&t=2070",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "TljookEyMZU",
      "timestamp": 2196.2799682617188,
      "text": "done. Here's what he's accomplished. Here's his ministry. And here's what that means. That old system is no longer needed. It's no longer necessary. And so don't think about going back to Judaism. Don't think about going back to that old way. Because it's useless. It served its purpose. Amen? And in serving its purpose, it pointed to Messiah. And he fulfilled it. I think about the truth of the Scriptures and you look at the whole of the ministry of the Lord Jesus Christ and you understand what he did. He said this in Matthew 5 and verse number 17, think not that I am come to destroy the law or the prophets. I am not come to destroy but to fulfill. And he fulfilled everything that needed to be fulfilled. You think about the book of Ruth. It's just a short little book. It's really still dealing with the period of the judges as you find that reference in the beginning of the book of Ruth. And we're certainly familiar with all that takes place in that book and just four chapters. But it's very interesting as you think about Boaz as he's made aware of what's taking place. You come to the third chapter. Remember, we made this point of reference several weeks ago as we were studying through the book of Hebrews in the sixth chapter and we dealt with the fact that what was in view was the fact that he is our kinsman redeemer.",
      "context": "... the whole of the ministry of the Lord Jesus Christ and you understand what he did. He said this in Matthew 5 and verse number 17, think not that I am come to destroy the law or the prophets. I am not come to ...",
      "sermon_title": "Sermon TljookEyMZU",
      "url": "https://www.youtube.com/watch?v=TljookEyMZU&t=2196",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}