{
  "reference": "Matthew 15",
  "occurrences": [
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1186.5599975585938,
      "text": "is grievously vexed with a devil. In Mark's account in chapter number 7, we find that the Bible tells us in verse number 26 that she was a Greek, a Syrophoenician by nation, and she besought him that he would cast forth the devil out of her daughter. We're told in verse number 25 that it was a young daughter. We're not told the age of this daughter. We're not told the age of the woman that comes. But the Bible tells us that it was a young daughter, and the Bible tells us that she was grievously vexed with a devil. thus leading to this woman's desperation. When we understand what she recognized about Jesus, we will understand that it is the basis for what she requests. We noticed what she's recognized. Now, notice what she requested. By the way, if she did not recognize that He was Lord and that He was worthy of worship and that He was all-powerful, there's no reason that she would make the request that she makes. But because she understood, just because she heard of Him, she goes and she understood some things, she recognized some things, and therefore she comes, and knowing that He's God in flesh and knowing that He has all-power, she comes with a passionate plea for deliverance. Lord, help me. We've mentioned that there as our title in Matthew 15 and verse 25. I believe that as we would look at the passage of Scripture",
      "context": "...s with a passionate plea for deliverance. Lord, help me. We've mentioned that there as our title in Matthew 15 and verse 25. I believe that as we would look at the passage of Scripture",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1186",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1266.3599472045898,
      "text": "comes, and knowing that He's God in flesh and knowing that He has all-power, she comes with a passionate plea for deliverance. Lord, help me. We've mentioned that there as our title in Matthew 15 and verse 25. I believe that as we would look at the passage of Scripture and notice what she requested, that she had faith, she believed that God was able. I don't think there was any part of her that had any doubt whatsoever that Jesus was able to fulfill her request. She believed. She recognized that He was God. She recognized He was worthy of worship. She recognized that He had all-power, and therefore, based upon her recognition, she then goes and she makes this request, Lord, I know You can do something about this. There's no one else to go to. See, this morning, in your life and in my life, what we recognize about our Savior will have a great impact and influence on what we request from our Savior. See, the reality is that a missionary of yesteryear, he said that we're to expect great things from God. We're to attempt great things for God. The reality is that we can read various accounts of those that have gone before us and we can see their prayers, and we can see how God answered and how God worked. Our God is able. We find that this woman, she was specific and she was persistent.",
      "context": "...s with a passionate plea for deliverance. Lord, help me. We've mentioned that there as our title in Matthew 15 and verse 25. I believe that as we would look at the passage of Scripture and notice what she reque...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1266",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 1346.4199523925781,
      "text": "God. The reality is that we can read various accounts of those that have gone before us and we can see their prayers, and we can see how God answered and how God worked. Our God is able. We find that this woman, she was specific and she was persistent. In fact, her persistence, because the Lord Jesus Christ answered her not a word, according to Matthew 15 and verse 23, the disciples, they besought Him and said, send her away for she crieth after us. She was persistent. What caused her to be persistent? What she recognized. She was desperate. She needed help. And she knew that Jesus was the One. She knew that He could do something. And as we think about the interaction that takes place, I'll mention this and not the main focus of our message this morning, but certainly important to point out, when we understand the interaction between this woman and the Lord Jesus Christ and how that He answered her not a word initially and then said to her, I am not sent but unto the lost sheep of the house of Israel, and then said it is not meant to take the children's bread and to cast it to dogs. We'd understand that what the Lord is dealing with here in the text of Scripture, both in Matthew and Mark as He's revealing to us the truth that we've often said,",
      "context": "...tent. In fact, her persistence, because the Lord Jesus Christ answered her not a word, according to Matthew 15 and verse 23, the disciples, they besought Him and said, send her away for she crieth after us. She...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=1346",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "BTHY_qWho6M",
      "timestamp": 2164.7999572753906,
      "text": "it was that she requested. And we find that this desperate mother, that she comes to the Savior and now she leaves from where he is and she returns to her home and she finds that her daughter was made whole from that very hour. I believe this is something they probably talked about for a while. Don't you? I mean, something that would not soon be forgotten. To see how God worked, what He did, could only be explained as God did it. There was nothing she could do. There was nothing anyone else could do. But the Lord Jesus Christ, God in flesh, He was able to deliver this her daughter who had been grievously vexed with a devil. Notice that she is commended for her faith in our account in Matthew 15, 28. The Bible says, a woman, great is thy faith. I wonder this morning, how many of us, would the Lord Jesus Christ say of us, great is thy faith? I'm not asking if you think you have great faith. I'm not asking if someone else, humanly speaking, thinks that you have great faith. But I'm wondering if Jesus would say of me, I'm wondering if Jesus would say of you, great is thy faith. She just believed God. She just believed, and she didn't hear half as what we've heard. Amen? We have the whole canon of Scripture. But she believed. And Jesus says, great is thy faith.",
      "context": "...ad been grievously vexed with a devil. Notice that she is commended for her faith in our account in Matthew 15, 28. The Bible says, a woman, great is thy faith. I wonder this morning, how many of us, would the ...",
      "sermon_title": "Sermon BTHY_qWho6M",
      "url": "https://www.youtube.com/watch?v=BTHY_qWho6M&t=2164",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}