{
  "reference": "Matthew 6",
  "occurrences": [
    {
      "sermon_id": "7-Svueb0C4s",
      "timestamp": 473.67999267578125,
      "text": "God provided for his children, you're mindful of the fact that they would collect that, and if they left it over, it would spoil, it would stink, it would breed worms, and so on and so forth, and they would need to just take their daily allotment, and they would find that God on that next day would provide again. What a great reminder for them. I'm mindful as they would enter into the land of promise in Joshua chapter number five, after they cross over and commemorate the crossing and all that takes place there, you find that the Bible tells us in verse number 12 that the manna ceases, but they ate of the fruit of the land. God was providing for his people, and when we begin to have this mindset and this framework for our prayer, and we're mindful of this prayer for provision, that it would impact my perspective to help me have this understanding, this recognition that God is my provider. I believe that it's also impactful for us to be able to instruct our children, to help them understand that God has graciously provided for us, and the provision that he has given to us. We find that God is aware of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn there, if you'd like you can, in Matthew 6 and verse number 8, we find that the Bible tells us",
      "context": "...ven to us. We find that God is aware of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn there, if you'd like you can, in Matthew 6 and verse number 8, we find that...",
      "sermon_title": "Sermon 7-Svueb0C4s",
      "url": "https://www.youtube.com/watch?v=7-Svueb0C4s&t=473",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "7-Svueb0C4s",
      "timestamp": 542.7999877929688,
      "text": "has given to us. We find that God is aware of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn there, if you'd like you can, in Matthew 6 and verse number 8, we find that the Bible tells us this, be not ye therefore like unto them, speaking of those that were praying, he called them hypocrites and so on and so forth, and he says here, your father knoweth what things ye have need of before ye ask him. I made the statement to someone actually today, and I said to the individual, I said, you know, the reality is that prayer, sometimes when we think about prayer, not only is it moving the hand of God, but prayer helps my own perspective. We're going to think about God and his provision for us, and the fact that he is the provider. You say, no, I go to work and I provide for my family. I understand that you're supposed to provide for your family. In fact, the New Testament speaks about those that would not provide for their family. They're worse than an infidel, but the reality is that we understand that it's God who's given us the ability, and so ultimately God is the provider. Notice what the book of Deuteronomy tells us with regard to this thought in Deuteronomy chapter number 8, and Deuteronomy 8 and verse number 18. Now remember,",
      "context": "...ven to us. We find that God is aware of our needs. He's created us. He knows what we need. In fact, Matthew 6, you don't need to turn there, if you'd like you can, in Matthew 6 and verse number 8, we find that...",
      "sermon_title": "Sermon 7-Svueb0C4s",
      "url": "https://www.youtube.com/watch?v=7-Svueb0C4s&t=542",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 2398.0199584960938,
      "text": "be cute, you wanna wear something that's cute, but you cannot, you cannot, you must not sacrifice modesty for cuteness. It's just not appropriate. And so therefore, we find that as we would go through this evaluation, we're reviewing, we're saying all manner of conversation, I wanna recognize some things. And so I think about my attire, I think about my finances. I heard a preacher just last week, I was at a preacher's meeting, he said this, give me your checkbook and I'll tell you what's important to you. I think about finances. God's Word says a lot about finances, by the way. You know, in Malachi, they were receiving rebuke because they were robbing God. How are we robbing God? In tithes and offerings. God goes on to say, prove me. Luke says, give and it shall be given. And he goes through that whole process. Listen, we don't give so that we can get something from God. We give because we recognize all of it already belongs to God. And He's been so very good to us. And what a privilege to be able to give back to Him. I think about what Jesus said in Matthew chapter number 6. In Matthew chapter number 6, verses 20 and 21, Jesus says this. I'll read verse number 19 along with it. In Matthew 6, verses 19 through 21. Lay not up for yourselves treasures upon earth, where moth and rust doth corrupt,",
      "context": "...ew chapter number 6, verses 20 and 21, Jesus says this. I'll read verse number 19 along with it. In Matthew 6, verses 19 through 21. Lay not up for yourselves treasures upon earth, where moth and rust doth cor...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=2398",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "B2bISRh1PFo",
      "timestamp": 2466.8199615478516,
      "text": "about what Jesus said in Matthew chapter number 6. In Matthew chapter number 6, verses 20 and 21, Jesus says this. I'll read verse number 19 along with it. In Matthew 6, verses 19 through 21. Lay not up for yourselves treasures upon earth, where moth and rust doth corrupt, and where thieves break through and steal, but lay up for yourselves treasures in heaven, where neither moth nor rust doth corrupt, and where thieves do not break through nor steal. For where your treasure is, there will your heart be also. I want God to evaluate my finances. I think about this, my prayer life. The sin of prayerlessness. The fact of the matter is that Samuel says this. You don't need to turn there, but it's a powerful statement that Samuel makes. Of course, he's grieved in his heart because the nation wants a king. And he goes through that whole process and God gives him instruction. Of course, we understand that Saul is anointed to be the first king of Israel. But Samuel says this in 1 Samuel 12, in verse number 23. Moreover, ask for me, God forbid, that I should sin against the Lord in ceasing to pray for you. The sin of prayerlessness. We're busy. We don't have time. How's my prayer life? See I want to be able to recognize these things as I review and I'm recognizing, okay, God, I need some work there. Okay, God, I need some work here.",
      "context": "...ew chapter number 6, verses 20 and 21, Jesus says this. I'll read verse number 19 along with it. In Matthew 6, verses 19 through 21. Lay not up for yourselves treasures upon earth, where moth and rust doth cor...",
      "sermon_title": "Sermon B2bISRh1PFo",
      "url": "https://www.youtube.com/watch?v=B2bISRh1PFo&t=2466",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}