{
  "reference": "Nehemiah 10",
  "occurrences": [
    {
      "sermon_id": "4j6miDNAqs4",
      "timestamp": 1452.5799865722656,
      "text": "through the book of Nehemiah. Read the Bible through a couple of times this year, then read the New Testament and finished up the New Testament a few days ago for the third time. And then decided that I'd go ahead and just read a couple of Old Testament books. And Nehemiah was the one that I started reading through a few days ago. And I read this morning in Nehemiah chapter 10. And it's kind of interesting if you understand some things about Nehemiah, you find that it's a post-exilic book. In other words, after the captivity, and there's a remnant that can return, of course, they're rebuilding the walls and so on and so forth. But you find that in chapter nine, especially, you begin to read about various things with regard to understanding how gracious and merciful God is, and certainly He is, and how much they had failed the Lord, and certainly they did, and they were judged because of it. You come to chapter 10 and you start reading, and it's very interesting, because a people that experience such hardship, the Bible says of those people in Nehemiah 10, I was reminded of Hebrews 10 when I read it this morning, but in Nehemiah chapter 10, in verse number 39, the Bible says this, as they're making this covenant with the Lord, it says at the end, and we will not forsake the house of our God.",
      "context": "...very interesting, because a people that experience such hardship, the Bible says of those people in Nehemiah 10, I was reminded of Hebrews 10 when I read it this morning, but in Nehemiah chapter 10, in verse num...",
      "sermon_title": "\"We Have Come To Worship Him\" Matthew 2:1-12",
      "url": "https://www.youtube.com/watch?v=4j6miDNAqs4&t=1452",
      "channel": "Unknown",
      "publish_date": 20241222
    },
    {
      "sermon_id": "4j6miDNAqs4",
      "timestamp": 1515.3999938964844,
      "text": "Nehemiah 10, I was reminded of Hebrews 10 when I read it this morning, but in Nehemiah chapter 10, in verse number 39, the Bible says this, as they're making this covenant with the Lord, it says at the end, and we will not forsake the house of our God. We will not forsake the house of our God. You know, there was a time when they were in Babylonian captivity where they couldn't come and worship. It was taken away from them, that privilege. And when it was removed from them and they were not able to, and then after the exile, after all that takes place and they go back, they say, we will not forsake the house of our God. Remember Hebrews 10 in verse 25, not forsaking the assembling of ourselves together as the manner of some is, but exhorting one another and so much the more as you see the day approaching. And this morning, when we have the privilege of being able to gather together, we see in these wise men this morning, we see their desire, we see their determination. They were determined because of their desire. We have come to worship. Number three, as we continue back in Matthew chapter two, I want you to notice their delight, their delight. In verse eight, after having the conversation with Herod, they're sent on their way to Bethlehem. And the Bible tells us now, understand they arrived in Jerusalem,",
      "context": "Nehemiah 10, I was reminded of Hebrews 10 when I read it this morning, but in Nehemiah chapter 10, in verse num...",
      "sermon_title": "\"We Have Come To Worship Him\" Matthew 2:1-12",
      "url": "https://www.youtube.com/watch?v=4j6miDNAqs4&t=1515",
      "channel": "Unknown",
      "publish_date": 20241222
    }
  ]
}