{
  "reference": "Nehemiah 6",
  "occurrences": [
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 564.3800048828125,
      "text": "against the king? Then answered I them and said unto them, the God of heaven. Don't you like that? He is talking about, and they, the opposition, the adversity, they're talking about a human king, but he's talking about the king of kings. And he says, the God of heaven, he will prosper us. He recognized God's power. He said, therefore, we, his servants, will arise and build, but ye have no portion, nor right, nor memorial in Jerusalem. Oh, we have to recognize the power of God. Listen, the work that we're engaged in, it's a work that God would put in our hearts, and we know that it's our God, the Lord God omnipotent that puts it in our hearts, and we find that it is God's hand that would be upon us, and we recognize that it is his power that enables us. And he says that God, He will prosper us. Number five. Skip over to chapter number six, if you will. In chapter number three, you read the work that's assigned, the building of the walls. In chapter number four, you read of all the attack. It continues into chapter number five and into the beginning of chapter number six by way of compromise and what have you. But I want you to notice what it is that Nehemiah recognized. Number five, he recognized that this work was, quote, a great work. Notice what he says in Nehemiah 6 in verse number three.",
      "context": "...ognized. Number five, he recognized that this work was, quote, a great work. Notice what he says in Nehemiah 6 in verse number three.",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=564",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 639.7799835205078,
      "text": "into the beginning of chapter number six by way of compromise and what have you. But I want you to notice what it is that Nehemiah recognized. Number five, he recognized that this work was, quote, a great work. Notice what he says in Nehemiah 6 in verse number three. And I sent messengers unto them, saying, I am doing a great work, so that I cannot come down. Why should the work cease whilst I leave it and come down to you? He recognized that it was a great work. Let me say this. Every work for God is a great work. Why? Because He's a great God. And He is the Lord God Almighty. And listen, every work for God is a great work. And we understand that as God had put it in the heart of Nehemiah to build the walls, as God had put this work in his heart and He had given him the power and the strength to do it, we find that every work that we would do for God is a great work. You say, well, the work that God's given me to do isn't the same work that God's given you to do. Correct. But it's still a great work. It's still a great work. Why? Because it's for God. Because it's for God. And when we recognize that this work that we're doing is a great work and that it's a work for God,",
      "context": "...ognized. Number five, he recognized that this work was, quote, a great work. Notice what he says in Nehemiah 6 in verse number three. And I sent messengers unto them, saying, I am doing a great work, so that I ...",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=639",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 1442.4999542236328,
      "text": "and answers prayer. We just read verses in the book of 1 John in the fifth chapter. And we can rejoice in knowing that as Nehemiah made this request, as he says, now therefore, oh God, strengthen my hands. I want you to understand that the attack of the enemy did not cease immediately following that prayer. In fact, the attack of the enemy became even more subtle as they tried to get Nehemiah to go into the holy place in the next following verses. It was a place in which Nehemiah was not permitted to go, and they invited him to go there, and the idea was to go there for protection. That's the subtlety of the enemy. And Nehemiah says this, I know that if I go there, these folks are hired servants, and they're gonna, the hired enemies, they're going to come, and they're going to try to bring an evil report against my name. But we come to verse number 15 and 16 of Nehemiah 6, and I want you to see what the Bible says. So the wall was finished. Underline that word, circle that word. Isn't it good to see the work completed? What was the desire of the enemy? Well, that their hands should be weakened from the work, that it be not done. And we read verse number 15, so the wall was finished in the 20 and fifth day of the month, Elul,",
      "context": "...y're going to try to bring an evil report against my name. But we come to verse number 15 and 16 of Nehemiah 6, and I want you to see what the Bible says. So the wall was finished. Underline that word, circle t...",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=1442",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "Qk9420819_w",
      "timestamp": 1872.6399383544922,
      "text": "I worked in the corporate world, people would say, well, it's good enough for government work. You ever hear that? And you hear that phraseology, see the guy in the Air Force, he's like, oh yeah, I know all about that. But the reality is that we've heard that phraseology. Listen, the work that we're doing is for God Almighty. We never, but never should mail it in, so to speak, because we're doing a work for God. And we recognize that this is a great work. I won't take you there, but in Psalm 109 and verse 27, the Bible speaks about how people would see that it was God that did the work. We find that that's exactly what the enemy recognized in Nehemiah 6 and verse number 16. Now, I want you to think about this. The Bible tells us as to the day in which the work was completed. In verse number 15 of Nehemiah 6, it tells us that the wall was finished on the 25th day of the month, Elul. Now, that's the sixth month in the Jewish calendar. And I want you to go forward, if you will, to chapter number eight, and we're gonna just kind of pick it up right here in the beginning of chapter number eight. And I want you to see what the Bible says. And all the people gathered themselves together as one man in verse number one into the street that was before the water gate.",
      "context": "...uld see that it was God that did the work. We find that that's exactly what the enemy recognized in Nehemiah 6 and verse number 16. Now, I want you to think about this. The Bible tells us as to the day in which...",
      "sermon_title": "Sermon Qk9420819_w",
      "url": "https://www.youtube.com/watch?v=Qk9420819_w&t=1872",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}