{
  "reference": "Nehemiah 1",
  "occurrences": [
    {
      "sermon_id": "jNCO80tyoMQ",
      "timestamp": 1523.3200378417969,
      "text": "specifically in Nehemiah chapter number 6, I want you to note that Nehemiah was a man of prayer. Nehemiah is a man of prayer, and I believe that that's such a key for us to see how that he had the level of perception and discernment to be able to recognize the enemy in chapter number 6, because he was a man of prayer. He's submitting to God. He's a man of prayer. Notice in Nehemiah chapter number 1, we don't have time to read the entirety of it, but in verse number 4 is when you begin to see where Nehemiah prays. It goes all the way through the end of chapter number 1, there in verse number 11, but notice what it says in Nehemiah 1 in verse 4, and it came to pass when I heard these words that I sat down and wept and mourned certain days and fasted and prayed before the God of heaven. Listen, I'm glad that he wept and I'm glad that he mourned, but had he not fasted and prayed, we may not see the same results that we see here in Nehemiah. We find that, yes, we can weep for our nation, we can mourn for the report that we hear, but we better seek the face of God. We need a revival of prayer. We find, again, I don't have time to read the entirety of the next verses, read it",
      "context": "...l the way through the end of chapter number 1, there in verse number 11, but notice what it says in Nehemiah 1 in verse 4, and it came to pass when I heard these words that I sat down and wept and mourned certa...",
      "sermon_title": "Sermon jNCO80tyoMQ",
      "url": "https://www.youtube.com/watch?v=jNCO80tyoMQ&t=1523",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 150.3800048828125,
      "text": "that the enemy operates, and really, it enables us to be better equipped for the battle. As we look at Nehemiah, we're going to be in chapter number four, and I want you to understand some things that are taking place as we get into chapter number four this evening. Obviously, we've not been studying through the book of Nehemiah, and we're jumping in chapter number four, and so just briefly, I want to give you some information. Nehemiah, of course, was not in Jerusalem at the beginning of the book. As it's being written, the people of God had been carried captive already at this particular time in their history. Of course, a remnant was returning under the decree of Cyrus, and we understand that as we look at the passage of Scripture, that in the very first chapter, that God gives us some insight as to the concern that Nehemiah has for his home country. The reason we know that he's concerned is because he inquired, and he made inquiry as to what was going on, and he received a report, and part of the report that he received, according to Nehemiah 1 and verse number three, is that the wall of Jerusalem also is broken down, and the gates thereof are burned with fire. As we go through the book of Nehemiah, we begin to see the work that is taking place on rebuilding the walls.",
      "context": "... what was going on, and he received a report, and part of the report that he received, according to Nehemiah 1 and verse number three, is that the wall of Jerusalem also is broken down, and the gates thereof ar...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=150",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nexqP9hAOHU",
      "timestamp": 216.4199981689453,
      "text": "he received, according to Nehemiah 1 and verse number three, is that the wall of Jerusalem also is broken down, and the gates thereof are burned with fire. As we go through the book of Nehemiah, we begin to see the work that is taking place on rebuilding the walls. We understand that it's in the second chapter that Nehemiah makes his petition, if you will, to King Artaxerxes with regard to going and fulfilling the work that God had called him to. We read in chapter number three, if you were to read the entirety of the chapter, you begin to see how the rebuilding of the walls and the workers are assigned, and as you go through the passage, you'll find at the beginning of verse number two, and many of the verses thereafter will say, and next unto him, and then it will name some people, and they were working on this part of the wall, on this particular gate, and then next unto him there was this group of people, and so on and so forth, and so we kind of see what's happening. Even before we get to the fourth chapter, at the end of chapter number two, we're made aware of some of the opposition. They're named by name at the end of chapter number two. The Bible tells us in verse number 19, but when Sanballat the Horonite and Tobiah the",
      "context": "he received, according to Nehemiah 1 and verse number three, is that the wall of Jerusalem also is broken down, and the gates thereof ar...",
      "sermon_title": "Sermon nexqP9hAOHU",
      "url": "https://www.youtube.com/watch?v=nexqP9hAOHU&t=216",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}