{
  "reference": "Numbers 21",
  "occurrences": [
    {
      "sermon_id": "PVuTDINYjgU",
      "timestamp": 701.3200073242188,
      "text": "of fornication. Corinthesiam was a word that they would use, and it would be said of them that they were acting and behaving as a Corinthian. Now, that's not very positive for your image of your city, of your people to be. You see someone that's behaving and committing fornication. You say, well, you're acting like a Corinthian. And now he's writing to them, and he's telling them, listen to the Old Testament. There's a lesson. 23,000 people died in one day. This is serious business. Learn the lesson. Notice verse number nine. Neither let us tempt Christ, as some of them also tempted and were destroyed of serpents. This is interesting. I admit to you, as you read verse number nine and you see that he says that they were tempting Christ, the passage of Scripture that's being referenced based upon the remainder of verse number nine, that they were destroyed of serpents, would be Numbers 21, and we're familiar with the fiery serpents. And if you read the text of Scripture in Numbers 21, they're complaining, they're murmuring against Moses and against God, and they're saying that they hate the manna that God had provided. And so here, the Scriptures say that they're tempting Christ. They're gonna deal with the subject of murmuring in the next verse, but to tempt means to, in this context of tempting Christ, means to put to proof God's character and power. In other words, what they were doing is they were taking,",
      "context": "...enced based upon the remainder of verse number nine, that they were destroyed of serpents, would be Numbers 21, and we're familiar with the fiery serpents. And if you read the text of Scripture in Numbers 21, t...",
      "sermon_title": "Sermon PVuTDINYjgU",
      "url": "https://www.youtube.com/watch?v=PVuTDINYjgU&t=701",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "PVuTDINYjgU",
      "timestamp": 772.7999877929688,
      "text": "the Scriptures say that they're tempting Christ. They're gonna deal with the subject of murmuring in the next verse, but to tempt means to, in this context of tempting Christ, means to put to proof God's character and power. In other words, what they were doing is they were taking, and as they were tempting Christ in that situation, they were challenging the very character and power of God. God had provided for them graciously. God had given them leadership. God had given them a human leader in the man Moses. God had provided them leadership with the pillar of fire and the pillar of cloud, and he had provided for them all that they needed. He had provided water and he had provided manna. And yet, as they're sitting there and they're tempting Christ, they're putting to proof God's character and power, they're saying that God somehow was wrong in what he was doing. They said this in Numbers 21, in that passage of Scripture that's being referenced, they said this, wherefore have you brought us out of Egypt to die in the wilderness? Now, that was a recurring statement of the children of Israel. They would say that often, and we find that he says, listen, neither let us tempt Christ. Verse number 10 gives us our fourth example of behavior to be avoided as we're learning these lessons from history. It says in verse number 10, neither murmur ye, as some of them also murmured",
      "context": "...racter and power, they're saying that God somehow was wrong in what he was doing. They said this in Numbers 21, in that passage of Scripture that's being referenced, they said this, wherefore have you brought u...",
      "sermon_title": "Sermon PVuTDINYjgU",
      "url": "https://www.youtube.com/watch?v=PVuTDINYjgU&t=772",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}