{
  "reference": "Numbers 14",
  "occurrences": [
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 0.0,
      "text": "to have a Bible, and what a blessing. Numbers 14, we're gonna be jumping right in the middle of a text of scripture, verses 11 through 20 will be our text this morning. In Numbers 14, verses 11 through 20, I wanna read to you by way of introduction, verse 18 and 19, and then we'll get into the message this morning. But notice in Numbers 14, verse number 18, the Bible says this, this is Moses now talking back to the Lord, the Lord is long-suffering, is recalling what God has said, and of great mercy, forgiving iniquity and transgression, and by no means clearing the guilty, visiting the iniquity of the fathers upon the children unto the third and fourth generation. Notice this in verse 19, pardon, I beseech thee, the iniquity of this people, according unto the greatness of thy mercy, and as thou hast forgiven this people from Egypt even until now. You'll notice there right in the midst of verse number 19, according unto the greatness of thy mercy, and I've used that as the title for the message this morning. We've spent the calendar year of 2023 talking about the truth that our God is great, and I'm so thankful that his greatness is revealed to us in the pages of this precious book, and what a blessing it is to know great is the Lord and greatly to be praised, as we sang from Psalm 48, verses one and two this morning,",
      "context": "to have a Bible, and what a blessing. Numbers 14, we're gonna be jumping right in the middle of a text of scripture, verses 11 through 20 will be ou...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 153.05999755859375,
      "text": "this year. Now that we have discovered the greatness of God, we ought to be declaring the greatness of God. This morning in this text of scripture, we find that Moses makes reference to the greatness of God's mercy, and it's a blessing to consider that our God is merciful. As we begin to think about the text of scripture that we're in here this morning in Numbers 14, and we're looking at just the center section, if you will, of this particular chapter, but I wanna remind you of what's taking place historically in the events of this particular chapter. It was in Numbers chapter 13 that God had given the instruction to Moses to send those 12 spies into the land, and we understand that God had given the direction and their responsibility, these 12 individuals that were to go and to spy out the land. Their job was not to come back and say whether they could or could not take the land. Their job was simply to bring a report, and we find that they came, and as we sing the song with the children, and we sing in our Sunday school, 12 men went to spy on Canaan, 10 were bad. What is it about those 10 that cause us in that song to say 10 were bad? Well, they brought an evil report. The Bible tells us that they brought that report about the walled cities, about the defense",
      "context": "...od is merciful. As we begin to think about the text of scripture that we're in here this morning in Numbers 14, and we're looking at just the center section, if you will, of this particular chapter, but I wanna...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=153",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1198.0400390625,
      "text": "John 13 is where we started last Sunday morning, that He loved them unto the end. We talked much about that cycle that I talked about last Sunday morning with regard to reminding ourselves that God loves us, and then resting in His love, and then rejoicing for His love. I'm so thankful that as we go through that process. that I said that we need to remind ourselves of God's love for us. Why? Because there are times in which the accuser, the brethren, would like to whisper to you and whisper to me that God has forgotten us and God's not loving us and God's mercies are dried up, as the psalmist says here in Psalm 77. But no, we remind ourselves that no, God does love me. No, God is merciful. And we find that here in this passage of scripture in Numbers 14 that Moses has recalled what God has previously revealed. It's so important for us to be students of God's word. You cannot recall what you do not know. You just can't. We understand we speak about God's word and we talk about revelation, all scripture is given by inspiration of God, and we understand that God was speaking through His men. Holy men of God spake as they were moved by the Holy Ghost. But you understand that the canon of scripture is closed. God's given us this book and He's told us to be students of this book.",
      "context": "...at no, God does love me. No, God is merciful. And we find that here in this passage of scripture in Numbers 14 that Moses has recalled what God has previously revealed. It's so important for us to be students o...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1198",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1420.0400390625,
      "text": "while when you're preaching, it just seems as if you go to a verse of Scripture that you really didn't have in your notes. And that it was something that maybe you didn't plan to say. Is that true? Is that a good observation? And I said, Jason, it is. He said, I thought that might be the case. He said, can you help me understand that? I said, well, just at certain times as you're preaching, as you're delivering the message, the Holy Spirit of God will remind you of a verse of Scripture. And it's as if he says, you need to go there. I'm not patting myself on the back. I'm just simply saying, God will help us to recall as we get into this book. Notice not only what Moses recalled, but I want you to notice what Moses requested. As we continue reading in Numbers 14, we read very specifically what Moses requested. But I want you to understand this morning that Moses, I believe this morning, that Moses would not have made the request that he made had he not recalled the truth that he did. The request that is made in verse number 19 in one word, pardon, pardon, pardon. The request is so simple, but the request that is made by Moses in this text of Scripture, the basis of this request is what he recalled, what God had previously revealed to him. Notice it says this, pardon, I beseech thee.",
      "context": "... only what Moses recalled, but I want you to notice what Moses requested. As we continue reading in Numbers 14, we read very specifically what Moses requested. But I want you to understand this morning that Mos...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1420",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1765.0400390625,
      "text": "until now. Moses makes a bold request. His request is made because of what he had recalled. He recalled what God had revealed to him as noted in Exodus 34. I'm thankful that God's mercy is on display throughout his word. You can read over and over throughout God's word of God's mercy being on full display. You've experienced in your life, and I've experienced in my life, God's mercy. And I'm so thankful this morning that Moses would stand between the people and the Lord, and he would cry out and he would beseech the Lord, and he would say that it's not because they deserve it. Because what they deserve was judgment. I don't deserve to be forgiven. You don't deserve to be forgiven. But I'm certainly thankful that God chose to forgive me. us. What a blessing. You can't earn forgiveness. You can't. There are people that try. There are religious systems that have been designed and developed to try to persuade people that they can do something to earn forgiveness, to buy God's favor. It's not possible. It's not possible. As we look at the passage of Scripture here in Numbers 14, we note first what Moses recalled and what he requested, but now I want you to notice as we finish the passage of Scripture here in verse number 20, I want you to notice how God responded. Notice how God responded. It's a simple verse of Scripture. The Lord speaks back to Moses.",
      "context": "...y God's favor. It's not possible. It's not possible. As we look at the passage of Scripture here in Numbers 14, we note first what Moses recalled and what he requested, but now I want you to notice as we finish...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1765",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1996.3200378417969,
      "text": "land. They would conquer, divide and inhabit the land. They'd go through a period of judges for nearly 450 years and Samuel would come on the scene as a prophet. We find they'd ask for a king and God gives them a king and Saul and David and Solomon. Then the kingdom is divided and the nation of Israel, the ten tribes of the north, no good kings after the divided kingdom, downhill the whole way, taken captive by the Assyrians. The nation of Judah, the two tribes of the south, periods of time in their history where there are good kings, revival, prophets of God, people responding and getting right and God sending revival. But eventually they too are taken captive, they by the Babylonians. And then we come to the book of Nehemiah. I mean all that history between numbers 14 and Nehemiah. Hundreds of years. You come to Nehemiah, this remnant is going to return. We find that Nehemiah begins in verse number 16, but they and our fathers dealt proudly and hardened their necks and hearkened not to thy commandments and refused to obey. Neither were mindful of thy wonders that thou didst among them, but hardened their necks and in the rebellion appointed a captain to return to their bondage. Sound familiar to what we were just talking about in numbers 14? Notice where it says, but thou art a God, ready to",
      "context": "... they by the Babylonians. And then we come to the book of Nehemiah. I mean all that history between numbers 14 and Nehemiah. Hundreds of years. You come to Nehemiah, this remnant is going to return. We find tha...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1996",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 2085.8800354003906,
      "text": "Neither were mindful of thy wonders that thou didst among them, but hardened their necks and in the rebellion appointed a captain to return to their bondage. Sound familiar to what we were just talking about in numbers 14? Notice where it says, but thou art a God, ready to pardon, gracious and merciful, slow to anger and of great kindness, and forsookest them not. If you skip down, we don't have time to look at all that's taken place, but if you skip down to verse number 31, notice what the Bible says, nevertheless for thy great mercy's sake thou didst not utterly consume them nor forsake them, for thou art a gracious and merciful God. This morning we find that God desires that we as His children would know that He is a merciful God. He desires that we would have that knowledge. Listen, He's revealed and recorded it for us through the pages of this precious book that each of us would have this confident knowledge that God is a merciful God. I believe for each of us that are gathered here this morning that have personally been the recipients of God's mercy, that we would stand and rejoice and thank God that He's a merciful God. But there's a world that does not know that our God is a merciful God. And just as He's been merciful to you and to me, He's ready to pardon. He's a merciful God. Then you understand that",
      "context": "...ppointed a captain to return to their bondage. Sound familiar to what we were just talking about in numbers 14? Notice where it says, but thou art a God, ready to pardon, gracious and merciful, slow to anger an...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=2085",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 2433.060064315796,
      "text": "by works of righteousness which we have done, but according to His mercy.\" He saved us. \"...by the washing of regeneration and renewing of the Holy Ghost, but God who is rich in mercy.\" He's rich in mercy. This morning I'm thankful that someone told me that God was merciful. I see in the passage of Scripture this morning in Numbers 14 how Moses recalls this and he stands as an intercessor between the people and God. This morning, I want to see people saved. You know, it grieves my heart to be very transparent with you this morning. It grieves my heart when I hear Christian people say and desire for God's judgment upon lost people. I hear it and it grieves my heart. Why? Because I've read Revelation 20. And when you read Revelation 20, you read about that second death, to be cast in a lake of fire. You can't wish that on anybody. As a child of God and as a recipient of God's mercy, it ought never cross our lips. God judged those people. I've always said God saved those people. God, just as you've been merciful to me, would you be merciful to them? Listen, I can't pray for them to be saved, but God's called us to go give them a message. And it grieves my heart that there are believers that have that opinion of certain peoples around the world, whether they're of a different religion or whatever the case might be.",
      "context": "...nkful that someone told me that God was merciful. I see in the passage of Scripture this morning in Numbers 14 how Moses recalls this and he stands as an intercessor between the people and God. This morning, I ...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=2433",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}