{
  "reference": "Numbers 11",
  "occurrences": [
    {
      "sermon_id": "t3763lfMrgQ",
      "timestamp": 297.55999755859375,
      "text": "says later on in verse number 14 that ye did communicate with my affliction. In verse number 15, now you Philippians know also that in the beginning of the gospel when I departed from Macedonia, no church communicated with me as concerning giving and receiving. Notice this. But ye only. So, Paul is rejoicing because of the opportunity that they had to partner with him and to invest in the ministry, and he says at the end of the verse, he says, wherein ye were also careful, but ye lacked opportunity. Now, look in verse number 11. He says, not that I speak in respect of want. He's not writing to them. He's not saying I'm speaking, I'm not speaking in respect of want, and then he says this, For I have learned in whatsoever state I am therewith to be content. This statement in verse number 11 is very informative to me. Number one, I would say this, to be content is not our default setting. To be content is not my default setting. To be content is not your default setting. I mentioned on Sunday morning when I preached the message there from Numbers 11, when the people complained, and I said this in that message, that the default setting for the children of Israel was to complain. Every time something went a little bit off course for the children of Israel, their default setting was to complain. It was not, what is God doing in this situation?",
      "context": "...t is not your default setting. I mentioned on Sunday morning when I preached the message there from Numbers 11, when the people complained, and I said this in that message, that the default setting for the chil...",
      "sermon_title": "Sermon t3763lfMrgQ",
      "url": "https://www.youtube.com/watch?v=t3763lfMrgQ&t=297",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 2013.2400207519531,
      "text": "in chapter number 11 of Numbers, the Bible says, and when the people complained, it displeased the Lord and the Lord heard it and His anger was kindled and the fire of the Lord burned among them and consumed them that were in the uttermost parts of the camp. Now Numbers 11.1 is a convicting verse of Scripture because the Bible says when the people complained, it displeased the Lord. But then it tells us this, and the Lord heard it. God hears our praise, but He also hears our complaints. And oh, would it be said that He hears us praise Him far more frequently than He hears us complaining. But not only did the Lord hear it, not only was the Lord displeased, but the Bible says that His anger was kindled. His anger was kindled. I don't want God to be angry with me. I don't want God to be angry with my family. I don't want God to be angry with our church. I don't want to be complaining. No, I want to learn from that example that is referenced in 1 Corinthians 10. We go back to the Old Testament and we learn. So this truth of proving what is acceptable unto the Lord. We can please God, but then how can I please the Lord? The two vital principles, I need to dig into God's Word so that I can prove what",
      "context": "...e of the Lord burned among them and consumed them that were in the uttermost parts of the camp. Now Numbers 11.1 is a convicting verse of Scripture because the Bible says when the people complained, it displeas...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=2013",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}