{
  "reference": "Numbers 25",
  "occurrences": [
    {
      "sermon_id": "MyCOoL7O768",
      "timestamp": 999.0399780273438,
      "text": "Spirit works specifically, but I know that He works. And I know this truth of God's Word as well, that the believer has the ability to quench and to grieve the Holy Spirit. We find that the Holy Spirit of God, one of His ministries with regard to lost people, according to John 16, one of the ministries is that He would reprove the world of sin and of righteousness and of judgment to come. I think about those that the Apostle Paul stood before and preached the gospel, and they were under great conviction. And they were so under conviction that they said, Paul, you're mad. You're beside yourself. Get out. I'm not going to listen to you any longer. Almost, Agrippa said, thou persuadest me to be a Christian. They were under conviction, but they resisted the conviction. And as a child of God, we can grieve and quench the Holy Spirit. And it's a dangerous thing to grieve and to quench the Holy Spirit. Oh, when the Holy Spirit of God takes the Word of God and convicts us of sin in our lives, oh, how we ought to respond. He says, I gave her space to repent. But obviously, though at this time, in the time of the writing, there was no repentance, and therefore the judgment is given, and it's explained to us, again, the severity of the judgment. We read already in Numbers 25, and we referenced historically the severity of that judgment.",
      "context": "...udgment is given, and it's explained to us, again, the severity of the judgment. We read already in Numbers 25, and we referenced historically the severity of that judgment.",
      "sermon_title": "\"The Church In Thyatira - Part 2\"  Revelation 2:20-29",
      "url": "https://www.youtube.com/watch?v=MyCOoL7O768&t=999",
      "channel": "Unknown",
      "publish_date": 20250211
    },
    {
      "sermon_id": "MyCOoL7O768",
      "timestamp": 1079.5599975585938,
      "text": "to repent. But obviously, though at this time, in the time of the writing, there was no repentance, and therefore the judgment is given, and it's explained to us, again, the severity of the judgment. We read already in Numbers 25, and we referenced historically the severity of that judgment. But notice here, the Bible says, behold, verse 22, I will cast her into a bed, and them that commit adultery with her into great tribulation, except they repent of their deeds. So again, there's still this offer of repenting. You know, throughout the Old Testament, especially the minor prophets, you'll read regularly where the Bible says that God says, return, return, return, turn to me. God is pleading with His people. God is so longsuffering to His people. Think about the nation of Israel, and think about Judah and all of their wickedness and all of their idolatry. We find that God continuously raised up the prophets to come and to deliver a message, and that message was, think about Isaiah 1, come and let us reason together. Though your sins be as scarlet, they can be as white as snow. God is calling these people within the church here that they've allowed this false teacher, this one that called herself a prophetess, and those that have been caught up with this false teaching, He says they need to repent. Notice in verse 23, and I will kill her children with death, and all the churches shall know",
      "context": "...udgment is given, and it's explained to us, again, the severity of the judgment. We read already in Numbers 25, and we referenced historically the severity of that judgment. But notice here, the Bible says, beh...",
      "sermon_title": "\"The Church In Thyatira - Part 2\"  Revelation 2:20-29",
      "url": "https://www.youtube.com/watch?v=MyCOoL7O768&t=1079",
      "channel": "Unknown",
      "publish_date": 20250211
    }
  ]
}