{
  "reference": "Numbers 20",
  "occurrences": [
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 1864.5200119018555,
      "text": "struggle within the womb, there are two nations, right? It's what the Bible says. The Bible says the elder shall serve the younger. We find that God is connecting these dots for us and helping us to see what's taking place and we find, yes, the selling of the birthright, we see the subtlety of Jacob with the blessing. By the way, I mentioned this when I taught through that passage of Scripture in Genesis 27, there was no reason for Jacob to have to scheme. God had already promised in Genesis chapter number 25 that the elder shall serve the younger. There's no reason for you in your life or in my life to scheme, we just trust God. But here in Numbers chapter number 20, we find this dispute that is listed here with the Edomites or the people of Edom, the descendants of Esau. Notice, first of all, in Numbers chapter 20, in the wilderness. Notice, as the children of Israel had left Egypt, they've crossed the Red Sea, they're now in the wilderness. They've already disobeyed God, according to the evil report that was brought in Numbers chapter 14 and they said they weren't able, but we find in verse number 14, here in Numbers 20, the Bible says that Moses sent messengers from Cadiz unto the king of Edom. Thus saith thy brother Israel, thou knowest all the travail that hath befallen us, how our fathers went down into Egypt",
      "context": "...ught in Numbers chapter 14 and they said they weren't able, but we find in verse number 14, here in Numbers 20, the Bible says that Moses sent messengers from Cadiz unto the king of Edom. Thus saith thy brother...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=1864",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 1929.1600189208984,
      "text": "said they weren't able, but we find in verse number 14, here in Numbers 20, the Bible says that Moses sent messengers from Cadiz unto the king of Edom. Thus saith thy brother Israel, thou knowest all the travail that hath befallen us, how our fathers went down into Egypt and we have dwelt in Egypt a long time, and the Egyptians vexed us and our fathers. And when we cried unto the Lord, he heard our voice and sent an angel and hath brought us forth out of Egypt. And behold, we are in Cadiz, a city in the outermost of thy border. Let us pass, I pray thee, through thy country. We will not pass through the fields or through the vineyards neither will we drink of the water of the wells. We will only go by the king's highway. We will not turn to the right hand nor to the left until we have passed thy borders. Now does the request of verse number 17 sound like a difficult thing? Were they really causing any trouble to Edom or the Edomites? And they just said, can we pass through? We're not gonna go through your fields, we're not gonna go through your vineyards, we're not gonna drink of your water or of your wells. We're gonna go the king's highway, we're not gonna turn to the right or to the left. I mean, we're just gonna pass through your borders.",
      "context": "said they weren't able, but we find in verse number 14, here in Numbers 20, the Bible says that Moses sent messengers from Cadiz unto the king of Edom. Thus saith thy brother...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=1929",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "Wiu68PR_4NQ",
      "timestamp": 2207.6600036621094,
      "text": "how that God was angry with Solomon, why? Because of his evil, where he built these places of worship for these false gods of these wives that he married and all that was taking place. And we find that he also was burning incense and sacrificed one of their gods. And the Bible then tells us in verse 14 of 1 Kings 11, and the Lord stirred up an adversary unto Solomon, hey, dad, the Edomite. Hey, dad, the Edomite. He was the king's seed in Edom. The days of Amaziah, king of Judah, there's conflict, there are disputes with the Edomites. But I want you to think about the judgment upon the Edomites. I won't take time to look at any of the references. We're near the end this evening. But turn to the book of Jeremiah, if you will. Read two verses from the book of Jeremiah and Ezekiel and I encourage you to read the small book of Obadiah. And the book of Obadiah completely deals with Edom, the sons of Esau. Specifically goes back to Numbers 20. To the event that we read of in Numbers 20 where they said we're gonna pass through. He said, no, you're not. If you read the book of Obadiah, just a short book, you'll see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly,",
      "context": "...ah. And the book of Obadiah completely deals with Edom, the sons of Esau. Specifically goes back to Numbers 20. To the event that we read of in Numbers 20 where they said we're gonna pass through. He said, no, ...",
      "sermon_title": "Sermon Wiu68PR_4NQ",
      "url": "https://www.youtube.com/watch?v=Wiu68PR_4NQ&t=2207",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "kZ4u2Ljc7cU",
      "timestamp": 0.0,
      "text": "And just one chapter in the book of Obadiah, and we'll look at just a few verses, really as a springboard into our message this evening. And this brief, minor prophet book of Obadiah is addressed to Edom. It's only got 21 verses in this short book of the Bible, and we find that the descendants of Esau are those that are being addressed here, concerning Edom. These are the descendants of Esau. And we understand, and we won't take a lot of time this evening to develop all of this, but historically speaking, the Edomites were in regular conflict with the people of Gob, the nation of Israel. And oftentimes, when Israel would face difficulty, when Israel would face some level of defeat, we would find that there are many times in which you could see that the Edomites would rejoice when Israel would face some of those hardships and difficulties. We are mindful, maybe one of the most familiar accounts is found for us in Numbers 20, verses 14 through 22, and I'm just going to briefly mention that it was during that period of time in which Moses made the request to pass through their land. And you'll remember as you think about that portion of Scripture that that request was denied. And we find that God, in this particular book, as He would use the prophet Obadiah to issue this warning, this really just a message of doom and judgment,",
      "context": "...dships and difficulties. We are mindful, maybe one of the most familiar accounts is found for us in Numbers 20, verses 14 through 22, and I'm just going to briefly mention that it was during that period of time...",
      "sermon_title": "Sermon kZ4u2Ljc7cU",
      "url": "https://www.youtube.com/watch?v=kZ4u2Ljc7cU&t=0",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}