{
  "reference": "Philippians 3",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 605.8400292396545,
      "text": "us for understanding this evening how God's Word continues to work in our lives. Notice in verse 13 of 1 Thessalonians two, the Bible says for this cause also, thank we God without. sing, because when you receive the Word of God, which ye heard of us, ye received it not as the Word of men, but as it is in truth, the Word of God, notice, which effectually worketh also in you that believe.\" This evening we could take the time and go around the room and give testimony of how God's Word has worked in our lives, how God's Word has been at work, the power of God's Word accomplishing things in our lives as we study the Word of God, as we read and meditate upon the Word of God, as we hear the teaching and preaching of the Word of God. It's through the preaching and teaching of the Word of God, the reading of the Word of God, the receiving of God's Word that our faith increases. It's through this book that I know my Savior, Paul says in Philippians 3, that I may know Him and the power of His resurrection. And if you want to know God, you need to know the Bible. And I'm thankful that God has preserved it for us, and He's promised that it will work, the power of His Word. He said that His Word is quick and powerful and sharper than a two-edged sword.",
      "context": "... of God's Word that our faith increases. It's through this book that I know my Savior, Paul says in Philippians 3, that I may know Him and the power of His resurrection. And if you want to know God, you need to kn...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=605",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2622.739990234375,
      "text": "were friends with him, and really, and I'm not saying this to be unkind or to be boastful or whatsoever, but it had been years since they had talked to him, and they really didn't know anything really knowing him. They went to school with him. They knew about him. It's a different thing when you know somebody, when you know what somebody likes, when you know how somebody... Do you understand what I'm saying? And you know somebody. And we think about this truth this morning, that the all-powerful, almighty God of the universe lets us know him. That should just cause our mind to explode this morning, seriously. Paul says in Philippians 3 that I may know him, the power of his resurrection, the fellowship of his sufferings he speaks about. Begin to think about that truth this morning. Moses said that I may know him. I don't want to just know about God. I want to know him. If I'm going to know God and I'm going to know him intimately, it's because it's through this book. How do I know him? Well, he's revealed himself to us in the pages of Scripture. I preached a message this week at school chapel over at Fairfax Baptist Temple Academy, and I preached from Proverbs 3. In verse 26, the Bible says that the Lord shall be thy confidence. And I said to those young people, I said, how can you make God your confidence?",
      "context": "... lets us know him. That should just cause our mind to explode this morning, seriously. Paul says in Philippians 3 that I may know him, the power of his resurrection, the fellowship of his sufferings he speaks abou...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2622",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "G50UWUcArHE",
      "timestamp": 2004.1799926757812,
      "text": "we are ambassadors for Christ.\" Isn't that a wonderful truth? That we're His ambassadors. What's an ambassador? It's a representative. One who goes on the behalf of another. Typically when we think about ambassadors, we think about it in the context of global, national things where we have an ambassador from the United States to a particular country and what have you. And what are they doing? They're in that country representing on the behalf of the country that they represent. And so they're in some other country representing the country of their origin. And we find here that my citizenship is no longer here upon the earth. We sing a song, \"...this world is not my home, just a passing through. My treasures are laid up somewhere beyond the blue.\" We find that there in the book of Philippians in the third chapter, the Bible speaks about our citizenship being in heaven. And what a joy that is. See, because we've experienced the miracle of reconciliation, but we understand the ministry of reconciliation. Paul put it this way in Philippians 3 in verse number 20, \"...for our conversation is in heaven. From whence also we look for the Savior, the Lord Jesus Christ.\" What a blessing to know that my citizenship is in heaven. That I'm a child of the King. This world is not my home. I'm looking forward to the day that I get to meet my Savior face to face. And forever and ever and ever",
      "context": "...iracle of reconciliation, but we understand the ministry of reconciliation. Paul put it this way in Philippians 3 in verse number 20, \"...for our conversation is in heaven. From whence also we look for the Savior,...",
      "sermon_title": "Sermon G50UWUcArHE",
      "url": "https://www.youtube.com/watch?v=G50UWUcArHE&t=2004",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}