{
  "reference": "Proverbs 4",
  "occurrences": [
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 1308.0199508666992,
      "text": "deceived. I can trust my heart. First Corinthians 11 says, let he that thinketh he stand, take heed lest he fall, amen? I think it's verse 12 in First Corinthians 11, verse 12. And so the reality is that we must take heed to the warning that God gives us. How do we respond to the warning? Well, he says take heed in the verse of Scripture in chapter 11 and verse 16 of the book of Deuteronomy. And I mentioned that last week because that's what Jesus said as well. It means to see, to discern, to beware. I believe this. Turn back, you're in the book of Proverbs right now, turn back to the fourth chapter if you will, chapter number four. What must I do? How should I respond to this warning when God tells me this word that my heart is deceitful above all things? When he tells me that I'm to take heed that my heart be not deceived, and I recognize that the New Testament, as we studied last week, tons of Scriptures that we referenced last week that say, hey listen, they lie in wait to deceive, right? They're deceiving and they're being deceived and we understand that we're living in this age of deception and so therefore what must I do? Well I believe that I must keep my heart. Notice in verse number 23 of Proverbs 4, it's a very simple verse of Scripture, but the",
      "context": "...so therefore what must I do? Well I believe that I must keep my heart. Notice in verse number 23 of Proverbs 4, it's a very simple verse of Scripture, but the",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=1308",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "EaNRDOjPIW4",
      "timestamp": 1366.0999603271484,
      "text": "They're deceiving and they're being deceived and we understand that we're living in this age of deception and so therefore what must I do? Well I believe that I must keep my heart. Notice in verse number 23 of Proverbs 4, it's a very simple verse of Scripture, but the Bible says this, keep thy heart with all diligence for out of it are the issues of life. Keep thy heart with all diligence. The word keep is an interesting word, it means to guard or to watch, but it really goes even further than that. It means to guard from dangers, but it also means this, to guard with fidelity, with loyalty, with faithfulness. And so when I begin to notice what he says here, why is he saying keep thy heart with all diligence? Why is there an emphasis of guarding our hearts and to watch them, to guard them from danger, to guard it with fidelity? Why does he tell us that? Well because of out of it are the issues of life. Well because it's deceitful and so therefore I must guard my heart and how do I do that? I've got to get in the Word of God. There are times in which as we go through life, as we live here on this earth, that we face decisions and we have things that are before us and we know there are people",
      "context": "...so therefore what must I do? Well I believe that I must keep my heart. Notice in verse number 23 of Proverbs 4, it's a very simple verse of Scripture, but the Bible says this, keep thy heart with all diligence ...",
      "sermon_title": "Sermon EaNRDOjPIW4",
      "url": "https://www.youtube.com/watch?v=EaNRDOjPIW4&t=1366",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 892.9200134277344,
      "text": "for doctrine. Amen? And we understand doctrine's important. You say, but doctrine divides. Then so be it. Don't think I'm looking for fights or anything like that, but I'm just saying, doctrine is important. Amen? We cannot, we must not embrace the ideas of some of our liberal brethren that have the ecumenical idea that we can set aside doctrine and seek to have unity in the things that we agree on. It doesn't work. It does not work, brethren. It's not possible. What gives us unity is that we support and embrace the same truth. God is the one that gives us unity as we embrace this book. Amen? Notice the message of His lips as we've mentioned here in Proverbs 4, but I want you to think about the message of His life. We don't necessarily see it here within the context of Proverbs 4. We do find that He mentions in verses 3 and 4 how that He, Solomon, received instruction from his father David, and He says to him in verse 4, He taught me also and said unto me, let thine heart retain my words, keep my commandments, and live. In fact, if you were to study the life of Solomon prior to the situation with all that took place with all of his wives and concubines and all of the idolatry that is recorded, you find that He walked with the Lord.",
      "context": "...s us unity as we embrace this book. Amen? Notice the message of His lips as we've mentioned here in Proverbs 4, but I want you to think about the message of His life. We don't necessarily see it here within the...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=892",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 1914.300033569336,
      "text": "know, I get asked all the time, how can you memorize Scripture? And my consistent answer is W-O-R-K. It takes work to memorize the Word of God. It really does. And the older you get, or the more you try to memorize, the more work it takes. Just takes work. Sometimes we forget that, but he says, get wisdom, get understanding, labor for it, work for it. Notice what he says back in Proverbs 4, in verse number 13, take fast hold of instruction. I mean, does your mind, when you read these words, does it not give you some pictures, some images of what we're to do? Take fast hold of this instruction. He says this, notice, let her not go. Can I tell you that if you found truth in the Word of God, you better not let it go for anything. I don't care who comes down the road. I don't care what they try to teach. If you have the truth of the Word of God, you better hold on to it. Don't compromise on it. Don't change. No, no, let's search the Scriptures, let's understand what the Word of God says. And we find, he says, take fast hold here of instruction. Let her not go. Keep her, for she is thy life. In Proverbs 13, in verse number 1, the Bible says, a wise son heareth his father's instruction.",
      "context": "... but he says, get wisdom, get understanding, labor for it, work for it. Notice what he says back in Proverbs 4, in verse number 13, take fast hold of instruction. I mean, does your mind, when you read these wor...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=1914",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 2055.500030517578,
      "text": "hearing the instruction? Are we understanding that this book is profitable? That I need the content of this book every day of my life? I don't just need the Bible when I have a problem. In fact, if we get a regular routine of getting into the Word of God, then maybe when the problem comes, we already have the answer. Why? Because God's been preparing me. God's been feeding me. He's sustaining me. And that problem comes, we say, man, God, I'm so thankful that You gave me that truth that I read just a few days ago. You knew that I needed that, because You knew what was coming in my life. That's how God works. Now, sometimes He lets something come that we didn't have that preparation for. And we search the book. We get into the Word of God. God, help me. Give me wisdom. Notice the result. We see the responsibility of the Father, the response of the children. Notice the result. I love it. The Bible tells us several things within the passage in Proverbs 4. In verse 6, notice first of all it says this, Forsake her not, and she shall preserve thee. Love her, and she shall keep thee. Wisdom is in reference here as we look at the portion of Scripture. And we notice, wisdom shall preserve thee. You know that God's instruction as we hear it and as we obey it,",
      "context": "...the children. Notice the result. I love it. The Bible tells us several things within the passage in Proverbs 4. In verse 6, notice first of all it says this, Forsake her not, and she shall preserve thee. Love h...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=2055",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "w16vXRlvXV0",
      "timestamp": 2191.800048828125,
      "text": "use the outlet. Amen, Joseph? He said to me the other day, how do you get this crazy thing out of here anyway? It's kid-proof. No, just kidding. The reality is that when I said that to the individual, they said, man, I'm going to protect all of my outlets because I don't want my kid putting something in there. Yeah, why? Because you're trying to protect them. And when you tell Johnny or Susie, don't put it in there, you're trying to keep them, to preserve them. So guess what? When God gives us the instruction that He's given us, when we hear it and when we follow it, can I tell you that one of the results that we see here in Proverbs 4 is that it will protect and guard us from any troubles and evils? The reality is that it shall preserve thee. There are some things that we just understand biblically that we take and make decisions based on. There are some things I'm not going to do, some places I'm not going to go, so on and so forth. Why? Because there's biblical command and it's preserved me. It has. Amen? If you'd be honest, I hope that you could say it's preserved you. Because that's what the Word of God says. If you hear it and you keep it, it shall preserve thee. It's going to keep us, it's going to protect us and guard us.",
      "context": "..., when we hear it and when we follow it, can I tell you that one of the results that we see here in Proverbs 4 is that it will protect and guard us from any troubles and evils? The reality is that it shall pres...",
      "sermon_title": "Sermon w16vXRlvXV0",
      "url": "https://www.youtube.com/watch?v=w16vXRlvXV0&t=2191",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}