{
  "reference": "Proverbs 3",
  "occurrences": [
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2622.739990234375,
      "text": "were friends with him, and really, and I'm not saying this to be unkind or to be boastful or whatsoever, but it had been years since they had talked to him, and they really didn't know anything really knowing him. They went to school with him. They knew about him. It's a different thing when you know somebody, when you know what somebody likes, when you know how somebody... Do you understand what I'm saying? And you know somebody. And we think about this truth this morning, that the all-powerful, almighty God of the universe lets us know him. That should just cause our mind to explode this morning, seriously. Paul says in Philippians 3 that I may know him, the power of his resurrection, the fellowship of his sufferings he speaks about. Begin to think about that truth this morning. Moses said that I may know him. I don't want to just know about God. I want to know him. If I'm going to know God and I'm going to know him intimately, it's because it's through this book. How do I know him? Well, he's revealed himself to us in the pages of Scripture. I preached a message this week at school chapel over at Fairfax Baptist Temple Academy, and I preached from Proverbs 3. In verse 26, the Bible says that the Lord shall be thy confidence. And I said to those young people, I said, how can you make God your confidence?",
      "context": "...ed a message this week at school chapel over at Fairfax Baptist Temple Academy, and I preached from Proverbs 3. In verse 26, the Bible says that the Lord shall be thy confidence. And I said to those young peopl...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2622",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "timestamp": 2704.739990234375,
      "text": "I preached a message this week at school chapel over at Fairfax Baptist Temple Academy, and I preached from Proverbs 3. In verse 26, the Bible says that the Lord shall be thy confidence. And I said to those young people, I said, how can you make God your confidence? The Lord shall be thy confidence. And I said this, part of the message, it wasn't the entirety of the message, is that the only way God's going to be my confidence, the one that I rely on, the one that I'm trusting, is when I get to know him. And I get to know him through this book. And if the Lord shall be thy confidence, and he's revealed himself to us in the pages of Scripture, and we rejoice this morning because 1 John 5 and verse number 20 tells us that we may know him that is true, and we, notice as it continues, are in him that is true. Think about the truth that we can abide in him. He said in John chapter number 15, abide in me, and I in you. And we can rejoice this morning in the fact that I can abide in him. See, when we close out this book, he ends it this way, even in his son Jesus Christ, this is the true God and eternal life. I'm so thankful this morning that God has given us a record,",
      "context": "...ed a message this week at school chapel over at Fairfax Baptist Temple Academy, and I preached from Proverbs 3. In verse 26, the Bible says that the Lord shall be thy confidence. And I said to those young peopl...",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY&t=2704",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1536.9199829101562,
      "text": "evening but Isaiah is after the Exodus. So I think it's fair that we could say that the children of Israel were aware of what happened during the Exodus. The children of God during the time of Isaiah's prophecy were aware of the Exodus. They were aware of the plagues. They could read the Psalms. They could read the book of Exodus. They could be aware of what God did. And let me ask you this. Who had more power? God or Pharaoh? Was it abundantly clear? So clear that even the magicians of Egypt said this is the finger of God. They asked Pharaoh, do you not see that the land is devastated? I mean how long are you going to allow these people to be a snare unto us? God made it abundantly clear and abundantly obvious that He is the one that has all power. That He has more power than Pharaoh. Would you agree? But look at verse number 2. These people that would have known that, it says to strengthen themselves in the strength of Pharaoh. Why do we want Pharaoh's strength? If Pharaoh's strength is inferior to God's strength, why do we want Pharaoh's strength? Do you understand? But this is what they're doing. It says at the end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not.",
      "context": "...he end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not.",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1536",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "timestamp": 1632.9199829101562,
      "text": "want Pharaoh's strength? Do you understand? But this is what they're doing. It says at the end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not. You know the verses, right? And we find here this evening that they are going to seek to be strengthened by the strength of Pharaoh who is inferior to God Almighty and God had made it abundantly clear and demonstrated that truth. And then they're going to trust in the shadow of Egypt. That's a sad commentary, is it not? I mean, what a sad, sad indictment against the children of Israel here. And we find that we are to abide. You don't need to turn there, but I'm mindful this evening of the truth of Psalm 91. He that dwelleth in the secret place of the Most High shall abide under the shadow of the Almighty. Not the shadow of Pharaoh of Egypt, but of the shadow of the Almighty. I will say to the Lord, He is my refuge and my fortress. My God, in Him will I trust. Wow. If we know the Lord, why are we going to run to Egypt? Look at Isaiah 31. We see the indictment in Isaiah 30, but we see it continue in chapter 31. Woe to them, verse number 1, that go down to Egypt for help",
      "context": "...he end of verse number 2, and to trust in the shadow of Egypt. The world. Trust in the Lord. Right? Proverbs 3 verse number 5 and 6. With all thine heart and lean not. You know the verses, right? And we find he...",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s&t=1632",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}