{
  "reference": "Proverbs 24",
  "occurrences": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 1384.300033569336,
      "text": "as high as it is here, if we've not prepared to stand, we're probably gonna bow. We're gonna justify it somehow in our minds. Everybody else is doing it. You probably said that as a teenager like I did. Why can't I do that, mom? Why can't I do that? That everybody else is doing it. I think I only said that a handful of times, honestly, because each time I said that, they said, okay, tell me who's doing it, and it was just like, mmm, everybody. But you understand. Notice what the wise man says, Solomon, Proverbs 24. Notice what he says in Proverbs 24 and verse number 10. What a great truth that God gives us here in this verse of Scripture. The Bible says in Proverbs 24 and verse number 10, if thou faint in the day of adversity, thy strength is small. Can I tell you this morning that the day of adversity is gonna come? It's gonna come. It's not talking about physical strength, however. See, we wrestle not against flesh and blood, as I referenced in Ephesians 6 this morning by way of introduction. We wrestle against spiritual wickedness in high places. And here he's not speaking about our strength being small, meaning that our physical strength is small. Remember, Paul said, in my weakness, then I'm strong. Why? Because his strength is made perfect in weakness. And we find that",
      "context": "..., and it was just like, mmm, everybody. But you understand. Notice what the wise man says, Solomon, Proverbs 24. Notice what he says in Proverbs 24 and verse number 10. What a great truth that God gives us here ...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=1384",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 262.0799865722656,
      "text": "notice this phrase the place where Joseph was bound the place where Joseph was bound it tells us in verse number four in the captain of the guard charged Joseph with them and he served them and they continued a season in ward as we look at Genesis chapter number 40 we find the entire chapter that Joseph is in prison in fact as you start chapter number 41 you find that it was two more years after the conclusion of chapter 40 that Joseph still is in prison and we find that when Joseph is here in prison in Genesis chapter number 40 we read of a man we read of his life and we see that he's a man that's continuing to walk with the Lord he's not quit he's not giving up he's not throwing in the towel because of the lot that he was served because of the circumstances in which he is facing I begin to think about this truth and as I think about this passage here in Genesis chapter number 40 and looking at the truth of being faithful through trials through those difficulties in the opposition I'm reminded of what the wise man says in Proverbs 24 in verse number 10 if thou faint in the day of adversity thy strength is small if thou faint in the day of adversity then I strength is small now we can look at that from a physical perspective",
      "context": "...rough trials through those difficulties in the opposition I'm reminded of what the wise man says in Proverbs 24 in verse number 10 if thou faint in the day of adversity thy strength is small if thou faint in the...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=262",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 323.1199951171875,
      "text": "I'm reminded of what the wise man says in Proverbs 24 in verse number 10 if thou faint in the day of adversity thy strength is small if thou faint in the day of adversity then I strength is small now we can look at that from a physical perspective we can think about physical opposition and adversity but the reality is that that is not the focus of Proverbs 24 in verse number 10 it's really a focus of spiritual strength and we find that he said listen the day of adversity will come we mentioned this morning it's not a question of whether you will have a trial or I will have a trial it's a question of how will we respond how will we behave in the midst of that trial and as we look here in Genesis chapter number 40 and we see the trial the difficulty in which Joseph is dealing with but yet we find that he's faithful he's faithful and there's a great example for us in this passage of scripture I'm going to somewhat quickly go through the dialogue of Genesis chapter number 40 provide you with some details with regard to the chapter and then look at some application for how you and how I can through trials not only rejoice as we look at this morning but also be faithful through those trials and I'm so thankful that",
      "context": "I'm reminded of what the wise man says in Proverbs 24 in verse number 10 if thou faint in the day of adversity thy strength is small if thou faint in the...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=323",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 1760.97998046875,
      "text": "be faithful through the trials. Why? Because I'm trusting my Lord. I'm walking with him day by day. These unfortunate things have happened, these trials, these difficulties, these adversities but I know that God's in control and I know that God has a purpose and I'm going to be faithful. I'm gonna rejoice through these trials and I'm gonna be faithful because I'm gonna see what God is going to do. I mentioned in Proverbs 24 in verse number 10, if thou faint in the day of adversity, thy strength is small. I want you to turn over to the New Testament if you will in 2 Corinthians chapter four as we seek to make some application this evening from this portion of scripture. This truth that we see in Genesis chapter number 40, as we said this morning, we can, it is possible that we can rejoice through trials. It is possible that we can be faithful in the. midst of trials. We look in 2 Corinthians 4. We mention that the strength that's referenced in Proverbs 24 and verse 10 is not a physical strength, but a spiritual strength. And notice what the Bible tells us in 2 Corinthians 4. The Bible says in verse 1, Therefore, seeing we have this ministry, as we have received mercy... Notice the Bible says we faint not. We faint not. If thou faint in the day of adversity,",
      "context": "...hese trials and I'm gonna be faithful because I'm gonna see what God is going to do. I mentioned in Proverbs 24 in verse number 10, if thou faint in the day of adversity, thy strength is small. I want you to tur...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=1760",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EoTOjgo0SqY",
      "timestamp": 2016.780014038086,
      "text": "in verse 15, For all things are for your sakes that the abundant grace might through the thanksgiving of many redound to the glory of God, for which cause we faint not. So we see that a second time in this passage of scripture, that Paul says in verse number 1, We've received this ministry, as we have received mercy, we faint not. We see now in verse number 16 that he says, For which cause we faint not. Now remember, Proverbs 24 and verse 10, If we faint in the day of adversity, our strength is small. Paul says twice here, we faint not. Again, the picture that we see of Joseph, of this continuing, of this faithfulness through the trial, though he's in prison, he's been falsely accused, all of these things are taking place, we find that he's still engaged. We find that he's still inquiring, he's still ministering to others, he's still trusting God, he's still proclaiming that, hey, interpretations belong to God. He's still evidently, as we look at the passage, he's obviously walking with God and obeying God. In Genesis chapter 40, and Paul is saying here, listen, we've dealt with some issues, we've had some adversity, we've had some trials, but we faint not. Now notice the rest of verse number 16, But though our outward man perish, and here's the key, yet the inward man is renewed day by day.",
      "context": "... faint not. We see now in verse number 16 that he says, For which cause we faint not. Now remember, Proverbs 24 and verse 10, If we faint in the day of adversity, our strength is small. Paul says twice here, we ...",
      "sermon_title": "Sermon EoTOjgo0SqY",
      "url": "https://www.youtube.com/watch?v=EoTOjgo0SqY&t=2016",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "0lpK3XY3NtI",
      "timestamp": 862.9200134277344,
      "text": "the book of Ephesians, that it helps us to understand how Paul prayed for these believers. We do not have the time to outline the entire prayer that is given here in Ephesians three, verses 14 through 21. But I do want to jump into the middle of the prayer in verse number 16 and notice with regard to the subject that we're dealing with, this being strengthened in the inner man, notice what it says in verse 16. That he, speaking of the Lord, would grant you according to the riches of his glory, notice, to be strengthened with might by his spirit in the inner man. That's what we need. That's Ephesians three in verse 16. And so that's what we need. We need to be strengthened in the inner man by his spirit to have that strength that we can go forward. Again, it's not physical strength, it's spiritual strength that we need. And we find that the book of Proverbs, it says this in Proverbs 24 in verse number 10, if thou faint in the day of adversity, thy strength is small. And so we see that verse in Proverbs 24 in verse number 10. And again, I do not, yes, you could look at that from a physical strength perspective and you could understand that there's certainly an application with that. But I look at it from a spiritual perspective. Listen, there's going to be adversity that you face. You can guarantee when you decide",
      "context": "...ength, it's spiritual strength that we need. And we find that the book of Proverbs, it says this in Proverbs 24 in verse number 10, if thou faint in the day of adversity, thy strength is small. And so we see tha...",
      "sermon_title": "Sermon 0lpK3XY3NtI",
      "url": "https://www.youtube.com/watch?v=0lpK3XY3NtI&t=862",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}