{
  "reference": "Revelation 2",
  "occurrences": [
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2063.7200317382812,
      "text": "to help your wife have time with God because it's going to help your home. It's busy. I get it. And so as a wife, helping your husband, he's got a job and responsibilities, the time with God is important. We find this evening that idolatry there in Israel, introduced by Dan. I believe it's very prophetic what we read in Genesis 49. It is of interest when we think about Dan, some have noted and perhaps you've seen it before as well, that if you look at Revelation chapter 7 and verses 1 through 8, Dan as a tribe is not mentioned. We find also that in 1 Chronicles chapters 2 through 10, there's a chronological order that is given of the tribes, and you'll notice that in that portion of Scripture that Dan also is missing from there. Now it's interesting if you understand the timeline of the book of Revelation, and this isn't a lesson on the book of Revelation, but, but Revelation chapter 7 is in the midst of the tribulation. All right? The rapture's already taken place. The church age as we know it has ceased to exist. We see that in Revelation 2 and 3 with the church age. Chapter 4, I believe, is a picture of the rapture and the timing of the rapture. And then you begin to see the throne room of heaven. You begin to start seeing",
      "context": "...The rapture's already taken place. The church age as we know it has ceased to exist. We see that in Revelation 2 and 3 with the church age. Chapter 4, I believe, is a picture of the rapture and the timing of the ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2063",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "d7fsLPs8FTY",
      "timestamp": 2121.8800354003906,
      "text": "know it has ceased to exist. We see that in Revelation 2 and 3 with the church age. Chapter 4, I believe, is a picture of the rapture and the timing of the rapture. And then you begin to see the throne room of heaven. You begin to start seeing the judgments that are beginning to be poured out in chapter 6 and so on and so forth with regard to the judgments. And we find in chapter number 7 of the book of Revelation, it's still in the midst of the tribulation. So Dan is not mentioned in that portion of Scripture. Many people have sought to try to answer the question why that is. I don't know exactly. God doesn't tell us specifically. But it could possibly be that because of their introduction of idolatry into the nation, that they're missing, they're absent in Revelation chapter number 7. But I will say this, it's of note that in Ezekiel chapter 48, in verses 1 and 2, we find that Dan is included in the list of the tribes. And why is that interesting? Well, because that's a prophetic view of the millennium. And I think that's of interest because, again, when we look at Genesis chapter 49, we find that the process and all that's taking place, the purpose of this whole scene that is given to us, but then the prophetic",
      "context": "know it has ceased to exist. We see that in Revelation 2 and 3 with the church age. Chapter 4, I believe, is a picture of the rapture and the timing of the ...",
      "sermon_title": "Sermon d7fsLPs8FTY",
      "url": "https://www.youtube.com/watch?v=d7fsLPs8FTY&t=2121",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}