{
  "reference": "Revelation 17",
  "occurrences": [
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 1749.0399780273438,
      "text": "word conversation is used in our Bibles in 1st Peter, that we're to walk in humility, excuse me, in holiness in all manner of conversation. What that word means is behavior, our lifestyle. But you know that's normally not how we use the word conversation today. We use the word conversation that, hey, before service Armando and I had a conversation. That's how we use the word. So the word, because language kind of evolves, in fact if you get a dictionary today and you start looking up words, what usage or what definition is provided first in a dictionary is the one that's most commonly used at the time of the writing of the dictionary. So in other words, when you're looking up words in the Bible, it's better to get an older dictionary than a newer dictionary. That's why I recommend the 1828 Noah Webster's Dictionary. Why? Because almost always the first definition given for a word in that dictionary is the definition that we're to go by here in God's Word. And so symbolism is outside of that aspect. of language being weakened over time, and I think, listen, it's the wisdom of God to use these symbols. By the way, the Bible talks about, I believe it's in Revelation 17 here, I didn't jot it down, where it talks about the woman that was drunk with the blood of the martyrs. That's a little bit different than just saying somebody's evil, or they're wicked.",
      "context": "..., it's the wisdom of God to use these symbols. By the way, the Bible talks about, I believe it's in Revelation 17 here, I didn't jot it down, where it talks about the woman that was drunk with the blood of the mar...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=1749",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 1827.039960861206,
      "text": "use these symbols. By the way, the Bible talks about, I believe it's in Revelation 17 here, I didn't jot it down, where it talks about the woman that was drunk with the blood of the martyrs. That's a little bit different than just saying somebody's evil, or they're wicked. It gives to us a depth, and we see how God uses the symbolism throughout the book of Revelation. So we see the purpose, number two, if you're taking notes. Notice with me in verse number two, the precise record of the book. We see the purpose of the book, but I want you to notice the precise record. We find that in verse number two, it's very interesting to me how God uses and records this for us to help us as the readers, and those that are studying it. It says, speaking about the fact that the angel signified unto his servant John, notice in verse two, who bear record of the word of God, and of the testimony of Jesus Christ, and of all things that he saw. We find that, of course, I mentioned already in verse number one, that the truth of inspiration is clearly seen, that all scripture is given by inspiration of God, but we find that as we come to verse number two, and we think about the precise record, you think about precision, and you think about somebody being precise. Listen, John was not just being haphazardly",
      "context": "use these symbols. By the way, the Bible talks about, I believe it's in Revelation 17 here, I didn't jot it down, where it talks about the woman that was drunk with the blood of the mar...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=1827",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}