{
  "reference": "Revelation 1",
  "occurrences": [
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 722.2200012207031,
      "text": "so, that they were subject to this severe persecution. John is therefore, as we read and we understand the historical aspects, in fact, in verse number nine, we read this truth, that John is therefore exiled to the island Patmos. That island is a small island in the Aegean Sea, which is in the southwest, it's located southwest of Ephesus, and we find that it is with this backdrop that God gives this book of Revelation. Now, I hope, and just, it's a simple thing, but it's an important thing. Sometimes in the top of the Bible that you might have, it might say the Revelation of John the Apostle. This is not the Revelation of John, it is the Revelation of Jesus Christ. Okay, so if your Bible says that in the top, sometimes it will say the book name or whatever, so mine says the Revelation to John. And I'm okay with that, because it's the Revelation to John. It is not the Revelation of John, it is the Revelation of Jesus Christ. We see that in verse number one. Notice with me this evening, as we look at these just first three verses, introductory into the book of Revelation. The Bible says this in Revelation 1.1. The revelation of Jesus Christ, which God gave unto him to show unto his servants things which must shortly come to pass. And he sent and signified it by his angel unto his servant John,",
      "context": "... at these just first three verses, introductory into the book of Revelation. The Bible says this in Revelation 1.1. The revelation of Jesus Christ, which God gave unto him to show unto his servants things which m...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=722",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 795.3000030517578,
      "text": "three verses, introductory into the book of Revelation. The Bible says this in Revelation 1.1. The revelation of Jesus Christ, which God gave unto him to show unto his servants things which must shortly come to pass. And he sent and signified it by his angel unto his servant John, who bear record of the word of God and of the testimony of Jesus Christ and of all things that he saw. Blessed is he that readeth, and they that hear the words of this prophecy and keep those things which are written therein for the time is at hand. If you're taking notes, I've titled the message very simply this evening, the Revelation of Jesus Christ. Number one, as we look at verse number one, we see the purpose of the book. God reveals to us in this singular verse of Scripture the purpose of this book. And we find first and foremost, it is the revelation of Jesus Christ. The word revelation literally means an unveiling, to lift the veil, to reveal something. And we find that first and foremost, this book, the book of Revelation, is the unveiling of Jesus Christ. We find that throughout the book of Revelation, we see the glory of Jesus Christ. And what a joy. We understand that as we read through the book of Revelation, this is the book that reveals to us how Jesus is going to come back to this earth.",
      "context": "three verses, introductory into the book of Revelation. The Bible says this in Revelation 1.1. The revelation of Jesus Christ, which God gave unto him to show unto his servants things which m...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=795",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 2027.8599548339844,
      "text": "If there's a place where there's a silent area, I don't need to try to put my opinion in there. I don't need to try to add things in there. He gave a good record. He put down what God gave him, and he put down accurately, and with precision, he gave us this record, and of course, God has preserved it, and it says, and of all things that he saw. Notice with me, look over at verse 19 here in Revelation 1. The Bible says this. Write the things which thou hast seen, and the things which are, and the things which shall be hereafter. It's an interesting verse of scripture because it deals with really all the aspects of past, present, and future. He says, write down the things which thou hast seen, past, and the things which are, present, and the things which shall be, future, hereafter. And John was faithful to bear record of the word of God, and of the testimony of Jesus Christ, and of all things that he saw. That should cause us to rejoice this evening. Should cause us to have a measure of confidence this evening. We find the purpose, we find the precise record. I want you to notice number three. There's a promise of blessing. A promise of blessing. Verse three is a great verse of scripture that I would submit to you is a verse that is obviously applicable to this book of Revelation,",
      "context": "...erved it, and it says, and of all things that he saw. Notice with me, look over at verse 19 here in Revelation 1. The Bible says this. Write the things which thou hast seen, and the things which are, and the thin...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=2027",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "e8NqM-KyHng",
      "timestamp": 2741.6399841308594,
      "text": "unto Him, Prophesy. And the servants did strike Him with the palms of their hands. Can I tell you from verse number 65 that Jesus knew the exact names of the people that hit Him when they did? And wouldn't it have been something if Jesus started calling out their names? Because He's God. Caiaphas was beside himself when He asked Him plainly, Are you the Christ, the Son of the Blessed? I am. I am. Notice in Revelation 1, and I know this isn't the Gospels, but I want you to see what the Apostle John is writing to us in Revelation 1. I am nearing the end. In Revelation 1, we understand that the book of Revelation and perhaps the title in your Bible says, The Revelation to John, and that should be proper. If it says, The Revelation of John, it almost gives the idea that John's giving this revelation, but it's the revelation to John because it's the revelation of Jesus Christ, according to verse number 1. There's a difference there. It says this, The Revelation of Jesus Christ, which God gave unto Him to show unto His servant things which must shortly come to pass. We don't have time to read all of it. Notice in verse number 2, it says, Who bear record of the word of God, and of the testimony of Jesus Christ, and of all things that He saw. Notice what Jesus says. We know that He's speaking about Jesus. In",
      "context": "...imself when He asked Him plainly, Are you the Christ, the Son of the Blessed? I am. I am. Notice in Revelation 1, and I know this isn't the Gospels, but I want you to see what the Apostle John is writing to us in...",
      "sermon_title": "Sermon e8NqM-KyHng",
      "url": "https://www.youtube.com/watch?v=e8NqM-KyHng&t=2741",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}