{
  "reference": "Revelation 13",
  "occurrences": [
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 1252.3599853515625,
      "text": "son that we may eat him today. I can't even begin to comprehend that. I can't. And we will eat my son tomorrow. Verse 29, So we boiled my son. Again, I can't even begin to comprehend. And did eat him. And I said unto her on the next day, Give thy son that we may eat him. And she hath hid her son. That's crazy. Desperate times, people do crazy things. Seriously. Did you see what happened in 2020? People did some crazy things. I mean crazy things. The Bible tells us in Revelation 13, that during the tribulation, people are going to take this mark of the beast. Now, we're not going to be here. If you're saved, you're not going to be here. Amen? What a blessing. But understand, they're going to take this mark of the beast. Why? Well, notice what the Bible says. I'm going to read it to you in Revelation 13, in verse 16 and 17. It's very plain. And you see what's happening here. Revelation 13, this is the midpoint of the tribulation. And it says in Revelation 13, in verse 16, And he causeth all, both small and great, rich and poor, free and bond, to receive a mark in their right hand or in their foreheads. And that no man, notice what it says, might buy or sell, save he that had the mark, or the name of the beast, or the number of his name.",
      "context": "...see what happened in 2020? People did some crazy things. I mean crazy things. The Bible tells us in Revelation 13, that during the tribulation, people are going to take this mark of the beast. Now, we're not going...",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=1252",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "MPv8bPsuptg",
      "timestamp": 1332.3599853515625,
      "text": "and great, rich and poor, free and bond, to receive a mark in their right hand or in their foreheads. And that no man, notice what it says, might buy or sell, save he that had the mark, or the name of the beast, or the number of his name. So we're just going to say, you can't buy or sell, unless you have this. You know, people are going to get it. Because they're going to be desperate. There may be some people that say, yeah, I'm not going to do that. They get hungry enough. I think there are going to be people that line up and say, do you want to put it here or here? You can do both if you want. Honestly. People are going to do crazy stuff. Why are we saying that? Well, we see what happens in Egypt during this great famine. We see what happens in Israel in 2 Kings 6. We understand what's going to happen in Revelation 13. And as we begin to think about our lives and think about where we are, there are going to be some things that we face. We've got to keep our eyes on the Lord. Keep our eyes on the Lord. People do crazy stuff during times of desperation. It's interesting to me as you read chapter 47, the distinction in Genesis 47 between what's happening with the children of Israel and what's happening with the Egyptians.",
      "context": "...s great famine. We see what happens in Israel in 2 Kings 6. We understand what's going to happen in Revelation 13. And as we begin to think about our lives and think about where we are, there are going to be some ...",
      "sermon_title": "Sermon MPv8bPsuptg",
      "url": "https://www.youtube.com/watch?v=MPv8bPsuptg&t=1332",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}