{
  "reference": "Revelation 22",
  "occurrences": [
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 2168.8599548339844,
      "text": "that is applicable to all of scripture, it's only found in the way that it's given to us here in the book of Revelation. In other words, in this concise statement. Notice what the Bible says in verse number three. Blessed is he that readeth. Blessed is he that readeth. Now let me ask you, is that singular or plural? It's singular. Blessed is he that readeth. So in other words, when I come to verse number three, here's what I'm understanding that God is seeking to communicate to us as his people, that as individual believers, I ought to read the book of Revelation. Not only the book of Revelation, but the whole of scripture, because there's a blessing in reading the word of God. And so we find that he says, blessed is he that readeth. You know, there are some denominations that absolutely flat out ignore the entire book of Revelation. It's as if it's not even part of the Bible. But it's in this book in the opening statements that say, blessed is he that readeth. And so there's an expectation that God communicates to me, and I hope to you this evening, that God expects his people to read his word. Yes, the book of Revelation, as it's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it stop there?",
      "context": "...t's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it stop there?",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=2168",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "E-g-Sq7N4Bg",
      "timestamp": 2247.2599487304688,
      "text": "God expects his people to read his word. Yes, the book of Revelation, as it's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it stop there? Notice, and they, now that's plural, that hear the words of this prophecy. Now, that's kind of interesting, because it's the blessed is he that readeth, so that's an individual reading, but then it says, and they, plural, that hear the words of this prophecy. Now, how do you hear the words of the prophecy? Somebody else publicly reading it or preaching it, right? That's how, you're hearing it tonight, because I'm reading it, so you're hearing it. Now, you're following along in your Bible, so you're getting a double blessing, amen? You're reading it and you're hearing it, praise the Lord. And it says, so again, if the expectation in verse number three in the beginning part of the verse is that God's people would read it, the expectation also is that the people of God would gather together and hear the word of God. You ever read the book of Ezra? Man, they gathered together for a big part of the day. Why? To hear the word of the Lord. He stood up on a pulpit of wood, amen? And he just read. Now, they confessed, but they read publicly. The reading of God's word is so important.",
      "context": "...t's contained here in verse number three, but I believe that it's applicable to Genesis 1-1 through Revelation 22-21, that there is a blessing in reading God's word. What a joy. But does it stop there? Notice, and...",
      "sermon_title": "Sermon E-g-Sq7N4Bg",
      "url": "https://www.youtube.com/watch?v=E-g-Sq7N4Bg&t=2247",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "UpbuU9BS4yg",
      "timestamp": 1865.4400024414062,
      "text": "with the fact that the Bible is pure and also deals with the truth that we mentioned about verbal plenary inspiration. The Bible says this in Proverbs 30 and verse number 5, every word of God is pure. He is a shield unto them that put their trust in Him. The psalmist says this in Psalm 119 and verse number 140, thy word is very pure, therefore thy servant loveth it. Whew, man, it's a pure book. Everything that is contained within the pages of this Bible from Genesis 1-1 through Revelation 22-21, it is absolutely pure in everything that is contained therein. And we look at the Bible and we understand that the Bible says that all Scripture is given by inspiration of God. And because it is the word of God, it's pure. There are some that say they don't agree with what God's word is. So then they have difficulty with what God's word says because they don't agree with what God's word is. We talk about the word of God being pure, the Bible being pure. It is pure in all that it records. The record that is provided is reliable. It is trustworthy. How do we know what happened? We dealt with Hezekiah a couple of weeks ago. How do we know what Sennacherib and Rabshakeh really said? How do we know if it's true? How do we know if Hezekiah didn't just make something up, if Isaiah was just making something up?",
      "context": "...s a pure book. Everything that is contained within the pages of this Bible from Genesis 1-1 through Revelation 22-21, it is absolutely pure in everything that is contained therein. And we look at the Bible and we ...",
      "sermon_title": "Sermon UpbuU9BS4yg",
      "url": "https://www.youtube.com/watch?v=UpbuU9BS4yg&t=1865",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "LgYZtFLVeXk",
      "timestamp": 1671.9000244140625,
      "text": "say proving. It's that work, and we dig into the Scriptures, and we're seeking to prove what is acceptable unto the Lord. What is well-pleasing to God? Well in our journey of doing this, as we have the opportunity to go through and to study the Scriptures, we have many examples that God has given us with regard to things that please Him and things that do not please Him. In fact, there's a great example of something that does not please Him. We mentioned already in Romans 8 about walking in the flesh, but notice, if you will, in 1 Corinthians chapter number 10. In 1 Corinthians chapter number 10, the Bible tells us, as God is using Paul to minister to these believers in Corinth, and he's going back to the Old Testament and says, in fact, in the text of Scripture that the things that were written aforetime are written for our admonition. I'm so thankful that God chose to preserve the Old Testament. The Old Testament, listen, all Scripture is given by inspiration of God. That means from Genesis 1-1 to Revelation 22-21, amen? All of it is inspired by God, and it is profitable. So I don't, a certain portion of the Scripture, I don't like reading. You ought to get that right with the Lord, amen? Because it's God's Word to you, and He has preserved it for a reason, and Paul says it was written for our admonition. The things that he",
      "context": "...Old Testament, listen, all Scripture is given by inspiration of God. That means from Genesis 1-1 to Revelation 22-21, amen? All of it is inspired by God, and it is profitable. So I don't, a certain portion of the ...",
      "sermon_title": "Sermon LgYZtFLVeXk",
      "url": "https://www.youtube.com/watch?v=LgYZtFLVeXk&t=1671",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}