{
  "reference": "Romans 8",
  "occurrences": [
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1287.7000350952148,
      "text": "I am so thankful for sin shall not have dominion over you. Listen, you can be victorious. Actually, we're going to get to that in just a moment. We don't have to have that mentality of just, well, it's just what I am. It's just how I... No, no, no. Sin no longer has dominion over us. And I'm so thankful for that. Victory through Christ. Number seven, if you're taking notes, victory through Christ. We mentioned this morning, we spoke about the person, who He is, and we spoke about the fact that He is victorious. I'm thankful that His victory enables me to have victory. We're here in Romans 6. Look over in Romans 7, if you will, and look at verses 24 and 25. Paul cries out almost in despair, if you will, in verse number 24, and he says this, \"'Oh, wretched man that I am! \"'Who shall deliver me from the body of this death?' What does he say? \"'I thank God through Jesus Christ our Lord.' \"'So then with the mind I myself serve the law of God, \"'but with the flesh the law of sin.'\" And he says, I'm thankful to God. Listen, it's God that will give me the victory. It is God that will enable me to live the victorious Christian life. In Romans 8, in verse number 37, again, maybe a page over in your Bible, it says this, \"'Nay, in all these things we are more than conquerors.",
      "context": "...t will give me the victory. It is God that will enable me to live the victorious Christian life. In Romans 8, in verse number 37, again, maybe a page over in your Bible, it says this, \"'Nay, in all these thin...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1287",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1355.0400390625,
      "text": "Listen, it's God that will give me the victory. It is God that will enable me to live the victorious Christian life. In Romans 8, in verse number 37, again, maybe a page over in your Bible, it says this, \"'Nay, in all these things we are more than conquerors. \"'Through Him that loved us.'\" What a joy to have victory through Christ. To know that we can have the victory. To know that we can live a life not of defeat, but a life of victory. A life of victory. Victory through Christ. We sing the song, Victory in Jesus. That's a great song, isn't it? And you think about so many songs that we can reference as we look at our hymnal, and I'm thankful I've made mention of several of them today throughout the messages, and what a blessing it is to have the great hymns of the faith that reinforce biblical teaching and Bible doctrine, and we understand this evening that we have victory through Jesus. And I'm thankful for that tonight. I want to cause you to think about His work in us. Number eight, if you're taking notes, I'm thankful for this promise. He promised that He would work in us. I'm thankful that He's working in me. I'm thankful that He's working in you. I mentioned this morning that little song, that little chorus that we sing with the kids, that He's still working on me",
      "context": "...t will give me the victory. It is God that will enable me to live the victorious Christian life. In Romans 8, in verse number 37, again, maybe a page over in your Bible, it says this, \"'Nay, in all these thin...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1355",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1426.1600341796875,
      "text": "notes, I'm thankful for this promise. He promised that He would work in us. I'm thankful that He's working in me. I'm thankful that He's working in you. I mentioned this morning that little song, that little chorus that we sing with the kids, that He's still working on me to make me what I ought to be. And I'm thankful for His work in me, and I'm thankful that He's promised to do so. Notice in Ephesians 2, a verse of Scripture that we often are familiar with as we think about verses eight and nine, for by grace are you saved through faith, and that not of yourselves is the gift of God, not of works, lest any man should boast. We find that the thought really doesn't end in verse number nine, it carries into verse number 10, and we think about the truth that He promised to save us. Listen, if He was done with us at the moment of salvation, He'd just go ahead and take us to heaven, amen? And listen, on some days, maybe we'd wonder if it might not be better if we just went ahead and went to heaven, you know? But the reality is that He's doing a work in us. And the purpose of that work in us, according to Romans 8, is that we would be conformed to the image of His dear Son. It's the process of sanctification.",
      "context": "...? But the reality is that He's doing a work in us. And the purpose of that work in us, according to Romans 8, is that we would be conformed to the image of His dear Son. It's the process of sanctification.",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1426",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1489.8800354003906,
      "text": "just went ahead and went to heaven, you know? But the reality is that He's doing a work in us. And the purpose of that work in us, according to Romans 8, is that we would be conformed to the image of His dear Son. It's the process of sanctification. And here we find in Ephesians 2, in verse number 10, He says, we are His workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them, in those good works. Think about that, we are His workmanship. In the Old Testament, the Bible uses the picture, the analogy of Him being the potter and we being the clay. Isn't that great imagery? How many of you ever made anything on a potter's wheel? Anyone, a few of you? I had the privilege of the only art class I ever took in high school that I enjoyed, amen? You put some paint in front of me, you put a pencil or some kind of coloring instrument in front of me, it's a mess, man. I am not artistic at all. And they said, well, you know, Chris, you have to take some art class. Are you kidding me? I need art to graduate? Yep, yep, you need to take an art class. And I was able to take pottery. I had no idea how that was gonna work, but I actually loved pottery. It was an enjoyable class.",
      "context": "...? But the reality is that He's doing a work in us. And the purpose of that work in us, according to Romans 8, is that we would be conformed to the image of His dear Son. It's the process of sanctification. An...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1489",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 938.0,
      "text": "the Bible says, Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it in the lust thereof, neither yield ye your members as instruments of unrighteousness unto sin, but yield yourselves unto God as those that are alive from the dead, and your members as instruments of righteousness unto God. Because we're saved, we now can yield ourselves unto God. Notice the truth of verse 14, for sin shall not have dominion over you, for you're not under the law, but under grace. And I'm so thankful, notice Romans 8 and verse number 2, where the Bible says, for the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death. And I'm no longer bound by the power of sin. We understand that the Bible teaches us that our flesh still has an appetite and still has a desire. The Bible tells us in Galatians 5 that the Spirit is at enmity, or the flesh is at enmity with the Spirit, they're contrary one to the other. And it says, the flesh lusteth against the Spirit and the Spirit against the flesh, and these are contrary the one to the other, so that you cannot do the things that you would. So what's the answer? Walk in the Spirit, that you should not fulfill the lust of the flesh.",
      "context": "... have dominion over you, for you're not under the law, but under grace. And I'm so thankful, notice Romans 8 and verse number 2, where the Bible says, for the law of the Spirit of life in Christ Jesus hath ma...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=938",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}