{
  "reference": "Romans 6",
  "occurrences": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2496.760040283203,
      "text": "to influence the congregation to go and believe God, and they were ready to stone those guys. God says, how long will it be are my people believe me? Trust me, that we have confidence in God. See, it says that this man, Nebuchadnezzar, he recognized that these servants were delivered, but it was a result that they trusted in him, and then notice this, and have changed the king's word, and yielded their bodies, that they might not serve nor worship any God except their own God. It impacted Nebuchadnezzar. He said, these guys trusted in God, they yielded their bodies. It's interesting if you were to go and maybe jot it down in your notes to read Romans 6 about who we yield ourselves to. We are to yield ourselves unto the Lord, and we find that these men, they yielded themselves. It's interesting if you look in Romans 6 and you read the references with regard to the word yield or yielded, it's the same Greek word that is used in Romans 12 when he says that you would present your bodies a living sacrifice. Same exact Greek word. So, yielding and presenting our bodies to God, and see what God is able to do. He said, I'm not interested in signing up for all that. I don't want to be a martyr. Neither do I. I mean, honestly, I don't want to face, I don't want to go to prison. I don't want",
      "context": "...ielded their bodies. It's interesting if you were to go and maybe jot it down in your notes to read Romans 6 about who we yield ourselves to. We are to yield ourselves unto the Lord, and we find that these me...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2496",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1078.0400390625,
      "text": "Jesus says, My sheep hear My voice, and I know them, and they follow Me. And I give unto them eternal life. Eternal life. He didn't say I give unto them temporary life. He didn't say I give unto them probationary life. He said I give unto them eternal life. And they shall never perish. Neither shall any man pluck them out of My hand. My Father which gave them Me is greater than all, and no man is able to pluck them out of My Father's hand. I and My Father are one. I'm thankful that He's given us this promise here. We understand that, as we mentioned in Romans 6, that the gift of God is eternal life through Jesus Christ our Lord. Here He says My sheep, they hear My voice, and I know them, they follow Me. And here's what I give them. I give them eternal life. They shall never perish. I'm so thankful, 1 Peter 1 and verse number 5, jot it down in your notes. It tells us that we are kept by the power of God. Listen, I couldn't earn my salvation and neither could you, and I can't keep my salvation and neither can you. Amen? I'm kept by the power of God. These promises, we think about the promise that He said that He would save us, He empowers us, He keeps us. He tells us this, that sin no longer has dominion over us.",
      "context": "... are one. I'm thankful that He's given us this promise here. We understand that, as we mentioned in Romans 6, that the gift of God is eternal life through Jesus Christ our Lord. Here He says My sheep, they he...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1078",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1149.1000366210938,
      "text": "I can't keep my salvation and neither can you. Amen? I'm kept by the power of God. These promises, we think about the promise that He said that He would save us, He empowers us, He keeps us. He tells us this, that sin no longer has dominion over us. That caused me to rejoice greatly. Turn to Romans 6, if you will, and you think about this truth of being saved, being a child of God. Understand that the Spirit of God now lives within you. He empowers you, that He's keeping you. We find that He tells us, listen, sin no longer has dominion over you. You understand that prior to salvation, you were controlled by sin, you were entangled by sin, you were bound by sin. But after salvation, the Bible says that sin no longer has dominion over us. It says this in Romans 6 and verse number 14, for sin shall not have dominion over you, for you're not under the law, but under grace. God, you're so thankful that sin no longer has dominion over you. You know what happens sometimes? We get mad about things that happen in the world. I was talking to someone not long ago and they were kind of sharing some things with me and mentioned all sorts of things and I just kind of paused and said, listen, let me ask you a question. Why is it that they behave the way that they behave?",
      "context": "... tells us this, that sin no longer has dominion over us. That caused me to rejoice greatly. Turn to Romans 6, if you will, and you think about this truth of being saved, being a child of God. Understand that ...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1149",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "EetmC5JSFHc",
      "timestamp": 1287.7000350952148,
      "text": "I am so thankful for sin shall not have dominion over you. Listen, you can be victorious. Actually, we're going to get to that in just a moment. We don't have to have that mentality of just, well, it's just what I am. It's just how I... No, no, no. Sin no longer has dominion over us. And I'm so thankful for that. Victory through Christ. Number seven, if you're taking notes, victory through Christ. We mentioned this morning, we spoke about the person, who He is, and we spoke about the fact that He is victorious. I'm thankful that His victory enables me to have victory. We're here in Romans 6. Look over in Romans 7, if you will, and look at verses 24 and 25. Paul cries out almost in despair, if you will, in verse number 24, and he says this, \"'Oh, wretched man that I am! \"'Who shall deliver me from the body of this death?' What does he say? \"'I thank God through Jesus Christ our Lord.' \"'So then with the mind I myself serve the law of God, \"'but with the flesh the law of sin.'\" And he says, I'm thankful to God. Listen, it's God that will give me the victory. It is God that will enable me to live the victorious Christian life. In Romans 8, in verse number 37, again, maybe a page over in your Bible, it says this, \"'Nay, in all these things we are more than conquerors.",
      "context": "...fact that He is victorious. I'm thankful that His victory enables me to have victory. We're here in Romans 6. Look over in Romans 7, if you will, and look at verses 24 and 25. Paul cries out almost in despair...",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc&t=1287",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 865.9400024414062,
      "text": "and when the enemy tempts us, we're asking that God would deliver us from evil. You know, the reality is that if we're saved this evening, if you've trusted Christ as your Savior, that you're no longer bound by sin. Sin no longer has dominion over us. When we were lost before we trusted Christ as our Savior, the Bible describes us in a number of ways, but one way in which it describes us is that we were dead in our sins, in our trespasses. And we are not a sinner because we sin, rather we sin because we're sinners. We're born sinners, and therefore it's the outworking of being a sinner is that we sin, and we understand that we're dead in our sins and our trespasses, that we, apart from the deliverance that God provides through Calvary, we are bound by that sin. Notice what God says in Romans chapter 6 as Paul is speaking to the believers here and trying to help them understand this truth of being delivered from the very power of sin. The Bible says in Romans 6, and we'll pick it up in verse 12. Romans 6 and verse 12, the Bible says, Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it in the lust thereof, neither yield ye your members as instruments of unrighteousness unto sin, but yield yourselves unto God as those that are alive from the dead, and your",
      "context": "...to help them understand this truth of being delivered from the very power of sin. The Bible says in Romans 6, and we'll pick it up in verse 12. Romans 6 and verse 12, the Bible says, Romans 6 12, let not sin ...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=865",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "nS3pAoxKMb4",
      "timestamp": 938.0,
      "text": "the Bible says, Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it in the lust thereof, neither yield ye your members as instruments of unrighteousness unto sin, but yield yourselves unto God as those that are alive from the dead, and your members as instruments of righteousness unto God. Because we're saved, we now can yield ourselves unto God. Notice the truth of verse 14, for sin shall not have dominion over you, for you're not under the law, but under grace. And I'm so thankful, notice Romans 8 and verse number 2, where the Bible says, for the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death. And I'm no longer bound by the power of sin. We understand that the Bible teaches us that our flesh still has an appetite and still has a desire. The Bible tells us in Galatians 5 that the Spirit is at enmity, or the flesh is at enmity with the Spirit, they're contrary one to the other. And it says, the flesh lusteth against the Spirit and the Spirit against the flesh, and these are contrary the one to the other, so that you cannot do the things that you would. So what's the answer? Walk in the Spirit, that you should not fulfill the lust of the flesh.",
      "context": "the Bible says, Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it in the lust thereof, n...",
      "sermon_title": "Sermon nS3pAoxKMb4",
      "url": "https://www.youtube.com/watch?v=nS3pAoxKMb4&t=938",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "WhaPo-g3nqA",
      "timestamp": 2078.179962158203,
      "text": "morning that both salvation and sanctification are of Christ. It's of Christ. Sometimes what happens is we are saved, for by grace we are saved through faith. We understand that salvation is all of Christ. Right? There's nothing I can do. I can't save myself. But somehow we get to the point that we think sanctification is about me. And I'm trying, trying, trying, this process of sanctification, and I'm really trying in my own flesh. Do you remember what Paul said in Romans chapter number 7? He said, the things that I would, I do not. The things that I would not, that I do. Right? Paul's saying, I got this struggle going on, and I have this difficulty and all of this that's going on. And he says, who shall deliver me? And he says, I thank God through Christ Jesus. Listen, sanctification is about the work of the Holy Spirit of God, the work of Christ in us. It's not me trying, it's me yielding. Right? And as I yield my members, as he says there in Romans 6, 7, and 8, and you read those passages of Scripture and you see how Paul is really giving a great dissortation on the subject of sanctification there in the middle of the book of Romans, here we find that John is just simply talking about stating here quickly the subject of sanctification and the work that Christ does in us. Noah Webster in his 1828 Webster's Dictionary defines",
      "context": "... in us. It's not me trying, it's me yielding. Right? And as I yield my members, as he says there in Romans 6, 7, and 8, and you read those passages of Scripture and you see how Paul is really giving a great d...",
      "sermon_title": "Sermon WhaPo-g3nqA",
      "url": "https://www.youtube.com/watch?v=WhaPo-g3nqA&t=2078",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}