{
  "reference": "Romans 4",
  "occurrences": [
    {
      "sermon_id": "TJvBj1CQhW4",
      "timestamp": 896.1799926757812,
      "text": "Bible says in Galatians 3 and 6, even as Abraham believed God, and it was accounted to him for righteousness. Again, that event in Genesis 15 predates the communication between God and Abraham that we're studying in Genesis 17 with regard to the token of the covenant, that of circumcision. Look back in Romans 4 and look down at verse number 9, if you will. The Bible says this, \"...cometh this blessedness then upon the circumcision only, or upon the uncircumcision also? For we say that faith was reckoned to Abraham for righteousness.\" How was it then reckoned? When he was in circumcision or in uncircumcision? Not in circumcision, but in uncircumcision. Why? Again, Genesis 15 versus Genesis 17, the chronological order of these events in the life of Abraham, and again in verse number 11 it says, \"...and he received the sign of circumcision, a seal of the righteousness of the faith which he had, yet being uncircumcised, that he might be the father of all them that believe, though they be not circumcised, that righteousness might be imputed unto them also.\" Paul, of course, as I mentioned already, the event in Acts chapter number 15, he dealt with it quite extensively in the book of Galatians, and we find that Paul would summarize it this way in the book of Galatians, and he would say, \"...for in Christ Jesus neither circumcision availeth anything, nor uncircumcision, but a new creature.\"",
      "context": "...studying in Genesis 17 with regard to the token of the covenant, that of circumcision. Look back in Romans 4 and look down at verse number 9, if you will. The Bible says this, \"...cometh this blessedness then...",
      "sermon_title": "Sermon TJvBj1CQhW4",
      "url": "https://www.youtube.com/watch?v=TJvBj1CQhW4&t=896",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 2076.5599670410156,
      "text": "I don't have any seed, I don't have a son. God, what are you going to do? How are you going to do this? This one that's been born in my house, and he says, here's what I'm going to do. Here's my promise. And Abram believes in the Lord. He takes God in his word. And it says this, and he counted it to him for righteousness. Wow, what a powerful truth of the Word of God. And as we look at this statement at the end of Genesis 15 and verse number 6, our minds will race to the New Testament in which this particular truth is referenced on at least two occasions. And I want you to think about what God is saying here. We see the faith of Abram where he believed in the Lord, but then we see the response of that, the way in which God would respond. And it says that he counted it to him for righteousness. Go over to the book of Romans if you will. In Romans chapter number 4, look at the first three verses of Romans chapter number 4. The Bible says this in verse number 1 of Romans 4, What shall we say then that Abraham our father, as pertaining to the flesh, hath found? For if Abraham were justified by works, he hath whereof to glory, but not before God. Now, it's interesting when you read verse number 2 there",
      "context": "...look at the first three verses of Romans chapter number 4. The Bible says this in verse number 1 of Romans 4, What shall we say then that Abraham our father, as pertaining to the flesh, hath found? For if Abr...",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=2076",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 2166.47998046875,
      "text": "this in verse number 1 of Romans 4, What shall we say then that Abraham our father, as pertaining to the flesh, hath found? For if Abraham were justified by works, he hath whereof to glory, but not before God. Now, it's interesting when you read verse number 2 there and you consider it with the truth that God gives us in Ephesians 2, verses 8 and 9, in verse number 9 in particular, where the Bible says, lest any man should boast. Because the Bible says in Ephesians 2, 8 and 9, For by grace are you saved through faith, and that not of yourselves, it is the gift of God, not of works, lest any man should boast. What is he saying by that? Well, if I could work my way to heaven, I have whereof to glory, to boast. And so in verse number 2 of Romans 4, here's what Paul is saying to these believers. He says, if Abraham were justified by works, he hath whereof to glory, but not before God. What is he meaning? Well, he did enough good things to get to heaven. But you understand you can't do enough good things to get to heaven. Because the Bible says that the gift of God is eternal life through Jesus Christ our Lord, not by works of righteousness, which we have done in Titus 3 and verse number 5. We just looked at Ephesians 2, 8 and 9. The Bible is abundantly clear",
      "context": "this in verse number 1 of Romans 4, What shall we say then that Abraham our father, as pertaining to the flesh, hath found? For if Abr...",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=2166",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}