{
  "reference": "Romans 12",
  "occurrences": [
    {
      "sermon_id": "KVAB3-ajXLM",
      "timestamp": 2496.760040283203,
      "text": "to influence the congregation to go and believe God, and they were ready to stone those guys. God says, how long will it be are my people believe me? Trust me, that we have confidence in God. See, it says that this man, Nebuchadnezzar, he recognized that these servants were delivered, but it was a result that they trusted in him, and then notice this, and have changed the king's word, and yielded their bodies, that they might not serve nor worship any God except their own God. It impacted Nebuchadnezzar. He said, these guys trusted in God, they yielded their bodies. It's interesting if you were to go and maybe jot it down in your notes to read Romans 6 about who we yield ourselves to. We are to yield ourselves unto the Lord, and we find that these men, they yielded themselves. It's interesting if you look in Romans 6 and you read the references with regard to the word yield or yielded, it's the same Greek word that is used in Romans 12 when he says that you would present your bodies a living sacrifice. Same exact Greek word. So, yielding and presenting our bodies to God, and see what God is able to do. He said, I'm not interested in signing up for all that. I don't want to be a martyr. Neither do I. I mean, honestly, I don't want to face, I don't want to go to prison. I don't want",
      "context": "...d the references with regard to the word yield or yielded, it's the same Greek word that is used in Romans 12 when he says that you would present your bodies a living sacrifice. Same exact Greek word. So, yiel...",
      "sermon_title": "Sermon KVAB3-ajXLM",
      "url": "https://www.youtube.com/watch?v=KVAB3-ajXLM&t=2496",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "bPt92Z2dPIg",
      "timestamp": 725.3200302124023,
      "text": "possession to yield to the power of God and no longer live for myself, no longer live for yourself, but live for him. Why? Because he loves us, because he demonstrated that love, he died for us and he rose again. I'm thankful we serve a risen savior. He's alive. He lives, he rules and he reigns, and we find this morning that as we look at this truth that we should not no longer should we live for myself but for Christ here in the book of Romans in Romans chapter number 12, it's nearing the end of the book of Romans and we find that as he comes to this 12th chapter, Paul is literally begging the believers and he's begging them really, the basis of his plea is what had been previously revealed in the book of Romans. Remember, if you look back and maybe you've held your place in Romans 12, he says I beseech you therefore brethren by the mercies of God. Then we begin to understand that Paul is giving this plea to the believers and it's on the basis of what had been previously revealed in this book of Romans and we'll look at some things very quickly this morning that had been revealed that would give Paul the basis for which he's pleading and begging with these believers and then notice at the end of verse number one, he says which is your reasonable service. At the end of all of it,",
      "context": "...usly revealed in the book of Romans. Remember, if you look back and maybe you've held your place in Romans 12, he says I beseech you therefore brethren by the mercies of God. Then we begin to understand that P...",
      "sermon_title": "Sermon bPt92Z2dPIg",
      "url": "https://www.youtube.com/watch?v=bPt92Z2dPIg&t=725",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 1793.4600219726562,
      "text": "not guaranteed. Some of you are retired. You say, man, I've been retired. John tells me all the time, retirement's great. It's like Saturday every day. But the reality is this, retirement's not guaranteed. You know people that never made it to retirement, correct? Eternity is guaranteed. Eternity is guaranteed. Again, I'm not suggesting that we not consider retirement planning and estate planning, but I'm saying there ought to be a balance. Let me say this, number six, we think about how to avoid these pitfalls. I would say this, by the renewing of your mind. Remember what he said as we read that portion of Scripture in Romans 12, in verse number two, he says, be not conformed to this world, but be ye transformed by the renewing of your mind. You think about what Paul said in Philippians chapter number four with regard to the thought of God's people. He says, finally, brethren, what sort of things are true, what sort of things are honest, what sort of things are just, what sort of things are pure, what sort of things are lovely, what sort of things are of good report? If there be any virtue and if there be any praise, think on these things. He tells us that we're to bring every thought into the captivity, unto the obedience of Christ. And oh, if we'd understand the battle for our mind, and when we have our mind and we",
      "context": "...y this, by the renewing of your mind. Remember what he said as we read that portion of Scripture in Romans 12, in verse number two, he says, be not conformed to this world, but be ye transformed by the renewin...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=1793",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "1_NCe9SHoA0",
      "timestamp": 2270.279998779297,
      "text": "will of the Father. Amen? Isn't that abundantly clear? He says in verse number 15, for if any man loved the world, the love of the Father's not in him. He says in verse number 16 that all of this, the lust of the flesh, the lust of the eyes and the pride of life, it's not of the Father, but it's of the world. So obviously, loving the world, the world system, is not the will of God. Walking in the light is the will of God. Wouldn't you agree? He says that we walk in the light as He is in the light. That we're walking with Him, we're enjoying that fellowship with Him, we're abiding in Him, we're loving our brethren, we're growing in grace and knowledge of our Lord and Savior Jesus Christ, we're being sanctified, set apart. That is God's will. Remember at the end of Romans 12 in verse number 2, it says that we might prove what is that good and acceptable and perfect will of God. But we have to be renewed by the transforming of our mind. We're not to be conformed to this world. I'm mindful this morning of what the songwriter said. It's a song that we don't often sing. It's a song, however, that you will often hear played for invitation. That song is, Turn Your Eyes Upon Jesus. And think about these words at the chorus of that song.",
      "context": "... Savior Jesus Christ, we're being sanctified, set apart. That is God's will. Remember at the end of Romans 12 in verse number 2, it says that we might prove what is that good and acceptable and perfect will of...",
      "sermon_title": "Sermon 1_NCe9SHoA0",
      "url": "https://www.youtube.com/watch?v=1_NCe9SHoA0&t=2270",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1502.0400390625,
      "text": "number 19 in one word, pardon, pardon, pardon. The request is so simple, but the request that is made by Moses in this text of Scripture, the basis of this request is what he recalled, what God had previously revealed to him. Notice it says this, pardon, I beseech thee. Do you see the passion, if you will, of Moses? He's speaking to God. He's heard what God has said. He's experienced. I mean, can you imagine Moses as a leader? He sends these 12 guys out to go spy off the land. He knows that God has given him the instruction to go and to possess the land. And these 12 guys come back and Moses is there as the human leader. And he has these 12 guys come back and he's observing. He's seeing what's happening. And these 10 guys bring this evil report, this faithless report, and the whole congregation sides with them and says, yeah, let's go back to Egypt. Can you imagine Moses as a leader? I'm defeated. I'm discouraged. What's going on? Two guys, Joshua and Caleb, they say, hey, hey, listen, God is able. And then they're going to stone those guys. Say, what's going on? And God then speaks to them. Says, I'm going to smite them. I'm going to build of thee a greater nation. But Moses recalls God's great mercy. And he says, pardon, I beseech thee. We read that phraseology as we speak about Paul in Romans 12.",
      "context": "...reat mercy. And he says, pardon, I beseech thee. We read that phraseology as we speak about Paul in Romans 12.",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1502",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    },
    {
      "sermon_id": "N3xsGpOdIxU",
      "timestamp": 1577.0400390625,
      "text": "Say, what's going on? And God then speaks to them. Says, I'm going to smite them. I'm going to build of thee a greater nation. But Moses recalls God's great mercy. And he says, pardon, I beseech thee. We read that phraseology as we speak about Paul in Romans 12. And so often we reference that in that portion of Scripture. I beseech thee, therefore, by the mercies of God, to present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service, and be not conformed to this world, but be transformed. And we find that as we look at what's taking place and we find that Moses here, he says, I beseech thee, the passion that Moses has, he says, pardon, I beseech thee, the iniquity of Moses? No. Of this people. Of this people. Of this people. God told Moses, I'll build of thee a greater nation. Moses wasn't the offender. Moses wasn't the one that had no faith. Moses wasn't the one that was walking by sight. But Moses says, Lord, pardon, I beseech thee, the iniquity of this people, notice what he says, according unto the greatness of thy mercy. According unto the greatness of thy mercy. We find, again, the basis of the request is God's great mercy. And then notice as you continue in verse 19, the Bible says, and as thou hast forgiven this people from Egypt, even until now. Think about that phrase to end verse 19.",
      "context": "...reat mercy. And he says, pardon, I beseech thee. We read that phraseology as we speak about Paul in Romans 12. And so often we reference that in that portion of Scripture. I beseech thee, therefore, by the mer...",
      "sermon_title": "Sermon N3xsGpOdIxU",
      "url": "https://www.youtube.com/watch?v=N3xsGpOdIxU&t=1577",
      "channel": "Unknown",
      "publish_date": "2025-04-26"
    }
  ]
}