{
  "reference": "Titus 3",
  "occurrences": [
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 2166.47998046875,
      "text": "this in verse number 1 of Romans 4, What shall we say then that Abraham our father, as pertaining to the flesh, hath found? For if Abraham were justified by works, he hath whereof to glory, but not before God. Now, it's interesting when you read verse number 2 there and you consider it with the truth that God gives us in Ephesians 2, verses 8 and 9, in verse number 9 in particular, where the Bible says, lest any man should boast. Because the Bible says in Ephesians 2, 8 and 9, For by grace are you saved through faith, and that not of yourselves, it is the gift of God, not of works, lest any man should boast. What is he saying by that? Well, if I could work my way to heaven, I have whereof to glory, to boast. And so in verse number 2 of Romans 4, here's what Paul is saying to these believers. He says, if Abraham were justified by works, he hath whereof to glory, but not before God. What is he meaning? Well, he did enough good things to get to heaven. But you understand you can't do enough good things to get to heaven. Because the Bible says that the gift of God is eternal life through Jesus Christ our Lord, not by works of righteousness, which we have done in Titus 3 and verse number 5. We just looked at Ephesians 2, 8 and 9. The Bible is abundantly clear",
      "context": "...is eternal life through Jesus Christ our Lord, not by works of righteousness, which we have done in Titus 3 and verse number 5. We just looked at Ephesians 2, 8 and 9. The Bible is abundantly clear",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=2166",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    },
    {
      "sermon_id": "DFRdmeWDOAQ",
      "timestamp": 2229.1599731445312,
      "text": "get to heaven. Because the Bible says that the gift of God is eternal life through Jesus Christ our Lord, not by works of righteousness, which we have done in Titus 3 and verse number 5. We just looked at Ephesians 2, 8 and 9. The Bible is abundantly clear that salvation is by grace through faith alone. Paul says later in the book of Galatians, I do not frustrate the grace of God. If righteousness came by the law, then Christ is dead in vain. Listen, His death was not vain. His death was absolutely essential and required to pay for your sin and my sin and the sin of the world. Why? Because your works can't do it. And the law, keeping of the law can't do it. He says in verse number three, for what saith the Scripture, by the way, it's always good to go to the Scripture. Amen. You understand some of the things that were going on in the first century. Jesus dealt with it often with the Pharisees and the Sadducees and the scribes and those religious leaders. What about the tradition? What do men say? What do you do? And how is this? No, what does the Scripture say? You do err not knowing the Scripture. And we find that the appeal is given to these believers in the book of Romans. And Paul says this, for what saith the Scripture? Notice where it says, Abraham believed God",
      "context": "...is eternal life through Jesus Christ our Lord, not by works of righteousness, which we have done in Titus 3 and verse number 5. We just looked at Ephesians 2, 8 and 9. The Bible is abundantly clear that salv...",
      "sermon_title": "Sermon DFRdmeWDOAQ",
      "url": "https://www.youtube.com/watch?v=DFRdmeWDOAQ&t=2229",
      "channel": "Unknown",
      "publish_date": "2025-04-28"
    }
  ]
}