{
  "chapter": "Genesis 23",
  "sermons": [
    {
      "sermon_id": "UJuC0OTu5_I",
      "sermon_title": "Sermon UJuC0OTu5_I",
      "url": "https://www.youtube.com/watch?v=UJuC0OTu5_I",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Genesis 23",
          "sermon_id": "UJuC0OTu5_I",
          "timestamp": 152.8800048828125,
          "context": "...the death of Sarah. Now, of course, we read and studied the portion of scripture a few weeks ago in Genesis 23, where the Bible told us of the death and burial of Sarah and how that Abraham came to mourn for"
        },
        {
          "reference": "Genesis 23",
          "sermon_id": "UJuC0OTu5_I",
          "timestamp": 221.60000610351562,
          "context": "...the death of Sarah. Now, of course, we read and studied the portion of scripture a few weeks ago in Genesis 23, where the Bible told us of the death and burial of Sarah and how that Abraham came to mourn for Sa..."
        },
        {
          "reference": "Genesis 23",
          "sermon_id": "UJuC0OTu5_I",
          "timestamp": 1919.6800384521484,
          "context": "... before Mamre and then the Bible tells us in verse number 10 referencing back to what we studied in Genesis 23 the field which Abraham purchased of the sons of Heth there was Abraham buried and Sarah his wife a..."
        }
      ]
    },
    {
      "sermon_id": "6SpHqGGtcFw",
      "sermon_title": "Sermon 6SpHqGGtcFw",
      "url": "https://www.youtube.com/watch?v=6SpHqGGtcFw",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Genesis 23",
          "sermon_id": "6SpHqGGtcFw",
          "timestamp": 0.0,
          "context": "...ber 23. I'll read the first couple of verses and we'll get right into the message this evening. And Genesis 23 beginning in verse number 1, the Bible says this, and Sarah was 107 and 20 years old. These were th..."
        },
        {
          "reference": "Genesis 23",
          "sermon_id": "6SpHqGGtcFw",
          "timestamp": 95.4800033569336,
          "context": "...n he was born, according to Genesis 21. And so Isaac here, at this particular time, at the count in Genesis 23, Isaac is 37 years old. Now, this revelation not only helps us to understand the age of Sarah and A..."
        },
        {
          "reference": "Genesis 23",
          "sermon_id": "6SpHqGGtcFw",
          "timestamp": 172.39999389648438,
          "context": "...erstand those things that have transpired. In addition to that, however, we find that as we come to Genesis 23, that there's a chapter in God's Word, a message tonight that I'll preach, that is given to the dea..."
        },
        {
          "reference": "Genesis 23",
          "sermon_id": "6SpHqGGtcFw",
          "timestamp": 637.6000137329102,
          "context": "...od, we need not fear death. Amen? We approach death from a different perspective. And as we look at Genesis 23, go back if you will to our text of Scripture, I want to just look at this passage and I hope that ..."
        },
        {
          "reference": "Genesis 23",
          "sermon_id": "6SpHqGGtcFw",
          "timestamp": 1490.8000183105469,
          "context": "...eased. It's his wife, he loved her. I want you to think also, not only as we note, as we go through Genesis 23, what is revealed, first of all, his love for Sarah, I believe that his perspective is revealed. Hi..."
        }
      ]
    }
  ]
}