{
  "chapter": "John 16",
  "sermons": [
    {
      "sermon_id": "2mDKhmk687Y",
      "sermon_title": "Sermon 2mDKhmk687Y",
      "url": "https://www.youtube.com/watch?v=2mDKhmk687Y",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 16",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 2907.2200622558594,
          "context": "...en, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's"
        },
        {
          "reference": "John 16",
          "sermon_id": "2mDKhmk687Y",
          "timestamp": 2992.3800659179688,
          "context": "...en, it's our prayer this morning that the Holy Spirit of God would do the work that was outlined in John 16. Oh Holy Spirit, I pray that you would convict of sin, of Christ's righteousness, and of judgment t..."
        }
      ]
    },
    {
      "sermon_id": "QRS13lJ0CSY",
      "sermon_title": "Sermon QRS13lJ0CSY",
      "url": "https://www.youtube.com/watch?v=QRS13lJ0CSY",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 16",
          "sermon_id": "QRS13lJ0CSY",
          "timestamp": 2486.739990234375,
          "context": "...g, and we understand this morning that this understanding comes through the Holy Spirit. He says in John 16 and verse number 13 that He, the Holy Spirit, He is the Spirit of truth, and He will guide us into ..."
        }
      ]
    },
    {
      "sermon_id": "4ytTjjDvj2k",
      "sermon_title": "Sermon 4ytTjjDvj2k",
      "url": "https://www.youtube.com/watch?v=4ytTjjDvj2k",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 0.0,
          "context": "... the gospel of John. I just read it again last week and just thoroughly was blessed and encouraged. John 16, in verse number 33, notice what the Bible says. These things I have spoken unto you, that in me yo..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 166.55999755859375,
          "context": "...y, the truth of preparation is still found within these words that Jesus spoke. We find that really John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 246.16000366210938,
          "context": "John 16 and verse 33, the verse that I read a moment ago that is our text for our message this morning is a..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 454.20001220703125,
          "context": "...If you're taking notes with me this morning, notice number one, something to embrace. As we look at John 16 and verse number 33, I find that there's something for us to embrace, something for the disciples t..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 988.780029296875,
          "context": "...take place, he says, I'm commanding you that you love one another. You're going to need each other. John 16 and verse number 1, these things have I spoken unto you that you should not be offended. Notice whe..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1053.9000244140625,
          "context": "...things unto you. I'm trying to give you the instruction that you need. Look in verse number four of John 16, but these things have I told you that when the time shall come, you may remember that I told you o..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1115.9000244140625,
          "context": "... that he's given us the truth that we need. There's something to embrace. We find in verse seven of John 16, Jesus says, nevertheless, I tell you the truth. I tell you, he's speaking to them. It is expedient..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1188.9000244140625,
          "context": "...That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bi..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1188.9000244140625,
          "context": "...That we hold it dear. That we seek the face of God through his precious Word. Not only do I find in John 16 and verse 33 that there's something to embrace, but number two, there's something to expect. The Bi..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1343.5600280761719,
          "context": "...stand that in me, you might have peace. In me, in the Lord Jesus Christ. But notice what he says in John 16. He says, in me, you might have peace, but he follows it up and says this, in the world, you shall ..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1425.0000305175781,
          "context": "...na have tribulation, that in him, they can have peace. This is a great truth that is given to us in John 16 in verse number 33, that yes, we understand that in that world, there's going to be tribulation and..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1938.300048828125,
          "context": "...ribulation, but He said in Him there's peace. And what joy that is to every child of God. I find in John 16 and verse 33, there's something to embrace, there's something to expect, but I find there's someone..."
        },
        {
          "reference": "John 16",
          "sermon_id": "4ytTjjDvj2k",
          "timestamp": 1938.300048828125,
          "context": "...ribulation, but He said in Him there's peace. And what joy that is to every child of God. I find in John 16 and verse 33, there's something to embrace, there's something to expect, but I find there's someone..."
        }
      ]
    }
  ]
}