{
  "chapter": "Psalms 62",
  "sermons": [
    {
      "sermon_id": "9JjoBDbN7Ms",
      "sermon_title": "Sermon 9JjoBDbN7Ms",
      "url": "https://www.youtube.com/watch?v=9JjoBDbN7Ms",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 62",
          "sermon_id": "9JjoBDbN7Ms",
          "timestamp": 1691.4800109863281,
          "context": "pattern as in, I said my prayers, quote unquote. That's not the idea of praying. It's not rote religion. I'm talking to my Father. Amen? I belong to Him. I've been adopted in His family. We mentioned last week, or two weeks ago from 1 John, how that He spoke about the little children and the young men and the fathers, and we spoke about the little children, how that at salvation, there's just a couple of things that we learn right away. Number one, our sins are forgiven. Number two, He's my Father, and I'm speaking to Him. It's not some recorded prayer. It's not some printed out, I just take a prayer book, and I just pray these prayers, and they're just vain repetitions. No, it's not praying so that someone could look at me. By the way, Jesus spoke of those religious leaders that prayed in that manner, and He said they have their reward. You know what their reward was? The recognition of man. But He said, when you pray, enter into your closet. Amen? And we pray to our Father. We pour our heart out unto Him. Last Sunday morning in Sunday school, Psalm 62.8, we didn't deal with a miracle. We've been dealing with miracles, but God just impressed that passage of Scripture, that verse of Scripture, upon my heart. I couldn't get away from it all week, and we dealt with it last Sunday morning"
        },
        {
          "reference": "Psalms 62",
          "sermon_id": "9JjoBDbN7Ms",
          "timestamp": 1751.5599975585938,
          "context": "Last Sunday morning in Sunday school, Psalm 62.8, we didn't deal with a miracle. We've been dealing with miracles, but God just impressed that passage of Scripture, that verse of Scripture, upon my heart. I couldn't get away from it all week, and we dealt with it last Sunday morning in Sunday school, and how the psalmist told us that we're to trust in Him at all times, and we're to pour our heart out before Him. Hannah did that. David did that on more than one occasion. The people of God that I mentioned by way of introduction this morning, that testimony of answered prayer, they pour their heart out to God. Why? For He's a refuge for us. You don't need a prayer book that has some recorded prayers that someone wrote down. You just need to pour your heart out to God. Paul's praying. Paul tells the people that he ministers to that he's praying for him. Paul asks the people that he's ministering to to pray for him. Often throughout the Scriptures, you find that Paul will ask the question. In fact, in Ephesians 6, when he talks about after the armor of God that I mentioned earlier, how that he says praying always, he then specifically says, and pray for me. He asked the believers in Thessalonica this way. He says, brethren, pray for us. He tells the believers in the church in Colossae to pray for him and to pray for them"
        }
      ]
    },
    {
      "sermon_id": "7rseeVx8SA0",
      "sermon_title": "Sermon 7rseeVx8SA0",
      "url": "https://www.youtube.com/watch?v=7rseeVx8SA0",
      "publish_date": "2025-04-28",
      "occurrences": [
        {
          "reference": "Psalms 62",
          "sermon_id": "7rseeVx8SA0",
          "timestamp": 2310.3999938964844,
          "context": "he is coming, but he's coming at a set time. No man knows the hour. We don't know when he's coming, but we know that he's coming, and I know that certainly for us, man, it'd be okay if he came right now, but if he doesn't come right now, it means that he still has a task for us to do right now as we continue to wait upon him, knowing that his timing is perfect. Think about these verses. Turn to the book of Psalms, if you will, Psalm 27. Read about four verses or so from the book of Psalms, and then we'll look at two other passages of scripture, and then wrap it up this evening. Psalm 27, let's read these fairly quickly, and we'll get over to our fellowship this evening. Psalm 27, in verse number 14, notice what the word of God says. Wait on the Lord, be of good courage, and he shall strengthen thine heart. Wait, I say, on the Lord, chapter 33 and verse number 20. Notice this. Our soul waiteth for the Lord. He is our help and our shield. Aren't you thankful the Lord is our helper? He's our helper. He's our shield. He protects us. Look at Psalm 62, if you will. Verses one and also verse number five. Look at these two verses here in Psalm 62. The Bible says, truly, my soul waiteth upon God. From him cometh my salvation."
        },
        {
          "reference": "Psalms 62",
          "sermon_id": "7rseeVx8SA0",
          "timestamp": 2310.3999938964844,
          "context": "he is coming, but he's coming at a set time. No man knows the hour. We don't know when he's coming, but we know that he's coming, and I know that certainly for us, man, it'd be okay if he came right now, but if he doesn't come right now, it means that he still has a task for us to do right now as we continue to wait upon him, knowing that his timing is perfect. Think about these verses. Turn to the book of Psalms, if you will, Psalm 27. Read about four verses or so from the book of Psalms, and then we'll look at two other passages of scripture, and then wrap it up this evening. Psalm 27, let's read these fairly quickly, and we'll get over to our fellowship this evening. Psalm 27, in verse number 14, notice what the word of God says. Wait on the Lord, be of good courage, and he shall strengthen thine heart. Wait, I say, on the Lord, chapter 33 and verse number 20. Notice this. Our soul waiteth for the Lord. He is our help and our shield. Aren't you thankful the Lord is our helper? He's our helper. He's our shield. He protects us. Look at Psalm 62, if you will. Verses one and also verse number five. Look at these two verses here in Psalm 62. The Bible says, truly, my soul waiteth upon God. From him cometh my salvation."
        },
        {
          "reference": "Psalms 62",
          "sermon_id": "7rseeVx8SA0",
          "timestamp": 2393.0800170898438,
          "context": "Lord is our helper? He's our helper. He's our shield. He protects us. Look at Psalm 62, if you will. Verses one and also verse number five. Look at these two verses here in Psalm 62. The Bible says, truly, my soul waiteth upon God. From him cometh my salvation. He only is my rock and my salvation. He is my defense. I shall not be greatly moved. Look at verse number five. My soul, wait thou only upon God. God, for my expectation is from Him. Are you expecting God to work? Anticipating God working? Looking forward to seeing God work? You say, I don't know how all this stuff is going to work out. God is able. Abraham, waiting on the Lord. God promised He was going to give me a son. It's not happened yet. How is it going to happen? Sarah, I'm old. It's beyond. Is anything too hard for the Lord? God did what He said He would do. Look at Psalm 130. Psalm 130, verse 5. I wait for the Lord, my soul doth wait, and in His word do I hope. My soul waiteth for the Lord more than they that watch for the morning. I say more than they that watch for the morning. Waiting on the Lord. Notice it says not only waiting on the Lord. Listen, when we think about waiting on the Lord, it's not that we're sitting idle"
        },
        {
          "reference": "Psalms 62",
          "sermon_id": "7rseeVx8SA0",
          "timestamp": 2393.0800170898438,
          "context": "Lord is our helper? He's our helper. He's our shield. He protects us. Look at Psalm 62, if you will. Verses one and also verse number five. Look at these two verses here in Psalm 62. The Bible says, truly, my soul waiteth upon God. From him cometh my salvation. He only is my rock and my salvation. He is my defense. I shall not be greatly moved. Look at verse number five. My soul, wait thou only upon God. God, for my expectation is from Him. Are you expecting God to work? Anticipating God working? Looking forward to seeing God work? You say, I don't know how all this stuff is going to work out. God is able. Abraham, waiting on the Lord. God promised He was going to give me a son. It's not happened yet. How is it going to happen? Sarah, I'm old. It's beyond. Is anything too hard for the Lord? God did what He said He would do. Look at Psalm 130. Psalm 130, verse 5. I wait for the Lord, my soul doth wait, and in His word do I hope. My soul waiteth for the Lord more than they that watch for the morning. I say more than they that watch for the morning. Waiting on the Lord. Notice it says not only waiting on the Lord. Listen, when we think about waiting on the Lord, it's not that we're sitting idle"
        }
      ]
    }
  ]
}