{
  "chapter": "Psalms 135",
  "sermons": [
    {
      "sermon_id": "8h5bAwPFWSc",
      "sermon_title": "Sermon 8h5bAwPFWSc",
      "url": "https://www.youtube.com/watch?v=8h5bAwPFWSc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 135",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 0.0,
          "context": "18, Exodus chapter number 18, and really this morning, we'll be transitioning into phase two of our annual theme, our theme for this year. As you know, you see on the banners there, great is the Lord, and then it says this, and greatly to be praised, Psalm 48, verse number one. We've been singing as our theme song, Psalm 48, one and two all year. And the first part, the phase one, if you will, for our annual theme this year, has really been dealing with the idea of discovering God's greatness. Each of us would, I believe, agree this morning that our God is great. We wanna be able to have some substance as to why we would make that claim. Why is it that we would tell somebody else that our God is great? What sets him apart? And so as we've studied for all of these months, and we've looked at so many various subjects and passages of scripture, topics, as to why our God is great, and we've discovered God's greatness, phase two is going to be this, declare God's greatness. And you'll remember with me as we began studying this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this,"
        },
        {
          "reference": "Psalms 135",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 83.80000305175781,
          "context": "this year with this theme that I made note that the psalmist made two powerful statements really with regard to the greatness of God as it relates to our theme for this year. And one of those is in Psalm 135, in verse number five, where the psalmist said this, for I know that the Lord is great, that our Lord is above all gods. Each and every individual, every child of God needs to know and be fully persuaded in their own heart and mind that God is great. And we ought to be able to say with the psalmist, for I know that the Lord is great. God wants us to know his greatness. He has given us his precious word. He's revealed to us his character, his nature, and he helps us to understand how great he is. But then in Psalm 145, in verse number six, the psalmist makes that second statement that is so impactful with regard to our theme for this year. And at the end of that verse of scripture, the psalmist says this, and I will declare thy greatness. I will declare thy greatness. Near the end of the year, we'll get into phase three of our series for this particular annual theme. And phase one, discover God's greatness. Phase two, declare God's greatness. And then we're gonna deal with a number of messages, just a handful of messages on this thought of living"
        },
        {
          "reference": "Psalms 135",
          "sermon_id": "8h5bAwPFWSc",
          "timestamp": 1568.6199645996094,
          "context": "no doubt as Moses is sharing these testimonies and giving the report to his father-in-law that Jethro is understanding the power and the might of Jehovah God. But I want you to notice that he says, now I know, now I know that the Lord is greater than all gods. He had heard in verse number one of chapter 18 of all that God had done for Moses. He had heard much of no doubt what Moses actually reported to him. But now after hearing it firsthand, after having this reunion with Moses, he stands and he rejoices and he then makes this verbal declaration of his own personal understanding of how great God is. As we're gonna think about this statement and I mentioned by way of introduction where the psalmist says in Psalm 135 in verse number five, for I know that the Lord is great. Listen, we need to have this kind of understanding in our lives just as Jethro is going to declare verbally what he knows to be true. Listen, we as the people of God, we need to be able to stand and say, I know that God is great. There's no one that's gonna convince me otherwise, no one is gonna persuade me otherwise for I am convinced, I am persuaded, I know in whom I have believed. And we get into the Bible and we allow the Bible to get into us and as we have the truth of God's word"
        }
      ]
    }
  ]
}