{
  "chapter": "Psalms 146",
  "sermons": [
    {
      "sermon_id": "ovhq5P2teKg",
      "sermon_title": "Sermon ovhq5P2teKg",
      "url": "https://www.youtube.com/watch?v=ovhq5P2teKg",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 146",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2205.340057373047,
          "context": "were counted worthy to suffer shame for His namesake. Last week, the enemy was eliminated. 185,000 killed, Sennacherib goes back, his own sons kill him. We read it. This week, however, the opposition remains. But God's people are empowered. God's people are empowered to fulfill the task. We've often referenced Psalm 121, verses 1 and 2, where the psalmist says, I will lift up my eyes into the hills. From whence cometh my help? My help cometh from the Lord, which made heaven and earth. Last week with Hezekiah, he faced great adversity, but he understood that the Creator God was his helper. This week, we look at the disciples. They face opposition, adversity, threats, commands, but they understood that the Creator God is their helper. And I want you to notice what the psalmist says in Psalm 146. Look over and we'll finish here with this passage of Scripture in Psalm 146. Oh, indeed, creation reveals to us the greatness of God, His great power, His great wisdom. We see it throughout the pages of Scripture. You can walk out this afternoon and you can see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm"
        },
        {
          "reference": "Psalms 146",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2205.340057373047,
          "context": "were counted worthy to suffer shame for His namesake. Last week, the enemy was eliminated. 185,000 killed, Sennacherib goes back, his own sons kill him. We read it. This week, however, the opposition remains. But God's people are empowered. God's people are empowered to fulfill the task. We've often referenced Psalm 121, verses 1 and 2, where the psalmist says, I will lift up my eyes into the hills. From whence cometh my help? My help cometh from the Lord, which made heaven and earth. Last week with Hezekiah, he faced great adversity, but he understood that the Creator God was his helper. This week, we look at the disciples. They face opposition, adversity, threats, commands, but they understood that the Creator God is their helper. And I want you to notice what the psalmist says in Psalm 146. Look over and we'll finish here with this passage of Scripture in Psalm 146. Oh, indeed, creation reveals to us the greatness of God, His great power, His great wisdom. We see it throughout the pages of Scripture. You can walk out this afternoon and you can see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm"
        },
        {
          "reference": "Psalms 146",
          "sermon_id": "ovhq5P2teKg",
          "timestamp": 2299.6600341796875,
          "context": "see the beauty of creation. Look at your own body and see how God has formed us, fashioned us, how each of our members work. Just stand in awe of our God, but never forget that He's your helper. Yes, He's the Creator, but He's your helper. Notice in Psalm 146, verse number 1 says, \"'Praise ye the Lord! Praise the Lord, O my soul! While I live will I praise the Lord. I will sing praises unto my God while I have any being. Put not your trust in princes, nor in the Son of Man, in whom there is no help.'\" How often are we guilty of verse number 3? Putting our trust in someone or something else. Sometimes putting our trust in ourselves. I got this. I can handle this. I need to do something. No, no. He says, \"'Put not your trust in princes, nor in the Son of Man, in whom there is little help.'\" No, no. He says, no help. \"'His breath goeth forth, he returneth to his earth, and that very day his thoughts perish.'\" But then notice verse 5 and 6. \"'Happy is he that hath the God of Jacob for his help, whose hope is in the Lord his God.'\" The word happy is often also translated as blessed. He says, listen, don't trust in these things, but happy or blessed is the one that has as his help the God of Jacob for his help, whose hope"
        }
      ]
    }
  ]
}