{
  "chapter": "Psalms 12",
  "sermons": [
    {
      "sermon_id": "EetmC5JSFHc",
      "sermon_title": "Sermon EetmC5JSFHc",
      "url": "https://www.youtube.com/watch?v=EetmC5JSFHc",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 12",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 251.6199951171875,
          "context": "given us many, many promises. And these promises are indeed exceeding great and precious. This evening I have a list of 15 promises that I want to give you. And the list is not exhaustive. You can go and you can find many, many promises within the Word of God. I'm going to start with two promises with regard to the Word of God. And then if you follow, hopefully, the logic, it makes as much sense to you as it does to me, I'm going to kind of begin at salvation where we begin in promises that pertain to our walk with God and eventually through eternity. Consider this promise, the promise that God has given us to preserve his Word. Turn to the book of Psalms, if you will, in Psalm chapter number 12. And I want you to notice a few verses of scripture here with regard to the promise of preservation. And the first two that I mentioned that we'll look at are dealing with the Word of God. The reason is because it's this book that contains the promises. And therefore, I thought it best that we would look at some promises that God has given us with regard to his Word, so that we could use that as really foundation for these other promises that we'll look to. In Psalm 12, in verse number six, the Bible says, \"'The words of the Lord are pure words."
        },
        {
          "reference": "Psalms 12",
          "sermon_id": "EetmC5JSFHc",
          "timestamp": 310.6199951171875,
          "context": "would look at some promises that God has given us with regard to his Word, so that we could use that as really foundation for these other promises that we'll look to. In Psalm 12, in verse number six, the Bible says, \"'The words of the Lord are pure words. As silver tried in a furnace of earth, purified seven times. Thou shalt keep them, O Lord. Thou shalt preserve them from this generation forever.'\" And as you recall, this morning, as we looked at the person of Jesus Christ, being thankful for his person, who he is, the very first thing that we mentioned is he is Alpha and Omega, he's eternal. And here we find that he's promised that he would preserve his words, these words that are pure words, he's gonna preserve them from this generation forever. And to be mindful of the fact this evening that the eternal God has given us a promise to preserve the precious Word of God ought to cause us to rejoice because I can have full confidence in faith in what the Word of God says. Why? Because God said he was going to preserve it. And since God said he was gonna preserve it because God is trustworthy and dependable and always does what he says he will do, we can rest assured that God has indeed preserved his Word. Notice, if you will, in Psalm 119 in verse number 89, the Bible tells us, of course,"
        }
      ]
    },
    {
      "sermon_id": "2cDKZaPlI5s",
      "sermon_title": "Sermon 2cDKZaPlI5s",
      "url": "https://www.youtube.com/watch?v=2cDKZaPlI5s",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 12",
          "sermon_id": "2cDKZaPlI5s",
          "timestamp": 2400.1199951171875,
          "context": "eternal destiny, you can trust him with tomorrow. Whatsoever he sayeth unto you, do it. To whom do we cry? To whom do we go in times of crisis? We all face them. We all have times of great difficulty. And I hope tonight that we run to the cross. that we run to the Lord Jesus Christ and we say, Lord, help me. You ever read Psalm 12? Help, Lord. That's how it begins. You know, sometimes that's all we can pray. Help, Lord. I just need help and I know that you're the helper and you said that you would give us help. Aren't you so thankful that we have a wonderful Savior and He offers to give us the counsel, the direction that we need. He's our shepherd and as our shepherd, He takes good care of His sheep. Let's pray this evening. Father, we love You. We thank You for loving us. We thank You for Your Word, the truth contained therein. I pray that even as we look at this historical event, this time in Egypt when Joseph is there and this famine begins and the land is famished, Lord, I pray that tonight as we can understand the historical context of this event that we also would be able to make application in our lives. Lord, I pray that You'd help us tonight to run to You in times of difficulty, of great need, of great distress, times of crisis."
        }
      ]
    }
  ]
}