{
  "chapter": "Psalms 16",
  "sermons": [
    {
      "sermon_id": "4jMDiZ3Rc6E",
      "sermon_title": "\"The Glorious Gospel\"  II Corinthians 3:1-18",
      "url": "https://www.youtube.com/watch?v=4jMDiZ3Rc6E",
      "publish_date": 20250211,
      "occurrences": [
        {
          "reference": "Psalms 16",
          "sermon_id": "4jMDiZ3Rc6E",
          "timestamp": 1151.280029296875,
          "context": "shone while he talked with him. Isn't that awesome? I mean, his face was shining because he had been in the presence of God. You know, there's something true about this for us this morning. When you're in the presence of God, you can see what other people can tell. You know what the Bible says? Listen, it might not be that your face shines the way that Moses' face shined here in Exodus chapter 34. But do you remember what the religious leader said in Acts chapter number four, when they deal with Peter and John and they say, these are ignorant and unlearned men? But they had been with Jesus. That's what the Bible tells us. And listen, when you spend time with Jesus, it's evident to other people. You ever notice on somebody's countenance, you can see, if you know someone well enough, you can see on their countenance whether something's wrong or whether something's good. Amen? You've been married long enough, I can look at Holly, she can walk in a room and I say, honey, are you okay? What's wrong? Nothing. Hold on a minute. You ever do this with your spouse? Hold on a minute. You're telling me nothing, your face is telling me something different. Our countenance. And his face was shining. Why? Because he'd been in the presence of God. Psalm 16, and his presence is fullness of joy. Notice it was only Moses that could go to that mount."
        },
        {
          "reference": "Psalms 16",
          "sermon_id": "4jMDiZ3Rc6E",
          "timestamp": 1219.3200225830078,
          "context": "on a minute. You're telling me nothing, your face is telling me something different. Our countenance. And his face was shining. Why? Because he'd been in the presence of God. Psalm 16, and his presence is fullness of joy. Notice it was only Moses that could go to that mount. Thyself, no man with thee. Remember that, it's important. Verse 29, verse 30, and when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone, and they were afraid to come nigh him. I guess so. Notice in verse 31, and Moses called unto them, and Aaron and all the rulers of the congregation returned unto him, and Moses talked with them. And afterward, all the children of Israel came nigh, and he gave them in commandment all that the Lord had spoken with him in Mount Sinai. Until Moses had done speaking with them, notice he put a veil on his face. But when Moses went in before the Lord to speak with him, he took the veil off until he came out, and he came out and spake unto the children of Israel that which he was commanded. And so we find that verse 35, and the children of Israel saw the face of Moses, that the skin of Moses' face shone, and Moses put the veil upon his face again until he went in to speak with him. It's important to recognize that Moses,"
        }
      ]
    }
  ]
}