{
  "chapter": "Psalms 5",
  "sermons": [
    {
      "sermon_id": "35c77xaGibc",
      "sermon_title": "\"The Lord Is King For Ever And Ever\" Psalm 10:16",
      "url": "https://www.youtube.com/watch?v=35c77xaGibc",
      "publish_date": 20241027,
      "occurrences": [
        {
          "reference": "Psalms 5",
          "sermon_id": "35c77xaGibc",
          "timestamp": 2844.519989013672,
          "context": "purpose. And my God still has a plan. And He's still going to use us. And by the way, one day I'm going to heaven. Hallelujah. This world is not my home. I'm just a passing through. My treasures are laid up somewhere beyond the blue. That's what the songwriter said. And we need to start living like that. But the reality is that if we take the perspective that God is in control, only if my candidate wins, you are not understanding the truth of the Bible. You cannot say, because my candidate wins, that God is in control. And then if your candidate loses, you say, well, God must not be in control. They did this, they did… No, no, no, no, no. God is in control regardless. And we have to understand that. So what do I do? Number one, I trust in the Lord. Number two, I rejoice. I rejoice. You know what Jesus said in Luke? Those disciples came back because the spirits were made subject to them, and they were rejoicing, man. They saw the power of God demonstrated. And Jesus said this, don't rejoice in that. But rather rejoice, why? Because your names are written in the book. Listen, this morning, it does not matter who wins an election in this nation with regard to my eternity. I'm going to rejoice. Psalm 5 and verse number 11, but"
        },
        {
          "reference": "Psalms 5",
          "sermon_id": "35c77xaGibc",
          "timestamp": 2917.7999877929688,
          "context": "And Jesus said this, don't rejoice in that. But rather rejoice, why? Because your names are written in the book. Listen, this morning, it does not matter who wins an election in this nation with regard to my eternity. I'm going to rejoice. Psalm 5 and verse number 11, but let all those that put their trust in thee, what? Rejoice. I said, number one, we must trust Him. But if I put my trust in Him, then I must rejoice. Let them ever shout for joy, because thou defendest them. Let them also that love thy name be joyful in thee. Can I tell you that really, if you study the church history, there has never been a nation like our nation that has had as much liberty and freedom for a church as we have experienced. And you know what's happening? We're doing less for God today than we ever have. There literally, last week, Brother Hummel stood in this pulpit and said, America is now in the place where we need missionaries to come to her. Where we used to be the number one sending mission field of the, or mission sender of the entire world. And guess what? England was that at one point. And if you go to England today, you find that church after church after church has been turned into pubs, has been turned into apartments, has been turned into mosques. And guess what has to happen in England? We have missionaries"
        }
      ]
    }
  ]
}