{
  "chapter": "Psalms 139",
  "sermons": [
    {
      "sermon_id": "CuDgnvg3ek8",
      "sermon_title": "Sermon CuDgnvg3ek8",
      "url": "https://www.youtube.com/watch?v=CuDgnvg3ek8",
      "publish_date": "2025-04-26",
      "occurrences": [
        {
          "reference": "Psalms 139",
          "sermon_id": "CuDgnvg3ek8",
          "timestamp": 1922.9599838256836,
          "context": "and Armando would rather inspect me. That's the reality of life. Why? Because it's a hard thing to inspect yourself, to examine yourself. You know why? We think we're better than we are. We think we really don't have any problems. We think we've got it all together. But then God starts working. That bitterness, lack of forgiveness, that contention, unresolved. I mean you just go down a list. I'm not going to go down through a list tonight. I'm just going to mention a few things. But the reality is that God is working. Listen this was something that happened 20 years earlier. I think that the brothers probably tried to suppress it as much as they possibly could. Isn't that what we try to do? Try to suppress those things. Try to suppress them. But you know what God does? He brings it right to the forefront. We can deal with this. I can handle this. I'm thankful that God was working locally and globally but God was working personally. Our God is a personal God. And He works in the lives of His people. And as we allow Him to have His way, as we say as the psalmist does in Psalm 139, God search me oh God. Search me oh God. And show me if there be any wicked way in my life. Right? That's what the Bible teaches us. That process of self-examination."
        },
        {
          "reference": "Psalms 139",
          "sermon_id": "CuDgnvg3ek8",
          "timestamp": 1990.959976196289,
          "context": "as we allow Him to have His way, as we say as the psalmist does in Psalm 139, God search me oh God. Search me oh God. And show me if there be any wicked way in my life. Right? That's what the Bible teaches us. That process of self-examination. And so we find that God is working in the lives of these brothers. They say what is this that God hath done unto us? Surely we are guilty concerning our brother. And they understand what is taking place and how God is working. God is at work in the life of Joseph. God is at work in the lives of the ten brothers. I believe that God is at work in Jacob's life. Look at verse 29. And they, nine of them, He sent ten out. And they, nine of them, came unto Jacob their father unto the land of Canaan. And notice what the next phrase says. And told him all that befell unto them. They didn't just come back with some food. They came back with a story. With an account of what took place. Here's what happened. Dad you sent us there. We came back with food but a whole lot more. Now they don't reveal everything to Jacob. They don't reveal to Jacob at this particular juncture. We don't, we see that not a place here where they reveal what they have done and really the conviction"
        }
      ]
    }
  ]
}