{
  "chapter": "Psalms 55",
  "sermons": [
    {
      "sermon_id": "M95WZQin3TU",
      "sermon_title": "\"Pour Out Your Heart Before Him\"  Psalm 62:1-12",
      "url": "https://www.youtube.com/watch?v=M95WZQin3TU",
      "publish_date": 20250414,
      "occurrences": [
        {
          "reference": "Psalms 55",
          "sermon_id": "M95WZQin3TU",
          "timestamp": 1526.3999633789062,
          "context": "give help. We find that in chapter number four, in verse number 14, the Bible says this, seeing then that we have a great high priest that is passed into the heavens, Jesus, the son of God, let us hold fast our profession, for we have not an high priest, which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are, yet without sin. Let us therefore come boldly unto the throne of grace, that we may obtain mercy and find grace to help in time of need. We pour our heart out before God. We find that this evening, the psalmist is giving this instruction in Psalm 62. He's now teaching, beginning in verse number eight, to those that would come and read and be benefited by this, and he says, trust him at all times, but he says, pour out your heart before him. Be transparent with God. He knows all about it, and he cares about you. Casting how many of your cares? All. Is that what 1 Peter 5, 7 says? Casting all your care upon him. Why? For he careth for you. Isn't that a precious truth of God's word? Psalm 55, cast thy burden upon the Lord. He will sustain thee. And here, the psalmist, I love the imagery. We saw great imagery in verse number three, when he talked about the wicked as a bowing wall and as a tottering fence,"
        },
        {
          "reference": "Psalms 55",
          "sermon_id": "M95WZQin3TU",
          "timestamp": 1610.3199768066406,
          "context": "that a precious truth of God's word? Psalm 55, cast thy burden upon the Lord. He will sustain thee. And here, the psalmist, I love the imagery. We saw great imagery in verse number three, when he talked about the wicked as a bowing wall and as a tottering fence, and you get that imagery of something that's ready to fall and crumble. And we find here the imagery when he says, pour out your heart before him. Just get along with God. God cares. God hears. Why is it that the psalmist, other than the experience that he had himself, why is it that he would say, trust in him at all times. Pour out your heart before God. Well, we find in verse number eight at the end, he says, God is a refuge for us. He's my refuge. He's my refuge. And then we see that word again, selah. We see it throughout the Psalms. We're not real good at selah. Because we're in a hurry. And selah carries with it the exact opposite of being in a hurry. Just slow down. Just meditate. Let it sink in. God is my refuge. God wants me to trust him. He wants you to trust him at all times. He wants us to pour our hearts out before him. He is able to help us. He is able and he will succor us as we read there in Hebrews. And we find that he provides us"
        }
      ]
    }
  ]
}